[{"name":"Amazing Vietnam 10 Days 9 Nights Tour From North Central To South","duration":10,"travelStyle":["Adventure","Christmas & New Year"],"oldPrice":1026,"price":821,"summary":"Vietnam Travel Top is proud to offer you the best of the best deal to discover my beautiful country. Vietnam tour 10 days 9 nights from North to South included flight and train tickets. Destination covers Hanoi, Halong bay, Da Nang, Hoi An, Ho Chi Minh city, Mekong delta, Cu Chi Tunnel. All of hotel we select is top ranking on Tripadvisor and guarantee satisfaction ! Let’s book and enjoy your holiday! Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["An amazing itinerary with all activities included","Enjoy a cruise on Halong Bay, a UNESCO World Heritage Site","Explore limestone cliffs and caves in Halong Bay","Kayak through the emerald waters of Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9daf9f1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9daf9f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ddad92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ddcb06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9dde925.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de0463.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de2573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de41b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de603b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de7a42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de9718.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9deb309.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ded2e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e118a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e13a36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e15b8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e174ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e1e7f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e24b3c.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Vinh Long","Cu Chi Tunnels"],"timeline":[{"title":"Day 1 Hanoi - airport pick up - Check in hotel in Hanoi (Meal: No)","description":"In and around Hanoi, Da Nang, Ho Chi Minh CityPick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself. Note: Check in time is 13:00 P.M.Start point\n Hanoi old quarter, Hanoi, Vietnam 12:30 - 13:00"},{"title":"Day 2 Hanoi - Halong Bay - Overnight on Cruises (Meal: B, L, D )","description":"Morning: Shuttle bus picks you up from your hotel at 8:00am. Enjoy a scenic drive to Halong Bay with lush green paddy fields and romantic rivers. Embark on Cruise by noon for a short cruise briefing and check-in.  Afternoon: Savour a delectable lunch as Cruises amongst the limestone islands. In the afternoon, we will stop at Surprise Cave, the most impressive cave in Halong Bay. Climb up the stairs and be thrilled by what Mother Nature has crafted here. Later return to main boat and continue cruising further into the Bay to Titop Island. Have a shower to relax then you can join us in our cooking class in the dining room or sunset party on sundeck. For the rest of the night, socialize with other guests, fish for squid, or just laze around. Overnight on board."},{"title":"Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meal: B, L )","description":"Start your day with morning Tai Chi exercises a photo hunt on the sundeck.  Have a light breakfast with coffee and tea and cake then head toward the Luon Cave. Come back to the ship and check out of your cabin while the farewell party is ready at the dining room. Passing famous sites like Ba Hang Fishing Village, Dog Islet on the way back to Ha Long Harbour. "},{"title":"Day 4 Hanoi Free day – Train station transfer- Night train to Da Nang (Meal: B )","description":"Today, you are free to visit Hanoi Old Quarter, see the water puppet show until transfer to Hanoi Train Station for solf – Sleeping train to Da nang. Time you need to spend on the train is around 13 hours. On the train you can view our beautiful country along the coastal line. You also stay overnight on the train and reach Danang train station at around 10.30 am"},{"title":"Day 5 Da Nang pick up - Check in hotel in Hoi An town (meal: No)","description":"In and around Hoi AnTrain arrive on the next day. We will pick up and transfer to Hoi An Ancient town. Check in hotel in the ancient town and relaxing."},{"title":"Day 6 Hoi An - My Son day tour (Meal: B,L)","description":"7:30 – 8:00: The bus and tour guide pick you up at your hotel 8:30 : Leaving Hoi An  for My Son HolyLand. 9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Spend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa  Kingdom with our tour guide. 12.00: Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river 13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!."},{"title":"Day 7 Hoi An - Airport transfer - Flight to HCMC- Pick up- check in Hotel (Meal: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City."},{"title":"Day 8 HCMC - Mekong delta - Cai Be Floating Market - Vinh Long tour (Meal: B, L )","description":"In and around Vinh Long08:00 Picking up from hotel/stay. 08:15 Starting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields. 10:30 Start the motorized boat to visit the Cai Be Floating market, experience how people exchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn. Arrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature. Have lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City. 18:30 Arrive in your hotel."},{"title":"Day 9 HCMC - Cu Chi tunnel tour (Meal: B )","description":"In and around Cu Chi Tunnels08:30 Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors. The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants. 12:00 Back to Ho Chi Minh City 13:20 Arrive in your hotel in Ho Chi Minh City."},{"title":"Day 10 HCMC - Airport transfer - end the trip (Meal: B )","description":"This day you are free to visit Ho Chi Minh City and shopping for souvernirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends. End point\n Ho Chi Minh city, Hồ Chí Minh, Vietnam 13:00 - 17:00"}]},{"name":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta","duration":10,"travelStyle":["Family","Christmas & New Year"],"oldPrice":0,"price":1134,"summary":"This 10-day tour definitely amazes you with the unforgettable discovery of magnificent Hanoi, breathtaking Halong Bay by cruise, Hoi An Ancient Town, mysterious My Son Sanctuary, bustling Saigon, and unique Cai Be Floating Market in Lower Mekong Delta province of Vinh Long.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a3ed6870.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_42bb7339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_094ec9ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d9ef09d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_10e60a0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2c417434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_fc4c5886.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_3e6fce9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_f1ebfa6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_5f5ddd1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_383e501e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a96445a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_cf8262db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_8144b44d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d42eea53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_87281cf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2f5d8651.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e170418a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_52762d10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_b07508bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_7ca720ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_9f6dcdd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e642f629.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta","Cu Chi Tunnels"],"timeline":[{"title":"DAY 1 – ARRIVAL – HANOI","description":"In and around Hanoi, Da NangUpon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in. The rest of time, you’ll be free on your own. O/N in Hanoi.Start point\n Your hotel, Hanoi, Vietnam 08:00"},{"title":"DAY 2 – HANOI – HA LONG (GROUP TOUR) (B/L/D)","description":"07:30  Our shuttle bus with tour guide will pick you up at your hotels (Note: This pick-up is just applied for those who use our shuttle bus service) 10:30  Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products. 12:30  Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager 13:30  Great lunch is served while cruising passing by islets. 15:00  Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon. 17:30    Happy Hour. Buy 2 beverage get 1 for free 18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes 18:30    Enjoy Sunset Party with fruits and tea 19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods 21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar Overnight on Luxury Flamingo Cruises."},{"title":"DAY 3 – HA LONG – HANOI (B/L)","description":"06:15     Tai Chi class on the Sun-Deck 07:15    Have light breakfast with Coffee, tea, and bakeries on board 07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes. 09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins. 10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier 10.45    Brunch is served. After brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier. 11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina. O/N in Hanoi."},{"title":"DAY 4 – HANOI – FREE DAY – NIGHT TRAIN TO DA NANG (B)","description":"Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car). By the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Da Nang on SE1 (19:30 – 11:40 +). Overnight on the train."},{"title":"DAY 5 – DA NANG RAILWAY STATION – HOI AN – FREE (B)","description":"In and around Hoi An, Ho Chi Minh CityUpon getting to the Da Nang Railway Station, you’ll be welcome & escorted to your hotel in Hoi An for a check-in. The rest of time, you’ll be free on your own. O/N in Hoi An."},{"title":"DAY 6 – HOI AN – GROUP TOUR TO MY SON SANCTUARY – BOAT TRIP ON THU BON RIVER (B)","description":"08:00 – 08:30 AM: Our guide picks you up at hotel and leave Hoi An for visiting My Son Holly Land – the ruins of Cham people and was an imperial city during Cham dynasty. Here you can have more chance to explore and understand of technique of Old Cham people in making red bricks to build Tower which still now a secret to everyone, you can see a large complex of religious relics that comprises more than 65 architectural works. It also surprises for those who are curious with architectural art. In 1999, UNESCO labeled the Cham architecture in My Son as a World Cultural Heritage Site. Moreover, you have chance to enjoy traditional music performed by Cham girls in their colorful uniforms. Then transferring you back about 30km, you will take a boat trip along the Thu Bon River  to Hoi An Ancient Town. After that, back to the pier and come back your hotel by your own way & end of tour. O/N in Hoi An."},{"title":"DAY 7 – HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in. The rest of time, you’ll be free on your own. O/N in Ho Chi Minh City."},{"title":"DAY 8 – SAIGON GROUP TOUR TO MEKONG DELTA (B/L)","description":"PICK UP: 7:30am – 8:15am  RETURN: 17:30pm  ROUTE: HCMC – My Tho - Ben Tre – HCMC. Highlight: A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit. Itinerary: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.Stop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. Riding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. Have lunch at local restaurant. Break time. In the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.  O/N in Ho Chi Minh City."},{"title":"DAY 9 – SAIGON GROUP TOUR TO CU CHI TUNNELS (B/L)","description":"In and around Cu Chi TunnelsAfter having breakfast at hotel, you’ll be at leisure at the lobby of hotel At around 09:00, you’ll be picked up at your hotel then transferred about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range. At around 15:00, you’ll get back to your hotel & have a free time to relax by yourself. O/N in Ho Chi Minh City."},{"title":"DAY 10 – SAIGON – DEPARTURE (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00)."}]},{"name":"Short Northern Vietnam packages 6Days/5nights","duration":6,"travelStyle":["Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":585,"summary":"\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_54040105.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_270bbbb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_ae16d885.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_b7818dc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_47413246.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_096bda65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_d4f64ff2.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Chai","Cat Cat Village","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival – Night train to Sapa (No Meal)","description":"In and around HanoiYou will be greeted at the airport and transferred to down town. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day is yours.    In the evening: Bus and guide will pick up again then transfer to Railway Station to catch night train to Sapa. Overnight on the train."},{"title":"Day 2: Lao Cai –Lao Chai –Tavan Village (B/L/D)","description":"5:30 – 6:30: Pick up at Lao Cai train station by our staffs then drive to Sa Pa by bus.   7:00 -8:00: Have breakfast and relax at hotel. If hotel has avaiable room, you can check in early, if not, you join in tour first.   9:00 – 9:30: Our guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van village. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12 kms.   17:00 When you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.   Dinner and Overnight in hotel.Overnight in Sapa."},{"title":"Day 3: Sapa- Cat Cat village- Sin Chai - Ha Noi (Meals: B/L/D)","description":"7:00 Have breakfast.   9:00 – 9:30 Our guide takes you to visit a village of Black H’mong people.It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French ( This activity take 2 hours walking up and down to the valley ).    12:30 -13:00:Back to SaPa town and have lunch.You are free and easy to discover Sapa town.   16:30 – 17:00: Transfer from hotel to Lao Cai train station. Have dinner at the restaurant, near the train station before getting on the night train to go back to Ha Noi.    Overnight on the train."},{"title":"Day 4: Hanoi – Halong Bay (B/L/D) – Golden Star Cruise","description":"07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi Opera House then depart to Halong. On the half way stop for short break about 20 minutes.   12:30 Arrive Ha Long International Port, then tranfering to Golden Star Cruise by small boat. Enjoy welcome drinks, crew briefing before checking in cabin. Start cruising and enjoy a special lunch with Vietnamese traditional dishes while the boat slowly slides on romantic    15:30 Visiting Sung Sot Cave (surprising cave)   16:30 Our cruise will take you to the Titov Island, it is noted for having a viewpoint at its peak which affords splendid views all around Halong bay. Or you can enjoy your swimming on romance sandy beach.   17:30 Enjoy the Sunset party with wine and fruit and relaxing on sun deck    18:00 Cooking class how to make fresh noodle roll, you can enjoy product which you make it.   19:00 Enjoy your dinner in restaurant in middle romantic quite bay.   20:00 Playing some sports games like: Football table, Darts, Fishing, karaoke, dancing…"},{"title":"Day 5: Halong Bay – Hanoi (B/L)","description":"06:30 Wake up early to see the sunrise on Ha Long Bay then have breakfast with tea and coffee free   08:00 The boat cruising to Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.    09:00 Enjoy kayaking discover Halong bay. Then back to Cruise check out, take time to relax    11:00 Have lunch while the boat is cruising back to Tuan Chau International Port,    12:30 Get on the bus back to Hanoi, on the half way stop for short break 25 minutes   16:30 - 17:00 Arrive at the hotel in Ha Noi old quarter and Hanoi Opera House.   Overnight in Hanoi"},{"title":"Day 6: Hanoi - Departure (B/L)","description":"Breakfast at hotel. Free time to explore Hanoi by yourself until driver take you directly to the airport .   End of trip!"}]},{"name":"Hanoi, Halong & Sapa - 6 Days","duration":6,"travelStyle":["Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":360,"summary":"Get HUGE DISCOUNT for staying 3 nights Superior room at The Hanoian Hotel, 1 night on Board the World Nature Heritage Halong Bay and 1 night on Heavenly Sapa Plus FREE 1 hour cyclo trip or water puppet show.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138202_245d3385.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138202_245d3385.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_871e3af7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_1b0fb8df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_69a85984.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_03a05c86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_4901df6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_3ab0598a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_cca71c2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_32a1751f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_c4547009.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_9ed0e3aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_e7359124.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_fc631c1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_484a700c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_075ad5a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_7891b1d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_c423ca54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_4a18f520.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_81924436.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_ddb2ae61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_34320d86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_341fe396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_d59c865a.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"In and around HanoiPick up at airport. Stay 01st night in Hanoi at 3 star hotel (Superior room)Start point\n Hotel's Lobby, Quận Hoàn Kiếm, Hanoi, Vietnam "},{"title":"Day 2: Hanoi - Halong Bay","description":"Have breakfast, check out and be ready at lobby by 8am for pick up by shuttle bus for 2 days 1 night trip in Halong Bay with Deluxe Cruise ( 3 star Cruise ) Stay 02nd night on Board. (Deluxe room)"},{"title":"Day 3: Halong - Hanoi","description":"Return from Halong Bay, enjoy the FREE 01 hour cyclo trip around the famous Hanoi Old Quarter/ Water puppet show. Stay 03rd night in Hanoi at 3 Star Hotel (Superior room)"},{"title":"Day 4: Hanoi - Sapa","description":"Have breakfast, check out and be at lobby by 6h50am for pick up to  Sapa 2 days 1 night trip by bus.   Arrive to Sapa by noon for lunch, easy trekking trip in small group, back to hotel for dinner and stay 4th night at Standard room on the best 3 star hotel the either Vista/Panorama hotel "},{"title":"Day 5: Sapa - Hanoi","description":"Have breakfast, check out and be pick up at 9am for continue trekking in small group. Finish trekking in afternoon, back to hotel to fresh up and take bus back to Hanoi. Arrive to hotel in Hanoi by 9h30pm. Stay 5th night at in Hanoi at 3 star hotel (Superior room)"},{"title":"Day 6: Hanoi Departure","description":"Free time for shopping. Check out. Our car brings you to the airport. Trip ends. End point\n Hotel's Lobby, Quận Hoàn Kiếm, Hanoi, Vietnam "}]},{"name":"DREAMING Vietnam Offroad Motorcycle Tour to Ha Giang via Dong Van, Meo Vac and Ba Be Lake","duration":5,"travelStyle":["Motorcycle Ride","Christmas & New Year"],"oldPrice":0,"price":699,"summary":"We make this motorbike tour for experienced riders, whose love to explore this beautiful destination even you don’t have weeks to ride along. Besides the beautiful scenery that we enjoy on the tour itinerary, you also experience and explore the lives of ethnic minorities as home-stay with them. In addition, we also have the opportunity to Ba Be National Park to explore the wild beauty of nature here…","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceee8c918.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceee8c918.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeeb22fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeeba437.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeec4b45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeed7a65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeede44c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeee83d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceeef2ab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef2659c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef2f364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef37dd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef43a6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef5c6b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e00ceef740bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae854937.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae85b43b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae85fbd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae86461e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae868f04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae86dc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189742_5e017ae872b32.jpg"],"destinations":[],"timeline":[{"title":"Day 1: HANOI MOTORCYCLE TOURS TO VU LINH VILLAGE (THAC BA LAKE, YEN BAI)","description":"In and around HanoiWe start our Motorbike tour by riding on to dyke roads following Red river to Thac Ba lake. See beautiful countryside, rice and green tea fields. Then we turn to the little road to Vu Linh village, where populated by Dzao ethnic minority by the side of Thac Ba lake, very friendly people and the welcome is exceptional. Home-stay in Vu Linh  Summary: Distance:  180 km Meals: Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 2: THAC BA MOTORCYCLE TOURS TO HA GIANG CITY","description":"After breakfast, we motorcycle along the Thac Ba lake on a small road lined by palm trees and scenic mountain views to join the main Road 2, heading up to Ha Giang where we stop for the night and apply for a permit.  Summary: Distance:  180 km Meals: Breakfast, Lunch, Dinner Accommodation: Hotel"},{"title":"Day 3: HA GIANG MOTORCYCLE TOURS TO DONG VAN (HA GIANG) – OFFROAD MOTORBIKE TOURS TO TRIBAL VILLAGES","description":"After getting the permit to ride in border areas at Ha Giang’s Immigration Police, we motorbike on small challenging mountain roads (but incredibly beautiful) on the land of colorful mountain hill-tribes. Head up the Ma Pi Leng Pass. Here is yet another amazing place, with cloudy mountain ranges and the poetic Nho Que river winding off in the distance.  It is really difficult to find the exact words to describe Ma Pi Leng Pass, located between Dong Van and Meo Vac, near the northernmost tip of Vietnam, as a painting of astonishing beauty and magnificence that captures the eyes of all viewers and nature lovers.  Ride on a zig-zag track until reaching Vuong Family’s Residence, 14 kms before Dong Van. Vuong Family was considered the King of the Hmong People in Dong Van, Ha Giang. Their residence was built in the scenic valley of Sa Phin with Chinese architecture. The whole house was built out of wood and rock only. The rocks for the buildings were imported from China. Vuong Family Residence is a masterpiece of man work in the valley of heavenly beauty of Sa Phin.  This is a remote area and we can meet the hard-working local people here. It is inspiring to see how they survive as they manage live in the rocks.When we reach Dong Van Town we will have some extra time to wonder the ancient streets lined with H’mong homes of clay bricks and tiles roofs built centuries ago.  Summary: Distance:  160 km Meals: Breakfast, Lunch, Dinner Accommodation: Hotel"},{"title":"Day 4: DONG VAN MOTORCYCLE TOURS TO BA BE NATIONAL PARK (BAC KAN) VIA MEO VAC","description":" The road is still under construction and tracks what make the ride relatively long in spite of few kilometres. The landscape is among the most beautiful of Vietnam, and the slow tempo is only more appreciable.  We cross the wild regions of the mythical province of Ha Giang, Meo Vac is included. It shares the border with Dong Van District of Ha Giang Province and Bao Lam District of Cao Bang Province. Meo Vac has most of the terrain in the Rock Plateau of Dong Van and above 1000m above sea level.  Meo Vac has a harsh climate in the winter which is from November to April with dry and freezing cold weather. It is inhabited by different ethnic minorities including the H’mong, the King, Tay, Dzao…Most ethnic groups have maintained their culture untouched from the outside world. Beautiful motor ride down to Bac Kan Province in the afternoon. Take a local boat-ride on the reservoir of Na Hang Hydro Power Factory to village near by Dau Dang waterfall in Ba Be National Park for home-stay.  Summary: Distance:  160 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"},{"title":"Day 5: BA BE MOTORCYCLE TOURS TO HANOI","description":"Note: This is a very big day, we should start early and ride back carefully on Road 3 .After breakfast, take an other boat-ride on Ba Be lake to other side, before jumping on our motorbikes to Cho Ra, head up to main Road 3. Ba Be National Park is an abundant bioreserve area containing the world’s only fresh-water karst lake and several rare species of fauna and flora. Ba Be lake in VietnamThe biodiverse 10,048 ha park – home to 1,268 species of flora and fauna, a series of caves and a gigantic fresh water lake – was established in 1992 by the Vietnamese Government to preserve forest ecosystems in the northeast. Ba Be is home to over 3,000 people from the ethnic minorities of Tay, Nung, Dao and Mong, who live in 13 villages =within the park. The Tay people have inhabited Ba Be  area for centuries and make up 58 per cent of the population within the park’s boundaries. On Road 3, the way back to Hanoi, traffic is getting worst and worst, so we should be back before rush hour.  Summary: Distance:  230 km Meals: Breakfast, Lunch  "}]},{"name":"Highlight Vietnam Tour 11 Days/10 Nights","duration":11,"travelStyle":["Discovery","Family","Custom","Group","Fully Guided","Christmas & New Year"],"oldPrice":1559,"price":780,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter.\n\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\n\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\nDanang - Hoi An: See ancient sculpture in the Cham Museum, and tour Buddhist cave temples in the Marble Mountains. A walking tour through the UNESCO listed Old Quarter; Countryside bike ride, visit an old merchant house, the Hoi An Museum, and a Chinese assembly hall.\n\nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\n\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76133_4a732bb0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76133_4a732bb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_5ee52a2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_cc074bd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_f2d1943f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_94eb8fc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a9cd7c8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_716fb12a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a6b42c6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_56b29ae8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_5831bac7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_3388b299.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_783660cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_8f70bc42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_164f569b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_793e67f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_9d36e633.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_9c4cbb8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_7918afaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_50ca4b70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_6e9297e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_3280d51c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a3e19924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_94040ba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_521dba61.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Da Nang City","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"In and around HanoiToday you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi. Pomihoa Hotel Hanoi or similarStart point\n Airport pick up, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi. Pomihoa Hotel Hanoi or similar"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat. Garden Bay Cruises or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi Pomihoa Hotel Hanoi or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort Mai Chau"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Take a shower and walk around the Old Quarter until transfer to Railway Station to catch the train to Da Nang City. Overnight on the Train (4 Berth Cabin sleeper sharing cabin)"},{"title":"Day 7: Arrive Danang - transfer to Hoi An (No Meal today)","description":"In and around Hoi An, Ho Chi Minh CitySpend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30am! You`ll prepare the breakfast by your own because train doesn`t serve breakfast included in the ticket. Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. Check in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An.. Phu Thinh Resort Hoi An or similar"},{"title":"Day 8: Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous \"Cua Dai Beach,\" with the evening at your leisure. Overnight in Hoi An. Phu Thinh Resort Hoi An or similar"},{"title":"Day 9: Depart Hoi An for Ho Chi Minh City Sightseeing. (B, L)","description":"Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City. Liberty Parkview Hotel Saigon or similar"},{"title":"Day 10: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Saigon. Liberty Parkview Hotel Saigon or similar"},{"title":"Day 11: Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. Finish your Vietnam trip arranged by Legend Travel Group. We`ll arrange the transfer for you from hotel to Airport. Trip ends at the airport. Good bye and see you again! Airport Transfer is included!End point\n Airport Transfer, Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736400, Vietnam "}]},{"name":"Vietnam 7-day Sweet Honeymoon","duration":7,"travelStyle":["Other","Honeymoon","Christmas & New Year"],"oldPrice":0,"price":639,"summary":"Start and end in Hanoi! With the discovery tour Vietnam 7-day Honeymoon, you have a 7 day tour package taking you through Hanoi, Vietnam and 2 other destinations in Vietnam. Vietnam 7-day Honeymoons is a private tour that includes accommodation in a hotel as well as meals, transport and more. This package will be a good choice for couple who want to spend honeymoon in Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150935_e03355cf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150935_e03355cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_e6efe887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_9b349c01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_23e00587.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_284ed34e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_6a229bf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_d593abdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_bc916361.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_c3d02896.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_e3122b8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_6240daef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_92c3c254.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_28b38c8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_278dcf32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_65dcc910.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_8aa6fa9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_106d2034.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_76f83392.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_d36dd43c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_f50ddcee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_739e2524.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_a127107b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_3eb1fc56.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrive in Hanoi- Check in hotel","description":"In and around HanoiLanding at the Hanoi Airport. Our guide welcomes and pick you up at the airport to your hotel. You will check in hotel and take a rest Overnight at 3.5 star hotel like MK Premier Hotel, Hai Bay Hotel or similar Start point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam 00:00 - 23:00"},{"title":"Day 2: Hanoi city Private tour by private car- Take a hanoi food tour - Overnight on train to Lao Cai( Breakfast, Lunch)","description":"(Hanoi city  is Private tour, so it is flexible for you and you will be served better) - 8:30am: Start a Hanoi city tour by private car Firstly, we visit Ho Chi Minh Mausoleum and One Pillar Pagoda which are highlight to understanding more about Ho Chi Minh President, history of Vietnam war and Buddhism culture of Vietnam. . Next we will  go to campus of the first university of Vietnam – Temple of Literature – which was built in 10th century under Ly Dynasty who greatly influenced by Confucianism. The next stop is Tran Quoc Pagoda, the headquarters for the Vietnam Central Buddhist Congregation where many important Vietnamese Buddhism activities are taken place. Going along the Youth Road with two lakes in two sides including West Lake, the biggest lake in Hanoi and Truc Bachlake.  - 12:15am: Have a lunch - 1:00pm: Finish the tour and take come back the hotel. - 3:00 pm: Take a Hanoi Walking Street Food tour, our tour guide will meet you at your hotel. - 8:00p.m: The local guide in Hanoi pick you up from your hotel about .We will catch the overnight train soft sleeper with AC to Lao Cai. The train leaves at 21.10 - 21.50 from Hanoi railway station.  Overnight on Train: Chapa Train or similar "},{"title":"Day 3: Hanoi - Sapa– Y Linh Ho – Lao Chai – Ta Van –Sapa( Breakfast, Lunch, Dinner)","description":"5.00 - 6.30 Pick up you at Lao cai Transfer to SaPa for breakfast and check in hotel ( if available) 9.00 – 9h30 Begin 12 km of trekking, visit Y Linh Ho and Lao Chai village of the H’Mong minority.  13.00 After lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay the our guide will lead you visit some house on stilts of ethnic.Here you have opportunity to experience their daily life, work and original custom, enjoy some green tea and taking with ethnic people. 14.30 We return to main road Ta Van Village. Where the van will pick you go back the hotel. 18.00 – 19.30 Enjoy your dinner in our hotel.  After dinner you are free to explore the charm of Sapa by night, enjoy roasted corn, baked eggs beside charcoal fire or go shopping. Especially on Saturday night, we highly recommend a stop at the love market which is one of unique cultures of ethnic minorities (H’mong, Dazo. Int Lao Cai in pacticular and Northwest of Vietnam in general.  Stay overnight in Sapa Relax hotel or similar "},{"title":"Day 4: Sapa - Fansipan Peak – Ha Noi ( Breakfast, Lunch, Dinner)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery. 9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos). 11.00: Come back to Cable Car Station and return to Sapa town, 12.30: Have lunch in the hotel 13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi. Overnight on train like Chapa train or Sapaly train or similar "},{"title":"Day 5: Hanoi- Ha Long Bay Pelican Cruise( Breakfast, Lunch, Dinner)","description":"Arrive in Ha Noi at 5.00 am. We rent a small room for you to take a shower and relax until 8a.m.  Then, you  continue a trip to Ha Long Bay at 8.30 AM 8.30- 19.30:  Our mini van will come to pick you up at your hotel in Hanoi centre around 8.30 am. Drive to Halong City.  Enjoy the landscape of the Red River Delta country side. Stopover at Hai Duong province for refreshment about 30 minutes Arrive at Tuan Chau island – Take break and welcome drink at Pelican HalongCruise Lounge Transfer to Pelican Halong Cruise Welcome drink - receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature. Enjoy buffet lunch with Vietnamese dishes served while cruising through the bay, passing the most beautiful and quiet areas, such as Incense Burner, Dog Stone Islet, Fighting Cock, Soi Sim beach, Coconut Three Island Visiting Tung Sau area, is covered by the leaping rocks, cultured pearl fishery. You can wit yourself the process of the jewel, from culturing to harvesting and sculpting, Moreover, you have a chance to do kayaking based on your preference. Enjoy busy space with pearl maker, you can experience the completion of pearl. Visiting the beautiful Ti Top beach for swimming (if the weather permits), Ti Top Beach is especially famous for its fresh atmosphere, clean water, and smooth white sand that create a great ambiance for tourists to relax or passengers can take steps to reach on the top of  Ti Top beach to have a whole panorama view of Halong Bay. Back to the boat and free time while sailing to Luon Bo area, and anchor overnight. Option: Massage service available. Please book with Cruise Manager directly (please see massage menu) Attend the Cooking class on sundeck – How to make Vietnamese spring rolls - traditional Vietnamese food. Then enjoy Happy Hour (Buy one drink-get one free). It is time for chit chat and relaxing. Watch the magnificent sunset over Halong Bay.  19.30 – 23.00: Dinner – Deluxe Vietnamese  BBQ Set Menu Dinner Evening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spending a romantic night on Pelican Halong Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat. 23.00: End of Program for Day One. Overnight on Pelican Cruise   "},{"title":"Day 6: Tai chi- Visiting Sung Sot Cave - Relaxing( Breakfast, Lunch)","description":"06.00 – 11.30: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements. Coffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape. Transfer by tender to Sung Sot Cave. Walk up about 100 steps to the cave entrance. It takes approximately 45 minutes for cave visiting. Visit Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites. Return to the boat by tender. Proper shoes are highly recommended. Back to Pelican Halong Cruise. Check out and settle your bill at reception. Have a buffet brunch while cruising back to the Tuan Chau Wharf. Relaxing on the sundeck or in the dining room enjoying the bay scenery while approaching the wharf. Disembark to Tuan Chau Wharf. Say goodbye  to the crew. 12.00-15.30:  Stop over the middle to visit a traditional workshop and refreshment about 30 minutes. Arrive in Hanoi End of the trip. Overnight in 3.5 star Hotel like Hai Bay Hotel, MK premier Hotel. "},{"title":"Day 7: Return the Noi Bai airpot and fly back to your home( Breakfast )","description":"-Take a rest in your hotel. - Our Private Car will pick you up at your hotel and take you to the airport and say Goodbye. Ends Package tourEnd point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam 00:00 - 23:00"}]},{"name":"Sapa Wonder and Minority Market","duration":5,"travelStyle":["Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":468,"summary":"5Highlights of Sapa brings most of Sapa’s natural wanders to your holidays. You will enjoy much the natural beauty and magnificent landscapes while paying visit to Sapa’s most beautiful valleys, meeting 4 tribal peoples, witnessing unique ways of life. For your 5th day of the trip, one of the tribal traditional markets in the region such as Bac Ha, Coc Ly, Muong Hum…will add more color to your vacation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/148900_a3aee7d9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/148900_a3aee7d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_75707c13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_5bac106e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_4df0a970.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_e3ecd4a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_4ebb7e4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_80f01f5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_32a0df3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_0b6d7e34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_fe06d1c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_e296ca19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_ba8d1b3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_7b3aec8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_9a5b2dfa.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Take overnight train from Hanoi to Lao Cai","description":"In and around HanoiPlease, be ready at your hotel lobby at 20.00 for a short transfer to Hanoi railways station for taking the overnight train (first class 4 beds cabin with air-condition) which arrive in Lao Cai city, near the Chinese border next morning. Start point\n Your hotel/stay in the Old Quarter Area or our office at no.47C Ly Quoc Su Street,  Hoan Kiem District, Hanoi, Vietnam, Hanoi, Vietnam 20:00 - 20:30"},{"title":"Day 2 : Lao Cai - Sapa Town’s Highlights ( B,L,D)","description":" The train arrives at Lao Cai station early at about 6AM, meet your guide and driver as you check out and an hour transfer uphill the Hoang Lien Son mountains to Sapa. Great views of valleys and terraced rice fields along the way. After Breakfast your guide will show you around for a brief introduction of this charming town. At the market, ethnic minority people of different groups wearing their traditional costumes made by themselves comes every day selling local products includes vegetable, bamboo shoot, mushroom, medicinal herbs and souvenirs…there are chances to get intact and taking photos. Later you will follow the footsteps uphill to the top of Ham Rong Mountain for over viewing beautiful scenery of the town and surrounding area, paying visit to an orchard garden and a mini museum which tells you a lot about ethnic minority people living in Sapa and the northwest region. Later in the afternoon, you may wish to continue your walk down hill to visit Cat Cat village of the Black H’mong, 5 km away or drop in a local terraced café to enjoy your self as the cloud comes   Overnight at 3-star hotel in Sapa"},{"title":"Day 3: Visit Ta Phin Valley - Silver Waterfall - Tram Ton Pass ( B,L,D)","description":"Today morning, you will visit Ta Phin commune 14 km southeast of Sapa town. Located in a large valley, surrounded by high mountains, which covered by pine trees and forest, Ta Phin Commune is home to the Red Zao and Black H’mong ethnic. Although living close to each other for years, these two ethnic peoples are very different: The H’mong are cheerful and open minded while the Red Zao are economical and reserved…  Take a 14km drive to the center of the valley, you will enjoy an easy walk following village path around the valley, paying visit to H’mong hamlets scattering from the bottom of the valley to higher mountain slopes. From high elevation, great view of the valley stretching under your foot. Continue your walk to the Red Zao village in which you will meet groups of women making handicrafts includes embroidered clothes, handbags… Transfer back to Sapa for Lunch and noon break. Afternoon, Local guide and driver will pick you up at about 02.00 pm and then drive up hill to see the famous Silver Waterfall and then onto Tram Ton, the highest mountain pass in Vietnam at 1,800 m above sea level for enjoying the magnificence of Hoang Lien Son Mountain Range as well as over viewing spectacular landscapes of the whole area, stretching endlessly. Transfer back to Sa Pa and relax. Overnight at 3-star hotel in Sapa"},{"title":"Day 4 : Tribal Villages visiting along Muong Hoa Valley ( B,l,D)","description":"Two high ranges of mountains run in parallel southwest of Sa Pa town create Muong Hoa valley, famous for its breathtaking scenery in the region which is home to the major part of Sa Pa’s ethnic population including the H’mong, Zao, Zay, Tay and Xa Pho. Today you will spend the whole day exploring the spectacular Muong Hoa. A Jeep will take us out of the town, following the only road built on the side of a mountain range, looking down the valley, over viewing magnificent landscapes composed of high mountains, deep valleys, and stream of water winding, waterfalls and terraced rice paddies…Many time, leaving the main road, you will visit tribal villages such as Ta Van of the Zay, Su Pan of the Black H’mong,  drive back to Sapa. Evening is at your leisure. Overnight at 3-star hotel in Sapa"},{"title":"Day 5 : Full day joining a Tribal Traditional Market ( B,L,D)","description":"Depending on what date it is today, you can choose one of the market available for your interest in our market list and we shall refine a detail itinerary and activities. After a day joining locals and enjoying their market atmosphere and activities, you will have VIP sleeping bus from Sapa to Hanoi at 4p.m and arrive in Hanoi at 10p.m-10.30p.m.End point\n Bus station in Old QUarter, Hanoi, Vietnam 22:00 - 22:15"}]},{"name":"Discovery Vietnam Central 5 Days 4 Nights","duration":5,"travelStyle":["Sightseeing","Family","Christmas & New Year"],"oldPrice":0,"price":350,"summary":"Start and end in Da Nang City! With the sightseeing tour Discovery Vietnam Central 5 Days 4 Nights, you have a 5 day tour package taking you through Da Nang City, Vietnam and 3 other destinations in Vietnam. Discovery Vietnam Central 5 Days 4 Nights includes accommodation in a hotel as well as an expert guide, meals, transport and more.\n\n\n\n\nHighlight of the tour\n\nDay 1: Arrive Da Nang transfer to Hue City \n\nDay 2: Visit Hue City \n\nDay 3: Ba Na hill with golden bridge \n\nDay 4: Marble moutain and Hoi An ancient house \n\nDay 5: Hoi An Departure ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153401_9f226924.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153401_9f226924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_eb011959.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_ba993b3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_1ec0711a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_79d350fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_92379b22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_f999c980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_245b852d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_e6aeaaf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_14056a1a.jpg"],"destinations":["Da Nang City","Hue","Hoi An"],"timeline":[{"title":"Day 1: Danang arrival – Transfer to Hue – Half day City Tour","description":"In and around HueWelcome to Danang! You will be greeted by our car and driver at the airport then transfer directly to Hue.   Arrive Hue, check in hotel. Hue served as an imperial capital to the Nguyen Lords, a feudal dynasty which reigned from the 17th to 19th century. With splendid emperors’ tombs, ancient pagodas and the remains of the Citadel, the city retains its Royal charm. Overnight in Hue"},{"title":"Day 2: Hue City Tour – Transfer back to Danang (B/L)","description":"In the Morning: Pick up at your hotel 7:30am by car. You will visit:  Minh Mạng Tomb, Khai Dinh Tomb, Traditional Martial Art Van An, Tu Duc Tomb, Conicat Hat & Incense Making Village  Noon: Buffet lunch (50 traditional foods, Asia & Western foods).  Afternoon: Continue by bus to visit: The Citadel, Thien Mu Pagoda Then get on the boat for a sight -seeing along the Perfume River to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River!  Finish tour, the private car takes you back to Da Nang. Overnight in Danang. "},{"title":"Day 3: Danang – Bana Hills – Golden Bridge – Danang (B/L)","description":"After breakfast at hotel, we transfer to Ba Na hills. Arrive Bana, take Cable Car which gains 5 world scores to Ba Na hills station. Stop at By Night station to visit Vong Nguyet hills, Linh Ung pagoda, The Old Villas of French. Continue moving up by cable car to the Nui Chua Mountain – the top of Ba Na range, visiting Nginh Phong top, Le Nim Villas, Orchid Garden… Experience hill climbing train (first and unique funicular in Vietnam) and visit an old French cellar (Debay Ancient Wine Cellar), flower garden Le Jardin D’amour and Linh Ung Pagoda. Have lunch at restaurant on Bana Hills. Afternoon: Free for joining games in Fantasy Park – the third biggest indoor games zone in Vietnam with series of interesting games: 4 – 5D film, skiver, The death race, dinosaur park… (2 hours) then we take the cable car down. Bus back to Danang City. Overnight in Danang.   "},{"title":"Day 4: Danang – Marble Mountain – Hoian (B/D)","description":"In and around Hoi AnBreakfast at hotel then you are free and easy to relax on the beach or walk around to visit and do shopping in Danang City. 15h00 – 15h30: Shuttle bus and tour guide will pick you up at hotel. 16h15: Visit the Non Nuoc carvings-stone village and conquer Marble Mountains, explore the beauty of the mysterious caves, visit the ancient temples hundred years: Linh Ung and Tam Thai. 17h30: After leaving Marble Mountains, shopping local specialities. Depart to Hoi An Ancient Town 18h00: Have a dinner at Hoi An restaurant. 19h30: Walking to visit and shopping in Ancient Town, admire Hoi An at  night flickering in multi – colored lantern. Check in hotel and Overnight in Hoian. "},{"title":"Day 5: Hoian – Danang – Flight departure (B)","description":"Today you are free at leisure to walk to the ancient city to visit the Kwan Temple, Phuc Kien Chinese Assembly Hall, Tan Ky Old House, Japanese Cover Bridge and Historic & Cultural museum in Hoi An. Enjoy a walking tour through the narrow lanes of the town lined with century-old building and illuminated by hundreds of colorful lanterns till transfer to Danang airport for your flight back home. End of trip.   "}]},{"name":"10 Days Vietnam In Style","duration":10,"travelStyle":["Discovery","Christmas & New Year"],"oldPrice":0,"price":1690,"summary":"In and around Hanoi, Da Nang\n\nOn arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. The journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.   Evening:  You will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.   Accommodation: Hanoi LaSiesta Hotel & Spa Meals: Dinner","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/115883_8aef4ac9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/115883_8aef4ac9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_93ed3299.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_294ab863.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_50478adf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_56fd8be4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_acfb19b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_3b9f1bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_6b08223d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_a7b064d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_9e5c8972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_0e830825.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_2675f80b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_bcbae29c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_b9a3b142.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_e94cde25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_ea60dadc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_42463cf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_4876f43f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_f3aeebce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_27589710.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_a4fa8c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_5b7e95c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_6dd05210.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_60847eee.jpg"],"destinations":["Hanoi","Ninh Binh City","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around Hanoi, Da NangOn arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. The journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.   Evening:  You will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.   Accommodation: Hanoi LaSiesta Hotel & Spa Meals: Dinner"},{"title":"Day 2: Hanoi","description":"This afternoon you will join \"Real Hanoi Bicycle Experience\", an amazing adventure to discover Hanoi City on the way you never explore by foot in the couple of days you be here on your own! It's a great way to crack into the local scene of Hanoi.  Accommodation: Hanoi LaSiesta Hotel & Spa   Meals: Breakfast"},{"title":"Day 3: Ninh Binh (Hoa Lu -Tam Coc)","description":"Today you will be transferred by luxury van to Ninh Binh a region well-known for its green valleys, karst mountains and conservation areas.07: 15 - 07:45 Approx – You will be met by Bus Line tour guide at our discussed meeting point. Visiting a local family in Tam Coc area. They are a traditional Vietnamese family with three generations living together. Here you will get the chance to see the house architecture and their daily life and their handicraft job of making traditional embroidery. Leaving the family, you will take a bike and start riding to explore the rice fields and limestone mountains with a unique route. Come back the local family, enjoy a special lunch with the local cuisine featuring the yin-yang balance of the Asian culture. After lunch, a break with a cup of tea will be served before you continue the journey of discovery Ninh Binh. Visit Tam Coc by a small boat rowed by a local for about 1.5 hours. Known as “Halong Bay on land”, the boat trip is a nice journey along the river with the peaceful scenery of Limestone Mountains, rice paddy if traveling during harvest season. Arrive at Hoa Lu, the ancient capital of Vietnam in the 10th century, visit the temple of King Dinh. Under the introduction of our local guide, you will get to know more about the Vietnamese history. We drop you at Hotel in Ninh Binh for overnight stay. Trip ends. Accommodation: Bai Dinh Garden Resort  Meals: Breakfast, Lunch."},{"title":"Day 4: Ha Long Bay - Lan Ha Bay","description":"After breakfast, leave Ninh Binh to Tuan Chau Harbor for an overnight boat trip on Lan Ha Bay that is a part of Ha Long Bay with the additional attraction of numerous white-sand beaches. Journey there through the rich farmlands, observe everyday life of Vietnamese villagers as they work the rice fields, take pigs to the market on bicycles and plough the fields with their water buffaloes.  12.00 Ready at the private guest lounge by Genesis at Tuan Chau Harbor. Genesis team will welcome you at lounge and register for your trip. 12.30 – 13.00 Welcome speech - Lunch time You will embark Genesis Regal Cruise in the warmly greeting of the team who will accompany you guys in the trip. A welcome speech will be given to you be our Cruise Manager, and itinerary briefing instantly. After that, you will enjoy set menu lunch with delicious local seafoods. Regal Cruise slowly glides between the numerous small islands and the sea-green color of the bay. 14.00 Check in rooms Receive the room key, check in and take a rest at your reserved room, while Regal Cruise take you sightseeing among the nature wonder. 15:00 – 16.30 Kayaking – Sampan boat. Reaching Dark- Light area of 3 underwater caves. In this activity, visitors have two choices, either by themselves creating separate roads for exploring by kayaking or sit on boats that rowed by the local people to soak in the peaceful atmosphere. 16.30 – 17.00 Swimming – relax After kayaking, visitors can do swimming in middle of the bay. Immerging the body to emerald water or jumping from top of tender are exciting activities. 18.30 – 19.30 Cooking class, Sunset Party, Bartender show Regal Cruise will move to safety anchorage. It is the time to join the “sunset party” on the open top deck of the ship. In the rhythm of the music, visitor could enjoy the sunset moment, gathering, mingling… Watching the skillful Bartender show and do not miss the special offer “Happy hours – buy two get one for free” to enjoy the memorable moments in the trip. Moreover, Regal Chef will guide you how to make one of the 50 best dishes in the world, voted by CNN – “Nem” – Deep Fried Spring Rolls in Vietnam. 19.30 Dinner on board Guests will enjoy the delicate dinner in the warm and cozy ambience. With fresh dishes by deluxe Fusion style, promise to bring guests an unforgettable dinner on this memorable trip. 21:00 Relax on board A free time for some activities such as: films; playing chess, reading books, listening to music, trying your luck with squid fishing, tea culture learning, or enjoy the starlight of night sky in the bay on sundeck. 22:00 Overnight  Cruise goes to overnight point at the quietest part of the wonders. Finishing the first day with a good night’s sleep. Overnight on board. Accommodation: Genesis Regal Cruise.   Meals: Breakfast, Lunch, Dinner."},{"title":"Day 5: Lan Ha Bay - Hanoi","description":"06.30 Morning greet Tai Chi wake up to new days are practiced out on the sundeck. This is also the moment visitors can pick up the dawn on the bay. 07.30 Breakfast A light and nutritious breakfast served at the restaurant will help you enjoy the last day on the bay, which is always full of energy. 08.30 Visit a floating house Tour guides and tender will take you to visit a floating house on the bay. The local host will welcome you as home-guests, visitors will be exchanged with the owner, to understand the information about culture, history … of the fishing village on Halong Bay – Lan Ha Bay. 9.30 – 10.30 Brunch time Guests return to the boat, stay and check out procedures. Enjoying the scenery of the Bay and a delicious buffet brunch while cruising back to the harbor. 11:45 Back pier Regal Cruise arrives in Tuan Chau Marina. Guests will relax at the private lounge, preparing luggage and depart back to Hanoi. 15.00 – 15.30 Back to your accommodation  Return to Hanoi Hotel after moving quickly by the highway.  Accommodation: Hanoi LaSiesta Hotel & Spa Meals: Breakfast, Lunch."},{"title":"Day 6: Hue","description":"In and around HueAfter breakfast at hotel, your driver will meet you for the transfer to Hanoi Airport for the flight to Hue.  On arrival, your guide will welcome you for the 30-45 minutes drive to Hue Hotel. After lunch at local restaurant, we visit Thien Mu pagoda. Then guide will take you to make a cyclo tour for visiting the Imperial Citadel where Nguyen Dynasty ruled between 1802 and 1945 with numerous of attractive places to see like Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Purple Forbidden City…Back your hotel and end of tour. Accommodation: Hue Indochine Palace Hotel Meals: Breakfast, Lunch, Dinner."},{"title":"Day 7: Hoi An","description":"In and around Hoi AnOur guide and driver welcome you at hotel in Hue and transfer you to leave Hue city for Hoian. You will be driven along National Highway No1 and see more of beautiful landscapes of rice fields, Cau Hai Lagoon, local villages. You will have a chance to see Lang Co beach – one of the most beautiful beaches in Asia to enjoy the nice view.   Next, you will see the spectacular view of Hai Van Pass through windy road to the summit. From here the panorama of Lang Co Beach, Da Nang city is under your eyes. It is the ideal spot to take wonderful photos of forest and mountains. You arrive in Da Nang city at noon.   After lunch at restaurant you will visit Da Nang city including Cham Museum where shows the collection of Champa sculptures to learn more of Cham culture and then Marble Mountain which is well known as Five Mountains to visit and discover pagoda, cave and view of Da Nang city from the summit. You arrive in Hoian late afternoon.    Accommodation: Hotel Royal Hoian - MGallery by Sofitel  Meals: Breakfast, Lunch"},{"title":"Day 8: Hoi An","description":"Morning: Our guide welcomes you at the hotel in Hoi An in the early morning and then you will sit on boat to learn fishing for more experience with the instruction of the local people. Continue to visit green Bay Mau water coconut forest; it’s a chance to row the basket boat to enjoy the tranquil atmosphere admire the revolutionary base of Hoi An in the past and use fishing tools to fish the field crab.  You will be transferred to continue to ride bicycle for visiting Tra Que Vegetable Village through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. You will join a cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods. Have lunch at the family.  After lunch, you will learn about farming; dress in farming clothes, take a short walk around to visit the garden where local farmers work and use the traditional methods without having electrical machines support. Come back the house to relax by soaking your feet in Vietnamese herbs. This is one of the ways to refresh ourselves after the hard time in garden of Vietnamese.Then you be transferred back your hotel in Hoi An.   Accommodation: Hotel Royal Hoian - MGallery by Sofitel  Meals: Breakfast, Lunch."},{"title":"Day 9: Hoi An","description":"Today is a free day to explore Hoi An. Browse the town’s cobbled streets and art galleries, or hire a bike and cycle through rice paddies out to An Bang Beach. Shop for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shop houses. Perhaps visit one of the hundreds of tailors in the city to get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class.   Accommodation: Hotel Royal Hoian - MGallery by Sofitel  Meals: Breakfast"},{"title":"Day 10: Da Nang","description":"Transfer from Hoian hotel to Danang International Airport for your home back for next extension.    Meals: Breakfast"}]}]