[{"name":"Cycle Vietnam","duration":15,"travelStyle":["Bicycle","Adventure","Group","Fully Guided","Christmas & New Year"],"oldPrice":0,"price":2115,"summary":"More than 30 million Vietnamese can't be wrong - handle-bar height gives you the best view of Vietnam! Our cycling tour through this mesmerising country provides opportunities to meet the locals and experience their culture in a way that wouldn't otherwise be possible. So come with us and get active as we travel from Hanoi to Ho Chi Minh City, down country lanes and over spectacular mountain passes. And, of course, all the exercise gives you the perfect excuse to indulge in delicious Vietnamese cuisine.","highlights":["Visit the Ho Chi Minh Mausoleum","Admire the lush panorama of the Mai Chau valley","Take a stroll through fields of rice","Discover the wacky architecture of Hang Nga Crazy House"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1847_b889931e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1847_b889931e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a6d5f7ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_f4bc262f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_4db36211.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_50ef9cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_57336d3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_c8978dea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_8dfd2c5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a24e5567.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_7af2e663.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a004c89d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_eab6c881.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_efe1f959.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_4732d2d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_145350bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_0180e8a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_e90a61f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_da080c7a.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh City","Hue","Hoi An","Quy Nhon","Dalat","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiXin chao! Welcome to Vietnam. Your adventure officially begins with a welcome meeting at 6pm tonight. You can arrive at any time during the day, as there are no activities planned until this important meeting. Please look for a note in the hotel lobby or ask the hotel reception where it will take place. We'll be collecting your insurance details and next of kin information at this meeting, so please ensure you have all these details to provide to your leader. \n\nIf you are bringing your own bicycle with you on the trip, you need to assemble it to check for any damage in transit before the welcome meeting. \nIf you have arranged for the hire of a bicycle, your leader will assist you in preparing the bike before your first cycling activity.\n\nIf you arrive with some time to spare then work your legs with a walk around Hanoi’s charming shaded boulevards and a squat on a short street-corner stools for a bia hoi (freshly brewed draught beer) in the Old Quarter.\n\nNotes: If you can't arrange a flight that will arrive in time, you may wish to arrive a day early so you're able to attend. We are happy to book additional accommodation for you (subject to availability). If you're going to be late, please inform the hotel reception or your travel agent in advance. \n\nRiding distance: none Accommodation: Hotel"},{"title":"Day 2: Hanoi","description":"This morning you’ll get the chance to explore the Vietnamese capital by bike on a guided ride through the city (approx. 22kms). \n\nHanoi is made for exploration by bike, so this is the perfect place to get to grips with Vietnamese street life and traffic. You’ll ride through parks, around lakes, and down tree-lined boulevards and visit iconic sights such as the Ho Chi Minh Mausoleum complex, which includes the Buddhist temple One Pillar Pagoda and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. \n\nThere’s also time to explore the vibrant Old Quarter, an architectural museum where blocks of ochre buildings give off the air of a 1930s provincial French town. In these ancient ’36 Streets’ discover an amazing selection of shops that sell everything from souvenirs to exquisite silk clothing, jewellery, beautifully embroidered tablecloths, wood carvings and lacquerware - it's a bargain hunter's paradise. \n\nYou’ll have some free time this afternoon. Perhaps take a walk around the beautiful Hoan Kiem Lake, with the reflection of modern office buildings, old Buddhist temples and the tangle of ancient streets in its still surface, or maybe dive into culture at the Vietnam Fine Art Museum or The Vietnamese Women’s Museum. Top off the day with a steaming bowl of fresh Pho from a hole-the-wall eatery – the street food in Hanoi is not to be missed!\n\nRiding distance: approx. 22kms/14 miles, mostly flat with approx. 40m/130ft of elevation gain. Accommodation: Hotel"},{"title":"Day 3: Mai Chau","description":"Saddle up this morning as your cycling adventure kicks into first gear. Leave Hanoi behind and travel by bus to Hoa Binh (approximately 2 hours). When you arrive you’ll jump on your bike and cycle 38 kilometres to Cao Phong, through small ethnic Thai villages, enjoying the tranquility of the paddy fields and interacting with the local people. Limestone peaks climb in the background and banks of green line the road, and you’ll take regular stops to admire the view across the lush valleys. After arriving you’ll take a short 30-minute bus ride for the next section, stopping for lunch at Man Duc. \n\nAfter you fuel up, the bus will take you to the Da River Reservoir. Stretch your legs again cycling along the Da River, passing spectacular karst cliffs, through paddy fields, and admiring the lush panorama of the Mai Chau valley on the way (approximately 19 kilometres). The peaceful town of Mai Chau is situated in a stunningly beautiful valley surrounded by verdant green mountains and is famed for its breathtaking scenery and friendly hilltribe peoples. Tonight you’ll enjoy local hospitality in a simple stilt-house homestay in the village of Poom Coong. Your amicable hosts will cook up a fabulous home-cooked meal, and there may even be a chance to sample some of the local rice wine produced in the region.\n\nRiding distances:\nRide 1 -  approx. 38kms/24 miles, uphill with approx. 330m/1080ft of elevation gain.\nRide 2 - approx. 19kms/12 miles, mostly downhill with approx. 80m/260ft of elevation gain. Accommodation: Homestay"},{"title":"Day 4: Ninh Binh","description":"This morning you farewell your homestay hosts and cycle from Mai Chau to Mai Hai, and then on to Co Luong (approx 50kms). You’ll ride through more paddy fields and test your riding skills (or suspension) with the shallow potholes that can be found on the road. Pass farmers riding atop their load drawn by lumbering water buffalo, ride through small towns and wave to friendly locals on your way through picture-perfect Vietnam – lush green fields, towering limestone mountains, tranquil waterways and charming historic sites. \n\nA bus trip then takes you along the Ho Chi Minh Road with a lunch stop before Ninh Binh. If you arrive in Ninh Binh with time (and energy) to spare you can take a 36 km cycle around the surrounding area. This is a wonderful chance to see everyday rural life in action as well as take in the beautiful countryside.\n\nRiding distances\nRide 1 - approx. 49kms/30 miles, mostly downhill with approx. 195m/640ft of elevation gain.\nRide 2 - approx. 36kms/22 miles, mostly flat with approx. 50m/165ft of elevation gain. Accommodation: Hotel"},{"title":"Day 5: Ninh Binh - Overnight train","description":"This morning you’ll cycle from Ninh Binh to Tam Coc, when you’ll really have the opportunity to soak up one of Vietnam’s most spectacular views – limestone karst peaks thrusting out of serene rice paddies, the sounds and views of the river, which winds through the fields and has boats parading up and down its length.  You will also cycle to Hoa Lu, the ancient capital of Vietnam under the 10th-century Dinh Dynasty, the remains of which can be seen in the lasting beautiful archways and temples. Here you’ll take a lunch break at the Dinh or the Le Temple. Today’s cycling is approximately 50 kilometres. Then it’s back on the bus to return to your hotel, where you can use the day room to take a shower and freshen up. After an early dinner you’ll transfer to Nam Dinh for an overnight train to Hue.\n\nNotes: On the overnight train to Hue (approximately 12 hours) conditions are basic, but it is a true Intrepid experience and the best way to travel long distances like a local. Sleeper trains typically have four berth compartments (occasionally six berth depending on seasonal variations and group configuration), which have bench seats that convert into sleeping bunks. A sheet, pillow and blanket are provided, although some travellers prefer to bring their own sleeping sheet. On occasion, passengers of different genders will be required to share a compartment and there will be occasions where you'll be sharing with local travellers or travellers who are not part of your group. Most trains have a dining carriage serving simple food, but some travellers take the opportunity to stock up on fresh bread, cheese and fruit prior to departure.\n\nRiding distance: approx. 52kms/32 miles, undulating with approx. 195m/640ft of elevation gain. Accommodation: Overnight sleeper train"},{"title":"Day 6: Hue","description":"In and around HueArrive in Hue and hop back in the saddle to begin your exploration of the former imperial capital of Vietnam. Hue holds the treasures of Vietnam's royal past and is a curious mix of bustling streets and tranquil settings. Today you will ride (approximately 16 kilometres) through the fields to visit many of Hue's remarkable sites, including temples, bunkers, tombs, ruins, pagodas and spectacular scenery. \n\nOn your cycle you will visit the Imperial Citadel, including the Forbidden Purple City. The latter was almost totally destroyed during the Vietnam War's Tet Offensive, but the foliage-covered ruins are still atmospheric and the gaping holes left by bombs give an idea of the destruction wreaked upon the country during the war. The itinerary is flexible and you have ample time for stops along the way to admire the sites. Later, kick back in a cafe or restaurant. Hue’s cuisine is considered by many Vietnamese as the best in the country, and is influenced both by its imperial heritage (small dishes and a focus on aesthetic presentation) as well as its strong Buddhist heritage, reflected in the high proportion of vegetarian restaurants in the region. The bustling Dong Ba Market offers a wealth of goods and foods to see and snack on. It's a good place to try some of the local specialities that graced the Nguyen emperors' banquet tables, such as the ‘banh khoai’, Hue's answer to the pancake.\n\nRiding distance: approx. 16kms/10 miles, flat with approx. 12m/40ft of elevation gain. Accommodation: Hotel"},{"title":"Day 7: Hoi An","description":"In and around Hoi An, Ho Chi Minh CityToday will be big on riding and big on spectacular views. Leaving Hue, you will do some mountainous riding (approximately 85 kilometres in total) as you conquer the Hai Van (Ocean Cloud) Pass on the way to the tropical south and the laidback town of Hoi An. The pass is a stunning stretch of highway the winds through the Truong Son mountain range for about 20 kilometres (10 kilometres each way), with views across the Bay of Danang to the south. It is 500 metres about sea level and the up/down slope ranges from 5-10%, and there will be plenty of well-earned breaks along the way to take in the views, snap some photos, and rehydrate. After the rewarding vistas on the cycle in, you’ll also be spoiled with the town of Hoi An – with lantern-lit streets, vibrant markets, skilled tailors, artisan shops, ancient houses, colourful temples and beautiful smiles, it’s a Vietnamese wonderland. Recently declared a World Heritage site, Hoi An is being beautifully restored and preserved, with parts of the town looking exactly like they did more than a century ago. This makes its streets of low tiled buildings perfect for strolling. Take the evening to soak up the atmosphere, or just rest your legs at a local restaurant after a day’s riding.\n\nRiding distances:\nRide 1 - approx. 56kms/35 miles, flat with approx. 55m/180ft of elevation gain.\nRide 2 - approx. 30kms/19 miles, significant uphill & downhill with approx. 576m/1890ft of elevation gain. Accommodation: Hotel"},{"title":"Day 8: Hoi An","description":"This morning you leader with take you on a walking tour of the town, which used to be a busy port for the Cham people before the river silted up. There’s also a strong Chinese influence, and you’ll see it as you walk past the pagodas and assembly halls. On your tour you’ll take in a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. The afternoon is free for you to do whatever takes your fancy. For those who love to shop then Hoi An is a mecca, with much to browse and buy. There are original paintings, handcrafted woodwork, ceramics, embroidery, lanterns and more. If you want to get some new threads then the town is also famous for its tailoring – pick a fabric and a design and it’ll be ready the same day. If you feel like keeping active then there are the options to take a 15-20 kilometre ride into the surrounding countryside, to cycle to nearby Cua Dai Beach, or to take a stroll through fields of rice, sesame, banana and peanuts.\n\nRiding distance: none Accommodation: Hotel"},{"title":"Day 9: Quy Nhon","description":"Continue south, down scenic Highway One on the road to Quy Nhon, one of the routes that is less visited by travellers, past paddy fields, wheat drying for Beer Hoi, and locals playing chess to Phu.\n\nClimb back on the bikes to cycle to the coastal city of Quy Nhon (approx. 45kms). The city is filled with long stretches of beach and relaxed boulevards, and as it’s pretty undiscovered by visitors, is a great place to get an authentic slice of coastal life.\n\nRiding distance: approx. 44kms/27 miles, undulating with approx. 255m/840ft of elevation gain. Accommodation: Hotel"},{"title":"Day 10: Nha Trang","description":"In and around Nha TrangToday’s cycle is approximately 95 kilometres, but it is one of the most breathtaking stretches of road you’ll ride – the highway hugs huge granite cliffs and looks out across the deep blue sea. \n\nFollowing parts of the Reunification railway, you’ll enjoy scenery of islands, lagoons and sand dunes. Join the scooter riders on the waterfront promenade as you arrive in the idyllic coastal town of Nha Trang, once referred to as the 'Cannes of the Orient', and whose sandy palm-lined beach and island-dotted bay still make a pretty idyllic picture. Here there’s consistently good weather, a vibrant nightlife and excellent diving.\n\nRiding distances:\nRide 1 - approx. 75kms/47 miles – lightly undulating with approx. 165m/530ft of elevation gain.\nRide 2 - approx. 19kms/12 miles - lightly undulating with approx. 140m/460ft of elevation gain. Accommodation: Hotel"},{"title":"Day 11: Nha Trang","description":"Today you’ll swap your bike for a boat as you head out to explore the nearby islands. This excursion is often the highlight of the trip for many travellers, as you’ll get to know some of the locals and indulge in the beauty of the place. Starting on the main boat, you’ll then take a small basket boat to shore and visit a fishing village, snorkel in the turquoise waters and feast on a fresh seafood buffet for lunch. You can enjoy this rest day by lazing in a deck chair, going for another swim or perhaps taking a mud baths to soothe away sore muscles. Accommodation: Hotel"},{"title":"Day 12: Dalat","description":"In and around DalatHead up through the Bidoup-Nui Ba Pass into the cooler climes of the South Central Highlands (approximately 65 kilometres), where some of the country's best fruits, flowers and coffee beans are grown. The road is winding and steep but if you're fit and ready for a challenge, you may want to conquer the whole mountain on your bike. If you're not so physically inclined, take it easy and flag a lift from the bus. Whichever way you choose to get to the top, you'll still be treated to magnificent views once you reach the summit. After a short photo stop here, you will descend to Dalat. One of Vietnam's most delightful cities, Dalat is a perfect base to explore this pleasant region. With an appealing Swiss-French feel, along with pleasant lakes, palaces, pine tree-covered hills, flower gardens and pagodas, Dalat is often called the 'city of eternal spring' for its temperate climate.\n\nRiding distances:\nRide 1 - approx. 57kms/35 miles, lightly undulating with approx. 160m/530ft of elevation gain.\nRide 2 - approx. 15kms/9 miles, lightly undulating with approx. 110m/360ft of elevation gain. Accommodation: Hotel"},{"title":"Day 13: Phan Thiet","description":"This morning you’ll take a city tour of Dalat, making the journey to Bao Dai's striking regal summer palace. He was the final emperor of the Nguyen dynasty, and the last to rule Vietnam until 1945. You’ll then discover the wacky and weird architecture of Hang Nga Crazy House. Echoing Gaudi's unconventional designs, and described as a 'fairytale house', explore the twisted tree roots, cave shaped hallways and animal themed rooms of this surreal guesthouse. Drop by the train station and the central market before continuing to Di Linh, where tea is the main industry and there are large plantations in the surrounding hills. After lunch, pedal down the forest-lined Gia Bac Pass, then cycle along from Malam to Phan Thiet and it's beautiful beaches.\n\nRiding distances:\nRide 1 - approx. 22kms/14 miles, mostly downhill with approx. 85m/280ft of elevation gain.\nRide 2 - approx. 45kms/ 28 miles, mostly downhill with approx. 30m/100ft of elevation gain. Accommodation: Hotel"},{"title":"Day 14: Ho Chi Minh City","description":"You’re on the home stretch now and it’s time for one last cycling splurge. Before heading for the big city, take in the views along the beach on your ride to Lang Long. After a picnic lunch, keep cycling (approximately 55 kilometres) to Cu Bi. From there it’s goodbye to your two-wheeled friend as you take the support bus the final leg to Ho Chi Minh City. Here daily life plays out on the streets and the dynamic atmosphere is a fascinating blend of old and new, East and West. Maybe spend the final night of your Vietnam adventure exploring the food stalls at Ben Thanh market or cheers to yourself and your new friends with a few glasses of street-side beer hoi.\n\nRiding distance: approx. 56kms/35 miles, approx. mostly flat with hill at the end, approx. 125m/410ft of elevation gain Accommodation: Hotel"},{"title":"Day 15: Ho Chi Minh City","description":"Your Cycle Vietnam adventure comes to an end today. There are no activities planned and you are able to depart the accommodation at any time. If you are sticking around then there are plenty of things to see and do in and around Ho Chi Minh City. \n\nRiding distance: none"}]},{"name":"Luxury Halong Bay Cruise and Mountain Resort - 6 Days","duration":6,"travelStyle":["Ocean Cruise","Family","Discovery","Christmas & New Year"],"oldPrice":0,"price":435,"summary":"The best quality and unbeaten price for 6 Days Trip\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optionals\n\nStart in Hanoi and finish in Hanoi\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Boat in Halong Bay - World Heritage Site: Most luxurious Paradise Luxury Cruises, traditional wooden Boat.\n\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\n\n","highlights":["Spend your nights cruising on Halong Bay's aquamarine waters","Weave between limestone karsts and discover enchanting lagoons","Sail in style onboard a 5-star Paradise Luxury Cruise Ship"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95520_b60f966f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95520_b60f966f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_ba973227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_1b93b2e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_bc851b0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_94d77fb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_7ec1448a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_38cdb790.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_a82a28b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_8160009e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_4cb4c7dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_47980960.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_5977aa23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_5a8e558a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_4467c067.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_b35722ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_0f3b9283.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_a1cc9d7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_9435b6d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_d4f5b956.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_4ecac339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_ea48f6aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_3098733e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95520_8471a995.jpg"],"destinations":[],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"In and around HanoiLanding at Noi Bai Airport, Hanoi, you feel warmly welcome by our helpful tour guide & car driver at the airport. Then your first impression is right on the way to Hanoi downtown- a city of beautiful lakes, shaded boulevards, public green parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similarStart point\n Airport pick up, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Halong Paradise Cruises (B, L, D)","description":"08.00: Pick up for a drive to Halong Bay by shuttle bus. 12.00: Arrive at Tuan Chau Island 12.15: Transfer to cruise ship 12.30: Welcome Drink - cruise briefing, safety instructions, check-in cabins. Cruise and program commence 13.00 - 14.30: Serve Special Paradise Lunch on board while cruising and exploring Halong Bay while passing by Soi Sim Beach and Coconut Tree Island, two iconic attractions in the bay. Soi Sim Beach is where you can find a lot of ancient trees in Ha Long Bay. 14.45 - 15.45: Explore Cua Van Floating Village by rowing bamboo boats with the local people or do kayaking by yourself, the best way to get an introduction of what its like living in Halong Bay. Considered as the core zone of Halong Bay, Cua Van Floating Village has an area of 22ha with 127 households and more than 700 people living in the community. 15.45 - 17.00: The vessels will continue cruising in Halong Bay, passing by famous attractions such as Tien Ong Cave, a favourite attraction for archaeologists because of its rich history, Trong Cave, a cave in a shape of a drum, Ho Dong Tien, a cave that has a lake inside and is believed to have fairies descending in the lakes, Luon Cave,where the golden hair monkeys can be found, Ti Top Island, where you can find the most stunning 360° view of Halong Bay and Coconut Tree Island for the overnight stay. 17:00 – 19:00: Enjoy the spa at your leisure on-board. Enjoy “Happy Hour” Buy one take one on selected beverages, while the vessels anchor at the Coconut Tree Island for overnight stay. 18.00 - 19.00: Enjoy cooking demonstration with the chef on-board to discover a short history of the Vietnamese cuisine. Learn how to toast the Vietnamese way through the evening’s toast of the local rice wine and followed by the Pre – dinner cocktails on the sundeck serving assorted canapés and nuts. 19.30 - 22.00: Feast on an elegant Paradise dinner. Start the dinner in a Traditional Bao Dai dress, dine like a king or a queen, and take photos with the manager on board. 21.00 - 23.00: Evening Activities - relax at leisure; enjoy Movie Night, squid Fishing or cap off the night with some Beauty Spa services. Paradise Luxury Cruises 5* or similar"},{"title":"Day 3: Paradise Luxury Cruises - Hanoi (B, L)","description":"6.30: Start the morning with a relaxing Tai Chi session on the Sundeck. 7.00 - 7.30: Rejuvenate with a cup of coffee or tea with some assorted homemade pastries afterwards. 7.30 - 8.30: Relax or Visit Sung Sot Cave, a cave that was discovered by a group of French explorers in 1901 with some magnificent limestone formations and considered as one of the most beautiful caves in Halong bay. 8.30: Enjoy an International A-la-Carte Breakfast Menu. 9.30: Time for checkout and settle all bills. 10.30: Arrive at Tuan Chau Island after cruise. 10.30 - 12.00: A traditional Vietnamese lunch is served at the Paradise Suites Hotel 12.15 - 12.30: Shuttle bus back to Hanoi from Halong Bay. 16:00 - 16: 30: Arrive Hanoi. Check in hotel & free for leisure. Overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before transferring to Airport by Private Car for your return flight home. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!End point\n Transfer to airport, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Vietnam: Hike, Bike & Kayak","duration":11,"travelStyle":["Adventure","Multi-sport","Group","Fully Guided","Hiking & Trekking","Christmas & New Year"],"oldPrice":0,"price":1395,"summary":"The spectacular valleys and mountains of Vietnam were simply made for exploration. Put on your hiking shoes and get ready for this immersive journey that gets away from the bright lights of Hanoi and under the skin of Vietnam's bucolic countryside. In between trekking and cycling past lush landscapes, stop in at local villages and learn about traditional life with memorable homestay experiences. It’s not all mountains and trails either, with an opportunity to kayak across the majestic waters of Lan Ha Bay and spend a night in a waterside resort. Prepare to be led off the beaten track.","highlights":["Take a tour to the Cat Cat village","Visit Ho Chi Minh Mausoleum","Walk through the streets of Hanoi","Discover Mai Chau valley","Explore spectacular Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/93183_3d0425e9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/93183_3d0425e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_ccd0e14a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_6b4444c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_6c424b6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_9e1ff887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_66562c81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_4ea62838.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_9e83ef5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_0caa257d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_12ca5e3a.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Chai","Mai Chau","Ninh Binh City","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiXin chao. Welcome to Vietnam! Your adventure begins with a welcome meeting at 6pm. If you have time before the meeting, head out and discover Hanoi. Visit Hoan Kiem Lake and Ngoc Son Temple, start sampling the delicious street food, or visit the Museum of Ethnology and find out more about the homes and lives of Vietnam’s ethnic communities. After the welcome meeting, you may like to join your group for an optional meal at one of Hanoi's fantastic eating spots. Accommodation: Hotel"},{"title":"Day 2: Hiking in Sapa","description":"After breakfast climb board a private minibus to Sapa, a town in the Hoang Lien Son Mountains of northwest Vietnam. This journey will take approximately 5 hours. From the market in the centre of Sapa, venture out on a short trek (approximately 2.5 hours) through the surrounding valleys to visit a village called Cat Cat. This is home to the H’mong people, who emigrated from China 300 years ago. In the evening, settle into your hotel in Sapa for the night. Accommodation: Hotel"},{"title":"Day 3: Hiking in Lao Chai","description":"Savour the dramatic landscapes and panoramic views of rural Vietnam on a trek from Lao Chai to Ta Van. You'll pass by terraced farms ripe with corn and rice, over bubbling brooks and through bucolic villages. Stop for a picnic lunch before heading on to our homestay with a local family in the evening. The total trek today is around 10 kilometres (6.2 miles). Accommodation: Homestay"},{"title":"Day 4: Hiking in Su Pan","description":"This morning trek to Su Pan before taking some time to rest your feet on a bus ride back to Sapa. In the afternoon the group returns to Hanoi (approximately 5 hours). Maybe get a bird's eye view of the city from a rooftop bar and unwind with an iced coffee. Accommodation: Hotel"},{"title":"Day 5: Cycling in Hanoi","description":"Vietnam's capital is best explored on foot, which is why the group will head out on a city walking tour. See the final resting place of Vietnam's revered revolutionary at Ho Chi Minh's Mausoleum and Museum before stopping by the Temple of Literature. Although the shrine was originally built in the 11th century, and is therefore considered to be the city's oldest temple, the current structure and shrine to Confucius actually dates from the 18th century. In the afternoon, have a practice on your bike with a warm up cycling trip around Hanoi's West Lake. Accommodation: Hotel"},{"title":"Day 6: Cycling in Mai Chau","description":"Leave behind the Hanoi hustle first by vehicle, then jump on your bike and  and cycle to the Mai Chau valley (approximately 60km / 37mi). There are great photo opportunities along the way – stop at a vantage point to take in the view of Mai Chau, home to a variety of minority groups with their own unique culture and languages. Along the way, there's also the opportunity to help local farmers plant rice seeds into the fields. Arrive in Mai Chau and head to the village of Pom Coong, where your local guide will introduce you to your hosts for lunch, and provide information on the region's people, their lifestyles, customs and culture. Lunch is a traditional affair with examples of local cuisine on offer. This is a great opportunity to experience the local area, chat with your hosts, and gain a real insight into life in this fascinating and picturesque region. After lunch, take some time to relax before saddling up for a cycle trip to nearby villages. Back at the homestay, relax with a cold drink while watching the sun set over the peaceful mountains. Alternatively, for the food lovers, why not help your host cook dinner! Accommodation: Homestay"},{"title":"Day 7: Cycling in Ninh Binh","description":"After breakfast set out again on your bike on a cycle from Mai Chau to Ninh Binh, a region well known for its green valleys, karst mountains and conservation areas. Today's ride will cover approximately 70 kilometres in total. Accommodation: Hotel"},{"title":"Day 8: Cat Ba Island","description":"Catch a bus this morning from Ninh Binh to Hai Phong then jump on a ferry to Cat Ba Island, which sits at the southeastern edge of Halong Bay. Lan Ha Bay, where Cat Ba can be found, is part of Halong Bay with the additional attraction of numerous white-sand beaches. The total travelling time today is approximately five hours. Check in to your peaceful, hilltop accommodation and enjoy a free afternoon taking it easy in a hammock, or opt to keep the pace up with a hike or trip to the beach. Accommodation: Lodge"},{"title":"Day 9: Kayaking around Cat Ba Island","description":"Explore the waters and limestone karsts of Lan Ha Bay on a full-day boat trip. Get up close and personal kayaking beside the tree-clad outcrops, with lunch onboard also included. Halong Bay's World Heritage designation was extended to the Cat Ba Archipelago thanks to its similar aesthetic value, and the scenes of turquoise water and junk boats are quintessential Vietnam. No-one will judge you for taking a selfie here. Spend a second night on Cat Ba, with the evening free to visit the local restaurants and bars. Accommodation: Lodge"},{"title":"Day 10: Hanoi","description":"Say goodbye to Cat Ba Island and head back to Hanoi (approximately five hours). Arrive in the late afternoon, and perhaps head down to the markets for some last-minute souvenir shopping or to pay a visit to one of the city's many museums or historical sites. Both the Fine Arts Museum and Hoa Lo 'Hanoi Hilton' Prison are great choices. In the evening, perhaps head out for a farewell dinner with your group and toast the end of this active adventure. Accommodation: Hotel"},{"title":"Day 11: Hanoi","description":"Your active adventure comes to an end today and there are no activities planned, but there's plenty to see if you'd like to continue exploring Hanoi or further afield, including an Urban Adventure discovering Hanoi's street food by night."}]}]