[{"name":"VNA001 - 8days North to South of Vietnam","duration":8,"travelStyle":["Discovery","Christmas & New Year"],"oldPrice":0,"price":554,"summary":"This 8-DAY INSIGHT OF VIETNAM TOUR tour offers you cultural and historical insights of Vietnam in the North and the South.\n\nIn the North, you will have a chance to explore the ancient Hanoi and you will have the oppotunity to come to Halong Bay, a world-renowned UNESCO heritage site, which is famous for its breath-taking natural beauty, and cruise around the wonderful limestone karsts here. \n\nIn the South, you will end your trip with a few days in the southern heart of the country, Saigon, where you can find the incredebly awesome combination between the old buildings of the past and the modern works of the present and you will get a lot of unforgettable memories when coming to Mekong Delta, take a boat trip along the river and trying the traditional meals, fuits with friendly locals.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108617_680b0824.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108617_680b0824.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_23304e73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_130ff32a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_ee50a18f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_03619c7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_2693c652.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_bfd272b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_36d37c63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_5252fb09.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Cu Chi Tunnels"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiFly to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in. Free at leisure or relaxing at hotel, overnight in Hanoi. 3* Gondola Hotel: Sup Room  4*: Tirant hotel: Deluxe Room  5*: Melia Hotel: Deluxe Room"},{"title":"Day 2: Hanoi","description":"After breakfast, our guide pick up at hotel at 8.00AM. Sightseeing today includes explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake including the sedate Tran Quoc Pagoda; and one of the city’s museums (a choice between the History Museum and the Ethnology Museum). End the day’s explorations enjoy a traditional water puppet show. Overnight in Hanoi."},{"title":"Day 3: Halong Bay","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 -8.20AM and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Spend the night on our luxurious boat 3* Swan Cruise: Deluxe Cabin 4*: Calypso Cruise: Deluxe Cabin 5*: Signature Royal Cruise: Sernior Suite"},{"title":"Day 4: Halong Bay","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi. The rest day is free at leisure in your own way and overnight in Hanoi"},{"title":"Day 5: Ho Chi Minh City","description":"In and around Ho Chi Minh CityFree at leisure until transfer to airport for flight to Ho Chi Minh. Upon arrival Ho Chi Minh, you will be welcomed by our tour guide/ driver and transfer to hotel for check in. Rest of the day is free at your leisure, overnight in Ho Chi Minh City 3* Gk Central Hotel: Superior Room  4* Grand Silverland: Pre DLX Garden 5* Majestic Hotel: Colonial Deluxe "},{"title":"Day 6: Cu Chi Tunnels","description":"In and around Cu Chi TunnelsBreakfast at hotel, meet our guide at 8.00 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City. Have a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there.  After that, taste the typical boiled tapioca and hot tea before you come back to Saigon. "},{"title":"Day 7: Cai Be","description":"In and around Cai BeAfter breakfast our guide and driver will pick you up at 6.30AM to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends in Cai be. Getting on bus and drive back to Ho Chi Minh, overnight in Ho Chi Minh City. "},{"title":"Day 8: Ho Chi Minh City","description":"Free at leisure until transfer to airport for flight back home. End of service!"}]},{"name":"Vietnam Express Southbound - For Solo Travellers","duration":10,"travelStyle":["Discovery","Adventure"],"oldPrice":0,"price":1235,"summary":"Capture the spirit of magical Vietnam on this compact tour from the colonial charm of Hanoi to the hustle and bustle of Ho Chi Minh City, on this new adventure, designed for solo travellers only. Sip coffee with locals in Hanoi and shop up a storm in the Old Quarter, cruise along emerald waters on a Halong Bay boat trip, travel through old-world Hue and Hoi An, and get lost in the hustle and bustle of Ho Chi Minh City. This is an adventure full of beauty and contrast that introduces Vietnam as a country of incredible food, lively locals, stunning scenery and cosmopolitan cities.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/99774_f4958899.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/99774_f4958899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_dd3f6a5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_6427df41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_3070e50b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f2abfb2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_7875367a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_d57bd734.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_64197a85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_e8fe3af0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_5cb1cdde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_c743acb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_1c55ee92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_090f7179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_a128cfdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_504778a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f65e7d5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_04ebed0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f26da9ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_671b2fbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_36838504.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_3d14e573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_d187c25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_835bbfdd.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiWelcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm and is followed by a group dinner at KOTO restaurant. This organisation is dedicated to developing the hospitality careers of disadvantaged youth.\n\nIf you arrive early into the capital of Hanoi, there’s plenty to see and do. Consider booking the Hanoi Highlights Urban Adventure with an expert local guide to introduce you to the city. Start by visiting the Temple of Literature, drop into a traditional tea house, and learn the stories of the Hoa Lo Prison museum. This tour concludes at Hoan Kiem Lake, surrounded by modern office buildings and ancient Buddhist temples. Or take it at your own pace and wander the Old Quarter and admire the city’s French-colonial architecture, relax in a park, or enjoy some street food. Accommodation: Hotel"},{"title":"Day 2: Halong Bay","description":"Travel by private minibus to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours). The bay is dotted with sandy coves, grottos and 1,600 limestone islands, which have been formed over millennia by wind and water erosion. Board a private boat and cruise the bay, exploring Surprise Cave and perhaps even take up the opportunity to kayak. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. To end the day, spend a night aboard the boat beneath the night sky. Your wooden junk-style boat has twin share cabins with air-conditioning and private facilities. There's also a dining room and bar to enjoy lunch, dinner and breakfast. Accommodation: Overnight boat"},{"title":"Day 3: Hanoi - Overnight Train","description":"Return by boat to Ha Long, and at approximately midday travel by bus back to Hanoi. Arrive late this afternoon, and use free time to shop, explore the sights or just relax. Later tonight board an overnight train to Hue. Accommodation: Overnight sleeper train"},{"title":"Day 4: Hue","description":"In and around HueArrive into Hue at approximately 11 am and transfer to the hotel. Once the imperial capital of Vietnam, Hue holds the treasures of the country’s royal past. You’ll have free time in the morning to rest or explore. The bustling Dong Ba Market is a great place to sample some of the foods that once graced the Nguyen emperors' tables, such as banh khoai (royal rice cake). Reunite with the group to visit the war-damaged ruins of the Hue Imperial Citadel complex, which once contained temples, state houses and the emperor’s palace. Accommodation: Hotel"},{"title":"Day 5: Hue","description":"Today, tour the sights of Hue on the back of a motorbike driven by a local guide. Enjoy a stop at Thanh Toan to see the 18th century covered bridge and villagers shopping at their local market. Visit the 17th-century active Buddhist monastery of Thien Mu Pagoda. During the visit you’ll see the car of a former monk who drove to Saigon in 1963 to set himself alight to protest the poor treatment of Buddhists by the South Vietnamese regime. Enjoy a delicious vegetarian lunch inside a nunnery. Finally, visit the lakeside royal tomb of Emperor Tu Duc before heading back to Hue. Accommodation: Hotel"},{"title":"Day 6: Hoi An","description":"In and around Hoi An, Ho Chi Minh CityThis morning travel by bus through coastal rice paddies and the spectacular Hai Van Pass (approximately 3 hours). After a photo stop en route, arrive into Hoi An. Recently declared a World Heritage site, Hoi An was a major international trading port during the 17th, 18th and 19th centuries. Today, parts of the beautifully preserved town retain the feel of centuries past. It's also a shopping mecca, famous for its plethora of tailors. On arrival your leader will take you on a sightseeing walk through the Old Town to visit a handful of the city's major attractions. You’ll also be given a sightseeing pass so you can further explore select attractions at your leisure. Accommodation: Hotel"},{"title":"Day 7: Hoi An","description":"Today is a free day to explore Hoi An. Browse the town’s cobbled streets and art galleries, or hire a bike and cycle through rice paddies out to Cua Dai Beach. Shop for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shophouses. Perhaps visit one of the hundreds of tailors in the city to get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class. Accommodation: Hotel"},{"title":"Day 8: Ho Chi Minh City","description":"Today take a short early morning flight to Ho Chi Minh City (approximatley 1 hour 30 mins). Formerly known as Saigon, Ho Chi Minh City has a fascinating history and is arguably Vietnam’s capital of commerce and culture. After landing, take a sightseeing bus tour around the city. Pass the Reunification Palace, Notre Dame Cathedral and the Opera House, stopping in at the War Remnants Museum to discover some of the sobering stories of the Vietnam/American War. Accommodation: Hotel"},{"title":"Day 9: Mekong Delta/Ho Chi Minh City","description":"This morning head out on a day trip to explore the Mekong Delta. Board a private boat to Ben Tre to visit the coconut gardens, stopping at a local home to sample tropical fruits & coconut jams. Afterwards, paddle in sampans (small rowing boats) past water coconut trees along the Mekong. Take a tuk-tuk tour around the villages, learning about local rural life and how they make their living making coconut products like brooms and coconut fibre mats. Eat lunch at a restaurant in the heart of the Delta, sampling regional specialties such as the famous elephant ear fish. Then it’s back to the boat to cruise the delta’s major waterways to Ben Tre boat pier. After the cruise return via bus to Ho Chi Minh City and perhaps head out to sample some local specialties as a final farewell with your fellow travellers. Accommodation: Hotel"},{"title":"Day 10: Ho Chi Minh City","description":"There are no activities included and you’re free to depart your accommodation at any time. If you would like to spend some more time in Ho Chi Minh City, we’re happy to organise additional accommodation (subject to availability). The Cu Chi Tunnels are an interesting day trip nearby, ask your group leader for more recommendations or assistance to book an Urban Adventure."}]},{"name":"Hanoi-Paradise Luxury Cruises Vacation Package plus Infinity Pool Resort","duration":6,"travelStyle":["Discovery","Family","Custom","Christmas & New Year"],"oldPrice":0,"price":459,"summary":"Hanoi: Located on the banks of the Red River with tranquil Hoan Kiem Lake at its heart, Hanoi is the capital of the Socialist Republic of Vietnam. North of the lake are the bustling streets of the Old Quarter, each street named after the trade that used to take place there.\n\nHalong Bay: Visiting Halong Bay - Natural World Heritage by a traditional Luxury Paradise Cruises boat, discover caves & fishing villages, explore the lagoon, Kayaking activity. Stay overnight on Board with amazing time & unforgettable experience!\n\nMai Chau: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95663_f199637d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95663_f199637d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_8470bf00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_9a7122b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_4aeb60dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_6e3a3dac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_d2d8ed72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_64486f4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_9c24172a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_64a4599b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_c67abfcb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_63fcfd1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_451b32e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_c80e995b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_a369e497.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_d0522f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_404c0d51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_d0b905c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_aff1aa24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_8674f7a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_9db0b39d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_df2b4100.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_912fe1ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95663_05a55517.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"In and around HanoiToday you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check in Hanoi hotel. Stay overnight in Hanoi. Pomihoa Hotel Hanoi or similarStart point\n Airport pick up, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Paradise Luxury Cruises (B, L, D)","description":"08.00: Leave Hanoi - Transfer to Halong Bay by Shuttle Bus pick up from Hotel. Hanoi-Halong Bay-Hanoi. 11.30 Arrive at Tuan Chau Island 11.45 - 12.00: Transfer to cruise ship 12.00: Welcome Cocktail - cruise briefing, safety instructions, check-in cabins 12.15: Depart to Halong Bay - cruise and program commence 13.00 - 14.30: Asian Lunch Buffet 14.30: Arrive at Surprise Cave (Hang Sung Sot) - explore most famous grotto 15.45: Transfer to cruise ship. 16.30: Arrive at Cua Van Fishing Village - experience life of local people 17.15: Continue cruise through Halong Bay 18.00: Arrive at Dong Tien (Fairy Cave) Area - swimming or kayaking, stay overnight 19.00 - 20.30: Asian Dinner Buffet 21.00 - 23.00: Happy Hour and Music - enjoy ‘Buy One - Get Two Drinks’ 21.00: Evening Activities - enjoy Movie Night, Board Games or Beauty Spa services 23.00: Program ends - Sleep Well!"},{"title":"Day 3: Halong Bay Cruise in different way - return Hanoi! (B, L)","description":"06.00: Tai Chi session on Sundeck 06.00 - 08.00: Morning Activities - swimming or kayaking, beauty spa services. 07.00 - 08.30: International Breakfast Buffet. 08.30: Continue cruise through Halong Bay. 09.00: Check-out cabins and settle bills. 10.30: Arrive at Tuan Chau Island. 10.45: Transfer from cruise ship - Check out. 11.30: Cruise and program ends & Cruise check-out. Rejoin car drive back to Hanoi for overnight.  4:00 - 4:30: Arrive Hanoi. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi. Pomihoa Hotel Hanoi or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi or similar"},{"title":"Day 6: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Private Car and Driver`s ready to take you to airport upon your flight schedule. Finish your unforgettable trip arranged by Legend Travel Group! Good bye and see you again! Airport transfer included!End point\n Airport transfer, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Vietnam at a Glance – 10 Days","duration":10,"travelStyle":["Adventure","Group","Fully Guided","Christmas & New Year"],"oldPrice":0,"price":980,"summary":"This Vietnam vacation package takes us from Hanoi to Ho Chi Minh City (Saigon) within 10  days. The trip covers most of the main attractions in Vietnam including three world heritage sites in Vietnam. It covers from the stately Hanoi, the magnificent Halong Bay, the former capital city of Hue, the charming Hoi An ancient town, the bustle & hustle Ho Chi Minh City (Saigon), the waterway of Mekong Delta and the legendary Cu Chi Tunnel.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150571_7cae0bd7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150571_7cae0bd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_3212b887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_900074a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_e17d9420.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_d210f8a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_b6db747e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_b01b5f46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_83447220.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_13c09d1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_e72dff4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_a96fd3b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_6167afec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_32a6c802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_3efc6842.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_80074c66.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Cu Chi Tunnels","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"In and around HanoiArrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day. Note*: The hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied. Please be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for youStart point\n Pick up at Hanoi Noi Bai Airport, Hanoi, Vietnam "},{"title":"DAY 2: HANOI CITY TOUR","description":"Today, we will spend a full day to visit the city. We start with visit to President Ho Chi Minh's mausoleum and residence. We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university After lunch in a local restaurant, we go to the Museum of Ethnology, which is an excellent museum containing the ethnic costumes of the various minorities of Vietnam, as well as relics, tools and even full size replicas of their homes and buildings. Back to the hotel.  Meals: Breakfast/Lunch  Accommodation: Hotel in Hanoi"},{"title":"DAY 3: HANOI - HALONG BAY - NIGHT ON BOARD","description":"8h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta. 10h00: Stopover on the way for a refreshment break 12h00: Arrive at Tuan Chau wharf – Break and photography time 12h30: Board the Cruise for departure. Welcome drink will be served 13h00: Lunch is served while cruising through the bay 15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen. 16h30: Enjoy kayaking or swimming (if the weather permits). 17h00: Back on board and continue cruising. 19h00: Dinner is served. 21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Note*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.  Meals: Breakfast/Lunch/Dinner  Accommodation: Night on board"},{"title":"DAY 4: HALONG BAY - HANOI - FIGHT TO DANANG","description":"07.00: Coffee and tea will be served 08.00: Continue cruising 08h15: Visit splendid Sung Sot Cave 09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island. 09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier 11h30: Arrive at the pier. Time to say goodbye to the crew. 12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm. Airport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.  Meals: Breakfast/Lunch  Accommodation: Hotel in Hoian"},{"title":"DAY 5: HOIAN - MY SON TOWERS TOUR","description":"In and around Hoi An, Ho Chi Minh CityPickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999. Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.  Meals: Breakfast/Lunch  Accommodation: Hotel in Hoian"},{"title":"DAY 6: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"In and around HueFree in the morning. In the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time. Note*: The train journey is part of a great local experience. Restrooms at either end of the carriages.  Meals: Breakfast  Accommodation: Hotel in Hue"},{"title":"DAY 7: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel. Today, we will spend a full day touring Hue city.  In the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant.  In the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village Then airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival.  Meals: Breakfast/Lunch  Accommodation: Hotel in Saigon"},{"title":"DAY 8: SAIGON CITY + CU CHI TUNNELS TOUR","description":"In and around Cu Chi TunnelsPickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon. In late afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby. Airport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.  Meals: Breakfast/Lunch  Accommodation: Hotel in Saigon"},{"title":"DAY 9: SAIGON – MEKONG ADVENTURE","description":"07:40am - 8:10am Pick you up at your hotel and depart for Ben Tre. After arriving at Ham Luong dock, board the boat & cruise along Ham Luong River, a tributary to the Mekong River. The cool breeze from the river and lush tropical islands along its banks will immediately get you excited to explore all the great things ahead.Arrive and visit various local workplaces to find many wonderful examples of how local people use ageless techniques to create their crafts, including activated charcoal, dried coconut, handy coconut husk brooms, and many family businesses using coir, or coconut fiber, to create amazing art. Drive around the village roads by “Xe Lôi”, the local vehicle, which is a kind of motorized rickshaw.  Perfect your day with a delicious and filling lunch at a local host house.Break time, treating yourself to a relaxing time to relish the beautiful countryside or cycling around the village. Visit the local fruit plantation, enjoy seasonal fresh fruits, and spend time relaxing while being rowed in a small boat slowly through the natural canals to get a sense of how truly beautiful this area is.Embark on the sampan and return to the dock. Travel back to Saigon.  Meals: Breakfast/Lunch  Accommodation: Hotel in Saigon"},{"title":"DAY 10: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!  Meals: Breakfast  Accommodation: N/AEnd point\n Drop off at Hanoi Hotels, Hanoi, Vietnam "}]},{"name":"Hanoi - Glory Legend Cruises - Bakhan Village 6 Days","duration":6,"travelStyle":["Sailing","Family","Motor boat","Discovery","In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":419,"summary":"The best quality and unbeaten price for 6 Days Trip\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optionals\n\nStart in Hanoi and finish in Hanoi\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Glory Legend Cruises 4* Boat in Halong Bay - World Heritage Site\n\nEscape from City to Bakhan Village Resort 4* - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100144_934c0995.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100144_934c0995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_dd79a788.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_94138cab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_88878dd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_2db515d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_1d6decaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_84dba7f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_cb6fbb6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_aa024ce0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_802087ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_85588480.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_9e1fe624.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_de414200.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_bd285143.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_97c25bd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_78fc3f22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_03465813.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_57f0dff3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_dcf30d89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_bc9c5cee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_1c0ae96b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_d2768daf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100144_5f7cdf47.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"In and around HanoiAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Check in hotel and stay overnight in Hanoi. Airport pick up included. Pomihoa Hotel Hanoi or similarStart point\n Airport pick up, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Glory Legend Cruises (B, L, D)","description":"7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter  Along the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch local crafts being produced and grab a bite to eat 12:00 pm We will arrive at the port before being transferred to Glory Legend Cruise Welcome drink - receive cruise briefing, safety instructions and check in.  Enjoy a lunch with Vietnamese dishes served while sailing through the bay, passing the imposing limestone formations.  You shall then board your bamboo craft piloted by indigenous locals. They will take you through a stunning cave formation into a tranquil bay where if you are lucky you can spot monkeys. Next you are able to relax on the beach at Ti Top where you are able to swim in the warm water, get some rays or treck to the top of the outcrop for stunning panorama views. Back to the boat and you have free time while sailing to Luon Bo area, and anchor overnight. Attend the Cooking class on sundeck. Then enjoy Happy Hour (Buy one drink-get one free). Sit back and relax while watching the magnificent sunset over Halong Bay.  19:30: Dinner - Deluxe Vietnamese and International BBQ Set Menu Dinner Evening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spending a romantic night on Glory Legend Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat. 23:00: End of day two Glory Legend Cruises Halong Bay or similar"},{"title":"Day 3: Halong Bay - Hanoi (B, L)","description":"6:00-7:00: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements. 7:00-8:00Coffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape. 8:00-9:30: Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites.  9:30-11:00 Have brunch while cruising back to the Tuan Chau Wharf. Relax while taking in the final views of Halong Bay Check out before 11:30 am 12:00 pm: Depart Halong Bay for Hanoi 4:30 pm: We shall drop you back off at your hotel in Hanoi’s old quarter.  Pomihoa Hotel Hanoi or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort Mai Chau"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi or similar"},{"title":"Day 6: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again! Airport transfer included!End point\n Transfer to airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Private tour: 5-day Explore Hanoi - Hoa Lu - Halong highlights","duration":5,"travelStyle":["Sightseeing","Family","Custom","Private","Christmas & New Year"],"oldPrice":0,"price":598,"summary":"Full with experiences for 5 days in Vietnam\n\nOnce you have chance to visit Vietnam, you should make use of it to explore the whole beauty of the most famous destinations in this pretty country. Hanoi, Hoa lu and Halong are some of the highest recommended destinations in northen Vietnam. This 5-day tour is designed to cover the highlights of these wonderful places and help you have unforgetable experiences in VIetnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/127408_74181faf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/127408_74181faf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_874dcbff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_3e3823c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_afe93ab6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_2f5422e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4cf978c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4fed30e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_83373cee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_2aed85a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_de26c257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_e79bffd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_0d2ff1cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_29a717c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_ca5b7757.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4b45ef9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_380cfb2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_377b5202.jpg"],"destinations":["Hanoi","Ninh Binh City","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival- Hanoi Street Food tour on Foot","description":"In and around HanoiHanoi Arrival Arrive in Hanoi. Greeted by your guide and driver at the airport. Transfer to your hotel in the city centre for check-in and relax. In the afternoon, you will have a street food tour on foot.  Experiences with local foods Hanoi is one of the world’s greatest street food cities and there’s no better way to unlock the hidden secrets of the Old Quarter and its cuisines than through this unique walking tour.  It will be great when you have a local guide to help you explore local foods in Hanoi. Accommodation : 3 star hotels in Hanoi likely ANGLE PALACE HOTEL or SimiliarStart point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hoa Lu - Tam Coc Rowing - Mua Cave Exploring(B,L)","description":"Visiting the first capital of Vietnam, sailling a boat along river, hiking to the peak of Mua Cave At 8 a.m: Our PRIVATE tour guide will meet you at your hotel in Hanoi Old Quarter. Then you're on way to Ninh Binh. At here, you'll enjoy a visit to the two remaining old temples of the Dinh and Le king. Learn about the history of the countries foundation of the Great Viet after being liberated from thousands of years of Chinese domination. Next, start your biking trip. You'll cycle along rural paths towards Tam Coc, three tunnel grottoes until you reach Tam Coc.  Here you will stop to enjoy lunch in Tam Coc. After lunch, take a three-hour boat trip meandering along the canals (two people per boat) throughout the three tunnel grottoes called “ Tam Coc”. Enjoy the landscape of green rice field among mountains and rain forest of the National Special Preservation zone. After that, we go back Tam Coc town. Accommodation: Overnight in Bungalow in Tam Coc Town"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Exploring the Suprising Cave, Hiking to Titop Island, Sunset Party After an early breakfast at your hotel, relax on the private car to Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. After Check in Halong Bay Cruise: At lunch around 12:30, you will have a lunch on a cruise  In the afternoon: Visit Amazing Cave in Halong bay  and Go to Titop island for hiking, swimming  In the early evening :Having dinner with an authentic Vietnamese menu on Cruise Overnight on Halong Bay Cruise. After dinner, reward yourself with a large selection of cocktails at our bar or take for you one of our onboard activities: book reading, games, movies, and squid fishing.... .Accommodation: overnight on a cruise likely Cozy, Apricot or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi (B,L)","description":"Taichi-Kayaking, Swimming, Cooking demonstration At 6.30 a.m: Wake up at sea, and take a swim or Taichi, which helps focus the mind and condition the body. Then at 7am-8am, local breakfast is served.  At 8am: Mingling yourself in the stunning views of the Bay and it's dramatic limestone islets. Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. At 9.15: Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay. At 10am: You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served. At 12am: Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus and return to Hanoi. Arrival back at your hotel approximately 16:30 Accommodation: 3-star-hotels in Hanoi likely ANGLE PALACE HOTEL or Similiar"},{"title":"Day 5: Hanoi departure( B)","description":"Free and easy to explore Hanoi till airport transfer for departure flight. Trip ends.End point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Scenic Vietnam","duration":15,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Christmas & New Year"],"oldPrice":0,"price":1540,"summary":"Journey from Hanoi to Ho Chi Minh City on an incredible two-week adventure in Vietnam. Discover the stately capital Hanoi, the lush hills of the Da Bac region, the stunning limestone scenery of Cat Ba Island, the majesty of historic Hue, the fairytale atmosphere of Hoi An, the glorious waterways of the Mekong Delta and the dynamic streets of Ho Chi Minh City. Explore not only the main highlights of the cities, but also the remote countryside, well away from the tourist crowds. A homestay in Sung Village, nestled in the forest among caves and tea plantations, is a chance to trek through minority villages and experience Vietnam at its sleepy best.","highlights":["Cruise through the famous Halong Bay","Visit the Ho Chi Minh Mausoleum","Shop at the Dong Ba Market","Explore the Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1838_0261ac.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1838_0261ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_97a16fbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_01d020a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_3a3b31f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_51778c77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_d31501de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_1d00fe02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_aca108f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_42f23f95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_20ac1890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_d12bffda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_3a3e741b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_c7910f13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_7aa377ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_b34cd874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_64965be2.jpg"],"destinations":["Hanoi","Cat Ba Island","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiXin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm where you'll meet you tour leader and fellow travellers. If you arrive early, why not step out onto the streets to explore the chaotic capital of Vietnam. Hanoi is an alluring city of contrasts, best discovered on foot. Tonight, perhaps get to know your new travel buddies over a glass of fresh bia hoi. This is a foamy, light beer made fresh each day and served in basic, open-walled ‘brew halls’ – take up a brightly coloured plastic chair and sip your tasty brew. Accommodation: Hotel"},{"title":"Day 2: Hanoi","description":"Enjoy breakfast at the Blue Dragon Children's Foundation, a community project dedicated to helping underprivileged children and victims of trafficking. Afterwards, head out on a city tour where you’ll see the city’s diverse past reflected in a mix of South East Asian, Chinese and French-influenced architecture. Stop by the aptly named One Pillar Pagoda, the country’s most famous stilt house (former residence of Ho Chi Minh), Ho Chi Minh Mausoleum and the Temple of Literature. Accommodation: Hotel"},{"title":"Day 3: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantation are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (2 kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so please ensure you have suitable footwear for this activity. After a handicraft workshop, return to your homestay accommodation for a nice hot shower and a delicious dinner. Accommodation: Homestay"},{"title":"Day 4: Hanoi","description":"This morning, have an opportunity to take in more of the Vietnamese highlands on a 10 kilometre (6.2 mi) trek from Sung Village to Da Bia. The first 8km of the trek is mostly flat ground along well-worn buffalo tracks. The final 2km gradually inclines and for a period of approximately 300m there are some steps to climb, however the walk will be a steady relaxed pace. Keep an eye peeled for the monumental stone at the peak of Da Bia Mountain during the hike that takes us through the local villages, meeting people from the ethnic Muong tribe along the way. Stop for lunch at Da Bia before enjoying a scenic 1.5 hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours). Arrive in Hanoi at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter? Accommodation: Hotel"},{"title":"Day 5: Cat Ba Island","description":"Rise and shine for the 7.30am bus, stop for a quick break, then jump on the ferry. This morning of travel will deliver you to beautiful Cat Ba Island before midday. There's no time to waste, so begin exploring the picturesque waters around Cat Ba. You’ll board a boat and spend the rest of the day cruising the breathtaking Lan Ha Bay. Located in the greater Halong Bay area, Lan Ha Bay is one of Vietnam’s most scenic places, where limestone islands and caves rise from the emerald waters. Enjoy lunch on board, then get up close and personal with giant karsts in a kayak. Stay overnight on Cat Ba Island and enjoy a dip at one of the beaches and a cold beer. Accommodation: Hotel"},{"title":"Day 6: Hanoi - Overnight train","description":"Wake up in paradise, maybe starting your morning with a refreshing swim. Make sure you soak up as much sun and sand as possible, because this afternoon it's back to Hanoi via ferry and bus. There will be free time to explore the city when you arrive back in Hanoi before boarding an overnight train bound for Hue around 10pm. Shared hotel rooms will be available if you want to freshen up or organise your luggage. Otherwise, use this time to do some shopping on Hang Gai Street or seek out some delicious Hanoi street food. Meet back at the hotel lobby at 9pm where you’ll transfer with the group to the train station. Although conditions are basic, overnight trains are a rewarding experience in Vietnam. They are an efficient way to travel long distances and a great way to get a sense of the country. Accommodation: Overnight sleeper train"},{"title":"Day 7: Hue","description":"In and around HueArrive in Hue just after sunrise and proceed to the hotel to refresh. Hue is the hub of Vietnam’s historic past. This former imperial capital is an eclectic mix of busy streets and peaceful beauty. The rest of the morning is free for you to relax, perhaps pick up a classic Hue breakfast of bun bo Hue, a popular Vietnamese soup containing rice vermicelli (bun) and beef (bo). After lunch you will visit the Imperial Citadel, a sprawling complex of temples, pavilions, moats, gates, and walls. The Ngo Mon Gate, Thai Hoa Palace and the Ancestral Altars are still impressive, and the complex must have been awe-inspiring during its heyday in the 19th century. In your free time you might like to visit to Dong Ba Market, which offers locally made goods, fresh produce and tantalising street food. This is a good place to try the specialties enjoyed by Emperor Nguyen such as the banh khoai royal rice cake. Accommodation: Hotel"},{"title":"Day 8: Hue","description":"Today’s adventure will be taken on the back of a motorbike. You’ll have your own driver who will take you first on a drive around the Imperial Citadel, including the Forbidden Purple City. The latter was almost completely destroyed during the Tet Offensive in the Vietnam War, but its humble, foliage-covered ruins remain a testament to its proud history. Here you'll gain some insight into the horrific damage endured during the war. Break up your sightseeing with a dragon boat cruise on the Perfume River. Then it's on to the Thien Mu Pagoda, the unofficial symbol of Hue. This site dates back to 1601 and is still an active Buddhist monastery. Here you’ll also see the car left by a monk who set himself alight to protest the treatment of Buddhists by the South Vietnamese regime. Ride to a special lunch spot at a convent or Buddhist monastery for a delicious vegetarian feast. After lunch, drive to the royal tomb of Emperor Tu Duc, set amid a lake, frangipani bushes and pine trees. This evening, perhaps ask your leader for the best place to try imperial street specialties. Accommodation: Hotel"},{"title":"Day 9: Hoi An","description":"In and around Hoi An, Ho Chi Minh CityTravelling by bus, head south through coastal rice paddies before stopping in at Lang Co Beach. Then traverse the dramatic Hai Van Pass, a sometimes bumpy but incredibly scenic stretch of highway with views back to Lang Co Beach and beyond. The spectacular Marble Mountains will be your backdrop as you arrive at Hoi An (approximately 4 hours). Declared a World Heritage site, Hoi An is being beautifully restored and preserved. Known as Faifo to early western traders, it was one of South-East Asia's major international ports from the 17th to the 19th centuries. Today, parts of Hoi An look exactly as they did more than a century ago and it retains the feel of times past, making it the sort of place that grows on you the more you explore it. On arrival, a walking tour will take you around the major sites of Hoi An’s charming Old Town, including an historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. You will notice a distinctly Chinese appearance to the pagodas and assembly halls scattered along the small streets. A sightseeing pass is included in your tour for you to visit a selection of the major sights as you wish. Accommodation: Hotel"},{"title":"Day 10: Hoi An","description":"If you feel like getting active on your free day today, why not hire a bicycle and tour the surrounding countryside. This is one of the best ways to get an insight into rural Vietnam. Other optional activities include a day trip to My Son Cham (elaborate World Heritage-listed temples that reflect the rich cultural traditions of the Cham civilisation), a cruise along the Thu Bon River, and a trip to the nearby Cua Dai Beach. Your leader will be able to help with suggestions on activities in Hoi An. Accommodation: Hotel"},{"title":"Day 11: Hoi An","description":"Enjoy another free day in the World Heritage-listed Hoi An. You may like to wander the Central Market and the street stalls selling paintings, woodwork, ceramics, lanterns and much more. Hoi An is also famous for its talented tailors who can make beautiful items to order within a few hours. Bring your favourite piece of clothing, or even just a picture, and you'll be able to have it copied. You might like to visit a local workshop to learn how to make your own rice paper, while a Vietnamese cooking class too is a great way to familiarise yourself with some age-old culinary techniques, not to mention being able to feast on the fruits of your own labour. Accommodation: Hotel"},{"title":"Day 12: Ho Chi Minh City","description":"Transfer to Danang (approximately 45 minutes) for your flight to Ho Chi Minh City. Formerly known as Saigon, Ho Chi Minh City is characterised by a fascinating blend of old and new, East and West. The huge number of people rushing about their daily lives in Vietnam's largest city gives it a dynamic atmosphere and the French influence is evident in the excellent baguettes and coffee on offer. Take a guided tour to get a feel for the city, going past the GPO, Reunification Palace, and the Opera house. Stop in at the War Remnants Museum and the Notre Dame Cathedral. With free time this evening perhaps drop by one of Vietnam’s most pulsing markets, Ben Thanh. This is the perfect place to pick up any last-minute snacks, cooking utensils, ingredients, or presents for friends and family before you return home. Perhaps enjoy some of the market fare for dinner as you shop. Accommodation: Hotel"},{"title":"Day 13: Mekong Delta","description":"Today you'll travel south by private bus (approximately 3 hours) to explore the Mekong Delta. When you arrive, you’ll board a boat and explore the intricate waterways of the Mekong Delta. Often referred to as ‘the rice bowl’ of Vietnam, the fertile delta is where rice, tropical fruit and flowers are grown for the whole country. Disembark at Ben Tre and visit a local cottage industry and sample the candy that the region is famous for. You’ll have the opportunity to take a tuk-tuk around this remote village and make a stop to sample tropical fruit, see a honey farm, and learn more about rural life. For lunch, go to a restaurant in the heart of the delta and try regional specialities such as the famous elephant-ear fish. After lunch, board sampans (small rowing boats) and paddle along the canals under the shade of lush water coconut trees. Stay overnight at a guesthouse in the Delta. The accommodation is fairly basic with shared bathroom facilities and dormitory style rooms, but the sounds of nature thrumming softly in the night makes for a memorable experience. Accommodation: Guesthouse"},{"title":"Day 14: Ho Chi Minh City","description":"Take the bus back to Ho Chi Minh City. Maybe spend the final night of your Vietnam adventure with a finale bowl of pho, celebrating with your new friends. Accommodation: Hotel"},{"title":"Day 15: Ho Chi Minh City","description":"Your Vietnam adventure ends after breakfast today. There are no activities included, so you are free to depart at any time. For those who are staying on longer and want to explore Ho Chi Minh City further, maybe check out our Urban Adventure day trips."}]},{"name":"Real Sapa Experience 5Days/5nights","duration":5,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":323,"summary":"Highlight :\n\nvisit Y Linh ho, Lao Chai and Ta Van villages of the H’mong and the Dzay minorities.\n\ndiscover Giang Ta Chai village, then Su Pan villages of the red Dzao minority\n\n2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93640.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93640.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93638.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93634.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363f.jpg"],"destinations":["Hanoi","Sapa","Lao Chai"],"timeline":[{"title":"Day 1: First Night : Hanoi – Sapa (No Meal ) by train","description":"In and around HanoiDriver will pick you up at hotel in Hanoi old quarter then transfer to station catch train to Sapa. Overnight on Train                                                                 "},{"title":"Day 1 : Lao Cai - Sapa (B/L)","description":"Arrival Lao Cai station Option 1: Bac Ha market open Sunday only . Guide take you to Bac Ha Market is held every Sunday and is the biggest minority peoples market in Northwest Vietnam .Lunch at local restaurant before back to Sapa. Free time to explore Sapa by yourself. Overnight in Sapa.   Option 2: Pick you up at Lao cai Station then transfer to Sapa. Have breakfast before walking to visit Sapa Church and Ham Rong Moutain Lunch at local restaurant before back to Sapa. Free time to explore Sapa by yourself. Overnight in Sapa."},{"title":"Day 2: Sapa – Y Linh Ho – Lao Chai – Ta Van (B/L/D)","description":"12 km of trekking, visit Y Linh ho, Lao Chai and Ta Van villages of the H’mong and the Dzay minorities. After lunch at a local family in Ta Van, we keep on hiking around the village of the Dzay & H’mong where we stay overnight in a local family for you to get to know their daily life of the local people: work, custom, embroideries, clothes...   - B, L, D - O/N at the Dzay local house"},{"title":"Day 3 : Ta Van – Giang Ta Chai – Su Pan – Ban Ho (B/L/D)","description":"After pancake made by your host family, we continue to discover Giang Ta Chai village, then Su Pan villages of the red Dzao minority. After picnic lunch, we keep on hiking to Ban Ho, the village lies within a beautiful valley, home to the Tay minority people who have their traditional house on stilts and we will spend the night here.    - B, L, D - O/N at the Tay local house"},{"title":"Day 4 : Ban Ho – Nam Toong - Sapa (B/L/D)","description":"2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam. Enjoy swimming then go up to the mountain to visit a small hamlet of the Red Dzao people called Nam Toong, then get back to Ban Ho before get to Sapa by Car.   -\tB, L,D -\tBus to Lao cai Station catch train back to Hanoi."},{"title":"Day 5 : Hanoi Depature ( No meal )","description":"Arrival Hanoi early morning, End of services ! "}]},{"name":"Vietnam Vacation From Hanoi in 9 Days","duration":9,"travelStyle":["Discovery","Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":629,"summary":"The most beautiful and stunning view and landscape from North down to South Vietnam will appear on your eyes. As a Pearl in the North, Halong Bay will be in touch while cruising. Giant Hai Van pass will be viewed from the train. In the busy society, however Hoi An old town is as a quiet and peaceful town where you can take off the modern city. Floating lives in famous Mekong River will be in your photo what is different from other in the World.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117745_bcb5b130.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117745_bcb5b130.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_d181a2a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_d256e0f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_95057b60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_2e5154a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_17699549.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_4920432c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_eb29e7fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_7608744a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_34b6d11e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_6a82ade3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_8c823ad8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_853a133c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_8ce6af03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_3c4f6949.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_afb691cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_16c8dfef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_aeed1be2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_ec76eb2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_355e2e99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_537d69f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_90f9438c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_2727bc82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_5867e2dc.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival – Pick-up at the airport – Hotel check-in (Meal:No)","description":"In and around Hanoi, Da Nang, Ho Chi Minh CityWelcome to Hanoi city. Our driver will pick you up from Noi Bai airport and transfer you to the hotel in Hanoi old quarter.  As the heart of the capital of Vietnam – Hanoi old quarter is the most interesting place where you can taste a lot of local street foods, experiencing the local lives, culture, tradition..ect. Take a visit Temple of Literature – Known as “First University of Vietnam”, Dai Nghien “ Ink Stand”, Ngoc Son temple “ The Jade Mountain temple” on Hoan Kiem Lake…Having a Cyclo visiting around the old quarter. Optional: Hanoi Street Food Walking tour, Water Puppet Show Note: Hotel check-in time: 13:00 Overnight at hotel in Hanoi Start point\n Noi Bai airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi – Halong Bay – Overnight on cruise (Meal: B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.  8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way. 12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch. After lunch time, free time to sunbathing on the sundeck, photo hunting while cruising among the hundreds of mountains. 15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay. 16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water. 17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine. Our chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself. 19:00: Dinner will be served with a lot of delicious Vietnamese foods. After dinner, free time to watch movie, playing the card, or attend the Squid fishing game Overnight on cruise"},{"title":"Day 3: Halong Bay – Kayaking – Hanoi (Meals: B, L)","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip. 7:00: Enjoy the breakfast and tasting Tea & Coffee 8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own. 9:30: Get back to cruise, check out the cabin. Then, take the leisurely time to rest on sundeck to view the bay. 11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor  12:30: Get on the bus back to Hanoi with short break time on half way. 16:30 – 17:00: Arrive your hotel in Hanoi city. Overnight at hotel in Hanoi "},{"title":"Day 4: Hanoi – Overnight train to Da Nang (Meal:B)","description":"Today, you take your own time to explore Hanoi old quarter until the transferred time to Hanoi train station to Da Nang. Train takes about 16  hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages… Optional: Hoa Lu – Tam Coc – Cycling 1 Day trip Overnight on the train"},{"title":"Day 5: Da Nang arrival – Hoi An (Meal:No)","description":"In and around Hoi AnOn the train, you can see the beautiful Hai Van Pass in the morning. The stunning and breathtaking landscape along the rail way, offer you the opportunity to take a lot of nice photo. Our driver meets you at Da Nang train station and transfer you to Hoi An.  Leisurely walking under the lanterns on Hoi An old town, seeing the simple and friendly local lives, breathing the pure air, tasting a coffee cup on Thu Bon river… Overnight night at hotel in Hoi An"},{"title":"Day 6: Hoi An – My Son Hollyland (Meal:B,L)","description":"7:45 – 8:30: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide.  12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon river. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river  13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!  Overnight at hotel in Hoi An"},{"title":"Day 7: Hoi An – Flight to Ho Chi Minh city (Meal:B)","description":"After breakfast, you should do walking around to feel the quiet and peaceful atmosphere in the old town. Or going to any tailor shop to make a lovely costume. Meeting to driver and going to Da Nang airport for flight to Ho Chi Minh city. Ho Chi Minh arrival, our driver will welcome and transfer you to the hotel in the central of Ho Chi Minh city. Visiting the biggest city in Vietnam and explore the busy lives as the Western one. Overnight at hotel in Ho Chi Minh city. Optional: HCM cooking Class "},{"title":"Day 8: Mekong Delta Full Day Tour (Meal:B,L)","description":"7:30-8:15 am: Tour guide and driver will pick you up at your hotel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.  Stop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation.  Riding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop.  Have lunch at local restaurant. Break time. In the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City Overnight at hotel in HCM city"},{"title":"Day 9: Ho Chi Minh city Departure (Meal:B)","description":"After Breakfast, feeling your own time with locals. Visit HCM city until the transferred time to the airport for the flight out. If you are not ready to leave, please let us know to help you extend your travel in Vietnam Please note: Hotel check-out time: 12:00 Note: This is group joining, there is a different group each day trip during your vacation. If you are Solo traveller, you will stay at Share Dorm Room at the hostel during your vacation. Who should participate? - This tour is suited for all, including children as well. Price structure: - Price quoted is based on per person basis.  This is 3 star package, please advise if you want to upgrade to 4 or 5 star package!End point\n Tan Son Nhat Airport , Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736400, Vietnam "}]},{"name":"Adventures from Hanoi to Hoi An 7 days 6 nights","duration":7,"travelStyle":["Sightseeing","Adventure","Family","Christmas & New Year"],"oldPrice":0,"price":746,"summary":"Seven legendary days from Hanoi to Hoi An. Immerse yourself in the local culture, culinary delights and scenic landscapes on a journey through rural Vietnam. Mr Linh's Adventures has  been designed by travellers for travellers. It showcases some of the most spectacular “off  the beaten track” destinations while keeping a fun and relaxed atmosphere, all being enjoyed with a bunch of like minded souls.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/106717_e7042ef3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/106717_e7042ef3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_e4b49132.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_351c9999.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_4b9ef8d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_d9380140.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_793e5b44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_26b13def.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_7fbafc48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_df7d4396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_a9fa5ad8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_c0016dcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_fab492a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_aee7da5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_89c19e8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_c9f05d56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_dd97ebc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_e81298db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_bf6956f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_45bf649f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_543cae35.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh City","Phong Nha National Park","Hue","Hoi An"],"timeline":[{"title":"DAY 1 HA NOI - HA LONG - NINH BINH (L/D)","description":"After breakfast, you will start the tour by heading to Ha Long Bay, an iconic and beautiful spot designated as a UNESCO World Heritage Site. Here we set out on a sailing boat for an exploration of the Bay and the many wonders within.   This exciting 4-hour cruise provides a fantastic view of the bay which is dotted with some 3,000 limestone islands rising amazingly from the clear and emerald water. These limestone karst formations are littered with beaches, grottoes and beautiful caves. Along the way we will anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath the towering cliffs.   After your exploration of Ha Long Bay, we will transfer you to Ninh Binh, making sure you have the chance to take in the beautiful scenery along the way. Once in Ninh Binh you will be ped off at your hotel and the rest of the evening is yours to spend at your leisure.Start point\n Hanoi old quarter, Hanoi, Vietnam 07:30 - 08:00"},{"title":"DAY 2 NINH BINH – NIGHT TRAIN TO DONG HOI (/L/D)","description":"In and around Hoi AnToday, you will have a chance to visit a natural wonder just as impressive as Ha Long Bay. About 150 kilometres from the famous Vietnamese bay is another equally as impressive landscape. This one, known as Trang An, is nowhere near the coast though, and the mountains are connected by rice paddies, not water. After enjoying a delicious lunch, we will take a boat up the beautiful river fed by natural springs, through caves that bisect amazing limestone karst mountains to visit an Ancient 10th Century pagoda and temple.  After our visit to the Pagoda and Temple, it’ll be great fun to hop on a bike for a trip to Thung Nham Bird Garden. The route to the garden is a quiet one, consisting of flat roads and dams set to a back of stunning scenery. In total the round-trip is roughly 10 kilometres long.  After all this activity you might feel a bit damp, so we’ll take you back to the hotel where you can enjoy a shower and get cleaned up, before boarding the overnight train to Phong Nha-Ke Bang National Park.  Following this, we will have dinner and a shower in central Ninh Binh town before boarding the overnight train to Phong Nha­Ke Bang National Park."},{"title":"DAY 3 PHONG NHA NATIONAL PARK (B/L)","description":"Phong Nha­Ke Bang is one of the largest National Parks in Vietnam and is home to a huge amount of wildlife, breath-taking scenery, crystal clear rivers and immense cave systems.   A documentary by National Geographic has given this area much attention with the discovery of Son Doong, the world’s largest cave, in the early 1990’s. Our first stop is Eight Lady Cave which is named for the eight women working on the Route 20 highway who died from a bomb attack that caused a massive rock to seal off the exit, trapping them inside. Then we move on to Paradise Cave, one of the most beautiful and famous caves in Phong Nha stretching for more than 30 kilometres and featuring hundreds of incredible rock formations.  After lunch we visit the awesome Dark Cave by zip line or kayaks for the slightly less adventurous. With only a head torch to light our way, we will navigate through the darkness to the mud baths where you can either relax and soak up goodness, leaving you with baby smooth skin, or have some fun with a classic mud fight! Afterwards you can take a refreshing dip in the lake and wash all the mud away."},{"title":"DAY 4 PHONG NHA NATIONAL PARK (B/L)","description":"After so many great activities the day before, this day is free for you to cycle around & explore the town, check out the local life by the river or just chill out. We will take you on a short but bumpy ride through the villages to and from the homestay if needed."},{"title":"DAY 5 VINH MOC TUNNEL (B/L)","description":"Vinh Moc is a tunnel complex in the Demilitarized Zone (DMZ), built to shelter families from the intense bombings of the area during the American war. Over 600 people lived here and 17 babies were even born in these tunnels between 1965 and 1972.   After lunch we will visit the Mine Action Visitors Centre in Dong Ha, which examines the effects of the war that persist to this day, even after hostilities ended over 40 years ago in 1975. After this you will arrive in Hue, and discover Thien Mu pagoda which rests on the banks of the perfume river. This is actually the tallest pagoda in Vietnam, featuring 7 tiers reaching for the sky, each level representing one step of the path to enlightenment.  You will then spend the rest of the evening and night in Hue. "},{"title":"DAY 6 HUE CITY TOUR AND BEACHES (B/L)","description":"In and around HueAfter breakfast, our tour guide will take you to the Imperial Citadel. The structure and its majestic architecture, built by Gia Long, sadly suffered extensive damage during the years of fierce conflict which took place here. These scars provide an extra layer of history, telling a tale of the decades of fighting long past.  We will continue your trip into the past by visiting Minh Mang Tomb, the final resting place of the 2nd emperor of Vietnam. This tomb is special in the way its architecture blends seamlessly with its surrounding landscape (a result of Minh Mang’s staunch belief in Confucianism). Following this, you can hop back on the bus and we’ll take you to the local beach to enjoy some lunch and cocktails as we swim and enjoy the sunset. This hidden gem is a great way to cap off an eventful day."},{"title":"DAY 7 HAI VAN PASS – HOI AN (L)","description":"We will depart Hue in the morning, riding motorbikes all the way to Hoi An. There will of course be many stops along the way to let you appreciate the beautiful beaches and coastline and enjoy the breath-taking Elephant Springs. Make sure you have packed your swimming gear as this is a great place to relax, swim and enjoy lunch for a couple of hours.   The journey then heads south to take in some breath-taking views as we ascend the famous Hai Van Pass where we will stop at the top to see some French and American bunkers, remnants of the past war. This road, made famous by the Top Gear motoring programme, is a site that simply cannot be missed.  Once you arrive in Hoi An the rest of the day will be free for you to spend at your leisure exploring all that the ancient town has to offer.  And this will be where your Adventure tour of Vietnam ends. If you feel like you haven’t had enough and want to continue further south, consider booking an extension!End point\n Hoi AN, Hội An, Quàng Nam, Vietnam 17:00 - 17:30"}]}]