[{"name":"Hanoi & Halong Bay plus Mountain Resort - 6 Days","duration":6,"travelStyle":["Discovery","Family","Custom","In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":399,"summary":"The best quality and unbeaten price for 6 Days Trip in the North of Vietnam\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optionals\n\nStart in Hanoi and finish in Hanoi\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Boat in Halong Bay - World Heritage Site\n\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\n\n","highlights":["Spend the night cruising on a traditional junk boat on Halong Bay","Discover enchanting lagoons and coves amongst limestone karsts","Fall in love with the vibrant hustle and bustle of Hanoi"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95674_2674385f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95674_2674385f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_cdd8fe3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_fc2ecd6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_3ff197e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_8aef5056.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_e241e136.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_7406abb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_6cd2829f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_97cb6cce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_70adcda7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_b2ddf919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_46226594.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_df51e61e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_187183b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_028af826.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_bb0fc5d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_99df5636.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_42193001.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_de43f7eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_a01d28cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_2b35be76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_1922d7c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_e22c11c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_83d2b81c.jpg"],"destinations":["Hanoi","Mai Chau","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"In and around HanoiToday you’ll land in Hanoi and this is where your adventure begins. Be warmly welcomed by our representative at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi. Optional tour for morning flight arrival: (45 US$ per Person) Take a short tour to visit Hanoi city landmarks including: Ho Chi Minh Mausoleum, One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong; stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. Also take the outside visit to the Opera House, St. Joseph Cathedral and make sure your camera is handy. Overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similarStart point\n Airport pick up, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"After breakfast at your hotel, you will be picked up for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on cabin on boat. Garden Bay Cruises 3* or similar"},{"title":"Day 5: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served. Cruise check-out time is around 10:30am. Disembark and rejoin our bus for driving back to Hanoi city. There will be one rest stop on the way for restroom and short shopping for handicraft souvenirs and local handmade products. Arrive Hanoi about 4:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. The Pub Street is opened until 12:00pm along Ta Hien, Dao Duy Tu, Hang Buom, Ma May ets streets. You will be filled of fun with local beers and street foods. Enjoy your last night in Hanoi before leaving home tomorrow. Stay overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group! Have a safe journey home or to next destination. Goodbye and see you again in Vietnam and Southeast Asia.End point\n Airport transfer, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Highlights of Vietnam - 12 Days","duration":12,"travelStyle":["In-depth Cultural","Group","Fully Guided","Christmas & New Year"],"oldPrice":0,"price":806,"summary":"An excellent value tour covering all the principal sights of Vietnam in a short space of time. Highlights include an overnight cruise around Halong Bay on a junk boat, the historic town of Hoi An, a full day sightseeing trip in the Mekong Delta and the two main cities of Hanoi and Ho Chi Minh. This tour features our selection of the best local hotels which are all centrally located, allowing independent exploration of Vietnam’s delightful shops and restaurants.","highlights":["Soak up the hustle and bustle of Hanoi City","Cruise on a traditional junk boat through Halong Bay","Explore the magical ancient town of Hoi An","Crawl through the mystical Cu Chi Tunnels","Feel the metropolitan pulse of Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132167_4d9e1348.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132167_4d9e1348.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_a1af9d8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_b3448d26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_ac935ec8.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Cu Chi Tunnels","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"In and around Hanoi, Da Nang“Welcome to Vietnam” at the airport by your EMH tours’ transfer team.  We then transfer you to the hotel.  The remainder of the day is at leisure.   Accommodation: Hotel  Meals: Meal is not included on this day.   Suggestions for your free time:  - Take a slow walk around Hoan Kiem Lake, which is very scenic, so remember to bring your camera.  - In walking distance from your hotel, you can go to Thang Long theatre where you can enjoy traditional Vietnamese water puppet show.  - Another option is to do shopping, you will find plenty of shops in the old town as well as street night market. Should you wish to taste famous Vietnamese coffee, you will find many coffee shops in French style with a view to the lake."},{"title":"Day 2: Hanoi City Tour","description":"After breakfast at the hotel, you will be picked up for the city tour. We first head out to the Tran Quoc Pagoda, a 1400 year-old temple, the oldest in the city and is located near West Lake offering a watery landscape, the pagoda is a very scenic attraction.   Then, we’ll drive to Ho Chi Minh Complex, where you'll have the opportunity to visit President Ho Chi Minh’s Mausoleum, Uncle Ho’s House and the One-pillar pagoda – a very iconic temple in Vietnam.   Temple of Literature will be our next stop. This ancient site offers a lake of literature, the Well of Heavenly Clarity, turtle steles, pavilions, courtyards and passageways that were once used by royalty. Visiting the Temple of Literature you will discover historic buildings from the Ly and Tran dynasties in a revered place that has seen thousands of doctors’ graduate in what has now become a memorial to education and literature.   Thereafter, we will continue our tour to Ngoc Son Temple, also known as the Temple of Jade Mountain, dedicated to Confucian and Taoist philosophers and the national hero Tran Hung Dao. Photography is also popular at this Huc bridge, a landmark red wooden bridge, leading over a lake to a shrine.   This tour will end with a drop off back to your hotel.   Accommodation: Hotel  Meals: Breakfast, Lunch"},{"title":"Day 3: Hanoi - Halong Bay - Overnight Onboard a Cruise Ship","description":"Wake up early and depart your hotel in Hanoi for a transfer by shared van to Ha Long Bay. This UNESCO World Heritage Site is one of the true natural wonders of the world. In this sweet spot where the land meets the Gulf of Tonkin, over 1,000 karst islets rise above emerald waters and the seascape takes on an otherworldly quality.   The eastward drive from Hanoi takes about four hours, and you’ll arrive at the port about noon. Here you’ll board a pleasure boat for an unforgettable overnight cruise along the bay. After a welcome aboard the ship, you’ll be led to your cabin followed by a short trip briefing.   Once the ship gets underway, you’ll enjoy a lunch of fresh, locally caught seafood.   Cruise at a gentle pace, disembark onto smaller boats to venture into grottos and caves, stop to explore floating fishing villages and picturesque lookout points.   You’ll return to the boat just in time to watch the incomparable sunset from the top deck ship before sitting down for a dinner of more delicious, fresh seafood.   Evening entertainments or activities onboard (such as cards game, chess, karaoke, squid fishing) are also available.   Please note, each junk operates with a slightly different itinerary and on board facilities.   Accommodation: Overnight Onboard a Cruise Ship  Meals: Breakfast, Lunch, Dinner"},{"title":"Day 4: Halong Bay – Hanoi","description":"Begin your day with a Tai Chi session on the cruise’s sundeck accompanied by complimentary tea and coffee. It’s the perfect locale to integrate your mind and body as the sunrise over the bay compliments this internal martial art perfectly. With a rejuvenated spirit and newly healthy qi (life energy), you’ll sit down for a light breakfast to be served on board.   After breakfast, you’ll have the opportunities for a swim, or to explore by kayak or to join other available activities.   Please note, each junk operates with a slightly different itinerary and on board facilities.   Afterward, you’ll return to the cruise where you’ll have time to relax and enjoy lunch. Then you’ll be transferred to a dock on the mainland followed by a drive to Hanoi.   Accommodation: Hotel  Meals: Breakfast, Lunch"},{"title":"Day 5: Hanoi – Fly to Da Nang – Hoi An","description":"In and around Hoi An, Ho Chi Minh CityBreakfast and free time until time to go to the airport for your flight to Da Nang. The flight time is approx. 1 and half hours. On arrival, we’ll drive to Hoi An, about 45 minutes drive, to check-in the hotel. The remainder of the day is at leisure.   Accommodation: Hotel  Meals: Breakfast"},{"title":"Day 6: Hoi An Free Day","description":"Today you are free at leisure to explore Hoi An, a World Heritage Site.  Accommodation: Hotel  Meals: Breakfast   Suggestions for your free time:   Walk around Hoi An in the morning. Visit popular highlights including the Japanese Bridge, the Chinese Temple and Phung Hung Old House.   Optional Tour (additional cost applies, this tour can be booked locally): Golden Bridge – Travel to the foot of the Ba Na Hills and ride by cable car up to the Marseille station. It is a short walk to the Golden Bridge from the station. The newly-opened bridge has been designed to make its visitors feel as though they’re walking on clouds. Make sure your camera is charged for the incredible photo opportunities! Continue with a walk into le Jardin d’Amour. The whole garden is made up of 9 gardens, all telling different stories and designed in different styles. The last stop of the excursion is a visit to Linh Ung Pagoda to admire the 27-metre high Shakyamuni statue.   Optional Tour (additional cost applies, this tour can be booked locally): Tra Que Vegetable Village Tour – Observe and try the local farming activities. Learn the process of planting vegetable such as raking the ground, sowing, watering, picking vegetables and many others. A light meal will be served during the tour."},{"title":"Day 7: My Son Sanctuary Tour","description":"After breakfast at the hotel, we’ll set off to My Son, a World Heritage site, 50 km southwest of Hoi An.   We will learn about the Cham history and how this massive sanctuary was built. My Son is a complex consisting of more than 65 architectural towers and temples dating back to 4th century. The site was used for religious ceremonies for Kings of the ruling dynasty as well as burial site for national heroes and royal family up to the 19th century. My Son is considered to be of same historical significance as Southeast Asia’s greatest archaeological sites, including Angkor Wat in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia.   After that, we’ll drive to the Thu Bon river, where we will take a boat trip back to Hoi An. Then we’ll have a lunch at the restaurant before we return to the hotel.   Accommodation: Hotel  Meals: Breakfast, Lunch"},{"title":"Day 8: Hoi An – Da Nang – Fly to Ho Chi Minh City","description":"After breakfast at the hotel, we’ll leave for the Da Nang airport to fly to the Ho Chi Minh City. The flight time is approx. 1½ hours. Upon arrival, you will be met and transferred to hotel for check-in. The remainder of the day is at leisure.   Accommodation: Hotel  Meals: Breakfast"},{"title":"Day 9: Cu Chi Tunnels","description":"In and around Cu Chi TunnelsAfter breakfast at the hotel, we’ll set off to explore the Cu Chi Tunnels.   Cu Chi is a network of more than 120 km under the ground and were built by sweat and blood of Vietnamese guerrillas to hide and fight against the rival forces. You will be introduced to many kinds of booby traps used during Vietnam War. We will take time to explain the methods of creating, maintaining and living in these tunnels as well as the special technique of hiding smoke invented by the guerrillas.   This tour also includes visiting different types of underground halls, secret working, meeting rooms. We’ll also have the opportunity to spend an hour experiencing the tunnels with a guide.   After that, we’ll enjoy the tea and cassava (guerrilla’s food during the war) before watching a short (15 minutes) documentary about the tunnel. At the end of the tour, we’ll return to the hotel.   Accommodation: Hotel  Meals: Breakfast, Lunch"},{"title":"Day 10: Mekong Delta Full Day Tour","description":"After breakfast at the hotel, we will set off to explore Vietnam’s picturesque Mekong Delta on this day trip. The Mekong Delta, located in southern Vietnam, is a stunning maze of rivers, islets, small villages with rice paddies and fruit plantations.   Firstly, we’ll drive to My Tho City. We can observe as the bustling city views transition to serene rice fields and rural settings. On the way, you will have a visit at the Vinh Trang Pagoda. On arrival in My Tho, hop on a boat for a calm cruise along the river observing stilt houses, fruit plantations and fishing villages. Then, continue to Tortoise Islet where we’ll have our lunch in the orchard garden.   After lunch, your boat will take you to An Khanh in the beautiful green province of Ben Tre. Taste some local treats like coconut candy and honey tea as you sit back and relax on your wooden river boat in the comfort of the shaded canals covered by water-coconut trees. Then, your boat will bring you to the marvellous tropical fruit gardens to enjoy a Southern Vietnamese folk music performance by the local islanders. After a relaxing cultural experience on the water, we’ll return to the Ho Chi Minh City by road.   Accommodation: Hotel  Meals: Breakfast, Lunch"},{"title":"Day 11: Ho Chi Minh City Free Day","description":"Today is at leisure to relax at your hotel, or explore more of the local area independently.   Accommodation: Hotel  Meals: Breakfast   Suggestions for your free time:   Optional Tour (additional cost applies, this tour can be booked locally): A O Show is a sophisticated cultural show featuring talented. This show will bring you on a journey from the rural to the urban life of Vietnam via a series of sketches and acts involving Vietnamese traditional props.   Optional Tour (additional cost applies, this tour can be booked locally): Teh Dar Show – Join us a fantastic cultural Teh Dar Show and immerse in an interesting story of Vietnamese highlanders. Get ready to be amazed at the stunning acrobatic movements of the skilled artists and feel the spiritual life’s beauty through an exceptional background live music.   Optional Tour (additional cost applies, this tour can be booked locally): Dinner on Saigon River Cruise Tour"},{"title":"Day 12: Fly Back Home","description":"Breakfast and free time until time to go to the airport for departure flight.  Then, transfer you to the Ho Chi Minh International Airport according to your flight departure time.  Meals: Breakfast"}]},{"name":"Hanoi, Sapa & Halong Bay plus Bakhan Village Resort - 9 Days","duration":9,"travelStyle":["Discovery","Family","Custom","In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":585,"summary":"The best quality and unbeaten price for 9 Days Trip\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optionals\n\nStart in Hanoi and finish in Hanoi\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Boat in Halong Bay - World Heritage Site\n\nExplore real culture of ethnic groups and enjoy the terraced rice-fields in Sapa\n\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\n\n","highlights":["Spend the night cruising on the aquamarine waters of Halong Bay","Go kayaking and discover enchanting coves and inviting lagoons","Fall in love with the vibrant hustle and bustle of Hanoi Old Quarter"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100146_80ee45c5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100146_80ee45c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_5270aac4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_e214abd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_5c858b1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_09f12fe1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_6b4699ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_560af8a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_08ad5caf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_20233dab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_f670f45c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_ec47ee2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_c23ebe6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_c4c1494a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_7acef503.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_a9ef3e8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_50f89c1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_24065896.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_99dd59a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_deeb528b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_44bcd72a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_d37967da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_2afd7b34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_e6e84965.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100146_ec68b964.jpg"],"destinations":["Hanoi","Sapa","Lao Chai","Cat Cat Village","Lao Cai","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"In and around HanoiAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Pomihoa Hotel Hanoi or similarStart point\n Airport pick up, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Sapa by Sapa Express Bus (B)","description":"Depart: 6:45 - 7:00am Arrive: 13:30 Total transfer duration is 5hour and 30 minutes (subject to change upon weather and road situation) Our bus transfer and tour guide will pick you up at your hotel before guiding you to your Sapa Express Bus – Noble Limousine  Along the way, you will have chance to view the stunning beauty of northwest mountains and pass by local life. Along the way you shall have a short 30 minute break. Upon arrival in Sapa you shall check in and explore at your leisure!  Bamboo Sapa Hotel 3* or similar"},{"title":"Day 3: Excursion full day - Y Linh Ho - Lao Chai - Tavan Village (B, L)","description":"9:30 AM, start from Sapa Ethnic (04 Hoang Dieu Str) on the main road to go down to Muong Hoa valley. At the start of the trip you are able to see a panorama view of this hilltop town before beginning your walk. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields to get to Y Linh Ho hamlet, a small village of the Black Hmong people. From Y Linh Ho village, we go along the river to go to Lao Chai village (means \"old village\" in the local dialect). It is time for you to visit the local families, listen to your guide's explanation about the local culture: how they live, way of building the traditional house, techniques of making clothes... or just feel free to chat. Stop for local lunch.  In the afternoon, we leave Lao Chai to continue to Ta Van village. Here your are welcomed to a family where you can immerse yourself in their culture, listen about their life, enjoy some green tea and learn about the differences from the other hill tribes even. After which we head up to the main road where the car will pick up us to transfer back to Sapa. Overnight in Sapa Town. Bamboo Sapa Hotel 3* or similar"},{"title":"Day 4: Sapa - Hanoi by Sapa Express Bus (B)","description":"Trekking from Sapa to Cat Cat Village you will see its waterfall and meet H’mong family and learn more about their way of life. Cat Cat is a small but bustling village situated at the foot of Fansipan Mountain. Here you will see traditional H’mong homes at their best, and you will be able to meet a H’mong family to learn more about their way of life. The village is also the perfect place to see traditional clothing being made, hemp being dyed and women weaving. From Cat Cat we will follow the Muong Hoa Valley for 3km through rice terraces and small dwellings to Sin Chai. This village is a little off the usual trekking route and less visited, it offers the opportunity to see traditional wooden homes built using the indigenous Pumu tree. Transport will be waiting in Sin Chai to take you back to Sapa.  15:30: Our car and guide will pick you up at the Sapa Tourism Information Center (inside) for departure back to Hanoi towards new Noi Bai - Lao Cai Highway. There will be 2 stops on the way for restroom (max 20mins/stop) Arrive in Hanoi at 8:30 pm to 9:00 pm. End of the trip with sweet memories about our Sapa and Hill-tribe village of the north of Vietnam. Check in hotel & overnight in Hanoi Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Halong Bay (B, L, D)","description":"In and around Halong City7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter  Along the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch local crafts being produced and grab a bite to  12:00 pm We will arrive at the port before being transferred to Glory Legend Cruise Welcome drink - receive cruise briefing, safety instructions and check in.  Enjoy a lunch with Vietnamese dishes served while sailing through the bay, passing the imposing limestone formations.  You shall then board your bamboo craft piloted by indigenous locals. They will take you through a stunning cave formation into a tranquil bay where if you are lucky you can spot monkeys. Next you are able to relax on the beach at Ti Top where you are able to swim in the warm water, get some rays or treck to the top of the outcrop for stunning panorama views. Back to the boat and you have free time while sailing to Luon Bo area, and anchor overnight. Attend the Cooking class on sundeck. Then enjoy Happy Hour (Buy one drink-get one free). Sit back and relax while watching the magnificent sunset over Halong Bay.  19:30-23:00: Dinner - Deluxe Vietnamese and International BBQ Set Menu Dinner Evening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spending a romantic night on Glory Legend Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat. Garden Bay Cruises or similar"},{"title":"Day 6: Halong Bay - Hanoi (B, L)","description":"6:00-7:00: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements. 7:00-8:00Coffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape. 8:00-9:30: Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites.  9:30-11:00 Have brunch while cruising back to the Tuan Chau Wharf. Relax while taking in the final views of Halong Bay Check out before 11:30 am 12:00 pm: Depart Halong Bay for Hanoi 4:30 pm: We shall drop you back off at your hotel in Hanoi’s old quarter. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort Mai Chau"},{"title":"Day 8: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 9: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi, Sapa & Halong Bay plus Bakhan Village Resort Trip. Good bye & see you again!End point\n Transfer to airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"Vietnam Quick Look - 7 Days","duration":7,"travelStyle":["Discovery","Family","Private","Fully Guided","In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":599,"summary":"The best quality and unbeaten price for 7 Days Trip\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optionals\n\nStart in Hanoi and finish in Ho Chi Minh City\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Boat in Halong Bay - World Heritage Site\n\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\nTaste wonderful Vietnamese local cuisines along the trip\n\nChillout in Ho Chi Minh City - the biggest and most modern City of Vietnam\n\nAnd more...","highlights":["Spend the night on a traditional junk boat at Halong Bay","Fall in love with the infectious hustle and bustle of Hanoi","Step back to times of war inside the Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f3e1c0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f3e1c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_284d48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_28f6de78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_0f424bf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_057bb583.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_fd47b245.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_cb25384a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_96ca57b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_11f8fe4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_9db80ace.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_32b21362.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_e3a0b083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e27cc4ca0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e27ccdc21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e27cd247e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e27cd6875.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f27167.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f2fd8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f345cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f39979.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f42e00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e29f47439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e2da609f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76129_5e02e2da69d54.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Ho Chi Minh City","Cu Chi Tunnels"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"In and around HanoiToday you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Take part in Water Puppet Show. Check into your hotel. Stay overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similarStart point\n Airport pick up, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Halong Bay Cruise & stay overnight on Board (B, L, D)","description":"9:00am: Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat. Garden Bay Cruise 3* or similar"},{"title":"Day 3: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi. Short break in the middle way is available (20 minutes) Arrive hotel in Hanoi around 4:00pm. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi fly to Ho Chi Minh City (B, L)","description":"In and around Ho Chi Minh City09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. You`ll be transferred to airport directly to catch the flight to Ho Chi Minh City.  Pick up upon arrival, transfer to hotel for check in! Overnight in Ho Chi Minh City. Liberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 6: Ho Chi Minh City Tour - Cu Chi Tunnels (B, L)","description":"In and around Cu Chi TunnelsToday you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. Return to hotel for free. Stay overnight in Ho Chi Minh City. Liberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 7: Ho Chi Minh City Departure (B)","description":"Today you are free for leisure & shopping until transfer to Airport for departure. Finish unforgettable Vietnam trip with Legend Travel Group. Good bye & see you in the next time!End point\n Transfer to airport, Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736400, Vietnam "}]}]