[{"name":"Vietnam - South to North 10 days","duration":10,"travelStyle":["Adventure","Family","Private","Discovery","Christmas & New Year"],"oldPrice":0,"price":895,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Visitthe Japanese Bridge in Hoi An","Explore the Holy Land of La Vang","Trek to see Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100048_a44a5e01.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100048_a44a5e01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_326dd271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_a060e6b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_212a271d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_d0c6f2ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_057f4396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_119de0c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_df839941.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_630d5fce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_35372606.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_57db50b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_d4dcd372.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_822a26c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_6bedbd87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_f3ca4c93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_28ebf380.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_eee7831e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_01f714fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_1d8ef25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_1946f02f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_448679a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_83c8c4e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_f33c3d49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_96fca443.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Cu Chi Tunnels","Hoi An","Hue","Phong Nha National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 HO CHI MINH CITY ARRIVAL","description":"In and around Da Nang, Ho Chi Minh CityMeal not included On arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You are free time for leisure. Overnight in Ho Chi Minh city.Start point\n Your hotel address , Hồ Chí Minh, Vietnam "},{"title":"Day 2 MEKONG DELTA – MY THO & BEN TRE","description":"Meal included: Breakfast, Lunch. Get a chance to taste the real Vietnam and let the splendid views cover your senses. This trip allows you to visit the local factories and see how local products are made. Also, you will meet the friendly local people and have a lot of wonderful experiences on land and at the river while see the floating fish market and fish farm. Let's discover a hard-working land with traditional people, which will give you more appreciation on life!  7h30 a.m Our tour guide welcome you at Vietnam Adventure Tours office, then transfer to the City of My Tho by bus. During 1.5 hours bus drive to My Tho join activities of local people and enjoy nice scenery of green rice paddy fields. We visit Vinh Trang pagoda - biggest pagoda in Mekong delta. Continue going to My Tho, where we take a boat trip along Mekong River. During a boat cruise along Mekong River, you can see fish cages, floating houses on the river. The boat take you to small canal, where is the place you totally escape from the busy town. The boat cruise in the coconut trees canal takes you to a coconut island in Ben Tre. We disembark and have a walk around the village. Stop at a local family to enjoy tropical fruit, taste honey tea, honey wine and listen to Vietnamese traditional music, performance by the villagers. Continue walking on the village’s road to coconut candy shop, learn how to make candy, show some handicraft made by coconut tree. Take a walk through village with two sides there are so many kind of fruits, flowers, trees, local houses, children in Mekong delta, take your time to have nice photos and enjoy nature scenery. Then, we head to the local restaurant. Lunch is set with special Vietnamese food at here. Enjoy lunch under tree shadow you will feel the life is so beautiful. After lunch you relax half an hour to walk around the village or biking, travel on the river to back the ferry, transit to the bus back Ho Chi Minh, arriving in Ho Chi Minh city at around 4:30pm. Stay overnight in Ho Chi Minh"},{"title":"Day 3 CU CHI TUNNELS HALF DAY","description":"In and around Cu Chi TunnelsMeal included: Breakfast 08:30        We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.  The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out! 14:30        The bus back HCM. Stay overnight in Ho Chi Minh."},{"title":"Day 4 DA NANG – HOI AN BY PLANE","description":"In and around Hoi AnMeal included: Breakfast Morning: Breakfast at hotel.  Our driver takes you to the airport for Da Nang flight. Arrive to Da Nang, our car take you to Hoi An (40 minutes drive). Check in hotel in Hoi An. You are free to discover the ancient town: Japanese Bridge, Lantern road, traditional tailor shop, enjoy the specialities. Besides, you can view sunset at Cua Dai beach. Spend overnight in Hoi An."},{"title":"Day 5 BIKING HOI AN VILLAGE WITH ACTIVITIES – HUE","description":"In and around HueMeal included: Breakfast, Lunch 8:00          Our local guide will pick you up at the hotel’s lobby. After that, you will ride a bicycle to the home of a craftsman in the city. Here you will get a short introduction to the history, shape, and color of the lanterns as well as the many stages of making them. Especially, you will be shown how to decorate and make your own lanterns you can also keep it as a souvenir.  First, you will say goodbye to your host to continue going to the vegetable village named Tra Que Village. Join the farmers as they prepare the land, fertilizing it with seaweed from the local lake. Watch and participate in raking, sowing, watering the greens, picking vegetables, and more. We will having lunch here. Finally, get back to Hoi An by bicycle. 4:00 pm Private car to Hue for 3 hours drive, you will check in hotel. Spend overnight in Hue."},{"title":"Day 6 PHONG NHA CAVE","description":"Meal included: Breakfast, Lunch 6:30           Start at your hotel and depart to Phong Nha Cave. On the way, our guide will introduce the Holy Land of La Vang (it is named the Minor Basilica), Hien Luong Bridge and Ben Hai River. When Arriving in Quang Binh, you will have chance to visit some magic location such as: Phong Nha Cave, Ke Bang national Park.  After that, you will be served lunch at Xuan Son Boat Station (in Phong Nha). 13h00 We will start visit Phong Nha Cave by boat on Son River. Then, proceed to explore the caves named Bi Ky grotto, Cung Dinh grotto, Tien grotto. 15h00 You will be picked you up at the boat station by car and continue to depart for Hue city on Ho Chi Minh Trail, via Truong Son Martyrs’ Cemetary.  19:30 We will return to Hue and overnight here."},{"title":"Day 7 HUE CITY – HA NOI","description":"Meal included: Breakfast, Lunch Morning:  Our bus and guide will meet you at your hotel in Hue to start the tour to discover loyal and historic places as follows: Minh Mang Tomb Khai Dinh Tomb Seeing Vietnamese Kungfu Performance Shown of Võ Kinh Vạn An (if possible) Tu Duc Tomb Conical Hat and Incense Make Villages.  Afternoon: You will enjoy your meals at local restaurant: Buffet 50 dishes which has diversity in Hue local Specialties, Western and Asian food. After having lunch, we continue to visit the other famous places: Imperial City (Đại Nội) Thien Mu Pagoda (400yrs old) From the pagoda, you will take a dragon boat on Perfume River. During that time, you will be relaxed in fresh cool wind and enjoy the beautiful sceneries on the way. We will spend 30 minutes for coming back to Hue City 16:30        Tour will be ended. Return your hotel to check out and then we will take a flight to Ha Noi capital. Evening  Arriving Ha Noi, car transfer to the center and spend overnight in Ha Noi."},{"title":"Day 8 HA NOI – HA LONG","description":"Meal included: Breakfast, Lunch, Dinner (Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities) 07.45 – 08.15 approx - Our guide will meet you at your hotel. The shuttle bus or private car pick up - Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta - Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours. 12 – 12.30 approx - Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing. - Check into your cabin. Time to refresh and unwind - Set sail as lunch is served - Join us for a typical local lunch in the dining room or at the outdoor dining area. Afternoon - Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising. - Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here - Heading back toward the sleeping area Early evening - Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset - An authentic Vietnamese menu is served - After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 9 HA LONG – HA NOI","description":"Meal included: Breakfast, Lunch (Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel) 06:30 For the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day. 07:00 – 08:00  Local breakfast is served 08:00 - Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn) - Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. 09:00 Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay. 10:00 You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served. 12:00 Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30-17:00 Stay overnight in Ha Noi."},{"title":"Day 10 HA NOI DEPARTURE / SEE YOU AGAIN","description":"Meal included: Breakfast You will have breakfast at hotel. Relax time in Ha Noi until transfer to the airport for the flight back home. See you again!"}]},{"name":"Vietnam Discovery","duration":15,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Christmas & New Year"],"oldPrice":0,"price":1175,"summary":"Trace Vietnam’s eastern coastline on this 15-day Lonely Planet Experience, tackling the country from south to north and discovering the many wonders that lie along the way. From the modern chaos of Ho Chi Minh City all the way up to old-world Hanoi, you'll experience tumultuous history, colonial charm, vibrant colours, delicious food and inspiring scenery on your adventure. Take a boat cruise along the Mekong Delta, tour the backstreets of Hoi An with a local, enjoy a rural homestay in Da Bac and explore the beautiful karsts of Lan Ha Bay.","highlights":["Shop for lanters in Hoi An","Visit ancient pagodas and cathedrals","Explore the Forbidden Purple City","Cruise around Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1846_e672c501.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1846_e672c501.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_fa1bfffc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_e7f0210d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_a5f2ec28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_de22bf34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_2516373c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_25923ca7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_d5d1590f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_076ce7e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_30db52fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_254fdf12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_6f422273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_14952553.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_32c5ba24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_cfe0aa86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_2645767a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_6b944e6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_335f67fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_9a540682.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_ebe41c81.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"In and around Ho Chi Minh CityXin chao! Welcome to Ho Chi Minh City, Vietnam. Your adventure begins with a welcome meeting at 6 pm today. As you won’t be spending much time in Ho Chi Minh City, we recommend arriving a few days early to see more of this fascinating city. See the ancient pagodas and cathedrals near the former Presidential Palace, historic Dong Khoi Street, and the chaotic markets of Ben Thanh and Cholon (Chinatown). Better yet, consider taking a day trip such as Urban Adventure’s Cu Chi Experience. See urbanadventures.com/destination/ho-chi-minh-city-tours for more information on the range of Ho Chi Minh City day tours. Accommodation: Hotel"},{"title":"Day 2: Mekong Delta","description":"This morning, head away from the city and make your way to the province of Ben Tre, where you’ll get on a boat to tour the canals of the Mekong Delta. This fertile area is famous for its abundance of fruit, flower and rice crops, and is known as the ‘rice bowl’ of Vietnam. During your boat ride you’ll visit some cottage industries along the river before heading to your guesthouse. Staying in simple local accommodation close to the delta, hosted by a Vietnamese family, will be one of the highlights of your trip, giving you a taste of community life as well as the chance to enjoy a traditional home-cooked meal. Accommodation: Homestay"},{"title":"Day 3: Mekong Delta – Ho Chi Minh City – Overnight Train","description":"Rise early to the sounds of the river coming alive, and enjoy a simple breakfast before boarding the boat back down the delta and catching a bus back to Ho Chi Minh City. Enjoy some free time in Ho Chi Minh City this afternoon, perhaps with a visit to the War Remnants Museum or Reunification Palace. If you haven’t already, head to Ben Thanh Market for some delicious street food, colourful shopping and even more colourful characters. This evening, board an overnight train bound for Danang. Trains are a common form of transport for the Vietnamese, so sit back and relax into this local experience. Accommodation: Overnight sleeper train"},{"title":"Day 4: Hoi An","description":"In and around Hoi AnArrive in Danang by train and travel by minibus for approximately 1 hour to Hoi An. Hoi An was recently declared a World Heritage town and is being beautifully restored. It was a major trading port with the West from the 17th century. Today, parts of Hoi An look exactly as they did more than a century ago. Your leader will take you on a sightseeing walk through the Old Town and visit some of the city's major attractions. A sightseeing pass is included in your tour so you can visit a selection of the major sights. Hoi An is also a shopping mecca, so head down to the markets and street stalls to browse paintings, woodwork, ceramics and lanterns. It’s also famous for its tailors who can make beautiful items to order, and with almost three full days here you have the chance to have some unique pieces whipped up. Accommodation: Hotel"},{"title":"Day 5: Hoi An","description":"Wake up for a free morning to do as you please. It’s a great opportunity to take a trip out to the My Son temples – a World Heritage-listed site constructed between the 4th and 14th centuries that reflects the rich cultural traditions of the Cham civilisation. In the afternoon, swap walking for cycling with a bike ride through the countryside near Hoi An. There's no better way to explore the peaceful area than on two wheels. You’ll see places few tourists get the chance to see among the green rice paddies and small creeks, which will give you a true insight into rural life in Vietnam. Accommodation: Hotel"},{"title":"Day 6: Hoi An","description":"You’ve got another day to explore this historic haven. Perhaps book in your final tailoring fitting this morning to make sure the threads you’re getting made fit like a glove, or hire a bike for a lazy ride out to the South China Sea to relax on An Bang or Cua Dai beach. Hoi An is also known for its great food, so you could book yourself in for a cooking class to take some culinary secrets away with you. Most tours include a trip to the local food markets, and some take you on a short boat journey along the Thu Bon River. Let your local leader know what you're into and they will be able to recommend some activities to suit. Accommodation: Hotel"},{"title":"Day 7: Hue","description":"In and around HueBid farewell to Hoi An this morning and make your way to Hue. The drive in a private vehicle will take around 5 hours. You’ll be travelling on the incredible Hai Van Pass, through lush mountains and past scenic lookouts, and there’ll be some good places for a photo stop. Once in Hue, you’ll have a free afternoon to explore. Hue was once Vietnam’s imperial capital and has a curious mix of bustling streets and tranquil enclaves. Perhaps visit the Dong Ba Market, which sells everything imaginable and is a great place to spend some time. It’s important to know that Hue is renowned for its cuisine, with some delicious dishes originating from this region, including bun bo hue (Hue’s delicious take on pho), and banh khoai (a filled turmeric crepe). Time to give your tastebuds a workout. Accommodation: Hotel"},{"title":"Day 8: Hue – Overnight Train","description":"Enjoy a free day in Hue. Perhaps visit the Imperial Citadel which includes the Forbidden Purple City that was almost totally destroyed during the Vietnam War. The gaping holes left by bombs give you an idea of how much destruction occurred in this country. Another optional activity is a dragon boat cruise along the Perfume River and then a visit to Thien Mu Pagoda – the unofficial symbol of Hue. Here you’ll see an active Buddhist monastery dating back to 1601 and a car belonging to the monk who tragically set himself alight in public to protest against the treatment of Buddhists. You may also like to visit one of the royal tombs, that of Emperor Tu Duc, with its central lake set amid a grove of frangipani and pine trees. This evening, take another overnight train bound for Hanoi. The journey will take approximately 12 hours. Accommodation: Overnight sleeper train"},{"title":"Day 9: Hanoi","description":"In and around HanoiArrive in Hanoi at about 5 am and transfer to your hotel. Once you’ve dropped off your bags and freshened up, embark on a walking tour of Vietnam’s charming capital. Explore the 36 streets of Hanoi’s Old Quarter – locally known as this because of each street originally selling a specific type of product. Continue on to the Dong Xuan Market and Hoan Kiem Lake, making sure you check out the unique architecture along the way. Hanoi has a French provincial feel left over from colonial times, but it also has a Buddhist influence and striking modern buildings. The rest of the day is yours to explore Hanoi as you please. In the evening, why not get your group together and head out to a bustling night market for some local fare. Sitting on plastic stools and eating on the roadside is a rite of passage in Vietnam. Accommodation: Hotel"},{"title":"Day 10: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung Village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantations are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (approximately two kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so make sure you’ve packed suitable footwear for this activity. After a local handicraft workshop, return to your homestay accommodation for a nice hot shower and a delicious dinner. Accommodation: Homestay"},{"title":"Day 11: Hanoi","description":"This morning, take the opportunity to encounter more of the Vietnamese highlands on a ten-kilometre (6.2 mi) trek from Sung Village to Da Bia. The first eight kilometres of the trek is on mostly flat ground along well-worn buffalo tracks. The final two kilometres gradually incline and for a period of approximately 300 metres there are some steps to climb, but the walk will be at a steady and relaxed pace. Keep an eye out for the monumental stone at the peak of Da Bia Mountain during the hike while you walk through local villages, meeting people from the ethnic Muong tribe. Stop for lunch at Da Bia before enjoying a scenic 1.5-hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours), arriving at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter? Accommodation: Hotel"},{"title":"Day 12: Cat Ba Island","description":"Get up early for the 7.30 am bus, stop for a quick break, then jump on the ferry. This morning of travel will deliver you to beautiful Cat Ba Island before midday. There's no time to waste, so begin exploring the stunning waters of Lan Ha Bay around Cat Ba. Located in the greater Halong Bay area, Lan Ha Bay is one of Vietnam’s most scenic places, where limestone islands and caves rise from the emerald waters. You’ll have a free afternoon to explore at your own pace, so perhaps get active on a hike, or just enjoy a dip at one of the beaches. Have a relaxing evening on Cat Ba Island. Accommodation: Hotel"},{"title":"Day 13: Cat Ba Island","description":"This morning, head out on the water from Cat Ba and continue exploring the limestone karst scenery. Take a boat around Lan Ha Bay with an included lunch while you cruise, then get up close and personal with this striking landscape by kayak. There’s the option to have a net on the side of your kayak and help out the locals’ clean-up efforts. This initiative hopes to eliminate the rising amounts of plastic waste in the bay. Lan Ha and Halong Bay are on many travellers' bucket lists, and with two days in the area you’ll get to tick them off yours. Accommodation: Hotel"},{"title":"Day 14: Hanoi","description":"Rise and shine! Perhaps start your morning with a refreshing swim or a Vietnamese coffee (or both). Make sure you soak up as much sun and sand as possible, because this afternoon it's back to Hanoi by ferry and bus. Tonight you may want to head out for an optional dinner with your fellow travellers, sharing some memories and laughs over a local meal and beer. Accommodation: Hotel"},{"title":"Day 15: Hanoi","description":"There are no activities planned for today and you’re able to depart the accommodation at any time after check-out. With so much to see and do in Hanoi, we recommend that you spend an extra day or two here, and we’ll be happy to organise additional accommodation (subject to availability). Urban Adventures has some great experiences in and around Hanoi, including Citadels, Karsts & Cycle, which is a great activity visiting the ancient citadel of Hoa Lu and taking a rowboat through the magnificent caves of Trang An. Head to urbanadventures.com/destination/hanoi-tours for more information."}]},{"name":"Vietnam the Charming North","duration":5,"travelStyle":["Discovery","Family","Christmas & New Year"],"oldPrice":0,"price":279,"summary":"HIGHLIGHTS:\n\nDelve into the 36 streets of 36 trades in Hanoi’s Old Quarter.\nA leisure cruise in Ha Long Bay – one of the world’s new seven wonders where its’ 1,600 islands and islets form spectacular seascape of limestone pillars.   \n\n\n","highlights":["Experience the hustle and bustle of Hanoi’s fascinating Old Quarter","Enjoy a traditional stage show invented by Vietnamese farmers","Indulge in the endless charm of Halong Bay with caves and grottoes"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/107424_4d948439.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/107424_4d948439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7217375d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7d7d381b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_ab05fcef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_1011ffa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_cbd3d268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_dc8ace0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7ff80d63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_2d7c69fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_66b193d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_77e5b835.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7389b34d.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL (-/- /-)","description":"In and around HanoiWelcome to Hanoi  Vietnam! Our driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to hotel in the centre of Hanoi. Overnight in Hanoi. Please note: Standard check in time is 14:00. Early check in is subject to availability of the hotel. Night activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with lifemusic, the young people of Hanoi and also foreign tourists. Hundred of bars and pubs in the Old Quarter are also atyour disposal. Or just simple spend your time at shopping malls or various boutique Shops."},{"title":"DAY 2: HANOI CITY TOUR (B/-/- )","description":"Breakfast at hotel. Around 8.00: Pick up from your hotel take you to visit the Ho Chi Minh Complex, which includes Ho Chi MinhsMausoleum  the final resting place of the beloved national hero, Uncle Ho  and President Ho Chi Minhs stilt housewhere he lived off and on from 1958 to 1969. 9.30: Youll visit the One Pillar Pagoda, which is actually a group of structures that collectively make up a pagoda builtover the water in the middle of a square lake.After that, youll have a chance to explore the Tran Quoc Pagoda on the shore of West Lake. From there, its onto theTemple of literature, which was Viet Nams first university and is dedicated to Confucius. 12.30: You have lunch at the restaurant in the Old Quarter. Afterwards, youll visit Hoan Kiem Lake - the heart and soulof Hanoi. OPTION 1: TUE, THU, SAT, SUNDAY Stop at Museum Of Ethnology. This superb museum showcases the depth of Vietnamese cultural diversity with anastounding collection of 15,000 artifacts gathered from throughout Vietnam. Maps, displays and dioramas are labeledin Vietnamese, French and English. Displays portray a typical village market, the making of comical hats and a Tayshamanic ceremony; videos show the real thing. You can also check out a traditional Black Thai house reconstructed inthe museum. There's also a centre for research and conservation where scientists from all over the world studytraditional Vietnamese cultures. OPTION 2: MONDAY, WED, FRI Depart for Bat Trang ceramic village which is about 20 km away from Ha Noi, this is pottery village with a half-millenary historic development. 15.30 - 16.00: Take the car back your hotel. Overnight in Hanoi."},{"title":"DAY 3: HANOI - HALONG (B/L/D)","description":"Breakfast at hotel and check out. From Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural WorldHeritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Uponarrival in Halong, well take a big boat to cruise the Bay to discover the magnificent beauty of this Descending-dragon bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood onboard, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach isletsto enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on theboat or relax at your own leisure. Overnight on the boat near Titov Beach. Please note! The program may be little varied upon the cruise you choose."},{"title":"DAY 4: HALONG HANOI (B/BRUCH/-)","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquillandscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that havebeen named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharfaround 11.00. Take shuttle bus back to Hanoi. Free at your own leisure. Overnight in Hanoi."},{"title":"DAY 5: HANOI DEPARTURE (B/-/- )","description":"You are free until transfer to the airport for departure flight. End of service! Please note: Standard check out time is 12:00."}]}]