[{"name":"Vietnam Highlights - 9 Days","duration":9,"travelStyle":["Discovery","Boat","Custom","Christmas & New Year"],"oldPrice":1371,"price":686,"summary":"The best quality and unbeaten price for 9 Days Trip\n\n100% Guaranteed Departure\n\nNO hidden Cost, NO Optional\n\nStart in Ho Chi Minh City and finish in Hanoi\n\nBoat trip cruise on Mekong Delta\n\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\n\nStay overnight on Boat in Halong Bay - World Heritage Site\n\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\nTaste wonderful Vietnamese local cuisines along the trip\n\nAnd more...","highlights":["Discover enchanting caves and fishing villages on Halong Bay","Spend the night on aquamarine waters on a traditional junk boat","Step back in time to times of war in the mysterious Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76086_e3178e5d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76086_e3178e5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_292c5621.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_42a64b32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_e9b99800.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_99991083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_69213819.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_a05261fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_067a692a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_5622a030.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_5f880133.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_670c2a8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_f324eb52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_f12898df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_f02939a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_68cbd0f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_2bdb2efe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_07654d6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_27939292.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_4ff5743a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_5f862bec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_148eae87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_450c80db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_7eda4297.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76086_a2b8f9b5.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Cu Chi Tunnels","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Ho Chi Minh City, Vietnam","description":"In and around Ho Chi Minh CityToday you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by Tour Guide & Car Driver at airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City. Liberty Parkview Hotel Saigon 3* or similarStart point\n Airport pick up, Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736400, Vietnam "},{"title":"Day 2: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City. Liberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 3: Ho Chi Minh City Tour - Cu Chi Tunnels (B, L)","description":"In and around Cu Chi TunnelsToday you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. After Cu Chi Tunnels you will take flight to Hanoi by Vietnam Airlines. Arrive Hanoi in the evening. Transfer to hotel for check in. Stay overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Full day sightseeing Hanoi City Tour (B, L)","description":"In and around HanoiHanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Halong Bay Cruise stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat. Garden Bay Cruises 3* or similar"},{"title":"Day 6: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City. 10:30: Take a short break for tea/coffee in the middle way. 12h00. Lunch at Bakhan Village Restaurant. Check-in room. 15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley. 19h00. Dinner time at Bakhan Restaurant. 20h00 -21h00. Enjoy the unique traditional dance by Villagers Overnight at Bakhan Village Resort Bakhan Village Resort 4*"},{"title":"Day 8: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route.  11h00. Back to the resort. Rest and relax  12h00. Check out. Enjoy lunch at the resort 13h30. Depart for Hanoi. 17h00. Arrive Hanoi Old Quarter. Check in hotel and overnight in Hanoi. Pomihoa Hotel Hanoi 3* or similar"},{"title":"Day 9: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. You`ll be transferred by Legend Travel Group to airport! Finish your unforgettable trip at airport! Good bye and see you again!End point\n Airport transfer, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]},{"name":"7-Day Discover Hanoi with Sapa Trekking & Cruising in Halong Bay","duration":7,"travelStyle":["Discovery","Family","Attraction-Based Hikes","Hiking & Trekking","Christmas & New Year"],"oldPrice":0,"price":410,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Trek to Cat Cat Village in Sapa","Visit the H’mong tribe","Explore the Surprising Cave"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/99990_6ac55b9e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/99990_6ac55b9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_38aecb89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_5e13b7eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_c8690924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_47419e14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_bd7049a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_7cff7935.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_70a8c3a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_99f6b12b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_31e76d60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_c7abc5f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_8625883e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_64991062.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_23eb0764.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_16302640.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_7f1d16ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_d3f1e712.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_70500f1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_52cf1bb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_9e4997a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_24fae359.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_0ee0c0c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_61b7ecb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99990_55803546.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1 HA NOI ARRIVAL","description":"Meal not included The car pick you up at the airport, take you get in the heart of the city. Arrive to the hotel after 40 minutes drive, check in and have a free day to walk around an Old Quarter, night market in Ha Noi down town, Hoan Kiem lake,... Overnight in Ha Noi hotel, locate in old quarter."},{"title":"Day 2 HA NOI CITY - TRAIN TO SAPA","description":"Meal included Breakfast, Lunch In the morning: 07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day. 09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam. 09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi.  11:00: Visit the Bat Trang  Pottery Village In the afternoon: 13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch. 14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day. 15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake. 16:00: Arrive back to your hotel. Tour ends ! Notes: •\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning. •\tThe itinerary can be changed due to weather, tide levels and operating conditions.  Come back your hotel at 17.00, you have free time for dinner. Until 21:00 pm: Our guide pick up you at your hotel for boarding the train to travel Lao Cai (soft sleeper, air condition, 4 berth/cabin)"},{"title":"Day 3 SAPA TREKKING","description":"(Cat Cat village) 7km trek Meal included Breakfast, Lunch, Dinner Morning: We will arrive at Lao Cai Train station in the early morning. Your tour guide will pick you up and take for 01hr drive to Sapa. The luggage is put in your hotel. Then, you have a good time to enjoy breakfast and take a shower. After breakfast at local restaurant, start trekking to Cat Cat Village, about 45 minute walk from Sapa, this is the village of Black H’Mong hill tribe. The village is on the slope of the hill and easy walking, rice and corn are grown here. Visiting Cat Cat village, you will have a chance to visit a big waterfall on the stream and the old Hydro Electric Power Station built by French people. That is the image of young women sitting by looms with colorful pieces of brocade decorated with designs of flowers and birds. When these pieces of brocade are finished, they are dyed and embroidered with beautiful designs. A note worthy is that H’Mong women use indigo plants and leaves to dye these brocade fabrics. And then they roll around and smooth section of wood covered with wax on fabrics to polish them, making their colors durable. Lunch at local restaurant. Afternoon:  Free time at leisure to relax. Evening: you are free to explore the charm of Sapa by night: enjoy roasted corn, baked eggs beside charcoal fire or go shopping. Especially on Saturday night, we highly recommend a stop at the Love Market which is one of unique cultures of ethnic minorities HMong, Dzao in Lao Cai in particular and North West of Vietnam in general. Dinner at local restaurant and overnight at hotel in Sapa."},{"title":"Day 4 SAPA TREKKING - TRAIN BACK HA NOI","description":"(Lao Chai - Ta Van village) 10km trek Meal included Breakfast, Lunch, Dinner After breakfast, start trekking from Sapa toward Muong Hoa valley where we can admire magnificent landscapes. Trek through Y Linh Ho village with Black H’mong tribe and keep trekking through lush rice – terraces towards Lao Chai village to experience Black H’mong people’s daily life and their traditional culture. Y Linh Ho village is a small commune composed by a dozen of small hamlets scattering on the very tough mountain terrain with high and steep mountains. There are some hundred inhabitants from the Black H’mong only living in this commune. They built their rudimentary houses on their farmland and mainly cultivate corn and dry rice on the steep hillsides. The only way to get to the commune is on foot from the main road. This village is home to the Black H'Mong people who wear very dark clothing in black and navy dyed with indigo (often seen on the hands of older H'Mong women). Then, arrive into Lao Chai and Ta Van villages. Have lunch with the locals in one of the local houses. Lao Chai & Ta Van Villages, about 8 km from Sapa town, where black H’mong and Giay people are living, it is also the beginning of the valley which is called Muong Hoa. From a high point of the main road, great view of the whole villages open wide to offer the marvelous panorama views, backed by high mountains and facing the river. Here you will enjoy the fresh air, see terrace fields, stream, discover and visit some Black H’mong families. You will have a welcome feeling at any house of the hospitable people there. You can interact them, learn about their culture and customs… The bus will pick you up from Ta Van village to Sapa Town. And transfer to Lao Cai Railway Station. Dinner at local restaurant near by the Railway Station and overnight on the train back to Hanoi (soft sleeper, air condition, 4 berth/cabin)"},{"title":"Day 5 HA NOI ARRIVAL - HA LONG BAY","description":"Meal included Breakfast, Lunch, Dinner  Arriving Hanoi in the early morning at 05:00am, the Vietnam Adventure Tours staffs pick you up, and escort you back to the hotel (no check in), leave a baggage at the reception and have a breakfast by yourself.  (Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities) 07.45 – 08.15 approx - Our guide will meet you at your hotel. The shuttle bus or private car pick up - Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta - Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours. 12 – 12.30 approx - Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing. - Check into your cabin. Time to refresh and unwind - Set sail as lunch is served - Join us for a typical local lunch in the dining room or at the outdoor dining area. Afternoon - Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising. - Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here - Heading back toward the sleeping area Early evening - Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset - An authentic Vietnamese menu is served - After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 6 HA LONG BAY - HA NOI","description":"Meal included Breakfast, Lunch (Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel) 06:30 For the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day. 07:00 – 08:00  Local breakfast is served 08:00 - Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn) - Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. 09:00 Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay. 10:00 You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served. 12:00 Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30-17:00. Overnight in HaNoi."},{"title":"Day 7 HA NOI DEPARTURE / SEE YOU AGAIN","description":"Meal included Breakfast Free time in Ha Noi old quarter before transfer to the airport for flight."}]},{"name":"Vietnam South","duration":10,"travelStyle":["Adventure"],"oldPrice":0,"price":835,"summary":"Enjoy everything Southern Vietnam has to offer. Begin in Ho Chi Minh with a visit to the war museum, then head to the coastal town of Mui Ne for the beach and sand dunes. Enjoy an evening in Nha Trang, before spending a couple of days at Ninhvana - an all inclusive backpacker resort. Finish off exploring the cultural hotspot of Hoi An on bike, and enjoy a bamboo basket boat ride through the coconut woods.","highlights":["Uncover Vietnam's history at Ho Chi Minh museum","Head to coastal town Mui Ne for beach and sand dunes","Explore the cultural hotspot of Hoi An by bicycle","Enjoy a bamboo basket boat ride through coconut woods"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_b1f0956d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_07b6f7ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_86007fd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_2048fe00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_be5ad6b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_c634eb5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_62830970.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Hoi An"],"timeline":[{"title":"Day 1 - Airport Pick Up","description":"Today is arrival day; feel free to arrive any time. You will be picked up from the airport by one of our drivers, who will be waiting for you. Then head to the hotel where your group leader will be waiting for you. Get excited to meet your new travels buddies for dinner and drinks in the evening."},{"title":"DAY 2 - CITY ORIENTATION & WAR MUSEUM","description":"Enjoy your day exploring Ho Chi Minh with a walking tour learning about the history & culture of the city then visit the National War Museum. Later we head off to the beautiful coastal desitination of Mui Ne."},{"title":"DAY 3 - MUI NE","description":"Have a relaxed morning, but prepare for a fun afternoon of sandboarding down the dunes of Mui Ne and a walk through the Fairy stream. We'll end the day with a group dinner and fun night out!"},{"title":"day 4 - Explore Mui Ne","description":"Enjoy a lie in or spend the morning relaxing by the pool and exploring the town. In the afternoon, we’ll hop on a bus to the city of Nha Trang and spend the night roaming around the markets or enjoying dinner and drinks with the perfect beach view."},{"title":"day 5 & 6 - ninhvana beach hideaway","description":"We leave Nha Trang early morning & will have a spot of breakfast before we jump onto our shuttle bus to spend the next two nights in Ninhvana. This epic spot is a backpackers paradise. It is up to you how you spend your time. You can choose from paddle boarding, kayaking, bike tours, guided trekking, and yoga classes. Facilities also include 2 swimming pools, beach volleyball courts, outdoor cinema & a basketball court. The perfect hideaway."},{"title":"day 7 - TRAVEL DAY","description":"Enjoy a leisurely morning & make the most of the inclusions of this magical place. We head back to Nha Trang late afternoon & arrive in time for our night bus to Hoi An. You should feel relaxed & raring to go for the next leg of our adventure after your time at Ninhava."},{"title":"day 8 - hoi an","description":"In and around Hoi An, Ho Chi Minh CityWe arrive early morning into Hoi An, drop our bags to our hotel, and enjoy a complimentary breakfast on arrival. As they prepare our rooms we head out to join a traditional Hoi An lantern making class where we learn how to make our own miniature lanterns. The afternoon is free for you to relax after a long journey, or you can explore the town’s markets & tailors."},{"title":"DAY 9 - BAMBOO BASKET BOAT TRIP","description":"Start the day with a bike tour around Hoi An old town and lunch at the locals family home. Then spend the afternoon crab fishing with the locals as we explore the 7 hectare water coconut woods in traditional bamboo basket boats. The late afternoon is free to chill or explore the lantern filled streets."},{"title":"DAY 10 - Chilled checkout","description":"It's time to say goodbye to one another as everyone heads off on their separate ways. Whether you’re continuing around Southeast Asia, or heading to the airport to go home, your Group Leader will help you to get you where you’re going."}]},{"name":"Hanoi and HaLong cruise to Ho Chi Minh 7 days","duration":7,"travelStyle":["Sightseeing","Family","Discovery","Christmas & New Year"],"oldPrice":0,"price":706,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Learn about the history of Hanoi","See the Dinh King temple","Explore the Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/99988_ade57eb0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/99988_ade57eb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_9d49fe67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_94c03036.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_e780e995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_2f7417f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_a7e8c466.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_c946d97e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_c109b75f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_21573498.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_fcc1c777.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_25f9da32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_9140cb80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_cbebc5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_d169169b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_5a6d85c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_12f70a3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_b20590ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_bbca18d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_4fa70e6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_41623c3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_548ffd3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_a45fcdd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_17a9521a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_bcfc61a0.jpg"],"destinations":["Hanoi","Tam Coc","Ninh Binh City","Halong Bay","Ho Chi Minh City","Cu Chi Tunnels","Ben Tre"],"timeline":[{"title":"Day 1 HA NOI","description":"Meal not included Morning: The car pick you up from Noi Bai airport (in Ha Noi) take you get in the heart of the city, it takes 40 minutes to drive. You will be free to discover many ancient and beautiful places such as: Old Quarter, Hoan Kiem Lake, Dong Xuan Market…. Evening: You also have chance to enjoy water puppet show and go wander to see its landscapes. You can try to go out by Cyclo, a traditional transports of Viet Nam. Overnight in Ha Noi."},{"title":"Day 2 TAM COC - NINH BINH","description":"Meal included Breakfast, Lunch 8.00 am:  After having breakfast, we will pick you up at your hotel, departure for Hoa Lu - Tam Coc, you will have a chance to enjoy the nice seeing of the rural areas on the way. 10.30: After arriving in Ninh Binh province, the guide will be responsible for taking you to visit Hoa Lu - the Ancient Royal capital of Viet Nam. In addition, we also visit Dinh King temple and Le King temple in the 10th century, getting knowledge about the heroic histories of this two Kings in Chinese Wars. Then, we continue to go to Tam Coc (10 km far from Hoa Lu). Our lunch will be served at local restaurant. After having lunch, you will get on bamboo boat which is rowed by the local people in Hoang Long River to visit Tam Coc (three caves) on the way. You pass through three caves that provide a brief respite from the excruciating summer sun. You will spend approximately two hours for going up and down the river and along the way, you also have seen local fisherfolk, village life along the river and, of course, the special limestone karst formations that bring fame for Tam Coc. It is a good idea for going biking. Besides, you will have an opportunity to visit real villages and appalling scenery by bicycle about one hour (from Restaurant). 17.00:  We take the car come back Ha Noi hotel. Overnight in Ha Noi."},{"title":"Day 3 HA NOI - HA LONG","description":"Meal included Breakfast, Lunch, Dinner (your hotel – Tuan Chau Marina  - Halong bay - Lunch – Amazing Van Gia floating village – Sunset party – Soi Sim island – Dinner – Fishing) 7:45 - 8:00 Am - Our guide will meet you at your hotel. The shuttle bus or private car pick up. - Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. - You will have a chance to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours. 12 – 12.30 noon approx - Arriving Tuan Chau Marina. Welcome aboard the cruise. Meet the captain, crew and join us for welcome cocktail as we tell you about life onboard. - Check into your cabin. Time to refresh and unwind - Set sail as lunch is prepared by our chef. - Join us for a relaxing lunch in the restaurant or on the outdoor dining area. Enjoy the stunning views of the Bay, its dramatic limestone islands as we sail through the calm waters. Afternoon - While we make our way to the amazing Van Gia fishing village, relax on the sundeck and watch the world go by or take an afternoon nap in your cabin. Middle afternoon arrive at Van Gia floating fishing village. - Drop anchor. - Our guide will give you some information and interesting facts about this fascinating village and its local community. - Disembark and you can choose which options when you visit the village by Kayak or local bamboo boat to visit the village. They will be your guides through their fishing village where you can meet the locals, see at first-hand what life is like living on the water, we are proud of our working partnership with, and support of this community. -    Our cruise will take you to the Soi Sim natural beach for swimming and snorkeling, you can enjoy our interesting games such as football, basketball. On the way cruising, you will enjoy with us the sunset party with fruits and wine as our complimentary - Back on board the cruise, we head towards the sleeping area. Early evening - Take an opportunity to refresh and then join friends for a pre-dinner drink in the bar. - Dinner is served in the restaurant or outdoor dining area if the weather is permitted, which is a gastronomic delight. After dinner, unwind in the bar where there is a selection of books, magazines and board games or watch a movie on our plasma TV; join some of our team to go cuttle fishing at night. Accommodation and overnight on boat"},{"title":"Day 4 HA LONG - HA NOI - HO CHI MINH CITY","description":"In and around Ho Chi Minh CityMeal included Breakfast, Lunch  (Tai Chi - Breakfast – Surprising Cave – Cooking Demonstration – Lunch – Your hotel and Farewell) 06:30 am - For the early risers join us for a Tai Chi session on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands. - Breakfast, coffee, tea served. After breakfast, we sail through the waters and pass by a number of caves and we drop anchor at Surprising (Sung Sot) Cave. - Disembark and visit Surprise Cave located on Bo Hon Island. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites 09:30 am We board the cruise again. Take time to refresh and relax before checking out. Bags can be left in the luggage store. You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served. 12 noon Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30/17:00. Free for dinner. 06:00PM Car transfer to the airport 08:00PM Flight Ha Noi – Ho Chi Minh. 10:00PM Arrive to Ho Chi Minh, transfer by car to the center, check in hotel. Overnight in Ho Chi Minh."},{"title":"Day 5 CU CHI TUNNEL","description":"In and around Cu Chi TunnelsMeal included Breakfast 8:30AM We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh city. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner. The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out! 02:30PM The tour finish at our company. Overnight in Ho Chi Minh."},{"title":"Day 6 MEKONG DELTA","description":"Meal included Breakfast, Lunch 08:00AM We depart from Ho Chi Minh City to My Tho City for one and half hours by bus. A smooth one and half hour bus ride passing the green rice fields, leads you to the beautiful rural MYTHO city. The morning trip continues on the motorized boat on the Tien River to the Qui (Tortoise islet). On the way, you will view the fishing port, stilt houses, boat-building workshops, the other Dragon, Phoenix and Unicorn Islet. The cruise will lead you through Bao Dinh canal to enter Ben Tre province, \"the country of coconut\", to see a typical agricultural model call \"Garden - Pond – Cage” then enjoy coconut candy mill and the relaxing honey tea. Then the amazing rowing boat trip on the small canal - fully covered by the shadow of the water coconut’s tree and cool breezes is something you cannot miss. Lunch will be served right in the heart of the orchard garden. Afternoon: After lunch, we will walk into the village, visit fruit garden, enjoy the tropical fruit while you are listening to the sound of \"Southern Vietnamese folk music\" performed by the islanders. Here we also can join the daily activities of the local people and enjoy the atmosphere of this beautiful natural countryside. Your expectations will be fulfilled by final boat trip back to My Tho on the Tan Thach natural canal. 03:00PM Drive back Ho Chi Minh, stop at Vinh Trang pagoda . Finish tour at 05:00PM"},{"title":"Day 7 HO CHI MINH DEPARTURE","description":"Meal included Breakfast Free time in Ho Chi Minh until your flight, car pick you up at the hotel and transfer to the airport. See you again."}]},{"name":"Vietnam Highlights","duration":9,"travelStyle":["Discovery","Christmas & New Year"],"oldPrice":0,"price":666,"summary":"Traveling from North to South is the best direction to research the traditional culture and history of Vietnam before you reach its modern daily life. Excellent to visit World Heritages of Vietnam and to extend to Cambodia at the end by riverway.","highlights":["Stroll around the town crammed with bustling silk and fish markets in Hoi An","Experience the underground life of Vietnamese soldiers in the Cu Chi Tunnels","Wrap up in Hanoi and explore the fascinating Old Quarter and specialty shops"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_c478f1ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5f67c353.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_93d5f612.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_f2b4f64a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_83087393.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e1b9cd7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_dbe593af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_daab6fb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_741bc409.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_603525a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_028440f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_6ef74016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_cc4bccbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5a082f65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_66cecf43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e58fab8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_9025ecea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_8675f31b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_12334c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_88ae41b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_1374354e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e54f53eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5938d91a.jpg"],"destinations":["Hanoi","Ninh Binh City","Halong Bay","Hoi An","Ho Chi Minh City","Cu Chi Tunnels","Mekong Delta"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL – CITY TOUR (-/-/D)","description":"In and around HanoiWelcome to Hanoi – Vietnam! Upon arrival flight, the local driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to the center of Hanoi then check-in at hotel.  Our tour guide will pick you at your hotel in the Old Quarter and then we get a Cyclo to Hoan Kiem Lake, one of the major scenic spots in the city and serves as a focal point for its public life to visit Ngoc Son temple and The Huc Bridge. And then we will stop at Hanoi Opera House, erected by the French colonial administration between 1901 and 1911.  After that, on the way to Water puppet show, we will see Sofitel Legend Metropole Hanoi Hotel - A Grand Dame of Southeast Asia that welcomes guests to experience her colonial grandeur and timeless elegance. Located steps from the Opera House in Hanoï’s French Quarter, this legendary property bring guests into intimate contact with the opulence of another era. A stage art invented by the Vietnamese peasants hundred years ago, with nearly 20 stories of Vietnam traditions and daily scenes will be the last activity. Finally we will take a walk on the streets of the old quarter and enjoy the Vietnamese traditional food: Beef noodles.  Night activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with life music, the young people of Hanoi and also foreign tourists. Hundreds of bars and pubs in the Old Quarter are also at your disposal. Or just simple spend your time at shopping malls or various boutique Shops. Please note: Standard check in time is 14:00 Start point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"DAY 2: HANOI – TAM COC – HOA LU - HANOI (B/L/-) - Group tour","description":"In and around Ho Chi Minh CityA 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Back to your hotel in Hanoi later on. Overnight in Hanoi. "},{"title":"DAY 3: HANOI - HALONG - OVERNIGHT ON BOARD (B/L/D) - Group tour","description":"From Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach islets to enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat near Titov Beach.  Please note! The program may be little varied upon the cruise you choose.  "},{"title":"DAY 4: HALONG – HANOI – DANANG – HOI AN (B/L/-) - Group tour","description":"In and around Hoi AnAfter breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf around 11.00.  Take shuttle bus back to Hanoi. Our driver shall wait for you en route to continue the transfer to Noi Bai International Airport for a short flight to Danang.  Welcome at the airport then transfer along the coast to reach Hoi An Ancient Town to check in. Overnight in Hoi An. "},{"title":"DAY 5: HOI AN – HALF DAY CITY (B/-/-) - Group tour","description":"After breakfast at hotel, you take interesting walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, enjoy the attractiveness of ancient houses Tan Ky & Phung Hung, as well as Japanese Bridge. Later we can stop at shrines or stroll into the market located by Thu Bon river, where you may find the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. Rest of day will be free on your own to discover the town or cycling (Bike rental on guest’s account) along Thu Bon to Cua Dai Beach. Overnight in Hoi An."},{"title":"DAY 6: HOI AN – HALF DAY SAIGON TOUR (B/-/-) - Group tour","description":"Relax till transfer to Da Nang Airport to take the midday flight to Saigon. You will be welcomed at the Tan Son Nhat airport and transfer to the hotel to check-in. Then we will join a half tour to have an overview of Saigon - the most dynamic city of Vietnam. Depart from your hotel to the Reunification Palace; this beautifully preserved palace was the residence of the President of the Republic of Vietnam. On April 30th 1975 the American War officially came to an end here. Enjoy a visiting the War Remnants Museum where you can see countless artifacts, photographs and pictures documenting the second Indochina war. Afterward, we visit The Notre Dame Cathedral, which was built in 1880, and the Old Post Office, which was built sometime between 1886 and 1891. It is one of the best examples of classical French colonial architecture. Our last stop would be at a local Market where you can practice your bargaining skills while shopping for souvenirs. Discover local life and culture. You’ll find some of the friendliest, liveliest, most convivial people in the city in here.  Overnight in Saigon."},{"title":"DAY 7: SAIGON – MEKONG DELTA – SAIGON (B/L/-) - Group tour","description":"After breakfast at hotel, picked by at hotel and drive heading to My Tho the homeland of coconut and family factories with local products like coconut candy, rice paper… Upon arrival, embark on the boat cruising on the mighty Mekong River viewing the life to the local people live along the banks. We stop at one of 4 islands in the area for sightseeing. Enjoy the fresh tropical fruits served in the heart of the garden accompanied by traditional southern Vietnamese folk music at the plantation. After that you will embark on the small boats rowed the local people thru the small cannels with water coconut tree to visit the local factories. There you will taste the honey tea and see the local people produce the coconut candy milk and of course you also can try it or stroll in the garden where the locals feed honeybee. We continue getting on the big boat to visit the vast area. Enjoy your lunch at a local restaurant nearby Mekong River. Afternoon, drive back to Saigon with stop to visit Vinh Trang pagoda, a famous pagoda in the area that its architecture is a mix of Chinese, Cambodian, and French culture. Overnight in Saigon. "},{"title":"DAY 8: SAIGON – CU CHI TUNNELS – SAIGON (B/-/-) - Group tour","description":"In and around Cu Chi TunnelsMorning visit Cu Chi Tunnels, one of the few remaining monuments to the Vietnam War. Beneath the ground lie 200 km of tunnels, dug by hand and inhabited by the forces of the Vietnamese guerillas during the conflict. At its peak, prior to the Tet Offensive in 1968, the tunnel complex was base to almost 10,000 troops. To this day, it remains one of the most impressive examples of how fierce the war used to be.  You even can try to crawl some dozens of m on the tunnel underground to have the real experience. Return to Saigon. Afternoon is at your own free time for shopping in the downtown where you can choose many lovely stuff at the very reasonable price. A few places to be mentioned to visit during your shopping is Ben Thanh Market – the center and typical market of Saigon; Saigon Square where is a few minutes walking from Ben Thanh Market; An Dong Plaza and its nearby Market; or Diamond Plaza and Thuong Xa Tax if you are seeking the high qualified and brand name goods.  Overnight in Saigon."},{"title":"DAY 9: SAIGON DEPARTURE (B/-/-)","description":"Breakfast at hotel. If your flight is in the  afternoon, you will have a half day more for the sightseeing and shopping before the departure till check out time and transfer to the airport for the departure flight back to your sweet home.   End of services! Please note: Standard check out time is around 12.00. End point\n Tan Son Nhat International Airport, Tan Son Nhat International Airport, Trường Sơn, Hồ Chí Minh, 736400, Vietnam "}]},{"name":"Hanoi to Hoi An - 8 days","duration":8,"travelStyle":["In-depth Cultural","Christmas & New Year"],"oldPrice":0,"price":945,"summary":"Travel between two of Vietnam's most charming destinations from the fading colonial chic of Hanoi to the attractive riverside merchant town of Hoi An with a night spent cruising the jade waters of Halong Bay and time spent exploring the royal citadel of imperial Hue, all in just 8 days.","highlights":["Explore the incredibly beautiful Halong Bay","Enjoy the sights of Hanoi","Take a guided sightseeing tour of Hue","Walking tour of Hoi An","Discover Tra Que village"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/89438_471bc1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/89438_471bc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_fd5cdbd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_5cbb6598.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_9072e00b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_ab7124a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_a5a00e30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_e601fe07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_86f79d02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_fb06fcf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_75ae0ded.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_12631e62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_b2bc5588.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_6a877d77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_96851fde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_3ba521ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_69b4a67b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_ffcbe12a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_af5989ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_697d5922.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"In and around HanoiXin Chao! Welcome to Hanoi, one of the region's most charming cities where French colonial elegance meets Asian spirit with attractive lakes, colourful pagodas and atmospheric streets. On arrival you will be met by our local representative and transferred to our joining hotel where the remainder of the day is at leisure for you to relax or head out and explore. For those able to arrive very early today or the day prior, why not get off the beaten track and explore Hanoi with us on our optional Back Streets of Hanoi add-on, which explores the quaint districts of Cho Buoi, Hoang Hoa Tham and Vinh Phuc, and also includes an exhilarating local experience - riding pillion, on taxi-motorbikes through a maze of tiny streets and along the shore of beautiful Ho Tay Lake."},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. After breakfast this morning we leave Hanoi and transfer to the jewel in Vietnam's scenic crown - the incredibly beautiful Halong Bay. Board a comfortable junk boat to explore the emerald waters of the bay, dotted with green islets, and enjoy lunch with a view onboard. This afternoon we visit Trinh Nu Cave, one of the finest caves in Halong Bay, covering an area of 2,000m² with a stunning array of stalactites and stalagmites. There's also the opportunity to go kayaking and enjoy a refreshing swim. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner."},{"title":"Day 3: Caves & Hanoi cyclo ride","description":"Halong Bay - Hanoi - Hue. Early birds can enjoy a beautiful sunrise and test their Tai Chi skills on the sundeck or enjoy a traditional massage - the perfect way to start the day. Before heading back to port this morning we explore the beautiful Sung Sot cave (Surprise Grotto), which is 10,000m² and consists of two major chambers. These spectacular chambers are spacious enough to hold thousands of people. On arrival back into Hanoi mid-afternoon we’ll explore the maze of streets in the French Quarter by cyclo (rickshaw), taking in highlights such as the Opera house and Ly Thai To Park. We then swap our wheels for a leisurely walk through ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street, from silk tailors to traditional medicine shops. Later this evening there's a chance to freshen up before boarding the overnight train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available."},{"title":"Day 4: Hue","description":"In and around HueArriving into imperial Hue this morning, we enjoy a guided sightseeing tour of the 19th-century capital. Visit the iconic Thien Mu Pagoda with its 21-metre-tall tower, and explore the walled fortress of the Imperial Purple Palace, ringed by a moat with elaborate arches and impressive ramparts, some of which lie in ruin. Later we travel into the countryside to visit the ancient mausoleum of Emperor Tu Duc, one of the wonderfully ornamental Royal Tombs of the Nguyen kings. This evening there is an optional sunset cruise on the Perfume River. Travelling by longboat, it's the perfect way to enjoy the city skyline."},{"title":"Day 5: Hoi An","description":"In and around Hoi AnHue - Road of the Ocean Clouds - Hoi An. Bidding farewell to Hue we take a scenic drive along the coast via the Hai Van Pass (Road of the Ocean Clouds) to Hoi An. We stop en route for a stroll along My Khe beach, nicknamed 'China Beach' by the Americans during the war. The beach is famous for being in Francis Ford Coppola’s movie ‘Apocalypse Now’. We arrive into the charming, old-world trading port of Hoi An later this afternoon. A short walking tour will introduce you to the highlights of this enchanting and historical town with highlights including the Chua Ong Pagoda, Chinese Assembly Hall, 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. During your stay in Hoi An, we offer a unique optional Hoi An Street Eats add-on, which explores the city’s most popular local haunts. Cruise the city the way the locals do, by vintage Vespa and enjoy lots of tasty Vietnamese Cuisine. Book early with your reservation consultant, as numbers are limited."},{"title":"Day 6: Rural Life in Vietnam","description":"Today will be spent out in the countryside learning all about the rural way of life in Vietnam. We'll reach Tra Que village by bicycle, a leisurely ride on flat roads that take us through ride paddies and farm land. The option of a taxi is available locally for those not keen on bike riding (payable locally). Once at the village we'll get our hands dirty learning about age-old farming practices and putting our knowledge to use by tending the fields and gardens. Lunch is a home-cooked affair with everyone mucking in. Later this afternoon return back to Hoi An on your bikes."},{"title":"Day 7: Hoi An - at leisure","description":"Today is completely free for you to enjoy Hoi An as you wish. Lose yourself in the cobbled streets lined with boutique restaurants, hip cafes, delightful craft shops and some of Asia’s best bespoke tailors (whose services come at a nominal price). If you prefer some R&R, lounge by the hotel pool or head to the beach. Alternatively you can opt for an excursion to the UNESCO-listed My Son sanctuary or enjoy a day trip to the popular Ba Na Hills mountain resort, where you will ride the second longest cable car in the world and walk along the striking Golden Bridge (book and pay locally)."},{"title":"Day 8: Hoi An","description":"Saturday. Today marks the end of your time in Vietnam. A departure transfer will be provided to take you to Danang airport in time for your onward flight."}]}]