[
  {
    "name": "Vietnam North-East Adventure tour to Lang Son, Cao Bang, Bac Kan",
    "duration": 10,
    "travelStyle": [
      "Hiking & Trekking",
      "Adventure",
      "In-depth Cultural",
      "Christmas & New Year"
    ],
    "oldPrice": 0,
    "price": 1930,
    "summary": "The North East mountainous areas of Ba Be Lake, Cao Bang and Lang Son offer opportunities for rugged jeep rides and stunning trekking routes. It is the less- known area of the north and is ideal for more hardy travelers craving a glimpse of some of the more remote ethnic minority people…",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/130231_c9276e6f.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_c9276e6f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_d784e3bf.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_c321ca67.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_a2ecdeaa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_9f470718.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_6d834d91.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_a33c6772.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_25e89d03.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_6048cba3.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_f777da87.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_f0a5dfbf.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_db20685d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_a54a43f1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_9282fa80.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/130231_ff9ca493.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: Arrival – Hanoi Sightseeing Tours",
        "description": "In and around HanoiOn arrival at Hanoi Airport, you are met by our tour guide and transferred to your hotel in Hanoi downtown. We will have a tour briefing in the afternoon and welcome dinner with Vietnamese delights. Overnight in Hanoi.  Summary:  Hotel transfer: Private AC vehicle – 45mins  Meal: Welcome dinner  Accommodation: Hotel in Hanoi "
      },
      {
        "title": "Day 2: Sightseeing Tours to Lang Son – Trekking Tours to Na Pang Village (That Khe) via Lang Son",
        "description": "After having breakfast in the hotel, we head north to Lang Son. Upon arrival in Lang Son we visit to Tam Thanh Cave before having lunch in local restaurant. After lunch we continue riding to That Khe, a small quiet town. The afternoon ride is very nice as we drive through beautiful area with forested mountains and peaceful tribal villages. Arrival in That Khe in late afternoon. We will walk to Na Pang Village in Trang Dinh district of Lang Son, here we will have dinner and overnight with a Tay family on their traditional house on stilt.   Summary:   Transfer: AC vehicle – 5hrs   Trek: 10km – Moderate  Meal: Breakfast, Lunch, Dinner   Accommodation: Homestay"
      },
      {
        "title": "Day 3: That Khe Trekking Tours to Na Pang Village – Pac Khoang Village – Homestay Tours",
        "description": "Breakfast at the homestay. We will start our trek to Pac Khoang – a village of Dzao ethnic minority. Today we will trek along valleys with on small paths that only used by the locals to go to their farms and surrounding villages. We will cross some small streams and tackle some easy hill slopes. Picnic lunch on the way. We would reach Pac Khoang around 5pm. Tonight, we will have dinner and overnight with a local family.  Summary :  Transfer: 10km by van  Trek: 16km – Moderate  Meals: Breakfast, Lunch, Dinner   Accommodation: Homestay"
      },
      {
        "title": "Day 4: Pac Khoang Village Trekking Adventure Tours to Dong Khe and Na Nieng Village – Homestay Tours at Pac Khoang Village",
        "description": "Breakfast and begin the trek around 8.30am. This morning we trek mainly downhill to Dong Khe where will have a rest for lunch. Dong Khe was the first major battle of the first Indochina war in 1950 between Viet Minh and the French and the war ended with Viet Minh victory, marked with the national hero Vo Nguyen Giap.  The morning trek is on village road and jungle trails with nice view of rice and corn fields along valleys. We reach Dong Khe at noon. After lunch we continue trekking to Na Nieng Village which is home of Tay ethnic minority. The trek in the afternoon is a bit harder than the one in the morning since we have more uphill terrain to tackle. We reach Pac Khoang Village around 5pm. Today we will have dinner and stay overnight in a local house.  Summary   Trek: 16km– Moderate  Meals: Breakfast, Lunch, Dinner   Accommodation: Homestay "
      },
      {
        "title": "Day 5: Na Nieng Village Trekking tours to La Village – Homestay Tour at La Village",
        "description": "Having breakfast in the homestay before starting the adventure of the day. Today we trek up and down on some forested limestone mountains to reach La, a beautiful village of Tay ethnic minority located in the valley among the magnificent mountain ranges. Today we have some stops for refreshment in remote tribal village of Na Nieng village which is surrounded by the lush forest and wild life, and we encounter during the trek. Dinner and overnight at homestay.  Summary :  Trek: 16km – Moderate  Meals: Breakfast, Lunch, Dinner   Accommodation: Homestay"
      },
      {
        "title": "Day 6: La Village Trekking Tours to Ta Lung – Cao Bang Adventure Tours",
        "description": "Breakfast at homestay and leave the village for Ta Lung, the border gate with China for 1 hour and one of the most dynamic economic zone of Phuc Hoa districts, Cao Bang province. We will trek through jungle and cross some small streams. Near Ta Lung we cross Bang Giang River on bamboo raft. The river flowing through Cao Bang ends at Tà Lùng border Gate, Hmong rural commune, Phuc Hòa (at the southeast of Cao Bang) before it returns to Guangxi, China. Lunch in Ta Lung before we take a van transfer to Cao Bang Town. Check in hotel in Cao Bang and spend the rest of the day relaxing in local café or wander around the town. Dinner and overnight in Cao Bang.  Summary :  Trek: 15km – Introductory  Meals: Breakfast, Lunch, Dinner  Accommodation: Hotel in Cao Bang"
      },
      {
        "title": "Day 7: Cao Bang Adventure Tours to Ba Be National Park.",
        "description": "Breakfast in Cao Bang and take a transfer to Ba Be National Park, popular Vietnam’s natural complex mainly consisting of Ba Be Lake, the supposed largest natural fresh water lake in Vietnam. The 150-m altitude makes it the Vietnam’s highest lake above sea level. Along the way, stop at Cho Ra Town, we will have lunch in a local restaurant before taking a relaxing boat trip on Nang River and enter the beautiful Ba Be Lake. We will cruise through Puong Cave, it’s about 30m high and 300m long, and completely passes through a mountain. A navigable river flows through the cave, making for an interesting boat trip. It costs 300, 000 VND for a boat and takes three hours. After the boat trip we reach Pac Ngoi, a village of Tay ethnic minority. Dinner and overnight in local house.  Summary   Transfer: 2.5 hrs  Meals: Breakfast, Lunch, Dinner   Accommodation: Homestay "
      },
      {
        "title": "Day 8: Kayaking Tours in Ba Be National Park",
        "description": "Breakfast at the homestay. We will have a short motorcycle ride to starting point where we begin a short walk through jungle. At some resting points we can have great view of Babe Lake. After 1hr trekking we descend to the lake shore and cross a bridge to An Ma Island. Visit to the temple on the island before we start kayaking. Leave the island we paddle to Dau Dang Waterfall we will have a picnic lunch in a beautiful natural setting of the waterfall. After lunch we paddle back to Babe Lake. If weather permits we can swim in the emeraude cool water of the lake. Paddle back to Pac Ngoi village for another night at the homestay.  Summary   Kayaking: 5hrs   Trekking: 1hr   Meals: Breakfast, Lunch, Dinner  Accommodation: Homestay"
      },
      {
        "title": "Day 9: Ba Be National Park Adventure Tours to Hanoi",
        "description": "After breakfast we take a short boat ride to the National Park Dock where we get on van for the ride back to Hanoi. Lunch on the way. Back to Hanoi at around 5pm. Check into your hotel and free afterward.  Tonight, we’ll have farewell dinner and overnight in Hanoi.  Summary   Transfer Babe – Hanoi: 240km   Boat cruise: 15mins  Meals: Breakfast, Lunch, Dinner   Accommodation: hotel in Hanoi "
      },
      {
        "title": "Day 10: Hanoi – Departure",
        "description": "Breakfast in the hotel and free until you are transferred to the airport for flight home.  Summary  Aiport transfer: 50mins  Meals: Breakfast"
      }
    ]
  },
  {
    "name": "SEE ALL EAT WELL: Vietnam Group Tour - 10 days",
    "duration": 10,
    "travelStyle": ["Discovery", "Adventure"],
    "oldPrice": 0,
    "price": 849,
    "summary": "When it comes to food experience, Vietnam owns a soft, memorable and convincing side that can satisfy the craziest hunger of worldwide foodies. For 10 days, join in the Vietnam small group tour, travellers will make the most of Vietnam, plus, taste all way from Hanoi to Ho Chi Minh City with iconic destinations and delightful dishes promoting best local flavours in each region.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/108911_cb9fbf4b.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_cb9fbf4b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c331b94.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_25b950b4.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c343e0f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c3021ed.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c33ad2e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c319aa4.jpg"
    ],
    "destinations": [
      "Hanoi",
      "Halong Bay",
      "Hoi An",
      "Ben Tre",
      "Ho Chi Minh City"
    ],
    "timeline": [
      {
        "title": "Day 1: HANOI ARRIVAL: WELCOME TO VIETNAM",
        "description": "In and around HanoiXin chào! Welcome to Hanoi, Vietnam. Hanoi, one of Asia’s most enchanting cities, is full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted by your guide and driver at Noi Bai International Airport for your transfer to the hotel.  We start our evening with a welcome dinner hosted in a lovely local restaurant where you can taste the various ethnic gastronomy specialties of Northern Vietnam. During dinner will learn about two important aspects of Vietnamese life that will prove very useful during your trip – basic language and chopsticks handling skills. We will teach you the most common phrases and expressions that can used during the many encounters to be expected on our trip; and do not fear the use of chopsticks, we will teach you all the tips and tricks that can be used to really enhance your Vietnamese experience.  Overnight in Hanoi.  Meals: Breakfast, Lunch, Dinner  Accommodation: May de ville Old QuarterStart point\n Pick up at any arrival Time, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "
      },
      {
        "title": "Day 2: SLICES OF LIFE IN HANOI",
        "description": "Get ready to see Hanoi as very few others do. This tour is the perfect blend of iconic cultural sites of Hanoi and offbeat districts to sample some genuine local life. The guide meets you in the hotel lobby and off we go. After a short car transfer to the South of Hanoi through a busy urban area, we veer off the main road and enter a very special district. It suddenly feels like stepping back in time, into the 1960’s when Hanoi was a quaint capital populated mostly by modest workers. Wander around these narrow alleys covered in colourful market stalls, feel the incredible vibe and let the guide tell you the story of these unusual big yellow buildings. We have a coffee break before transferring to the Temple of Literature. We visit the little gem of architecture and huge piece of history. For lunch, we suggest to walk to a nearby street food shop. There are several options, our favourite would be the Bun Cha flame-grilled pork meat served with sticky rice noodles.  In the afternoon, we continue to the garden of the Presidential Palace, where you can also see the One-Pillar Pagoda and the house on stilts where Ho Chi Minh lived. Afterwards, we have a quick fresh beer in a local bia hoi, the Vietnamese version of a pub. We return to the hotel in the afternoon. The rest of the day is at your own leisure.  Overnight in Hanoi.  Meals: Breakfast, Lunch & Dinner  Accommodation: May de ville Old Quarter"
      },
      {
        "title": "Day 3: TRANQUILITY IN HALONG BAY",
        "description": "We gather in the lobby at 8.00 AM for our departure to the majestic Halong Bay. We drive across the Red River delta and reach the coast a little before noon. We then embark on a beautifully crafted junk for an overnight cruise in the legendary seascape of Halong Bay. Once on board, we are served a delicious seafood-based lunch, while the surrounding limestone outcrops make for a truly magical setting. In the afternoon, we reach a less travelled area where we will devote ourselves to pure relaxation. The program is not fixed and depends on the time of the year and weather, but there will be an opportunity to visit a cave as well as explore a floating village or do a little bit of kayaking over the course of these 2 days. We end the day on the sundeck as the sun sets on this magical seascape. This evening, you can enjoy an aperitif or attend a cooking demonstration before dinner. Overnight in a comfortable private cabin with an en-suite bathroom.   *Note:  Cruise itinerary and schedule are subject to change due to weather, tide levels and operating conditions. Swimming or kayaking excursions may be cancelled due to poor weather. The tour leader will not be accompanying guests on the shuttle bus or boat. There will be an on-board cruise manager who will be available for guests should they have any questions or concerns.  Meals: Breakfast, Lunch, Dinner Accommodation: Bhaya Classic Cruise – Deluxe Cabin"
      },
      {
        "title": "Day 4: FROM EMERALD WATERS TO THE ANCIENT TOWN HOI AN",
        "description": "In and around Hoi An, Ho Chi Minh CityFor those early birds, start the day with a Tai Chi class or enjoy a cup of tea or coffee as the sun rises and illuminates the surrounding seascape. We then continue our exploration of the bay. Upon returning to the boat, check-out of your cabin and enjoy a lunch while cruising back to the pier. We disembark and transfer to Hanoi airport for your flight to Danang. On arrival in Danang, you are greeted and driven to your hotel in Hoi An.  Overnight in Hoi An.  Meals: Breakfast, Brunch Accommodation: Blue Sky Hotel"
      },
      {
        "title": "Day 5: UNIQUE FLAVOURS OF HOI AN",
        "description": "This morning after breakfast, we start our walk across the enchanting ancient town of Hoi An. Follow your guide as you meander your way through the beautiful streets and narrow alleys, which are bordered by ancient yellow-walled houses. We reach a market where you can spend some time exploring the colourful stalls and the variety of foods and souvenirs on offer. Try some local delicacies before we venture further into the town. The guide will show you various places of interest and will also arrange some spontaneous food tastings as we walk.  Afternoon is at your own leisure.  Overnight in Hoi An.  Meals: Breakfast, Lunch Accommodation: Blue Sky Hotel"
      },
      {
        "title": "Day 6: GETTING ACTIVE IN HOI AN",
        "description": "At 8.00 AM this morning, our guide will pick you up from your hotel, and equipped with bicycles you will set off directly towards Duy Vinh Commune. The picturesque cycling route is highlighted with rice fields, local gardens and markets. Stop as often as you wish to take photographs or engage in some laidback chats with locals (using our guide as a translator). There is also time to pay a visit to a local family who are still practicing the craft of weaving sedge mattresses using traditional techniques.  After about 1.5-hour cycling, it is time to hop into a kayak and off we go to explore the river. As you paddle towards Cam Thanh cocopalm forest, you will notice that the area is a large mangrove ecosystem unique to Hoi An, and the scenery is just spectacular. To end an active morning, your lunch will be served at a local farm with tasty Vietnamese food. Take as much time to relax as you wish before transferring back to your hotel. The rest of the day is at your own leisure to enjoy the town or some time relaxing on the beach.  Overnight in Hoi An.  Meals: Breakfast, Lunch Accommodation: Blue Sky Hotel"
      },
      {
        "title": "Day 7: READY, SET, SAIGON",
        "description": "You are met in the lobby of your hotel for a short transfer to Danang airport. Embark on your flight to Ho Chi Minh City, the big metropolis of the South. You are greeted upon arrival and driven to your hotel in the city centre, historically called Saigon. Dinner is served at a local restaurant.  Overnight in Saigon.  Meals: Breakfast, Dinner Accommodation: Muong Thanh Centre Hotel"
      },
      {
        "title": "Day 8: DISCOVERING THE LIVELY DISTRICTS",
        "description": "Your guide meets you in the hotel lobby at 8.00 AM and off we go for an original morning to explore the less travelled trails of this fascinating city. Prepare to travel back in time as we first head to District 3, where we visit the oldest café in town which was opened in 1938. Enjoy a refreshment, before we immerse ourselves into the genuine Saigon popular culture. Walk through a massive street-market, as you gently elbow your way between conical hats and mobile street food sellers to exit at Chung Cu. Here you will find yourself in the heart of Saigon’s working-class, which remains mostly unchanged since the 1960’s. Marvel at the size of these old residential buildings as we walk through and into the Ho Thi Ky Quarter. A place known for its spectacular flower market, and its maze of quiet narrow streets. A place also surprisingly famous for its Khmer delicacies since the 1990’s. Here you will be able to enjoy some of these traditional snacks. We continue deeper into District 10, a fantastic destination where every street corner holds a surprise and a chance to amaze you. Our urban adventure ends at one of the most famous street-food streets in the city, time for lunch!  In the afternoon, we take a digestive walk around the colonial buildings of the District 1. We start at the Independence Palace, continue to the Notre-Dame Cathedral and the Saigon Central Post office before we get to the beautiful Nguyen Hue street where the City Hall stands. To complete the day, we take you to taste a few brews in one of the most famous craft beer taprooms of the country, located in Pasteur Street.  We transfer back to your hotel afterwards, and end the day at your own leisure.  Overnight in Saigon.  Meals: Breakfast, Lunch Accommodation: Muong Thanh Centre Hotel"
      },
      {
        "title": "Day 9: A DAY IN MEKONG DELTA",
        "description": "Departing from your hotel at 8am, we drive out of the metropolis and after about 2 and a half hours we reach a less travelled region of the delta, about 30-kilometres away from the mouth of the mighty Mekong River. We hop onto our private boat and start our exploration. We will meet some friendly locals, learn more about their daily lives and navigate the Mekong. After visiting a local factory and an ancient communal house, we reach a small island for lunch at a local guesthouse.  In the afternoon, we visit a honey-bee farm before hoping onto bikes and cycling narrow pathways across the island. We stop at another local farm to unveil the secret of Sâm jelly and sample it. We continue across some orchards and transfer onto a small sampan to explore a thick mangrove. We return to the mainland, where our vehicle awaits to return us to Ho Chi Minh City. We arrive at your hotel in the late afternoon.  Overnight in Saigon.  Meals: Breakfast, Lunch Accommodation: Muong Thanh Centre Hotel"
      },
      {
        "title": "Day 10: TAM BIET SAIGON",
        "description": "The day is free at your own leisure until your transfer to the Tan Son Nhat International Airport for your departure flight. We wish you a pleasant flight!End point\n Drop off at the Airport (Flexible date within 48 hours after tour ends), Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736900, Vietnam "
      }
    ]
  },
  {
    "name": "Northern Vietnam Tour to Hanoi, Halong Bay and Sapa",
    "duration": 8,
    "travelStyle": [
      "Adventure",
      "Mountain Hikes",
      "Attraction-Based Hikes",
      "Hiking & Trekking",
      "In-depth Cultural",
      "Christmas & New Year"
    ],
    "oldPrice": 0,
    "price": 999,
    "summary": "This 8- day tour offers all the richness of the Northern Vietnam key sites, its ancient culture of Hanoi capital city combined with magnificent scenery of Halong Bay, friendly people in Sapa. Every aspect of the trip is exciting, from the Old Quarter of Hanoi, to the top luxury cruise on Halong Bay and the unique culture of the ethnic minority people in Sapa.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/137096_9c778d62.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_9c778d62.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_d5f477ad.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_3ba87995.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_d7fb6bfa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_d7a9d8cd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_729f5f2f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_ad98cb0e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_82f1e6bd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_41487d2b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_3a6849c9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_1917fd83.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_3ddb70f5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_36ac5d49.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_952de891.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_329bb6fc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_5c4b58bf.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_2596c992.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_dfe5c772.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_dbf369e7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_ebca7e15.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_75489a07.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137096_8e43f7e0.jpg"
    ],
    "destinations": ["Hanoi", "Sapa", "Halong Bay"],
    "timeline": [
      {
        "title": "DAY 1: HANOI – ARRIVAL (-/-/-)",
        "description": "In and around HanoiUpon arrival in Noi Bai Airport, you’ll receive cordial welcome and comfortable transfer to hotel. If time permits, enjoy an orientation tour by cyclo around the old quarter streets, an interesting introduction of the city. Like other big cities, Hanoi is hustling and bustling, with thousands of people riding motorbikes, the most convenient means of transportation in the city.  O/N in Hanoi."
      },
      {
        "title": "DAY 2: HANOI CITY TOUR –NIGHT TRAIN TO SAPA (B/-/-)",
        "description": "Today you’ll be on a full day tour to discover the most outstanding attractions of Hanoi. First, pay a visit to the complex of memorials to Ho Chi Minh to know his amazing life. Continue to the One Pillar Pagoda and the Temple of Literature to gain understanding of the two driving forces in Vietnam culture.  Afternoon visit the Museum of Ethnology which exhibits a large collection of artifacts about the cultures of the 54 ethnic groups in the country. Next, hustle back to the peaceful Hoan Kiem area since there is a water puppet show at the popular Thang Long Water Puppet Theater awaits. Water puppet is a unique traditional art form and expression of cultural identity. The shows capture Vietnamese traditions; farming, tending buffaloes, and catching fish; entertainment, like swimming contests and lion dancing; and historical legends with traditional music.  The one-hour show is a fun and insightful look into Vietnamese culture enjoyed by both adults and children. Later, you will be transferred to a hotel to have a break and shower before boarding the night train to Sapa.  Overnight on the train."
      },
      {
        "title": "DAY 3: LAO CAI –SAPA- TREKKING TO LAO CHAI, TA VAN (B/L/-)",
        "description": "The train arrives at Lao Cai station early this morning. Transfer to Sapa where your breakfast is prepared & served. Then, you’ll join us on a trip to the villages of Lao Chai & Ta Van, a home of the H’mong and Dzay. The day is devoted to a beautiful hike through the breathtaking scenery of Sa Pa valley. On road, you’ll interact with the hospitable locals, pass the beautiful rice terraces, a small suspension bridge and fascinating collection of rock carvings. These engravings depict some beautiful images of man, stilt houses and some beautiful decorative patterns. Today, we’ll share our lunch in a village home.  Overnight in Sapa."
      },
      {
        "title": "DAY 4: SAPA EASY TREKKING TO CAT CAT, THAC BAC (B/-/-)",
        "description": "After breakfast at hotel, find yourself among hundreds of the locals while you are leisurely trekking to Cat Cat village which is inhabited by the Hmong. On arrival at the village, take a visit to a home to learn how they live. Relax by a beautiful waterfall before pick up and transfer to Thac Bac, another highlight of Sapa that we should never miss.  Back to the hotel and spend the rest of your day at leisure.  Overnight in Sapa."
      },
      {
        "title": "DAY 5: SAPA FREE &EASY- EXPRESS BUS BACK TO HANOI (B/-/-)",
        "description": "After breakfast, enjoy your free time until a transfer overland by bus back to Hanoi.  Overnight in Hanoi"
      },
      {
        "title": "DAY 6: HANOI –HALONG BAY, OVERNIGHT ON BOAT (B/-/-)",
        "description": "After having breakfast at the hotel, we journey north- east to Vietnam’s greatest natural wonder, Halong Bay. On arrival, we’ll board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Kayaks are also available if specified at time of booking.  Spend the night on board."
      },
      {
        "title": "DAY 7: HALONG BAY - HANOI (B/-/-)",
        "description": "Wake up to fresh coffee before cruising back to the shore. En route the junk weaves through impressive rock formations that invite comparisons from fighting cocks to dragons and even further! After lunch we disembark and return to Hanoi. En route, take a detour to the 500 year pottery village of Bat Trang.  Overnight in Hanoi."
      },
      {
        "title": "DAY 8: HANOI DEPARTURE (B/-/-)",
        "description": "After breakfast, free until transfer to the airport for your departure flight home."
      }
    ]
  },
  {
    "name": "Toughest Northern Vietnam Motorbike Tour to Ba Be, Ha Giang, Sapa, Lai Chau, Son La",
    "duration": 8,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1120,
    "summary": "Within 8 days, this Northern Vietnam offroad motorbike tour from Hanoi offers you full chance to taste Ha Giang, Ba Be National Park, Ba Be lake, Mai Chau valley and Sa pa – they are the most attractive destinations in North of Vietnam. You will have great album of stunning landscape of mountainous region and colorful hill tribes after 8 day riding motorbike in northern Vietnam. This is one of the most favourite in our Vietnam Motorbike Tours Collection.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7a458c.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7a458c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7bc25a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7c27e9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7c8a91.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7cef0e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7d55e8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7dd42d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7e3922.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7e9e66.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d7f04bc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d80c204.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d812953.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d818c6d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d81f2ad.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d8257f2.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d82be7c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e0037d832371.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d0b7fa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d1b1e7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d212ef.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d27632.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d2d669.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d332e5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189725_5e017b4d38b97.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: HANOI MOTORBIKE TOURS TO BA BE LAKE (240 KM)",
        "description": "In and around HanoiThis great motorcycle tour to the north of Vietnam starts at around 8 AM. We try the best to avoid busy city road in the morning until Cho Chu town (in Thai Nguyen province) where we have lunch. After lunch, we surely have enjoyable motorcycle ride to Ba Be because the roads have less traffic and give you a lot of grand mountain view. At about 4 PM. We arrive Pac Ngoi – a beautiful village of Tay people which located peacefully at Ba Be lake’s side. Diner and stay with the Tay’s family. Ba Bể Lake (Vietnamese: Hồ Ba Bể – Ba means “Three”, Bể is from the Tay language word pé, meaning “lake”) is the largest natural lake in Vietnam. It is located in Nam Mẫu commune, Bắc Kạn district, Bắc Kạn Province in the northeastern region of the country. Having been formed approximately 200 million years ago, the lake is surrounded by limestone cliffs, which in turn are covered by primary forests.  The lake comprises three zones named Pé Lầm, Pé Lù, and Pé Lèng. Three rivers, named Năng, Tả Han, and Nam Cường, are the main inflows of the lake. The Năng river enters the lake through a large waterfall called Đầu Đẳng. In the lake there are also three islands, named Án Mã, Khẩu Cúm, and Po Gia Mải (literally “Widow’s Island”). Ba Bể Lake is a featured geographical science and is a biodiversity reservoir. It is a part of the Ba Be National Park. It is home of a range of animals and plants."
      },
      {
        "title": "Day 2: BABE LAKE MOTORCYCLE TOURS TO MEO VAC (170 KM)",
        "description": "Saying good bye to  the family, we’ll ride motorbike on the back-roads through some rustic villages and the jungle. Then we motorbike across some streams. This promise to be a great day for off-road Vietnam motorbike touring. We will stop in Bao Lac town for lunch and then continue the beautiful motorcycle tour Northern Vietnam to Meo Vac by taking a scenic route climbs over many Passes where we can enjoy beautiful mountain ranges and the Nho Que river.  Arrive at Meo Vac by 5.00PM. Dinner in town, Hotel stay.  Meo Vac Town is located in the heart of the Dong Van Rock Plateau, which was recognized as part of the Global Geo-Park Network in 2009, the Dong Van old quarter is home to age old and unique architecture near Ha Giang Province’s border with China. Therefore, the Motorbike tour to Ha Giang, Dong Van is always the best choice of the motorcyclists."
      },
      {
        "title": "Day 3: MEO VAC MOTORBIKE TOURS HA GIANG (180 KM)",
        "description": "Today’s ride promises to be the highlight of this motorcycle trip in north Vietnam as we will visit one of the most remote land in Motorbike Tour Around Northern Vietnam – 8 DaysVietnam where we can see many ethnic groups with their unique cultures and imposing mountains such as : Pi Leng Pass – one of the 4 longest and most beautiful passes in North Vietnam, the Rock Plateau, the Vuong palace in Dong Van, The “Heaven Gate” in Quan Ba.   This is for sure the best motorbike ride in Vietnam with many interesting and amazing things in every meter of the road.  Arrive Ha Giang in the late afternoon.Dinner and stay with the other Tay’s family or stay in hotel in Ha Giang city Ha Giang, 300 km away from Hanoi, located at the highest latitude in Vietnam. It is surrounded by Cao Bang, Tuyen Quang, Lao Cai, and Yen Bai. It shares a border with China in the north. Many ethnic minorities, including the Dao, H’mong, Tay, and Nung, live in Ha Giang province Vietnam.  "
      },
      {
        "title": "Day 4: HA GIANG MOTORBIKE TOURS TO SA PA (220KM)",
        "description": "Today we head straight towards the North-western mountain where the main Fanxipan Mountain range dominates the road until Sapa. The road is very smooth with a good view of green mountain, rice fields between lovely villages of the hill tribes. After a short break in Lao Cai to see Chinese border, we will have very beautiful motorbike ride up to Sapa. This motorbike ride is up and up till 1.600 meters above sea level. It offers a great  view of mountain with terrace fields and it must be one of the best motorbike ride in North Vietnam. Arrive in Sapa at around 5: 00 pm, overnight at hotel in Sapa."
      },
      {
        "title": "Day 5: SAPA MOTORBIKE TOURS THAN UYEN (110 KM)",
        "description": "You are free to explore Sapa until 1.30PM, check out hotel and we continue the route to Than Uyen, we will make a splendid climb up from Sapa to the top of the highest road pass in Vietnam (Tram Ton Pass). Crossing into Lai Chau Province at over 2000m above sea level. This is a short motorbike ride but could be the most enjoyable motorbike tour from Sa pa. The ride offers you amazing view of the Hoang Lien mountain ranges for miles and miles. We arrive in Than Uyen by 5.00PM.  Dinner and overnight in hotel."
      },
      {
        "title": "Day 6: THAN UYEN MOTORBIKE TOURS TO MU CANG CHAI – PHU YEN (220 KM)",
        "description": "We keep riding up and down into a forested and high mountain region populated by H’mong peoples, We will hike up a very high mountain pass before descending into a mountainous tea-growing region. Soon after we follow a long the valley floor covered in a sea of rice surrounded by Hmong and Thai’s villages all the way to Phu Yen. Especially, after lunch in Mu Cang Chai – a famous land for terrace fields so the ride through Mu Cang Chai is another highlight of this Motorcycle tours North Vietnam. Arrive Phu Yen town at 5:00Pm. Overnight at hotel."
      },
      {
        "title": "Day 7: PHU YEN MOTORCYCLE TOURS TO MAI CHAU VALLEY (150 KM)",
        "description": "It is a short motorbike tour to Mai Chau valley, but it’s also a enjoyable motorbike ride! It offers some different views from the days before with different hill tribes. Right after Phu Yen town, we will have great ride along the Da River lake on the winding road between the river lake and mountains. it is likely a motorcycle tour on the coastline in the central Vietnam.   After crossing the Da river by a ferry, we will motorcycle up and up to Moc Chau plateau where we stop for lunch, then after lunch, we’ll make a turn to the quiet mountain road named Hua Tat – it’s built by the French during the war time and nowadays, it is like a forgotten so the short ride to Mai Chau is also the best part of the Northern Vietnam Motorbike Tour. Arrive Mai Chau at 4:30 PM. Stay in Poom-coong village of the Thai people – Home stay."
      },
      {
        "title": "Day 8: MAI CHAU MOTORCYCLE TOURS BACK TO HANOI (150KM)",
        "description": "Getting up late, feel the peaceful life of the local by walking around the valley and then start the motorbike ride back to Hanoi at around 10 AM. After 2 beautiful mountain passes – Thung Khe and Doc Cun we will have lunch and then join the high way back to Hanoi. We will be back to the hotel before rush hours in order to end the 8 Day motorbike tour in north Vietnam safely."
      }
    ]
  },
  {
    "name": "9 Days in Northern Vietnam",
    "duration": 9,
    "travelStyle": ["Discovery", "Family", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 495,
    "summary": "Exploring Northern Vietnam in 9 Days will give you an unforgettable memory. Discovering the interesting Hanoi old quarter with 36 streets. Visiting ancient Hoa Lu capital in 10th century. Cycling in the local village and rice fields in the countryside to see the local daily life of local farmer. Taking photo of stunning view in Halong Bay. Trekking on terrace rice fields with breathtaking landscape in Sapa. Experiencing the local Hmong people in mounatainous Sapa. Still have more and more waiting for you exploring. Let’s enjoy!",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/141811_6d284a1f.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_6d284a1f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_8314e63a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_1b7e629a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_91c601aa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_d215fb31.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_b212a80f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_ab7fa7ce.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_cc2d6ffc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_c2902639.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_1bf2eea1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_7049d7fd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_0b237521.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_3b728c78.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_b0d51949.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_176d0273.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_353ece64.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_b27e6099.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_c10e5269.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_ca6089f0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_48cdc569.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_4cc2618f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_6d8e839f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_fb555e91.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/141811_56504217.jpg"
    ],
    "destinations": [
      "Hanoi",
      "Tam Coc",
      "Ninh Binh City",
      "Halong Bay",
      "Sapa"
    ],
    "timeline": [
      {
        "title": "Day 1: Hanoi city arrival – Hotel check in (Meal: No)",
        "description": "In and around HanoiWelcome to Hanoi city. Driver is waiting for you at the airport to transfer you to the hotel in the center. Check in the hotel and free time to take your first step exploring the city. Overnight at the hotel in Hanoi. Please Note: Hotel check-in time: 13:00 Start point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "
      },
      {
        "title": "Day 2: Ninh Binh – Hoa Lu ancient capital – Tam Coc Rowing boat – Cycling 1 Day (Meal: B,L)",
        "description": "8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour. Bus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside. Keep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you. Then, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat. After Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam. After rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country. 16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point. 18:30: Arrive the hotel in Hanoi old quarter.  Overnight at hotel in Hanoi "
      },
      {
        "title": "Day 3: Hanoi Street Food Walking Tour (Meal: B,D)",
        "description": "Today, you have free time to visit Hanoi city until 6:00 PM, Your tour guide picks you up from hotel to our meeting point. Star the journey discovering the local foods in Hanoi like street Foodie. Walking through some old streets there, you will discover historical and culture tourist site, visit Heritage House to learn more about Traditional House of Ancient Hanoi. You have chance to enjoy “Bánh Cuốn” from famous local restaurant,  “Bánh Cuốn” (steamed rice rolls) which  is steamed and made from rice flour and filled with a savory ground pork and  ear mushroom mixture. Then stop off at traditional space to try “Che” (sweet gruel)- a very special and famous sweet soup Hanoi old quarter. Then, keep walking to enjoy a bowl of  Pho- taste of  heaven that you could not be anywhere better than Hanoi. Spring roll is very meaningful dish for tourist; many restaurant and company organize cooking class. You will visit Local market to see people show all products, it is really interesting to learn about lifestyle and culture of local people. You will enjoy Bun Cha (Vermicelli with grill pork), an absolute highlight of authentic local culinary you must try as anyone’s the first visit of Hanoi. Then you will savor the real taste of Hanoian at a small corner of Hanoi by drinking a cup of “Bia Hoi”(Fresh beer).  Finally, get the chance to enjoy a very special flavor of the Vietnamese-“Cafe Trung”( egg coffee). 9:00 pm: Turn back to the hotel.  Overnight at hotel in Hanoi. "
      },
      {
        "title": "Day 4: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)",
        "description": "8:00 – 8:30 am: Meeting your tour guide at the hotel and depart for Halong bay trip. Short break-time on the haft way for relax before reaching Halong Bay.  Vietnamese Lunch will be served after check in the cabin on cruise and cruising through the bay to the center. Exploring the beauty of Surprising cave – the most beautiful and biggest one in the bay. Leisurely time hiking and swimming on the beach of Titop island. Get back the boat for Sunset Party with fresh fruit & local glass wine. Dinner with delicious local dishes and free evening to feeling Halong Bay. Overnight on the cruise "
      },
      {
        "title": "Day 5: Halong Bay – Hanoi (Meal:B,L)",
        "description": "You should wake up little early to enjoy the Sunrise in Halong Bay. After breakfast, doing Kayaking by your own to discovering Halong Bay.  Learning how to make Vietnamese Spring-roll in Cooking Demonstration on the cruise. Lunch time while cruising back the harbor. Get on the bus back to Hanoi. 17:00: Arrive the hotel in Hanoi. Overnight at hotel in Hanoi city "
      },
      {
        "title": "Day 6: Hanoi city Past & Present by your own – Water Puppet Show (Meal:B)",
        "description": "Today, you have the free time to visit Hanoi old quarte by your own. Exploring the local life and culture, custom. Tasting several local foods. 17:00: Guide will take you to the Water Puppet Theatre for show and come back the hotel by your own. Overnight at hotel in Hanoi.  "
      },
      {
        "title": "Day 7: Hanoi – Sapa – Ylinh Ho – Lao Chai – Ta Van village ( Meals: B, L, D )",
        "description": "12km trekking through the terrace fields to homestay. 06:30 – 07:00: Shuttle bus and tour guide will pick you up at your hotel and transfer you to sleeper bus. Heading to Sapa with short break-time on the half way. 12:30 pm: Our guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip. From Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy. Trekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time. On trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo. Arrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other. Evening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you. Overnight at guide’s house. "
      },
      {
        "title": "Day 8: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )",
        "description": "You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether. You have the options: + Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields. +Or, you can tell your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields. Get back to Sapa town by shuttle bus. You still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi. 15:30: Get on the sleeper bus and come back Hanoi city. 21:30: Arrive Hanoi. Shuttle bus will transfer you back to your hotel/stay in Hanoi Old Quarter. Overnight at hotel in Hanoi "
      },
      {
        "title": "Day 9: Hanoi Departure (Meal: B)",
        "description": "Today, you have free time to relax, shopping the souvenir for your family, until driver transfers you to Hanoi airport for your flight out. Trip ends. Please let us know if you want to extend your trip Please note: If you are Solo traveller booking for Share room, you will stay at Share Dorm Room during the vacation.End point\n Noi Bai International Airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "
      }
    ]
  },
  {
    "name": "Challenging Vietnam Motorcycle Tour to Ha Giang, Cao Bang via Sapa, Bac Ha, Yen Bai",
    "duration": 9,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1318,
    "summary": "In this motorbike tour, we not only travel to the impressive destinations in Ha Giang Province, but also explore the amazing natural beauties in mountainous northern Vietnam with a ride from Hanoi to Vu Linh Village in Yen Bai to glance at the beauty of Thac Ba lake then Luc Yen and Lao Cai. From here, we’ll keep on our motorbike tour rolling to Bac Ha market then Ha Giang with Dong Van, Meo Vac, Bao Lac and Ba Be lake in Cao Bang before riding back to Hanoi.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa07675.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa07675.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa20ba8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa29bff.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa31ec8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa3ba79.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa44b41.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa4bd5e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa52993.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa5a14d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa623ed.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa69754.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa715ab.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa79459.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa8184d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5dff98aa89d12.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5e002e3a23253.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189715_5e002e3a2fbcf.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: HANOI MOTORCYCLE TOURS TO VU LINH VILLAGE ( THAC BA LAKE, YEN BAI)",
        "description": "In and around HanoiWe start our Motorbike tour by riding on to dyke roads following Red river to Thac Ba lake. See beautiful countryside, rice and green tea fields. Then we turn to the little road to Vu Linh village, where populated by Dzao ethnic minority by the side of Thac Ba lake, very friendly people and the welcome is exceptional. Home-stay in Vu Linh  Summary: Distance:  180 km Meals: Lunch, Dinner Accommodation: Home-stay"
      },
      {
        "title": "Day 2: THAC BA MOTORCYCLE TOURS TO LUC YEN (YEN BAI)",
        "description": "After breakfast, we take the boat ride on Thac Ba lake, the biggest man-made lake in Vietnam. Stop by an island for swimming and discover the particularities of this area: the way villagers paddle their boats, the exotic and odd animals living around, the quiet and peaceful beauty of this huge lake, the lifestyle of the Dao among the thousands of islets. Back to home-stay for lunch. Get on the road, take a half-day ride through palm forest all the way to Luc Yen and stay in a family in the Tay territory. It’s a great home stay and the hosts are very welcoming. Home-stay in Luc Yen Summary: Distance:  100 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"
      },
      {
        "title": "Day 3: LUC YEN MOTORCYCLE TOURS TO BAC HA (LAO CAI)",
        "description": "Motorcycle to get out to Road 70 up north to Khanh Hoa T-junction, turn to Road 153 to Bac Ha.This small highland town fills up to choking point on Sunday morning, when visitors flood in to meet the Flower H’mong at the morning market. Compared with Sapa, tourism is still in its infancy here and during the week the town has a deserted feel. Bac Ha is a good base to explore the surrounding highlands. Around 900m above sea level, it is noticeably warmer than Sapa. One of Bac Ha’s main industries is she manufacture of alcoholic home brews (rice wine, cassava wine and corn liquor). The corn hooch produced by the Flower H’mong is so potent it can ignite! Bac Ha is the only place in Vietnam where you’ll find this particular moonshine; there’s an entire area devoted to it at the Sunday market. Overnight in Bac Ha. Summary: Distance:  140 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"
      },
      {
        "title": "Day 4: BAC HA MOTORCYCLE TOURS TO HA GIANG CITY",
        "description": "After breakfast, beautiful motor ride on the track to Xin Man and Hoang Su Phi on many small; back roads with scenic mountain views. Xin Man is right on the border between Vietnam and China. It is, as of this writing, well hidden and completely surrounded by wild mountains and forests. There’s a single road from Xin Man to Hoang Su Phi. Hoang Su Phi is among the most untouched area of Ha Giang Province of Vietnam. The area was separated from the mainstream society until very recently. Passing Hoang Su Phi, we will be charmed by the pristine beauty of the wild mountains and the authentic culture of the local ethnic groups which include: the Nung, the Flower H’mong, the Tay and the Ha Nhi People… After lunch, join the main road heading up to Ha Giang City, where we stop for the night and apply for a permit. Summary: Distance:  200 km Meals: Breakfast, Lunch  Accommodation: Hotel"
      },
      {
        "title": "Day 5: HA GIANG MOTORCYCLE TOURS TO DONG VAN",
        "description": "After getting the permit for motorbike tour in border areas at Ha Giang’s Immigration Police, we ride on small challenging mountain roads (but incredibly beautiful) on the land of colorful mountain hill-tribes. Head up the Ma Pi Leng Pass. Here is yet another amazing place, with cloudy mountain ranges and the poetic Nho Que river winding off in the distance. It is really difficult to find the exact words to describe Ma Pi Leng Pass, located between Dong Van and Meo Vac, near the northernmost tip of Vietnam, as a painting of astonishing beauty and magnificence that captures the eyes of all viewers and nature lovers. Ride on a zig-zag track until reaching Vuong Family’s Residence, 14 kms before Dong Van. Vuong Family was considered the King of the Hmong People in Dong Van, Ha Giang. Their residence was built in the scenic valley of Sa Phin with Chinese architecture. The whole house was built out of wood and rock only. The rocks for the buildings were imported from China. Vuong Family Residence is a masterpiece of man work in the valley of heavenly beauty of Sa Phin. This is a remote area and we can meet the hard-working local people here. It is inspiring to see how they survive as they manage live in the rocks. When we reach Dong Van Town we will have some extra time to wonder the ancient streets lined with H’mong homes of clay bricks and tiles roofs built centuries ago. Summary: Distance:  160 km Meals: Breakfast, Lunch Accommodation: Hotel"
      },
      {
        "title": "Day 6: DONG VAN MOTORCYCLE TOURS PASSING MEO VAC TO BAO LAC (CAO BANG)",
        "description": "The road is still under construction and tracks what make the ride relatively long in spite of few kilometres. The landscape is among the most beautiful of Vietnam, and the slow tempo is only more appreciable. We motorcycle across the wild regions of the mythical province of Ha Giang, Meo Vac is included. It shares the border with Dong Van District of Ha Giang Province and Bao Lam District of Cao Bang Province. Meo Vac has most of the terrain in the Rock Plateau of Dong Van and above 1000m above sea level. Meo Vac has a harsh climate in the winter which is from November to April with dry and freezing cold weather. It is inhabited by different ethnic minorities including the H’mong, the King, Tay, Dzao…Most ethnic groups have maintained their culture untouched from the outside world. In the afternoon, we stop for the night at Bao Lac, the ethnic crossroad of Northeast Vietnam. Many other ethnic groups on the two sides of the border meet at the market every Sunday. Summary: Distance:  80 km Meals: Breakfast, Lunch Accommodation: Hotel"
      },
      {
        "title": "Day 7: BAO LAC MOTORCYCLE TOURS TO BA BE NATIONAL PARK (BAC KAN)",
        "description": "Beautiful motor ride down to Bac Kan Province. Few passes from where you can dominate the area. The road is easy but there are many blind curves before we turn to Ba Be lake (inside Ba Be National Park). Ba Be National Park is an abundant bioreserve area containing the world’s only fresh-water karst lake and several rare species of fauna and flora. Ba Be lake in VietnamThe biodiverse 10,048ha park – home to 1,268 species of flora and fauna, a series of caves and a gigantic fresh water lake – was established in 1992 by the Vietnamese Government to preserve forest ecosystems in the northeast. Ba Be is home to over 3,000 people from the ethnic minorities of Tay, Nung, Dao and Mong, who live in 13 villages within the park. The Tay people have inhabited Ba Be area for centuries and make up 58 per cent of the population within the park’s boundaries. Motorcycle into Bac Ngoi village, which is located inside Ba Be National Park. Our home-stay in Tay’s family is right by the side of Ba Be lake with wonderful and peaceful view. Summary: Distance:  140 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay"
      },
      {
        "title": "Day 8: BA BE MOTORCYCLE TOURS TO NA HANG (BAC KAN)",
        "description": "Half-day boat-ride on the lake to the other side, where we can explore Dau Dang waterfall on Nang river. As one of the 27 ASEAN heritage gardens, Ba Be has the potential to attract naturelovers with its 450ha natural fresh water lake, and 553 species of mammals, birds, reptiles, amphibians and fish. According to a survey from the Viet Nam Institute of Geo-sciences and Mineral Resources, over 11,000 years ago, an earthquake caused a collapse of the subterranean Nang River, creating a natural dam which led to the formation of Ba Be Lake. Lunch in a village near by Dau Dang waterfall before back to home-stay. Get on our bikes and take a half-day ride on countryside to Na Hang. This Nung’s village is in middle of nowhere. We have last experience on the trip to share the meals and house with locals. Summary: Distance:  80 km Meals: Breakfast, Lunch, Dinner Accommodation: Home-stay / Hotel"
      },
      {
        "title": "Day 9: NA HANG MOTORCYCLE TOURS BACK TO HANOI",
        "description": "Easy motor ride in the morning, passing peaceful villages and rice fields before reaching very busy road in the afternoon. Traffic is getting worst and worst on Road 3, the way back to Hanoi, so we should be back before rush hour. Finish our trip around 4 pm  Summary: Distance:  160 km Meals: Breakfast, Lunch "
      }
    ]
  },
  {
    "name": "Spectacular Northern Motorbike Tour to Ha Giang via Ba Be, Cao Bang, Dong Van",
    "duration": 5,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 750,
    "summary": "This our 5-day Vietnam Northern Motorbike Tour to Ha Giang brings tourist a full view of Ha Giang and other northern destinations of Vietnam such as Ba Be Lake in Bac Kan Province, Bao Lac in Cao Bang and Dong Van Geo-park in Ha Giang and then to Lao Cai / Sapa for a night train back to Hanoi!",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de29a7aa.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de29a7aa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2a6077.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2b0361.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2bacbc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2c74ac.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2d7708.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2e7b18.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de2f24f2.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de316df0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de3207dd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de32a53c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de334a1a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de33f28a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de347fbc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff8de35012b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189714_5dff900996392.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: Hanoi Motorbike Tours to Ba Be lake – 240 km",
        "description": "In and around HanoiThis Vietnam motorcycle tour to Ha Giang starts at around 8 AM from eastern suburbs of Hanoi. We try the best to avoid busy city road in the morning until Cho Chu town( in Thai Nguyen province) where we have lunch. After lunch, we surely have enjoyable motorbike ride to Ba Be lake because the roads have less traffic and offer you a lot of grand mountain view. At about 4 PM, we arrive Pac Ngoi – a beautiful village of Tay people which located peacefully at Ba Be lake’s side. Diner and stay with the Tay’s family. Overnight in Ba Be lake – home stay. Ba Bể Lake (Vietnamese: Hồ Ba Bể; Ba means Three, Bể is from the Tay language word pé, meaning “lake”) is the largest natural lake in Vietnam. It is located in Nam Mẫu commune, Bắc Kạn district, Bắc Kạn Province in the northeastern region of the country.Having been formed approximately 200 million years ago, the lake is surrounded by limestone cliffs, which in turn are covered by primary forests. The lake comprises three zones named Pé Lầm, Pé Lù, and Pé Lèng. Three rivers, named Năng, Tả Han, and Nam Cường, are the main inflows of the lake. The Năng river enters the lake through a large waterfall called Đầu Đẳng. In the lake there are also three islands, named Án Mã, Khẩu Cúm, and Po Gia Mải (literally “Widow’s Island”).Ba Bể Lake is a featured geographical science and is a biodiversity reservoir. It is a part of the Ba Be National Park.  * Summary: + Distance: roughly 240km + Riding duration: nearly 8 hours + Meals: Lunch + Dinner + Accommodation: Homestay in the village"
      },
      {
        "title": "Day 2: BABE LAKE MOTORBIKE TOURS TO BAO LAC – 150 KM",
        "description": "After the early breakfast with the family, Take a short walk about 1km to the pier and then enjoy one and a half hour boat cruise around the largest natural lake in Vietnam – Ba Be. Lunch with the Tay family, In the after noon we will have  off-road motorbike tour in Vietnam. We will ride the bikes through a small part of Ba Be National Park,many beautiful villages and some streams, the tour will give you a lot of challenge and amazing beauty of mountain area in northern Vietnam. Arrive Bao Lac at 5 PM. Stay in town – Hotel.  * Summary: + Distance: roughly 150km + Riding duration: nearly 5 hours + Meals: Breakfast & Lunch + Accommodation: Hotel"
      },
      {
        "title": "Day 3: BAO LAC MOTORBIKE TOURS TO THE DONG VAN GLOBAL GEO-PARK IN HA GIANG. – 140 KM",
        "description": "Today, we will have relaxing, easy and very enjoyable motorbike tour to Dong Van. Start the day at about 9 Am, ride slowly along the Gam river to enjoy the green mountains and mountains. We will be in Meo Vac for lunch. After lunch, it could be the best motorbike tour in Vietnam to ride cross Ma-Pi-Leng pass ( It’s one of the longest and most beautiful passes in North Vietnam. We can have hundreds of stops for picture of The Dong Van Rock Plateau Global Geo-park, and the local ethnic minorities. Stay overnight in Dong Van town – Hotel.  * Summary: + Distance: roughly 140km + Riding duration: nearly 5 hours + Meals: Breakfast & Lunch + Accommodation: Hotel"
      },
      {
        "title": "Day 4: DONG VAN MOTORBIKE TOURS TO HA GIANG. – 150 KM",
        "description": "This motorbike tour to Ha Giang goes through the poorest part of Vietnam but the scenery is most imposing where you will be surpri se to see many ethnic groups with their unique cultures and amazing mountain view of the Rock Plateau, the Vuong palace in Dong Van, The “Heaven Gate” in Quan Ba. This is surely the best Vietnam motorbike tour in the northern part with many interesting and amazing things in every meter of the road. Arrive Ha Giang in the late afternoon. Dinner and stay with the other Tay’s family.   * Summary: + Distance: roughly 150km + Riding duration: nearly 5 hours + Meals: Breakfast & Lunch + Accommodation: Hotel"
      },
      {
        "title": "Day 5: HA GIANG VIETNAM MOTORBIKE TOUR TO LAO CAI – NIGHT TRAIN BACK TO HANOI – 180 KM",
        "description": "After breakfast with family, we have smooth motorbike ride on road No 2 for a bout 40 km, and then we will take a turn to a small road to Pho Rang – the road is small and somewhere bumpy but scenery is completely different from what you saw in days before. The scenery is the wonderful mixture of green mountain, rice fields and graceful villages of the ethnic people. Lunch is in Pho Rang and after lunch we have easy Vietnam motorbike tour to Lao Cai on the winding road with the different view from what we’ve seen. Before getting into town center we will have short visit to China and Vietnam border, then motorcycle straight to the Lao Cai Railway Station and put all the bikes on the train. Finish the Vietnam motorbike tour to Ha Giang and take a night train back to Hanoi after dinner in Lao Cai.  * Summary: + Distance: roughly 150km + Riding duration: nearly 5 hours + Meals: Breakfast & Lunch + Accommodation: On train"
      }
    ]
  },
  {
    "name": "Scenic Saigon Motorcycle Tour to Nha Trang via Mui Ne and Da Lat, Bao Loc",
    "duration": 5,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 780,
    "summary": "This Vietnam Motorbike Tour from Saigon to Nha Trang via Mui Ne, Da Lat within 5 days / 4 nights bring riders to explore all stunning beauties of Southern Vietnam. You will have a chance to visit almost the remote areas of central highlands Vietnam, also some famous attraction from Saigon up to Nha Trang. Especially, it is also the recommended motorcycle tour on the coastline of Vietnam.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e619ef.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e619ef.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e6dff6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e74864.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ec16f5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ec6e9d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ecc02a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ed1093.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e05780bd8d20.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ed9857.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ede99f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ee3a01.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ee8837.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373777fd6c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373968bd09.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373968bd0c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4374566438d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4374566438f.jpg"
    ],
    "destinations": ["Ho Chi Minh City", "Mui Ne", "Dalat"],
    "timeline": [
      {
        "title": "Day 1: SAI GON MOTORBIKE TOUR TO LA GI: 150 KM (L,D – HOTEL STAY)",
        "description": "In and around Ho Chi Minh CityWe start the Saigon motorbike tour at 8:30. From the city center of HCMC, we hit the city roads to the northeast of Saigon to La Gi town. We will have some interesting visits of Minh Dam Army base, Thuong Chieu Monastery pagoda and Binh Chau hot water spring. After lunch, we will have great short motorbike ride on the coastal roads to La Gi. We’ll be at La Gi at about 4:30 pm.Start point\n Your Hotel, Hồ Chí Minh, Vietnam 08:00"
      },
      {
        "title": "Day 2: LA GI MOTORCYCLE TOURS TO MUI NE: 130 KM (B,L,D – HOTEL STAY)",
        "description": "It’s short day ride but it’s surely the highlight of this short Saigon motorbike tour. We will have one of the best coastlines motorbike tours in Vietnam today. After breakfast, motorcycling up to the north along the coast to Mui Ne, we’ll pay more visits to Temples, colorful markets of local people and some interesting old towers of the Cham. We will be in Mui Ne at around 4:00 pm. Spend the rest time of the day at one of the most beautiful beaches in the world – Mui Ne."
      },
      {
        "title": "Day 3: MUI NE MOTORBIKE RIDE TO BAO LOC: 160 KM (B,L,D – HOTEL STAY)",
        "description": "After early breakfast in the hotel, we leave the town to visit the fairy springs, red canyons white sand dunes and some rustic villages who do fishing everyday to earn living or growing dragon fruits besides coffee plantation…. Then we continue motorcycle tour to the Central Highlands, along the way we will do more stops to visit the K’ho ethnic minority villages to learn about the culture of their wild life in the edge of the Central Highlands. We would arrive in Bao Loc after visiting Dambri waterfall (90 meters high). Overnight in Bao Loc."
      },
      {
        "title": "Day 4: BAO LOC MOTORCYCLE TOUR TO DA LAT: 140 KM (B,L,D – HOTEL STAY)",
        "description": "Start the motorbike tour to Da lat at about 8:30 am. It’s a short motorbike ride up to Da Lat but it offers a beautiful view of mountain and green plantation. We will see plenty of green tea farm, mushroom fields, vegetable and flower farm, coffee plantations and visit some villages who produce silk and learn how to make a good silk from silkworm. This must be another highlight of the motorbike tour central highlands Vietnam. We will be in Da Lat at 4:00 pm."
      },
      {
        "title": "Day 5: DA LAT MOTORBIKE TRIP TO NHA TRANG: 150 KM (B, L)",
        "description": "In and around Nha TrangThe last day of the Saigon motorbike tour start at 8:30 am, most of the ride is on sealed, smooth roads except some small “monkey bridges” just after Da Lat town however it offers one of the best coastline motorbike ride in Vietnam. We still do some stops to visit King Bao Dai’s palace or peaceful villages of the hill tribe along the way. The 5 day enjoyable Vietnam motorbike tour will finish at around 4.30 PM in the coastal city of Nha Trang. Check in the hotel of your choice and then enjoy your relaxing time on the beach. "
      }
    ]
  },
  {
    "name": "Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau",
    "duration": 10,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1310,
    "summary": "This Saigon Motorbike Tour to Dalat, Nha Trang, Mui Ne, and Vung Tau is the perfect way to discover not only evergreen Mekong Delta and romantic highlands city of Dalat but also the Southern part boasting the stunning sunny beaches in Nha Trang, Mui Ne and Vung Tau where you have chance to sit back and relax.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c365826.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581504fb8b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505501a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581503543e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815049fc0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505b2da.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505fd60.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815066398.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581506d182.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c36b570.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c371135.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c376cf7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c37c6be.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: ARRIVAL – HO CHI MINH CITY (-/-/-)",
        "description": "In and around Ho Chi Minh CityUpon landing at the airport at around 15:05, you’ll be welcome then escorted to your hotel for a check-in. The rest of time, you’ll be free to explore Saigon by night. Overnight at hotel.Start point\n Your Hotel, Hồ Chí Minh, Vietnam 08:00"
      },
      {
        "title": "Day 2: HO CHI MINH CITY MOTORBIKE TOUR TO MEKONG DELTA (B/L/-)",
        "description": "In the morning, our motorbike tour will be started from your hotel in Ho Chi Minh City Saigon Motorcycle tours and depart to Can Duoc Market – a stunning rural market (40 km). The scene changes from bustling streets with buildings and noise to peaceful rice paddles with cottages and small houses on the way – in the open air of “steel horses”.  Then take a rural route to My Loi Ferry. Some stops en route to see farmers working on paddy fields. Cross Vam Co river by the ferry then ride to Go Cong then Tan Hoa (25km). Have some stops en-route to visit an incense workshop, through some remote villages and reach Tan Thanh beach for seafood lunch. Then continue riding from this Mekong Delta beach to My Tho(45km), the heart of the Mekong Delta.  Arrive My Tho, stop by the bank of Tien Giang River. Take a boat trip on Mekong River to Phoenix Island where local handicrafts and sweets from coconut are being produced. Enjoy fresh seasonal fruits and traditional live music and songs performance. Take a short ride to a typical local house to taste some homemade honey-tea.  Proceed by small sampan boats through the small canals and side arms of the river to observe the Tiengiang motorbike tours daily life along the river banks with a stop and short leisurely walk at the Turtle Island. Ride through Rach Mieu suspension-bridge for a breath-taking view of the Upper Mekong and transfer to Ho Chi Minh city (70 km). The trip ends at your hotel.  Summary: Distance: 190 km Meals: Lunch"
      },
      {
        "title": "Day 3: HO CHI MINH MOTORCYCLE TOUR TO BAO LOC – LAM DONG (B/L/D)",
        "description": "Leave all chaos of Saigon behind, we’ll keep rolling the wheels to the Central Highlands and stop in the K’ho ethnic minority village to learn the culture of their wildlife at the edge of the Central Highlands. Arrive in Bao Loc after visiting Dambri waterfall – about 90 meters high then Tam Chau tea plateau & Linh Quy Phan An pagoda. Overnight in Bao Loc.  Bảo Lộc is a city of Lâm Đồng Province in the Central Highlands region of Vietnam. Bảo Lộc is famous for its registered trademark: B’lao tea. As of 2003, the town district had a population of 151,915. The district covers an area of 229 km2.  Meals: Breakfast, Lunch, Dinner Overnight at hotel in Bao Loc"
      },
      {
        "title": "Day 4: BAO LOC MOTORBIKE TOUR DALAT ( 140 KM – 5 HOUR RIDE) (B/L/D)",
        "description": "In and around DalatLeaving Bao Loc for Dalat, visit the green tea farms, the cascade waterfall, Pongour, mushroom farms, silkworm villages, and silk processing chains, coffee plantations, mushrooms, vegetable, and flower farms, visit the highlights of the city like Crazy House, Flower Market, Dragon Pagoda. Arrive in Dalat around 5 pm.  Đà Lạt, the capital of Lâm Đồng Province in southern Vietnam’s Central Highlands, is centered around a lake and golf course and surrounded by hills, pine forests, lakes, and waterfalls. Known as the “City of Eternal Spring” for its distinctive temperate climate, Đà Lạt was developed as a resort by the French in the early 1900s, and many reminders of its colonial heritage remain.  Meals: Lunch, Dinner."
      },
      {
        "title": "Day 5: DA LAT OFFROAD MOTORBIKE TOUR TO BUON MA THUOT VIA LAK LAKE ~ 200 KM (B/L/D)",
        "description": "After having breakfast at hotel, we’ll jump on our iron horses then keep riding to Buon Ma Thuot via Lak Lake. On the way, you can take a quick visit at the crazy house, travel along the country road to see the entire agriculture farm such as vegetable farm, greenhouse flower farm, coffee plantation, a visit of silkworm factory, rice wine making and elephant waterfall.  Arrive at Lak Lake with a visit to the “Jun” Minority Village (M’Nong). Crossing the Lak Lake by boat to Lieng minority village, with many opportunities of taking pictures of people farming and fishing Overnight at hotel in Buon Ma Thuot."
      },
      {
        "title": "Day 6: BUON MA THUOT OFFROAD MOTORCYCLE TOUR TO NHA TRANG ~ 210 KM (B/L/-)",
        "description": "In and around Nha TrangToday, we say goodbye to the land of Coffee – Buon Ma Thuot to ride straight to Nha Trang. On the way, you have half an hour trekking to the top of the Elephant rock mountain, back on the road again, on the back of the motorbikes you will have opportunities to observe the panorama view of rice paddy field along the road, and then, a quick visit to the Ede Minority Village.  One more waterfall name: Dray Nao waterfall between Lak Lake and Nha Trang, Descend along the Phoenix Pass (affect by Agent Orange) and a visit the Hot spring, the brick-making factory, 20 km ride along the beach will lead you to the most Charming beach in Vietnam: Nha Trang beach then check in at hotel. Overnight at hotel in Nha Trang."
      },
      {
        "title": "Day 7: NHA TRANG SIGHTSEEING TOUR (B/L/-)",
        "description": "08h30: Pick up at hotel & transfer to Cau Da harbor. 09h00: Take a boat trip to visit Bays in Nha Trang, which includes 19 big & small islands with imposing beauty. 10h00: Visit Hon Mun’s Preservation Area of Oceanic creatures. On this island, you will be steeped in the transparent cool water & diving to explore the coral reefs having been formed for 200 years with many kinds of precious fishes. 12h00: Come to Hon Mot Island for lunch on the boat. After having lunch, you may engage in a dancing & singing performance with many other visitors all over the world meanwhile enjoy free fruits & grape wine. 13h30: Arrive at Hon Tam Island, visit the statue of My Nhan Ngu & participate in sporting events in the water like Jeski, Gliding, volleyball….(Pay for yourself) 15h00: Visit fishing Village to learn more about their daily local life & get on the small bamboo boat to floating rafts. 16h00: Get back to Cau Da pier & transfer to hotel. Overnight at hotel in Nha Trang."
      },
      {
        "title": "Day 8: NHA TRANG MOTORBIKING TRIPS TO MUI NE CAPE (B/L/-)",
        "description": "After having breakfast at hotel.  8h00: Our motorbike tour will start leaving to Mui Ne, on the way we will stop by Ca Na and some other beautiful beaches to take a break as well as photos or if needed, you can jump on the sea to soak up yourself. Upon arrival in Mui Ne, we’ll check-in at hotel then ride to a local restaurant for lunch. This afternoon, we will ride our bikes to visit Fishing villages, Hong Stream, Golden Sand Dunes and Flying Sand Dunes, right here you can engage some optional outdoor games to make funs by yourself such as skating on sand or flying a kite…  Last stop is at Bau Sen – a vast sand dune which has inspired numerous photographers for many years The rest of time, you could take a bath on Mui Ne beach and view sunset.  Overnight at hotel in Mui Ne"
      },
      {
        "title": "Day 9: MUI NE MOTORBIKE TOUR TO VUNG TAU VIA PHAN THIET (B/L/-)",
        "description": "Breakfast at your hotel & check out. Back on our “steel horses” and we will keep riding along the coastal paved road, passing quiet pine forest of Loc An and we arrive Binh Chau hot spring, take a mud bath and relax on Hot Spring Lake. Having lunch at a local restaurant en-route.  In the afternoon, we’ll keep on riding to Phuoc Hai hamlet, we will be impressed by the beautiful scenery, especially the sections of road straddled by mountains and beaches then Minh Dam historical mountain and Long Phuoc Tunnels before reaching Vung Tau. Upon arrival, you’ll check in at hotel and relax by yourself.  Overnight at hotel in Vung Tau."
      },
      {
        "title": "Day 10: VUNG TAU MOTORBIKING TOURS BACK TO SAIGON – DEPARTURE (B/L/-)",
        "description": "Breakfast at your hotel & then you’ll be at leisure on the beach or hanging around Vung Tau city till the time to ride back to the Tan Son Nhat airport in Saigon for a flight home."
      }
    ]
  },
  {
    "name": "Wandering Northern Vietnam Motorbike Tour to Ta Xua , Mu Cang Chai, Y Ty, Sapa",
    "duration": 7,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1010,
    "summary": "This 7-day Northern Vietnam Motorbike Tour to Ta Xua, Mu Cang Chai, Y Ty, Sapa, Bat Xat, Mai Chau, Bac Yen in Son La takes you to explore the best authentic northwest of Vietnam with rice terraces, dirt rides through jungles, high mountains & remote villages cum waterfalls and rivers … to meet the friendly locals and taste their great local foods …",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675a6549.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675a6549.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675bd5e4.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675c46c0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675cad7f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675d15f7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675d8e68.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675df08c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675e7a51.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675f0233.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176760ee43.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017676147e3.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176761b696.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176762375b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176762af59.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e01767630d95.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017676375ee.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176763ee10.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955b8a77.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955c7d6e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955d0eab.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955d7c21.jpg"
    ],
    "destinations": ["Hanoi", "Mai Chau", "Sapa"],
    "timeline": [
      {
        "title": "Day 1: HANOI MOTORBIKE TOUR TO MAI CHAU VALLEY (HOA BINH)",
        "description": "In and around HanoiStart our motorbike tour by leaving Hanoi on dyke roads to avoid the heavy traffic around 9.am, we ride our motorcycles west to Mai Chau, an area of beautiful landscape and home to the Thai ethnic minority. We will motorcycle on Highway 6 passing extensive farming lands comprising a sea of paddy fields split by tree-lined roads punctuated by limestone karst scenery.  After a light lunch in Hoa Binh Province, we cross Thung Khe, one of the most beautiful mountain passes in North Vietnam then descent to the mountain valley settlement of Mai Chau. After dinner we join performance, where you can dance and share a range of special liquors (rice wine) with the locals. Overnight in a house-on-stilts of the Thai people. Summary :"
      },
      {
        "title": "Day 2: MAI CHAU MOTORCYCLE TOUR TO BAC YEN (SON LA)",
        "description": "In the morning, we take a short walk around village to discover local life. Life in the countryside starts early so by sunrise there is a wealth of activity. The Thai women are masterful weavers who ensure that there is plenty of traditional-style clothing to buy in the village centre.  You will see women weaving on looms under or inside their houses in the village We can buy some handmade traditional-style clothing, knife or cross-bow. After breakfast in home-stay, we say goodbye to villagers and leave Mai Chau around 10 am. We ride from Mai Chau to the direction of Moc Chau, where we have lunch. This highland town produces some of Vietnam’s best tea and is a good place to stock up.  The surrounding area is also home to several ethnic minorities, including Green H’mong, Dzao, Thai and Muong. Moc Chau boasts a pioneering dairy industry that started in the late 1970s with Australian (and, later, UN) assistance. The dairy provides Hanoi with such delectable iuxur us as fresh milk, sweetened condensed milk and little tooth-rotting bars called “Banh sua”.  After lunch, we turn to the less travelled Road 43 leading to the Da River, crossing the reservoir of Da river at Van Yen ferry, then ride on a beautiful winding secondary road until Bac Yen where we stay in a basic guest-house.  Summary:"
      },
      {
        "title": "Day 3: BAC YEN MOTORCYCLE TOUR UPTO TA XUA PEAK – MU CANG CHAI (YEN BAI)",
        "description": "In this morning, after having breakfast you’ll be jumping up the iron horse again to get over zigzag & curving spiral roads with wild beautiful flowers such as Do Queen & Tao Men to reach Ta Xua peak which is located at the height of 2.600m above the sea level. We then will ride on the narrow backbone of dinosaur to view cloud flying beneath our feet.  In the morning, we keep motorbiking across Lung Lo pass before head up on Road 32 . During the First Indochina War, the 15km-long Lung Lo Pass, used by the Vietnamese resistance force to transport weapons, goods and food during the Dien Bien Phu campaign of 1954, was heavily bombed by the French in order to sever the front lines from the rear. Lung Lo Pass, situated in the northern province of Yen Bai, was also recognized as a national heritage by the ministry. After lunch, we ride through the Mu Cang Chai massif, almost as high as the Fansipan. From the top, it offers one of the most beautiful views of North Vietnam. The ride is challenging but very rewarding. Overnight in a hotel.  Summary:"
      },
      {
        "title": "Day 4: MU CANG CHAI MOTORBIKE TOUR VIA THAN UYEN TO Y TY",
        "description": "In this morning, We’ll keep motorbiking straight toward the main Fansipan Mountain range via Than Uyen town of Lai Chau. There is also the option for a very challenging back route which takes us through several river crossings. The massive mountain range dominates the road until finally we must make a splendid climb up from Binh Lu and up to the top of the highest road pass in Vietnam (Tram Ton Pass).  Y Ty, one of the poorest communes in Lao Cai Province’s Bat Xat District, has become an attractive tourism destination in recent years due to its natural beauty. Y Ty is still a strange name to many Vietnamese people. Nestled against 2,700m Nhi Cu San mountain, the commune rarely sees the sun and is often covered by dense white clouds. This lovely land is a must-see destination for photographers and nature lovers who dont want to be in the crowd of Sapa. Terraced fields beautifully make up the place in which tourists themselves can witness the transplanting of seedlings called “pouring water season” every May and seeing the whole area turn to green after. The sight is so astonishing that it has become a favorite shooting destination for both amateur and professional photographers.  Y Ty has become famous for its unique terraced fields made by the ethnic minority group Ha Nhi. The fields have varying terrain, but the Ha Nhi people manage to make wide and beautiful fields that amazingly fit the valley curves and high mountain slopes.  Another special feature of Y Ty is its earthen houses whose architectural design is simple yet one-of-a-kind. It is mushroom-shaped especially when viewed from atop. There is only one door and a small arched window but enough to keep warm in the winter and cool in the summer. Though the design is basic, it takes one month to build an earthen house.  Overnight at Y Ty homestay"
      },
      {
        "title": "Day 5: Y TY MOTORBIKE TOUR TO SAPA (LAO CAI)",
        "description": "WE keep riding from Y Ty to Sapa via Lung Po and Muong Hum Crossing into Lao Cai Province at over 2,000m the views looks out over the main range for miles and miles, before we descend to the mountainous Sa Pa valley. Sa Pa is located in Lao Cai Province, north-west Vietnam, and 350 km north-west of Hanoi, close to the border with China. Sapa is famous both for its fine, rugged scenery and for its rich cultural diversity. French used to consider Sapa as Summer Capital of Northern Vietnam in the early decades of the 20th century. Its naturally gifted beauty keeps attracting more and more people to spend their vacation there since then. Particularly, the place is the foremost choice for honeymoon couples! Overnight in Hotel. Summary:"
      },
      {
        "title": "Day 6: SAPA MOTORCYCLE TOUR TO THAC BA RESERVOIR – VU LINH VILLAGE (YEN BAI)",
        "description": "Take our motorbikes down from Sapa to Lao Cai City and then have a coffee-stop on the bank of Nam Thi river, which is Vietnam – China border. Enjoy your coffee while taking the view to China.  Head to Road 70 before turning via Luc Yen on Road 152 with palm forests and lots of high mountains, deep valleys to Vu Linh village of Dzao ethnic minority located on the side of Thac Ba reservoir which is the biggest man-made lake in Vietnam. This artificial lake has an area of 23,400 ha and 1,331 islands and hills with diverse ecological environments.  The water in the lake is blue and clear, and imprinted with the reflections of the surrounding ancient forest. The thousands of hills and islands feature caves such as the Hum, Cau Cuoi and Bach Xa. After lunch, we take the boat ride, stop by an island for swimming and discover the particularities of this area: the way villagers paddle their boats, the exotic and odd animals living around, the quiet and peaceful beauty of this huge lake, the lifestyle of the Dao among the thousands of islets.  We will have an unforgettable dinner with the hosts, whose are really big drinkers and they party every day. The welcome is exceptional and we hope you will survive. Summary:"
      },
      {
        "title": "Day 7: VU LINH VILLAGE (THAC BA LAKE) MOTORCYCLE TOUR TO HANOI",
        "description": "After breakfast we ride southeast on Highway 2 and then branch off to the sleepy town of Phu Tho. We follow the edge of the Red River along the dyke, almost to the point where it merges with the Black River after which they flow together to Hanoi.  By now we are very much in the lowlands of the delta plains and the north’s main agricultural areas. Harvest time here is a sea of activity. Crossing the Black River by bridge, we pass through Son Tay and then return to Hanoi on the highway. We should be back to Hanoi before rush-hour (4 pm) because traffic’s getting busier and busier. Summary:"
      }
    ]
  },
  {
    "name": "Vietnam in Your Eyes - 7 days Original Experiences",
    "duration": 7,
    "travelStyle": ["Sightseeing", "Family", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 438,
    "summary": "Welcom to Hanoi - the capital of Vietnam, get a feel of Hanoi's local culture while seeing the city's highlights and mingling with the locals by visiting some famous temples, pagoda, lakes,... Customers will have a great time to immerse in Hanoi Olf Quarter at night, walk through lots of local restaurant and enjoy street food tour with Vietnamese people.\n\nObserve stalactites in miraculous form inside Sung Sot Cave (Amazing Cave), one of the largest caverns in Halong Bay. Kayak around the scenic bay, go swimming at Ti Top Island, or even hike up for a panoramic view. You'll find plenty to do in this UNESCO World Heritage area, including cooking classes on board.\n\nFoot print in Sapa, one of the most famous destination in Vietnam with lots of ethinic group, enjoy freah food, meet local people, do trekking around villages and rice terraces,...",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/152986_101fb641.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_101fb641.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_63e00c0c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_2245cd18.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_6ed060d5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_2876b237.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_0c949e8e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_3e2dca8e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_61e97f42.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_48bd9499.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_c90fbc0b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_c5facfc1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_05500aff.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_64c6e74c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_0a8396bd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_894cbd2e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_f0b89c50.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_8612b77e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_3c1a75f4.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_b3693ef9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_b0a477fe.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_0ab97f31.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_567f8560.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/152986_7ebf055a.jpg"
    ],
    "destinations": ["Hanoi", "Halong Bay", "Sapa"],
    "timeline": [
      {
        "title": "Day 1: Hanoi Arrival – Walking Old Quarter Street Food tour (Dinner)",
        "description": "In and around Hanoi-\tOur private car would pick you up at Hanoi Internatinal Airport and drop you off at your hotel in the city center.  -\tCheck in your hotel -\tParticipate in the Hanoi Walking Street Food tour by night to experience the Vietnamese local cuisine such as Bun Cha, Pho, Banh Cuon, Egg Coffee, Deserts,... -       Tour guide take you back to hotelm and take a rest -\tOvernight in Hanoi hotelStart point\n Optional Terminal, Sân bay quốc tế Nội Bài, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "
      },
      {
        "title": "Day 2: Legendary Hanoi City Full-day (Breakfast, Lunch)",
        "description": "Have breakfast at hotel & ready for the trip at lobby. 7:45 – 8:30: Tour guide pick up at hotel 08:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969. 09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world 10:15: Visit the Lacquer Paintings workshop – the biggest center in Ha Noi 10:45: Visit one of these : •\tOption 1 : Bat Trang ceramics & pottery village (On Mondays – Wednesdays  – Fridays ) •\tOption 2 : Vietnam Museum of Ethnology (On Tuesdays – Thursdays – Saturdays & Sundays) 12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes.  13:30 – 13:45: Continue to visit Temple of Literature – the first university in Vietnam in the feudal system. 15:00: Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh. 15: 45: Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury. 16:15: Tour finishes. It's time to enjoy dinner by yourself 20:00: We pick you up and take you to Hanoi Railway Station and transfer to Sapa 20:30: Check -in deluxe cabin and overnight on train to Sapa."
      },
      {
        "title": "Day 3: Hanoi - Halong Bay - Surprising Cave - Sunset Party - Cooking Class (Breakfast, Lunch, Dinner)",
        "description": "8:00 - 8:30AM: Tour guide will pick you up at hotel and depart to Halong 10:15: Arrive in Hai Duong province, and have 20-30 minute short break. 12:00: Arrive to Tuan Chau Harbor 12:20: Welcome to Cruise and Enjoy welcome to drink and get a brief introduction about cruise and safety guidelines. Check- in your cabin with Air-Conditioning. 12:30: Enjoy a special lunch with Vietnamese traditional dishes, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay. Afternoon Activities: 15:00: Visiting Sung Sot Cave (Surprising cave).  16:00: Our cruise will take you to the Titop Island, It is noted for having a viewpoint at its peak which affords splendid views all around Halong Bay or you can enjoy your swimming on romance sandy beach. 17:15: Come back to Cruise then take a shower, Relax on sundeck, sunset watching in comfortable lounge chairs while drinking a cocktail or reading a book in the most magical moment. 18:00: Enjoy welcome sunset party and Cooking class. How to make fresh noodle roll, you can enjoy product which you make it.  Evening Relaxing: 19:00: Enjoy your dinner when sitting by overlooking sea view window in the night romantic Bay.  20:30: Playing some sports games like: Squid Fishing, Singing karaoke, or playing puzzle game. Overnight on boat: Clean air- conditioning room."
      },
      {
        "title": "Day 4: Halong Bay - Pearl Farm Visiting - Kayaking – Hanoi - Sleeping Bus to Sapa (Breakfast, Lunch)",
        "description": "6:00: Wake up in the early morning to see sunrise on sundeck. 7:00: Morning view of bay landscape with a cup of tea of coffee. Have breakfast 7:40: Start visiting Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years. 8:30: Do kayaking to explore Halong Bay 10:00: Check-out and enjoy a fantastic cruise on the bay. 10:45: Enjoy the lunch while Cruising back to Tuan Chau Harbour. 12:00: Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise. 12:30: Return to Hanoi by shuttle bus. 14:30: Stopover in Hai Duong province for short break. 16:30: Arrive in Hanoi and we will prepare a small hotel where you can take a shower and take a rét before getting sleeping bus to Sapa 21:30: Tour guide and bus pick you up at hotel and transfer to Sapa Town."
      },
      {
        "title": "Day 5: SaPa arrival – Trekking to Y Linh Ho – Lao Chai – Ta Van (Breakfast, Lunch, Dinner)",
        "description": "5:30AM: Arrive in Lao Cai around, we will take 1 hour van ride uphill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces. Upon arrival Sapa town. 7:00AM: We have breakfast at the hotel. And relax about 2 hour, you can take a shower. 9.00 - 9.30: Begin a short walk of 5km along mountain trail to visit Y Linh Ho village which is inhabited by black Hmong tribe and completely secluded from tourists, especially you are able to embrace raw Sapa culture and community by coming into some native houses to discover their own culture and custom as well as study how the local tribe make handicraft from natural materials such as: hemp, indigo…ect. Continuing to walk down MuongHoaRiver where you can take a rest or swim before trekking uphill to Lao Chai village where your picnic lunch will be served.  13.00: After lunch, you will visit the Day and Red Dzao tribes of Tavan village, which lies in the middle of MuongHoa valley where excellent panoramas of rice terraced fields.  15h00 – 15h30: There you will have dinner and stay over night at local house. Accommodation: Homestay in Sapa with local people"
      },
      {
        "title": "Day 6: Ta Van – Giang Ta Chai – Su Pan – Sapa – Sleeping Bus to Hanoi ( Breakfast, Lunch)",
        "description": "8.00:You have breakfast at the home stay before trekking about 8km towards the Red Dzaovillage of Giang Ta Chai. On the way you will trek up and downhill then through bamboo forest before arriving at the waterfall, Rattan bridge and Stream where you have short rest to swim and picnic lunch.  14h30 Continuing to walk uphill about 2km to HauThao village where we catch the car to return to Sapa. You are free to discover Sapa town and Market before having dinner then being transferred to bus station to catch the night bus to Hanoi."
      },
      {
        "title": "Day 7: Hanoi departure",
        "description": "4:00AM: Hanoi arrival, take a rest at bus staion in Hanoi. Enjoy your free time in Hanoi before departure time.  It's time to say goodbye and thanks for using our service!End point\n Your hotel/stay in Hanoi Old Quarter, Hanoi, Vietnam 04:00 - 04:30"
      }
    ]
  },
  {
    "name": "Low Budget Vietnam Tour from Hanoi, Halong Bay to Da Nang, Hoi An, Saigon",
    "duration": 8,
    "travelStyle": ["Discovery", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 864,
    "summary": "This 8-day Vietnam Tour inspire you to take in the delight of exploring the best highlights of Vietnam. You will be immersed in the special beauty of Hanoi, cruise around the picturesque backdrop of Halong seascape, walk in the quiet streets of Hoi An Ancient Town, and enjoy the happy hours in busy Saigon.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/170891_cb6a01e5.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_cb6a01e5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_5b4348e6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_731ce3db.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_cbc4a5d3.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_56ca9e82.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_d253e2d7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_459828fb.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_a0d98537.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_3a65ad3b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_48127210.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_28f184e7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_8f920c8c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_9f1ae914.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_99065cd5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_bf60fc16.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_22ea06ec.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_a6543a58.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_6615a13b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_8c238d28.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_1135e89c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_4be0a45f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/170891_de99f334.jpg"
    ],
    "destinations": ["Hanoi", "Halong Bay", "Hoi An", "Ho Chi Minh City"],
    "timeline": [
      {
        "title": "DAY 1. ARRIVAL – HANOI",
        "description": "In and around Hanoi, Da NangUpon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in. The rest of time, you’ll be free on your own. O/N in Hanoi.Start point\n Your hotel, Hanoi, Vietnam 08:00"
      },
      {
        "title": "DAY 2. HANOI ONE-DAY GROUP TOUR TO HALONG (B/L/-)",
        "description": "After having breakfast at hotel, you’ll be at leisure in the lobby. 7:50 – 8:30: Our cruise’s shuttle bus and tour guide pick up at your hotel in Hanoi old quarter, then take about 3.5 hour drive to Halong Bay. 12:15: Arrive in Bai Chay tourist wharf, welcomed by crew on our cruise and enjoy welcome drinks, take photos12:45: Sailing forward to looking stunning scenery with thousands of limestone mountains and  have seafood lunch while cruising through the emerald water passing by the Dog Stone, the Burning Incense Islet, stop at fishing village for kayaking – you will have 30 – 35 minutes to explore some grottoes and islets by yourself. After that visit Fighting-Cock rock and the Heavenly Palace (Thien Cung cave) – which has opened to the public since 1998 with stalagmites and stalactites. Back to Cruise. Our staff serves you cold tissues and fresh fruits. 16:15: Back to Tourist wharf and get on bus to Hanoi. 20:00: Arrive in Hanoi.  O/N in Hanoi."
      },
      {
        "title": "DAY 3. HANOI – FREE DAY – NIGHT TRAIN TO DANANG (BSS)",
        "description": "Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car) By the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Da Nang on SE1 (19:30 – 11:40 +). Overnight on train."
      },
      {
        "title": "DAY 4. DA NANG RAILWAY STATION – HOI AN – FREE (B/-/-)",
        "description": "In and around Hoi An, Ho Chi Minh CityUpon getting to the Da Nang Railway Station, you’ll be welcome & escorted to your hotel in Hoi An for a check-in. The rest of time, you’ll be free on your own. O/N in Hoi An."
      },
      {
        "title": "DAY 5. HOI AN AT LEISURE (B/-/-)",
        "description": "After having breakfast at hotel, you’ll be free on your own to explore Hoi An (No Guide & No Car) O/N in Hoi An."
      },
      {
        "title": "DAY 6. HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B/-/-)",
        "description": "After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in. The rest of time, you’ll be free on your own. O/N in Ho Chi Minh City."
      },
      {
        "title": "DAY 7. SAIGON AT LEISURE (B/-/-)",
        "description": "After having breakfast at hotel, you’ll be free on your own to explore Saigon (No Guide & No Car) O/N in Ho Chi Minh City."
      },
      {
        "title": "DAY 8. SAIGON – DEPARTURE (B/-/-)",
        "description": "After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00) "
      }
    ]
  },
  {
    "name": "Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai",
    "duration": 6,
    "travelStyle": [
      "Motorcycle Ride",
      "Trail/Dirt bikes",
      "Sightseeing",
      "Christmas & New Year"
    ],
    "oldPrice": 0,
    "price": 980,
    "summary": "This 6-day Timeless Hoi An Motorcycle Tour to Saigon via Kon Tum, Buon Ma Thuot on Ho Chi Minh trail takes you on adventure rides to explore breathtaking landscapes of Central Highlands with coffee plantations, waterfalls, jungles and visit ethnic minorities in remote villages then taste great local foods at regions …",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_9963919f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_0cd07aa6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_247cb302.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_bba333e0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_787051ad.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_04032620.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_87071a10.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_3a58824c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_40d2e2f6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_d43b85c7.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_4fe03696.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/129836_7ac07973.jpg"
    ],
    "destinations": ["Hoi An", "Ho Chi Minh City"],
    "timeline": [
      {
        "title": "Day 1: Hoi An motorbike tour to Kham Duc",
        "description": "In and around Hoi An, Ho Chi Minh CitySaying goodbye with Hoi An ancient city, we will see how to make incense, visit Cham tower and Cao Dai Temple. Travelling on Ho Chi Minh trail, we will enjoy its magnificent scenery, exploring the rural life of the local people, learn their culture and customs We also learn more about the history of Vietnam and enjoy water massage on the Ho Chi Minh trail and the local market of the mountain town Arrive in Kham Duc around 5:00pm."
      },
      {
        "title": "Day 2: Kham Duc motorbike tour to Kon Tum",
        "description": "Continuing Ho Chi Minh trail, today we will ride to Kon Tum. On the way, we will stop at Charlie Hill, Indochine three Corner, Dak To – Tan Canh battle field, Phoenix airport, Wooden church that is combined of European style and culture of the Central Highlands Vietnam and     Kon K’tu ethnic village with their tradition Rong House"
      },
      {
        "title": "Day 3: Kon Tum motorbike tour to Buon Me Thuot",
        "description": "Wake up in the early morning to enjoy the fresh air of the highland town and walk around to visit Kon Tum market. After breakfast, we will get on the motorbike for visiting Sea lake – the eyes of Pleiku, War monument, Local house to learn how to make rice paper and rice noodle, Black pepper farm We will try to experience the daily life of local people Arriving in Buon Me Thuot around 5pm."
      },
      {
        "title": "Day 4: Buon Me Thuot motorbike tour to Dak Mil",
        "description": "This is one of the best days of the tour, so don’t miss anything! Before leaving Buon Me Thuot, let’s enjoy the best coffee in Vietnam (Buon Me Thuot is coffee homeland of Vietnam) and visit Ede ethnic minority village where still keep their tradition long house and local market where we will buy really special foods for our picnic lu’nch in the national park Following Ho Chi Minh trail, we will head to the national park where we will visit the Dray Sap and Dray Nur Waterfall – Biggest one in the Central Highland, and swim in Fairy pool, take a water massage from waterfall. Then Our guide will cook special foods for the lunch (Secret). Overnight in Dak Mil (Near Vietnam and Cambodia border). "
      },
      {
        "title": "Day 5: Dak Mil motorbike tour to Dong Xoai",
        "description": "We will Ride through the legendary Ho Chi Minh trail to enjoy its magnificent scenery, Explore the rural life of the local people and Learn more about the history of Vietnam. We continue to visit Soc Bom Bo village to understand S’tieng ethnic minority people culture and traditions and learn how the locals make rice papers, noodles,… Overnight in Dong Xoai (The beginning point of the Ho Chi Minh trail from South to North)"
      },
      {
        "title": "Day 6: Dong Xoai Motorbike Tour to Saigon",
        "description": "After breakfast, we will get on the motorbike to head to Cu Chi tunnel. On the way, we will stop at Rubber tree plantations, War Victory Monument, Paddy field We will spend few hours to discover the Cu Chi tunnel and learn Vietnam History, then will ride to Sai Gon to finish the trip. Our guide will drop you off at the place you require."
      }
    ]
  },
  {
    "name": "Hanoi - Sapa Highlight Package Tour in 7 Days",
    "duration": 7,
    "travelStyle": [
      "Discovery",
      "Family",
      "Ocean Cruise",
      "Christmas & New Year"
    ],
    "oldPrice": 0,
    "price": 1255,
    "summary": "LVP Travel will be willing to pick you up at Noi Bai Airport and transfer to hotel mentionded in Hanoi Old Quarter, relax in couple of hours before exploring some places surroundings. Customer must have to inform the Flight number and time of arrival, Driver and Guide will follow and pick up service offered. Single Traveller will be charged 180$ due to the luxury carbin room on Halong Bay Cruise",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_a3907ab3.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_72e0ed1d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_33b87d89.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_6362cb86.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_9ad1fe56.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_3f75c070.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_7f44b906.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_98aa96f0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_ec7f2be8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_89c80d09.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_abd078d5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_39406cfb.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/137667_cfe7aef5.jpg"
    ],
    "destinations": ["Hanoi", "Sapa", "Halong Bay"],
    "timeline": [
      {
        "title": "Day 1: Hanoi",
        "description": "In and around HanoiBriefly Descriptions: Experience the contrasts of Northern Vietnam from the charming chaos of Hanoi to the relaxing waters of Halong Bay.  Highlight Vietnam Tour is a fabulous introduction of Vietnam's Culture and Traditional. Begin your journey in the capital city with a Hanoi Capital full day city tour.  Visit the Temple of Literature and the mausoleum of Ho Chi Minh for a touch of history before heading through the busy Old Quarter.  Relax at the end of the day with a coffee at a local lakeside café and marvel at the seemingly endless stream of motorbikes. Enjoy the beautiful scenery diversity hill tribes, very peaceful and green rice terraces in Sapa - the roof of Indochina.\nLeave the hustles of the city behind as you travel east to the Gulf of Tonkin and board a traditional wooden junk boat.  An overnight cruise on Halong Bay is the remarkable opportunity to truly appreciate the beautiful limestone, karts mountains, spending the hours sailing among limestone cliffs and Emerald seas.  Stop to visit a mysterious cave, swimming in the warm waters and feast on fresh seafood.\nwe can tailor your family journey to the central or south of Vietnam with more history & Culture or also stunning sceneries in each destinations\nDay 1: Arrival Hanoi Vietnam (Dinner)\nToday you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Capital City some called The City Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Enjoy for leisure in Hanoi until 7:00pm. Take night train from Hanoi to Sapa. Overnight on the train. (Opt 4 Softbed- Sleeping Carbin or 6 bed sleeping Carbin)"
      },
      {
        "title": "Day 2: Sapa",
        "description": "Day 2: Sapa arrival - Black Hmong Village - Red Dao Village (Breakfast, Lunch, Dinner)\nArrive Lao Cai Railway Station at 5 -6:00am. Pick up to Sapa town for check in. Having breakfast and start hiking down to Lao Chai village to visit the Black H'mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town."
      },
      {
        "title": "Day 3: Sapa",
        "description": "Day 3: Lao Cai- Bac Ha Sunday Market - Night train back Hanoi (Breakfast, Lunch, Dinner)\nAfter breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most fabulous and colourful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, buffaloes,horses... all for sales or Barter. This is an unique opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H'mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Overnight on the train."
      },
      {
        "title": "Day 4: Halong Bay",
        "description": "Day 4: Excursion to Halong Bay and Stay overnight on Board. (Breakfast, Lunch, Dinner)\nArrive Hanoi Railway Station at 5:30am. Pick up & transfer to hotel for short rest & breakfast until 8:30am. Leave Hanoi for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat."
      },
      {
        "title": "Day 5: Halong Bay",
        "description": "Day 5: Halong Bay Cruise - Hanoi. (Breakfast, Lunch, Dinner)\nRising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi."
      },
      {
        "title": "Day 6: Hanoi",
        "description": "Day 6: Hanoi Sightseeing full day (Breakfast, Lunch, Dinner)\nHanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi."
      },
      {
        "title": "Day 7: Hanoi",
        "description": "Day 7: Hanoi Conclude/ Departure. (Breakfast)\nHave a Free Morning before Taking off to your hometown. comment on your facebook and remind when return Vietnam next trip."
      }
    ]
  },
  {
    "name": "Vietnam Specifically the North",
    "duration": 10,
    "travelStyle": [
      "In-depth Cultural",
      "Adventure",
      "Family",
      "Christmas & New Year"
    ],
    "oldPrice": 0,
    "price": 905,
    "summary": "It is your day to visit the Capital of Vietnam today. Let's start from the Ho Chi Minh Mausoleum, his simple house-on-stilts and the One-Pillar pagoda near Ba Dinh Square, where the most solemn ceremonies of Hanoi take place. Go on to the Temple of Literature, the very first high school of Vietnam Scholars\n\nAfternoon, we will visit Hoan Kiem Lake and the nearby Ngoc Son temple, Ly Thai To statue. Walk through the Old Quarter, a fascinating network of narrow alleys and shop houses also known as ‘The 36 Streets’ – each street being named after the merchandise traditionally sold there, ranging from fabrics to crafts and from medicines to tombstones.",
    "highlights": [
      "Stroll through Hanoi city with its best landmarks and historical-cultural sites",
      "Visit Halong Bay renowned for its thousands of limestone and tranquil islets",
      "Be amazed by the sublime natural beauty of Pu Luong's mountains and valleys"
    ],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/101731_a1e8a8ca.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_a1e8a8ca.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_77c77111.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_826cc766.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_f6d0085d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_d37358ff.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_16db2908.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_51cd8b63.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_49546115.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_2e651385.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_a765a155.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_75c871c2.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_ffe262c9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_579bebb1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_57778e7b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_4aedcdf5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_008d61a0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_b6ca413a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_f3225be1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_13b7b974.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/101731_5c4e9530.jpg"
    ],
    "destinations": ["Hanoi", "Halong Bay"],
    "timeline": [
      {
        "title": "Day 1: Hanoi Arrival (-/-/-)",
        "description": "In and around HanoiWarmly welcome to Hanoi, the 1000-year capital of Vietnam!  Upon arrival, you will be greeted by our local driver then transferred to Hanoi center to drop off luggage. Stay at leisure for refreshment after long flight. Please note! -Hotel check-in time is 14:00 -Depend on your arrival time, the program will be adjusted accordingly.Start point\n Arrival Hall, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam 00:00 - 23:55"
      },
      {
        "title": "Day 2: Hanoi City Tour (B/-/-)",
        "description": "It is your day to visit the Capital of Vietnam today. Let's start from the Ho Chi Minh Mausoleum, his simple house-on-stilts and the One-Pillar pagoda near Ba Dinh Square, where the most solemn ceremonies of Hanoi take place. Go on to the Temple of Literature, the very first high school of Vietnam Scholars  Afternoon, we will visit Hoan Kiem Lake and the nearby Ngoc Son temple, Ly Thai To statue. Walk through the Old Quarter, a fascinating network of narrow alleys and shop houses also known as ‘The 36 Streets’ – each street being named after the merchandise traditionally sold there, ranging from fabrics to crafts and from medicines to tombstones.  Overnight in Hanoi"
      },
      {
        "title": "Day 3: Hanoi – Farm Tour and Cooking Class at Local Family (B/L/-)",
        "description": "Breakfast at hotel. Morning, we leave Hanoi center and drive to the west of city. Our visit will start from a local market since Le Dynasty, the most famous market in the region where many traditional items for sales, including: dogs, cats, pigs, chickens, ducks, and bamboo baskets. Be surprised about bustling and colorful market which is working under the canopy of old tree.   Next to the market place is nice vegetable farms, where we take a tour around vegetable fields growing a variety of produce including: cauliflower, cabbage, tomatoes, green peas, Chinese peas and corn, as well as fruit gardens with oranges, pomelos, papaya, etc. Join with a local farmer with his daily work. Depend on the season this will involve ranking, sowing, water greens, picking greens and other garden activities. During the work, learn more about cultivation techniques and lifestyle through the farmer’s stories. At noon time, we will visit a local family and learn how to prepare delicious local meals by fresh ingredients, then make traditional cake while learning more about Vietnamese family's customs. Enjoy special tea and local wine from the host. Bid farewell to the family and driver back Hanoi center later on. At leisure in the rest of the day.  Overnight in Hanoi."
      },
      {
        "title": "Day 4: Hanoi – Pu Luong Retreat - Village Life and The Community (B/L/D)",
        "description": "Breakfast at hotel.  Early morning, check out and take drive to Pu Luong (150km from Hanoi). You enter Pu Luong Nature Reserve by road via a breathtaking mountain pass giving you a panoramic view of the whole valley. You arrive at your accommodation in time for a delicious lunch, followed by free time to explore the beautiful retreat, with its captivating panoramic views and tranquil setting.  PM: You have the chance to get close to village life and interact with locals living in the hills above the Retreat. Glimpse at daily life, walk around working farmland and rice fields, and get to know more about the local culture. Walking back the retreat for nice dinner. Overnight in Pu Luong."
      },
      {
        "title": "Day 5: Pu Luong Retreat - Uoi – Lan – Hieu Villages (B/L/D)",
        "description": "AM: This is a common and easy walk around the most beautiful valley of rice terraces in front of the Retreat. We start to descend into the beautiful valley facing the Retreat where you walk around tumbling rice terraces. Then we will walk through small paths shrouded in vegetation to slowly reveal a picturesque Uoi village sitting at the base of a towering mountain. Your camera will not be able to sit still when you see the panorama view of the village from above. PM: Continue walk down hill to a local home, where you can take rest then take a cycle to go cycling around Lan village. If time permits, we will visit a local family where we can learn about their traditional brocade weaving (not guaranteed). Cycling through the rice paddies and village to village, bridge to bridge to explore more the scenic landscapes surround. You will end up at Hieu Village (the stunning village in the area), you will have a good chance to enjoy the Hieu waterfall, the sole one in the reserve. Ride back to the local home, where the car pick-up point. You will be transferred back to Puluong retreat for dinner. Overnight in Pu Luong."
      },
      {
        "title": "Day 6: Pu Luong - Bang Scenic Village – Hanoi (B/L/-)",
        "description": "AM: After breakfast, take a short ride from the retreat to Dong Dieng village, Going down into the most beautiful valley in Puluong. Along the way you will have a chance to enjoy beautiful terrace rice fields and gorgeous mountains. Take a scenic trails winding to have a look of the landscape of rice field and the village, which were widen in your eyes. You will pass some homes on the way, you can come to visit any local family if you want, this is a great chance to learn more about life style and culture of the locals. It’s time to get back the retreat for lunch. After lunch, check-out the retreat and drive back to Hanoi. Overnight in Hanoi. "
      },
      {
        "title": "Day 7: Hanoi – Halong Bay (B/L/D)",
        "description": "If you wish to see how the Hanoi people rise and shine in the morning, wake up early and run to a lake close by your hotel, you can join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi quan, jogging, martial arts, classical dance and so on. After breakfast at the hotel, we will head to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006, and check-in our overnight boat. Enjoy a trip on Halong with stops to visit caves or to swim and enjoy the sunset on the sea. Dinner with fresh seafood! Overnight onboard."
      },
      {
        "title": "Day 8: Halong Bay – Hanoi (B/L/-)",
        "description": "Morning wake up with a taichi-quan or yoga exercises guided by the crew before having breakfast whilst your boat goes on between Halong islets. Return to the Wharf to be back to Hanoi by shuttle bus at midday. Arrive in the city around 3-4pm. Overnight in Hanoi. Optional:  HANOI STREET FOOD TOUR Navigating Hanoi's thriving street food scene can be tough. This unique, carefully designed adventure combines expert knowledge with flexibility to pursue your unique interests, bringing you closer than ever to discovering the culinary secrets hiding around every corner. Sample a wide variety of popular street food dishes, including bun cha (grilled pork patties with noodles), pho (beef noodle), crab noodle, pork porridge, and savory Vietnamese pancakes (ban xeo). Delve deeper into lesser known foods, including grilled quail, golden pillow cakes, beef noodle, eel noodle, shrimp cake, and snails. Enjoy an assortment of drinks and local dried snacks, and even visit a local market place."
      },
      {
        "title": "Day 9: Hanoi at Leisure (B/-/-)",
        "description": "Breakfast at hotel.  Stay at leisure today at your own for relaxing or shopping around. Overnight in Hanoi.  Optional:  NINH BINH – HOA LU – TAM COC – BICH DONG CAVE Timing: from 8:00 – 18:00 Our guide and driver will pick you up from your hotel. Today will be your great chance to visit to Ninh Binh, one of the oldest capitals of Vietnam. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a visit to the shady Dinh and Le temples, the site that used to be the kings’ palace in 10th century. Further discovery in Ninh Binh will be continued by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Back to Hanoi late afternoon. "
      },
      {
        "title": "Day 10: Hanoi Departure (B/-/-)",
        "description": "At your leisure until your driver comes to meet and transfer you to the airport to take the departure flight. End of services. Please note! Hotel check-out time is 12:00End point\n Main Entrance, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam 00:00 - 23:55"
      }
    ]
  },
  {
    "name": "Vietnam Beach Paradise - Halong Bay/ Mui Ne",
    "duration": 9,
    "travelStyle": ["Beach", "Christmas & New Year"],
    "oldPrice": 1476,
    "price": 797,
    "summary": "Mui Ne is listed in 20 idyllic beaches among Asia and results as the perfect place for adventurers who can enjoy activities such as kite-surfing, windsurfing or sand-boarding on its very famous sand dunes. Besides that, you can leisure on your own cruising in Halong Bay and explore the islands surrounding.These treasures of Vietnam is a perfect getaway for people who want to enjoy beach holiday in Asia. ",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/136938_38cf44aa.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_38cf44aa.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_9d61a992.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_a1abc1a5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_bcbaf105.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_1136ea5a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_d25cc736.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_1a60594f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_6de35b26.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_5c595a79.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_908b3e3b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_a1c6c500.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_9b66a61b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_b052b6d9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_68d3bca1.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_d8b71ef8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136938_5ec1c83c.jpg"
    ],
    "destinations": [
      "Hanoi",
      "Halong Bay",
      "Ho Chi Minh City",
      "Cu Chi Tunnels",
      "Mui Ne"
    ],
    "timeline": [
      {
        "title": "WELCOME TO VIETNAM - HANOI ARRIVAL",
        "description": "In and around HanoiYour trip begins with arrival to Vietnam. Your private driver will meet you at the airport and transfer you to the hotel. Check-in to the hotel and have some rest after the flight. Remaining part of the day is at your leisure. You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.  After enjoying the first day by yourself return to the hotel for a relaxing sleep. Start point\n Noi Bai International Airport Pick Up , Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "
      },
      {
        "title": "EXPLORE THE LANDING DRAGON - HALONG BAY - SHARING CRUISE/L/D)",
        "description": "In the morning, check-out from hotel and get pick-up by the Cruise at 7:30 am. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes.  After you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat. Overnight on cruise (Meals: breakfast, lunch, dinner)"
      },
      {
        "title": "MORNING RISE IN VIETNAM'S MOST FAMOUS BAY (B/L)",
        "description": "Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites or at the floating village. From here, you will sail back to the main harbor and return to Hanoi (around 16:30-17:00). Drop at hotel in Hanoi. Free at your leisure time. (Meals: breakfast, lunch)"
      },
      {
        "title": "ESCAPE FROM CITIES' HUSTLE WITH BA VI ECO TOUR (B/L)",
        "description": "08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive your Mr Duoc’s house with a welcome drink. 10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place that to enjoy beautiful scenery of the village. This Tea Plantation plays important role in providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea. Mr Duoc is a veteran in Vietnam War and the owner of a large tea farm. He also is an expert in handling the raw tea leaves, he will introduce you how to make a good green tea before selling. You will have great time listening to the host’s stories of his life in Vietnam war and enjoying the tea with green lentils or lotus seeds that made by his family. 11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you will have great time to enjoy lunch with food you done. 12:30: Have lunch with the host’s family and short break after lunch. ( Meals: breakfast, lunch) - Back to your hotel and ready for pick up to the airport for flight to Ho Chi Minh City - "
      },
      {
        "title": "DISCOVER THE FASCINATING CU CHI TUNNEL AND TRANSFER TO MUI NE (B)",
        "description": "In and around Cu Chi TunnelsHave breakfast and check-out from the hotel. Depart for Cu Chi tunnel at 8:00 am, the trip will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time exploring the remaining area and tunnel systems which includes the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.  Break time for relax or time for those who want to try the real shooting gun.  Return to Saigon at 14:00, to pick your luggage up at the hotel and short break. Transfer from Ho Chi Minh city to Mui Ne beach!  Overnight in Mui Ne (Meals: breakfast)"
      },
      {
        "title": "IT'S TIME FOR THE BEACH - MUI NE LEISURE (B)",
        "description": "Have a leisure day exploring Mui Ne beaches or just relax at your resort. (Meals: breakfast)"
      },
      {
        "title": "BEACH TIME IS NEVER ENOUGH - MUI NE LEISURE (B)",
        "description": "Have a leisure day exploring Mui Ne beaches or just relax at your resort. (Meals: breakfast)"
      },
      {
        "title": "LEISURE TIME IN MUI NE AND TRAVEL BACK TO HO CHI MINH CITY (B)",
        "description": "In and around Ho Chi Minh CityLeisure day on the beach – Then we will transfer you back to Ho Chi Minh City in the afternoon by private vehicle. Overnight in Ho Chi Minh City  (Meals: breakfast)"
      },
      {
        "title": "BIGGEST FAREWELL AND WARMEST THANK YOU - HO CHI MINH DEPARTURE (B)",
        "description": "Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home. (Meals: breakfast)End point\n Tan Son Nhat International Airport Drop Off, Tan Son Nhat International Airport, Trường Sơn, Hồ Chí Minh, 736400, Vietnam "
      }
    ]
  },
  {
    "name": "Best Selling Vietnam Motorcycle Tour to Central Highlands and Southern Coast with Da Lat, Nha Trang, Phan Thiet, Vung Tau",
    "duration": 7,
    "travelStyle": ["Motorcycle Ride", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1010,
    "summary": "This Vietnam Motorcycle Tour to Da Lat, Nha Trang, Phan Thiet, Vung Tau is an ideal combination between the Highlands and the Coast with a start from Saigon via Bao Loc, Lam Dong, Da Lat where you can have chance to visit grand coffee plantations, hill tribe's villages then downward to Nha Trang & along the beach to Phan Thiet, Mui Ne and Vung Tau to experience very beautiful beaches.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8946cc99.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8946cc99.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8948c861.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b89493f2e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b8949c661.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894a4bd5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ad9f6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894b4901.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894bbf50.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894c5320.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ccecb.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894d49a9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894ddaa9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e05b894e6528.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f73.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f75.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f7b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e43722570f7c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/189957_5e4372af0bba2.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: HO CHI MINH CITY MOTORBIKING TOURS TO BAO LOC – LAM DONG MOTORCYCLE TOURS TO DA LAT (-/L/D)",
        "description": "In and around Ho Chi Minh CityThe journey northwards begins as we depart Ho Chi Minh and pass through The influence of the French is evident in local culture and architecture since Da Lat was founded as a hill retreat for the colonials to escape the oppressive heat in the coastal plains and the chaos of Saigon.  This charming town is set around a lake and surrounded by forests, waterfalls and rolling countryside. O/N in Da Lat. Activities: 250 km motors riding (6.5 hours) Offroad Biking over the mountains & jungles many tea and coffee plantations to the hill station of Da Lat, sometimes known as the “City of Eternal Spring”. The drive is long but views are fantastic all along the way. Once arriving in Da Lat we can soak up the cool climate as much as we want by spending our time to wander around and catch our first glimpse of this town.Start point\n Your Hotel, Hồ Chí Minh, Vietnam 08:00"
      },
      {
        "title": "Day 2: DA LAT OFFROAD MOTORBIKE TOURS TO LAK LAKE ~ 160 KM (8:30 – 16:30)",
        "description": "What to see: on the way you can take a quick visit at the crazy house, travel along the country road to see the entire agriculture farm such as vegetable farm, greenhouse flower farm, coffee plantation, a visit of silkworm factory, rice wine making and elephant waterfall. Arrive at Lak Lake with a visit to the “Jun” Minority Village (M’Nong). Crossing the Lak Lake by boat to Lieng minority village, with many opportunities of taking pictures of people farming and fishing; Check-in at the long-stilt-house for the overnight stay. Where to stay: Homestay in Long Stilt house."
      },
      {
        "title": "Day 3: LAK LAKE OFFROAD MOTORCYCLE TOURS TO NHA TRANG ~ 210 KM (8:00 – 17:00)",
        "description": "In and around Nha TrangWhat to see: on the way heading to Nha Trang, you have half an hour trekking to top of the Elephant rock mountain, back on the road again, on the back of the motorbikes you will have opportunities to observe the panorama view of rice paddy field along the road, and then, a quick visit to the Ede Minority Village.  One more waterfall name: Dray Nao waterfall between Lak Lake and Nha Trang, Descend along the Phoenix Pass (affect by Agent Orange) and a visit the Hot spring, the brick-making factory, 20 km ride along the beach will lead you to the most charming beach in Vietnam: Nha Trang beach then check-in at hotel. Overnight at hotel in Nha Trang."
      },
      {
        "title": "Day 4: NHA TRANG MOTORBIKING TRIPS TO MUI NE CAPE (B/L/D)",
        "description": "After having breakfast at hotel. 8h00: Our motorbike tour will start leaving to Mui Ne, on the way we will stop by Ca Na and some other beautiful beaches to take a break as well as photos or if needed, you can jump on the sea to soak up yourself. Upon arrival in Mui Ne, we’ll check-in at a hotel then ride to a local restaurant for lunch.  This afternoon, we will ride our bikes to visit Fishing villages, Hong Stream, Golden Sand Dunes and Flying Sand Dunes, right here you can engage some optional outdoor games to make funs by yourself such as skating on sand or flying a kite… The rest of the time, you could take a bath on Mui Ne beach and view the sunset. Overnight at hotel in Mui Ne."
      },
      {
        "title": "Day 5: MUI NE CAPE MOTORBIKING TOURS TO PHAN THIET (B/L/D)",
        "description": "Morning, breakfast & check out. Back on our motorbike and ride 35kms forwards to famous Phan Thiet. On the way, pay a visit at the Fairy Stream, then pause to discover the fishing village of Mui Ne and further on is the enormous red sand dunes. Continue your trip and enjoy the motor ride with a stop to discover how fishermen doing the daily work: net fishing, selling fish, mending the fishing net.  The last stop is at Bau Sen – a vast sand dune which has inspired numerous photographers for many years. We arrive in Phan Thiet around 2.00 PM. The rest of the day is your own at leisure. This day is also a chance for you to try windsurfing on beautiful beaches at Phan Thiet (optional).  Overnight in Phan Thiet.Phan Thiet – Ninh Chu.  Activities: 40 km riding in Phan Thiet (Mui Ne Cape) Swimming at Phan Thiet Beach"
      },
      {
        "title": "Day 6: PHAN THIET MOTORBIKING TOURS TO VUNG TAU (B/L/D)",
        "description": "Breakfast at your hotel & check out. Back on our “steel horses” and we will keep riding along the coastal paved road, passing quiet pine forest of Loc An and we arrive Binh Chau hot spring, take a mud bath and relax on Hot Spring Lake. Having lunch at a local restaurant en-route.  In the afternoon, we’ll keep on riding to Phuoc Hai hamlet, we will be impressed by the beautiful scenery, especially the sections of road straddled by mountains and beaches then Minh Dam historical mountain and Long Phuoc Tunnels before reaching Vung Tau.  Upon arrival, you’ll check-in at hotel and relax by yourself. Overnight at hotel in Vung Tau."
      },
      {
        "title": "Day 7: VUNG TAU MOTORBIKING TOURS BACK TO SAIGON (B/L/-)",
        "description": "Breakfast at your hotel & then you’ll be at leisure on the beach or hanging around Vung Tau city till the time to ride back to Saigon.  At around 16:30, you’ll get to your hotel.  End of the trip."
      }
    ]
  },
  {
    "name": "5-Day Trekking In Ha Giang",
    "duration": 5,
    "travelStyle": ["Adventure", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 633,
    "summary": "Do you wish to explore Ha Giang in a better off the beaten track way? If so, this tour is specially customized just for you! Twisting up and down the steep hills covered with splendid terraced rice fields, heading down the fertile green valley and winding past isolated minority villages are what you should expect to experience. Get ready to be satisfied if you are an adventure-hungry trekker!",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/161723_c231a79f.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_c231a79f.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_282bf7ef.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_4eaf5b05.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_05d8c7fc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_0f878d57.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_160c30f8.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_3eb45db4.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_d23167bf.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_b78288f0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_c9fe374c.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_6dd61514.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/161723_9ff3f3ac.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: Hanoi / Ha Giang (L/D)",
        "description": "In and around HanoiAfter pick up at 8 AM at your hotel, transfer to Ha Giang on a 6-hour drive. Chance to witness the change from the hustle and bustle of Hanoi to the peace of rural areas. Stop on the way for a short walk along some local villages. After lunch at a local restaurant, the drive will continue along Lo river to Ha Giang city.  Take the rest of day wandering around Tay villages where there are vivid rice fields, traditional wooden stilt houses tiled with palm leaves or relaxing by and cooling off in a wild stream. Have a local dish for dinner and call it a day."
      },
      {
        "title": "Day 2: Ha Giang / Quan Ba (B/L/D)",
        "description": "Explore the hidden parts of Ha Giang city with a full day of 17-18km trek. Start from a local Tay village, up the off-beaten trails, winding through wild forests and captivating terraced rice fields to the highest point of Tay Con Linh range, which is the living place of Yao people. Chance to mingle with ethnic students in a local school. Lunch at a local Yao family for a break.  After lunch, do an easier trek down to the valley. Finish the trek in a Tay village after almost 7-hour off the beaten path. Next, head to Quan Ba district in Dong Van Karst Plateau Global Geopark."
      },
      {
        "title": "Day 3: Quan Ba / Dong Van (B/L/D)",
        "description": "Enjoy the morning wandering around the village of Yao people on foot to learn about living tradition and culture of local people, or just go sightseeing in the village. After 1-2 hour of walk, transfer to Dong Van. After lunch on the way in Yen Minh town, time for a short walk to some isolated Hmong villages. Finish the day with a visit to the old palace of Hmong king before reaching Dong Van. If time permits, take a 20-min walk to the top of the mountain where there is a vacant French Fortress to enjoy sunset."
      },
      {
        "title": "Day 4: Dong Van / Yen Minh (B/L/D)",
        "description": "Day begins with a visit to Dong Van market. If Sunday, chance to see a unique fair of the Hmong people. After the market, hike up the mountain to the edge of Nho Que valley where you can view to majestic mountain by the border of China. The 7-km hike leads to an acient traditional village of Tay people who live in amazing clay houses. Head back to Dong Van town on the same day for lunch before a drive to Ma Pi Leng pass.  A 20-min drive transfers you to the trekking point of Ma Pi Leng pass. Here you will be blown away by the stunning beauty of this top-of-the-world destination. This 3-hour walk leads to the top of the pass, through some local Hmong villages and ends with a stroll along the edge of the mountain looking down Tu San valley. After a short break for nature admiration, continue another 2-hour drive to Yen Minh through Meo Vac."
      },
      {
        "title": "Day 5: Yen Minh / Hanoi (B/L)",
        "description": "Wake up in the morning to regret passing time in this wonderland before returning Hanoi."
      }
    ]
  },
  {
    "name": "8 Days Discover North Of Vietnam",
    "duration": 8,
    "travelStyle": ["Discovery", "Christmas & New Year"],
    "oldPrice": 520,
    "price": 432,
    "summary": "Hanoi, Halong bay, Sapa, Tam Coc are the most popular places in all North of Vietnam. With all inclusive tour, Vietnam Travel Top will bring you to all them and guarantee your satisfaction. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.",
    "highlights": [
      "Visit UNESCO listed Halong Bay",
      "Swim in the emerald waters of the stunning Ha Long Bay",
      "Explore the emerald waters by kayak or bamboo boat",
      "Learn more about rice cultivation in the mountain areas"
    ],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/136667_ebcd1edd.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_ebcd1edd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_fd70af9e.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_437b4a1d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_682924fc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_fbc2b96b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_7a92a18a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_e90e9927.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_6bbad591.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_443ff3d5.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_ac6e69ef.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/136667_7abc64b4.jpg"
    ],
    "destinations": ["Hanoi", "Halong Bay", "Sapa"],
    "timeline": [
      {
        "title": "Day 1: Airport pick up - Check in hotel in Hanoi",
        "description": "In and around HanoiPick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself. Note: Check in time is 13:00 P.M. Our people will greet and brief all informationa round the trip.Start point\n Hanoi old quarter, Hanoi, Vietnam 07:00 - 08:00"
      },
      {
        "title": "Day 2: Hanoi – Halong bay – Overnight on Majestic Cruises (B, L, D)",
        "description": "08h00 – 08h30: Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay. 12h30 – 13h00: Embark on Majestic Cruises followed by a short cruise briefing. 13h30 – 14h30: Savor a delectable lunch as Majestic Cruises among the limestone islands. 15h00 – 16h00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay. 16h00 – 17h00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay. 17h00 – 17h30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way. 17h30 – 19h00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set. 19h00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around. Overnight on board."
      },
      {
        "title": "Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meal: B, L )",
        "description": "06h30 – 07h15: Start your day with Tai Chi exercises or a photo hunt. 07h30 – 08h30: Have breakfast on board and enjoy the peaceful morning of Halong Bay. 09h00 – 10h00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area. 10h15: Return to the boat. Freshen up and check out of your cabin. 10h15 – 11h00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more. 11h00 – 12h15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch. 12h15 – 12h30: Disembark Majestic Cruise. 12h30 – 13h00: Transfer back to Hanoi."
      },
      {
        "title": "Day 4: Hanoi - Sapa by bus - Cat Cat village – Sapa Hotel (L, D)",
        "description": "6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa. 9.30: Follow the highway to Lao Cai city with the first comfort break 11.00: Second comfort break at Lao Cai city before approaching Sapa 13.00: Arrive Sapa Town with colorful traditional costums of H’mong, Dzao, Tay ethnic People. Welcome drink and itinerary briefing Enjoy the lunch with local Vietnamese dishes, check-in procedures 14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon. Trekking distance is about 2.5 kms and it lasts for 2 hours 17.00: Come back to Sapa Town. Have dinner and overnight in hotel with night activities."
      },
      {
        "title": "Day 5: Sapa - Y Linh Ho - Lao Chai - Ta Van – Hanoi (B/L)",
        "description": "7.00 – 7.45: Have breakfast at hotel and prepare light pack for trekking 8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people. Trekking distance is about 9 kms and it lasts for 3.5 hours 11.30: Bus picks you up at Ta Van Bridge to Sapa. 12.00 – 15.00: Have a shower at hotel, check out and have lunch and time at leisure on your own. 15.00: Meet all group members at hotel to get ready for Hanoi. 15.15: Get on bus to go back to Hanoi with two comfort breaks. 21.15: Check in hotel in Hanoi"
      },
      {
        "title": "Day 6: Hanoi Free Day (B)",
        "description": "You are free today to relax after Sapa tour or you can visit some villages around Hanoi. please contact Vietnam Travel Top if you need any arrangement. Breakfast and hotel in Hanoi are included."
      },
      {
        "title": "Day 7: Hoa Lu Tam Coc 1 day tour (B/ L)",
        "description": "8.00 – 8.30 am:  Picking up from hotel/stay. 08:30 Starting drive to Ninh Binh Province 10:00 Arriving at Hoa Lu Ancient Capital 10:15 Visiting King Dinh and King Le’s temples. 11:30 Arriving in Tam Coc Wharf. 11:45 Having buffet lunch with Vietnamese Cuisine. 13:00 Getting on Sampan boats through caves and visiting countryside landscape 15:00 Back to Tam Coc Wharf to chill out. 15:15 Biking on country road around village 16:00 Getting on shuttle bus to go back to Hanoi 18:30 Saying goodbye to you at your hotel in Hanoi. Note: Sometimes, we will switch to visit Tam Coc first and then Hoa Lu."
      },
      {
        "title": "Day 8: Hanoi Departure (B",
        "description": "We will arrange car to airport for you, please advise your flight details. If you need any further arrangement: tour to Hoi an, Ho Chi Minh City…please advise.End point\n Hanoi old quarter, Hanoi, Vietnam 18:00 - 19:00"
      }
    ]
  },
  {
    "name": "Off the beaten tracks in North Vietnam 8 days 7 nights",
    "duration": 8,
    "travelStyle": ["Adventure", "Family", "Christmas & New Year"],
    "oldPrice": 0,
    "price": 1157,
    "summary": "This eight-day adventure veers off the beaten path and into the wild and unspoilt beauty of Northern Vietnam. During the trip, you will trek through mountains, valleys and villages to discover the landscapes and cultures of Sapa and the frontier region of Ha Giang before winding up in the sublime setting of Ba Be National Park.",
    "highlights": [],
    "imageCover": "https://cdn.tourradar.com/s3/tour/1500x800/155832_fe0cbb6b.jpg",
    "images": [
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_fe0cbb6b.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_877797e9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_1af38565.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_021f82a6.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_dde5b96d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_d1f1f86a.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_353f89bc.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_9f21abd0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_e2bb9c66.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_b2aac1d9.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_376edf43.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_e5c0ffaf.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_ceae4966.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_53dda887.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_c505fde0.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_ad997cfd.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_8ec2b542.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_85ba0b8d.jpg",
      "https://cdn.tourradar.com/s3/tour/1500x800/155832_0dc784ad.jpg"
    ],
    "destinations": [],
    "timeline": [
      {
        "title": "Day 1: Hanoi - Sapa (B/L/D)",
        "description": "In and around HanoiOur guide and driver will pick you up around 7:30am for your 5 hour drive to Sapa. Simply sit back, relax, and enjoy as the scenery transforms from bustling metropolis to rolling hills and endless rice paddies.  Around midday you will arrive in Sapa, at which time you’ll get to enjoy a local lunch. Then for your first trek we will head through the rice terraces from Lao Chai to Ta Van village, which is inhabited by a H’mong community. Here you’ll get the chance to meet local people and share stories and information about your respective cultures with each other before you head back to Sapa Town by car for an overnight stay in a hotel.Start point\n Hanoi old quarter, Hanoi, Vietnam 07:30 - 08:00"
      },
      {
        "title": "Day 2: Sapa Trekking (B/L/D)",
        "description": " After enjoying a delicious breakfast, we start our trek by heading to the Red Dzao village of Ma Tra, followed by the village of Ta Phin. On the way here there will be stunning scenery of rice paddies and small villages everywhere you look, and we’ll end the day by staying in a local homestay in Ta Phin, allowing you to really get up close and personal with the culture and traditions here."
      },
      {
        "title": "Day 3: Sapa - Ha Giang (B/L/D)",
        "description": " Today we’ll leave Sapa in favour of Vietnam’s final frontier, Ha Giang. On the way we’ll make a stop at Hoang A Tuong (or the “Cat King’s House”) in Bac Ha Town and have lunch in Chang Village, both inhabited by Tay communities.  After lunch we continue our drive deeper into Ha Giang, enjoying the spectacular scenery along the way, before finally reaching the Tay village where we will spend the night around 6pm, just in time for a home-cooked dinner. You’ll overnight in this traditional Tay stilt house."
      },
      {
        "title": "Day 4: Ha Giang - Dong Van (B/L/D)",
        "description": " Once we have purchased the mandatory permit at the Immigration Office, you will begin the journey to Dong Van following a spectacular series of passes which wind through the mountains and valleys. En route you enjoy exceptional views of the rolling landscape and interesting flora and fauna. After that, we will have Lunch in the small mountain town of Tam Son visiting the villages of the H’mong, Pho Bang, Pho Cao. You will have the chance to see the former palace of the H’mong King, Vuong Chinh Duc who was an ally of the French. You will arrive in Dong Van around 18:00 where you will have dinner at a local restaurant and spend the night in a hotel."
      },
      {
        "title": "Day 5: Dong Van - Meo Vac - Cao Bang (B/L/D)",
        "description": " You’ll start the day off with breakfast and a visit to the Dong Van Market, where locals come from all the surrounding villages to purchase and trade for essentials they cannot produce themselves.   Then you will be making the trek up to Pu Lo fortress which was built in 1890 and evacuated in 1945. From here you can enjoy spectacular views of the entire region, before climbing 15 km to the top of Ma Pi Leng Pass, through a gigantic maze of limestone peaks, stone forests, and canyons before descending into the valley of Meo Vac. Winding our way through the valley, we’ll eventually reach Bao Lac village, where we’ll rest for a bit and have lunch before being driven to Cao Bang where you’ll spend the night in a hotel."
      },
      {
        "title": "Day 6: Cao Bang - Ban Gioc Waterfall (B/L/D)",
        "description": " This day is likely to be your highlight of the tour, as we take you to one of the most incredible natural wonders in Northern Vietnam; Ban Gioc Waterfall. The drive here from Cao Bang is roughly two hours, and this breath-taking 300-metre wide cascade sits right on the border between China and Vietnam, amidst a beautiful mountainous landscape.  While you’re here you can spend your time relaxing in the glow of the natural beauty, take some amazing photos, and board a bamboo boat that will take you so close to the falls you’ll feel the spray on your face, practically sitting at the very edge of Vietnam, so close to China that you can actually touch it.  After enjoying the waterfall, you will venture deep underground into the magical Nguom Ngao Cave to discover the rock formations which have been carved by erosion over millennia.  After visiting the waterfall and cave, you will travel down a beautiful road which is unknown to many, which winds through the mountains before reaching the Nung village of Quang Uyen.   You will be welcomed by Mr. Hung Dao, an amazingly friendly blacksmith, before having dinner at his house and settling in for the night in this cosy traditional Nung house."
      },
      {
        "title": "Day 7: Cao Bang - Ba Be Lake (B/L/D)",
        "description": " Today we leave Ha Giang behind and drive through Ma Phuc pass on our way to Ba Be National Park. Once in the park, you’ll have time to explore the many wonders located here, such as the lake itself, the caves of Puong Grotto, the rapids of Dau Dang Waterfall and finally the tiny Widow Island located on the lake.  We’ll be staying in a traditional Tay stilt house overnight, staying with a local host family."
      },
      {
        "title": "Day 8: Ba Be Lake - Hanoi (B/L)",
        "description": " After breakfast, we’ll take you on a stroll along the riverfront to visit some surrounding villages, followed by a hike up one of the higher points around the lake, providing you with some impressive views surrounded by limestone formations and mountain peaks.  Following this we enter Hua Ma Cave, famous for its thousands of stalactites and stalagmites, and also known for being the biggest dry cave in Northeastern Vietnam. After lunch in a local restaurant, it’s sadly time to head back to Hanoi and say our goodbyes, arriving at your hotel around 5pm. End point\n Hanoi old quarter, Hanoi, Vietnam 17:00 - 18:00"
      }
    ]
  }
]
