[{"name":"Hanoi Halong Bay Tour with Luxury Flamingo Cruise - 4 Days","duration":4,"travelStyle":["Ocean Cruise","Group","Partially Guided","Holiday"],"oldPrice":0,"price":450,"summary":"This inclusive package tour is a great combination in between Hanoi & Halong bay. You'll not only have a chance to get picked up from the airport, tour around the city, stay at nice 3-star centrally located hotels in the old quarters but also a great journey in Halong Bay with our Luxury Flamingo Cruise - 4-star luxury one to explore the magnificent beauties of Halong bay with islets, caves ...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130514_d9839822.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130514_d9839822.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_471e1914.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_905c8628.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_042349b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_9b45eb6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_307579f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_f0ed9508.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_daab086b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_9482c91f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_5663450e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130514_8ba66d1b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI – ARRIVAL","description":"Arrival Hanoi, you will be picked up by our guide and driver to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere.\nO/N in Ha Noi."},{"title":"DAY 2: HANOI – HALONG BAY TOUR WITH LUXURY FLAMINGO CRUISE – KAYAKING (B/L/D)","description":"07:30     Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30    Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30    Great lunch is served while cruising passing by islets.\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises\n"},{"title":"DAY 3: HALONG BAY – SURPRISING CAVE – HANOI (B/L/-)","description":"06:30: Tai Chi class on the Sun-deck.\n07:30: Have breakfast with Coffee, tea and Bakeries on board.\n08:30: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30 – 10:30: Check out time. Relax on the sun-deck or inside the restaurant to enjoy the bay scenery during the trip back the pier.\n10:00: Farewell brunch’ll be served on board and saying goodbye to the screws.\n12:00: Disembarkation at Tuan Chau Harbour. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00: Arrive in Hanoi.\nOvernight in Hanoi."},{"title":"DAY 4: HANOI – DEPARTURE (B)","description":"Breakfast at your hotel, you will be free by your own to have more discoveries Hanoi then picked up to the airport for a flight back home!"}]},{"name":"3-day Halong Bay Cruise and Cat Ba Island","duration":3,"travelStyle":["Boat","Group","Partially Guided","Holiday"],"oldPrice":0,"price":218,"summary":"Discover Halong Bay, Lan Ha Bay and Cat Ba Island with a 3-day itinerary that includes a boat cruise in the World Heritage area plus an overnight stay in town. Stop for a swim at Soi Sim Island and visit Sung Sot Cave (Amazing Cave); take a boat tour to nearby Lan Ha Bay; look for wildlife at Monkey Island; and enjoy free time in Cat Ba. Choose from activities such as kayaking, cooking, karaoke or squid fishing.\n\nHighlights\n\n* 3-day Halong Bay and Cat Ba Island cruise from Hanoi\n* Visit Sung Sot Cave, and explore Lan Ha Bay\n* Enjoy a welcome drink plus morning tea, coffee and cake\n* Kayaking / Bamboo boat in Halong Bay\n* Full meals provided on board\n* Stay in a superior ensuite cabin + Spend one night at a 3-star hotel in Cat Ba Town\n*Includes round-trip hotel transport by air-conditioned coach","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/176013_48933e43.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/176013_48933e43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_6dbc914f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_1a675d93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_6537ea20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_ecf65ace.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_63d9a9f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_20c8dad3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_a3d27c95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_2575b6bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_50f0ad3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_901efb5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_610e99b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_865f5e95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_6c34aad6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176013_c121288a.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"Day 1: Hanoi - Halong Bay - Surprising Cave - Titop or Soi Sim Island (L,D)","description":"7:45am to 8:30am: Pick you up at your hotel in Hanoi Old Quarter and depart to Ha Long Bay. Rest stop for 20 minutes en-route.\n\n12pm to 12:30pm: Arrive at harbor and board cruise by a tender. Enjoy a welcome drink while captain delivers cruise briefing. Savor lunch on board while cruising through Ha Long symbols Stone Dog Islet and Trong Mai Islet.\n\n14:30pm: Visit Sung Sot Cave (the cave of Surprise) with millions of surprising stalactites and stalagmites. \n\n16:00 Stop at Titop or Soi Sim island for one hour for swimming, sun-bathing or getting a panoramic view on the island's peak.\n\n18:00 Come back to cruise and enjoy sunset party and cooking class with fresh spring roll.\n\n19:00 Have dinner on board\n\n20:00 Enjoy karaoke or squid fishing in the evening. Overnight in your cabin suite on the cruise in the middle of Halong Bay."},{"title":"Day 2: Halong Bay - Pearl farm - Cat Ba National Park - Trung Trang Cave (B/L/D)","description":"07:00: Start your day with complimentary tea or coffee, then enjoy breakfast on board.\n\n08:00: Visit a pearl farm village. See the pearl products and understand the process of pearl making in Ha Long.\n\n10:00 Checkout cabin\n\n11:00 Lunch will be served onboard.\n\n12:00 Our guide will take you to speed boat passing the bay to Gia Luan Harbor\n\n13:00 Our local tour guide take you to visit Cat Ba National Park is a tourist attractions to millions of domestic and oversea visitors.\n\n15:00 Keep moving to visit Trung Trang cave has an ecosystem in mysterious darkness, home to many species of creatures such as bats, birds, insects and reptiles.\n\n16:00 Get on the bus to your hotel on Cat Ba Island, check in hotel then free time.\n\n19:00 Have dinner in your hotel, overnight in hotel "},{"title":"Day 3: Cat Ba Island - Monkey Island – Hanoi (B,L)","description":"08:00: Have breakfast in your hotel. Enjoy your morning in Cat Ba town. Take advantage of the beautiful morning landscape, a prefect photo opportunity.\n\n08:30 Our driver will pick you up from hotel to Beo Harbor, get on the boat to visit Monkey Island for swimming and go up to take nice pictures of Lan Ha bay with thousands of islets around.\n\n11:00 Have lunch in restaurant, then check out of your hotel.\n\n12:00 - 12:30 The bus will come your hotel, get on the bus, say goodbye Cat Ba Island back to Hanoi.\n\n17:00: Arrive to Hanoi, get dropped off at your hotel. Tour ends."}]}]