[{"name":"3 Nights Hanoi and 1 Night on La Regina Legend Cruises","duration":5,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":170,"summary":"Spend 03 Nights in Quoc Hoa Premier Hotel 4* in Hanoi\nFree round trip transfer Hanoi-Halong Bay and Airport\nFree Kayaking to explore tunnel caves\nSail on both Lan Ha Bay & Cat Ba Island\nExcellent service with well trained team\nSpend full day to visit Trang An and Bai Dinh Pagoda ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161896_51c0603e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161896_51c0603e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_f14b22bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_7ab1ea02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_ed9d4032.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_357b1150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_29ae76fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_1baabaee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_3d84a6bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_47c2c6b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_b6f6146f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_83be0d10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_29fb34f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_d1a3236e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_75d83095.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_99a27af1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161896_d51f1aed.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - La Regina Legend Cruises","description":"9:00-9:30 LA REGINA LEGEND CRUISE luxury limousine picks you up at your hotel at Hanoi Old Quarter to travel to La Regina Private Lounge – arrive at around 11h30. The 2-hour journey from Hanoi to Got Ferry via the new Hanoi – Hai Phong highway is seen as a much quicker and smoother than the classic 4-hour drive to other ferries in Halong City. It’s a huge advantage when cruising with La Regina Legend Cruise.\n12:30 Let your vacation start with a welcome drink and wet towel during the time that our Cruise Manager introduce the safety briefing. The boat start to cruise to Lan Ha bay.\n13:15 Delicious set menu lunch is served in La Corona restaurant.\n15:30 Feel free to discover Trung Trang cave, one iconic and historic cave in Cat Ba island\n17:30 - 19:00 Enjoy your time with the beautiful sunset on the bay and join “Happy Hour” - 30% Discount off all drinks onboard\n18:30 join our Cooking Class on sundeck with the Chef on boat and learn how to prepare one of the most iconic dish of Vietnamese cuisine.\n19:30 Dinner is served on sundeck if the weather permit\n21:00 Other option is to try yourself at Squid Fishing at the reception or watching movie in the La Magia Restaurant on the third floor"},{"title":"Day 3: La Regina Legend Cruises - Hanoi","description":"06:15 Start your day with a Taichi session on the sundeck\n06:45 Light breakfast is served in La Corona on the second floor\n07:30 The boat anchor at Tra Bau area, it is time to discover the natural beauty of Lan Ha bay by kayaking or swimming.\n9:00 - 9:45 Back to the main boat for relaxing and check out at the reception, please put all your luggage at the outside of your cabin, crew member will help to bring luggage on land.\n09:45 Brunch is served in the restaurant while the boat heads back to the harbor.\n11:30 Disembark at the harbor. Get back to the Bus for Hanoi\n15:30 - 16:00: Arrive Hanoi Downtown. Check in hotel and stay overnight in Hanoi"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Hanoi 3 Nights plus 1 Night on Perla Dawn Sails 5*","duration":5,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":168,"summary":"Free Round Trip Transfer Hanoi - Halong and Airport\n01 Night on Perla Dawn Sails Luxury Brand New Cruise\nKayaking, Biking, Snorkeling, Cooking Class\nCruise through Halong Bay and Lan Ha Bay\nSpend 03 Nights in Quoc Hoa Premier Hotel 4* in Hanoi ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161877_44086977.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161877_44086977.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_15144db6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_21a00f53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_74f90333.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_ac78ad67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_f19f0b6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_f604e629.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_9359406c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_fe3dfe5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_b46277e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_703d6e6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_aa391e90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_2a372821.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_287588a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_8841e39e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_37214968.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161877_6415362c.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Hanoi - Perla Dawn Sails Halong Bay","description":"09:00 - 09:30 Pick-up at your hotel nearby the Old Quarter in Hanoi by luxury Limousine van\n12:00 - 12:30 Embark the Perla Dawn Sails at Cat Hai port. Enjoy a welcome drink and cruise briefing.\n13:15 - 14:00A splendid lunch is served while cruising into the primitive Lan Ha Bay.\n15:30 - 17:00 On a bamboo boat, visit Bright Cave, a serene round lake surrounded by lush trees and high stone cliffs. Then enjoy swimming in the private emerald water.\n17:00 - 18:30 Return to the Perla Dawn Sails for afternoon tea on the top deck - a perfect time to take some of your best snapshots of the day when the sun begins to set. Enjoy daily HAPPY HOUR promotion - BUY 1 GET 1 FREE on all beverages from 17:30 - 18:30.\nRelax with Massage and Spa treatment, always available upon request\n19:00 Delight in the shimmering atmosphere of thousands of stars while eating a fantastic, expertly prepared dinner on floating farm, all while floating in the center of serene Lan Ha Bay. To be impressed by an absorbing fruit and vegetable carving demonstration and a traditional music performance at dinner time."},{"title":"Day 3: Perla Dawn Sails - Hanoi","description":"06:30 - 06:45 Begin your new day with a Tai Chi session or a photo hunt.\n07:00 - 07:45 Enjoy breakfast in the fresh air and peaceful beauty of the Bay.\n07:45 - 09:00 Experience kayaking to discover the lovely Tra Bau area. Visit a fishing farm and socialize with the resident fishermen to know more about life here and how the people work every day.\n09:00 - 09:45 Pack your luggage and check out of your cabin while cruising towards the port.\n10:00 - 11:30 join a cooking demonstration before enjoying an extraordinary Buffet lunch\n11:45 - 12:00 Disembark the Perla Dawn Sails & Farewell\n14:30 - 15:00 Arrive in Hanoi. Trip ends."},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Hoi An – My Son Sanctuary – Tra Que Vegetable Village – Hue City – Phong Nha Cave Tour","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":405,"summary":"In and around Da Nang, Hoi An(No guide/ no meal)\nPick you up at Danang airport flight no…, transfer to Hoi An old town, check in hotel.\n\n\nArriving Hoian - one of the World’s Heritage Site, you have chances to walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda by yourselves. In Hoian, everything is preserved as they were hundreds years ago. At night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs. (expense is taken by you)\n\n\nOvernight in Hoi AnStart point\n Pick you up at Danang airport flight no…, transfer to Hoi An old town, check in hotel., Da Nang International Airport, Hai Chau Dist., Da Nang City, Quận Hải Châu, Đà Nẵng 552200, Vietnam ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171021_9511dd7c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171021_9511dd7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_55cfbc46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_e8765cba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_34729b28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_6ba20a22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_58f8236c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_44a1e052.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_9e6d4265.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_6f90f995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_89d5d36a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_24c06a00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_3ddbbf81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171021_0fe16641.jpg"],"destinations":["Hoi An","Hue","Phong Nha-Kẻ Bàng National Park"],"timeline":[{"title":"DAY 1: DANANG ARRIVAL – HOI AN OLD TOWN","description":"(No guide/ no meal)\nPick you up at Danang airport flight no…, transfer to Hoi An old town, check in hotel.\n\n\nArriving Hoian - one of the World’s Heritage Site, you have chances to walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda by yourselves. In Hoian, everything is preserved as they were hundreds years ago. At night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs. (expense is taken by you)\n\n\nOvernight in Hoi An"},{"title":"DAY 2: HOI AN – MY SON (B/L)","description":"After breakfast at hotel:\n\n\n8:30 am: Tour guide will pick you up at Hotel, and then we go to visit My Son Sanctuary – one of World’s Heritage Sites\n\n\n10:00 am: My Son Sanctuary, which used to be the citadel of Champa Kingdom, has been keeping the ancient beauty with more than 70 architectural works, which are the temples of the old Champa Kingdom. They still survive until today, despite the destruction of many wars. You will be able to not only discover the old Cham Pa monuments but also admire the Champa traditional dance performed by the professional local artists.\n\n\n12:30 pm: Depart for restaurant near Hoi An\n\n\n1:30 pm: Having lunch in a local restaurant\n\n\n2:30 pm: We will go back to your places in Hoi An\n\n\nOvernight in Hoi An"},{"title":"DAY 3: TRA QUE VILLAGE – DA NANG(B/L)","description":"After breakfast at hotel, check out hotel.\n\n\n8.00am: Local guide will see you at your hotel with your bicycle. You will cycle to a local farm in Tra Que Village. A short stroll will take you around the vegetable garden and then you can join the farmers in preparing the land and fertilizing it with seaweed from the local lake. Following steps are raking the ground, sowing, watering, picking vegetable and many other gardening activities.\n\n\n After all these activities, you will take a short rest and enjoy foot bath before getting to preparing lunch with a local family. \n\n\nYour lunch will consist of many local delicacies including “Tam Huu” spring roll, “Banh Xeo” or local pancake of people in Vietnam middle region. You can join the cooking with the chef on these meals. After your morning excurtions and your lunch, you will take a Vietnamese traditional post-prandial nap before learning how to harvest and wrap the vegetables.\n\n\nAround 2.00pm, bid farewell to your host family before riding back to Hoi An.\n\n\nPick you up back to Da nang. Check in hotel\nOvernight in Da Nang"},{"title":"DAY 4: DA NANG – HUE IMPERIAL CITY (B/L)","description":"Enjoy breakfast at hotel. Then, check out hotel\n\n\n7:30 am: In the morning, you will be picked up at hotel, then we start Hue city tour. On the way to Hue, you will pass through Hai Van tunnel, the longest tunnel in Southeast Asia.\nBesides that, you will have some time to enjoy the golden sandy beach of Lang Co Bay – one of the most beautiful bay in the planet.\n\n\n9:30 am: After arriving Hue citadel, you will visit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city.\n\n\nThien Mu Pagoda – the most beautiful pagoda of Hue, which is considered as the National pagoda of The Nguyen Dynasty, is your next destination after Khai Dinh Tomb. You can find the relics of Monk Thich Quang Duc – his private car, an eloquent witness of the Buddhist era in Vietnam.\n\n\n12:30 pm: At lunch time, introduces to you Hue specialties – the featured local dishes of this ancient city, in one of Hue’s famous restaurants.\n\n\n1:30 pm: We will take you to Hue Imperial city – the former administrative center as well as the accommodation of 13 Kings of the Nguyen Dynasty – the last feudatory Empire of Vietnam. The Imperial city is preserved as new for hundreds years, and tourists are allowed to visit many places such as Meridian Gate, Thai Hoa Palace and Duyet Thi duong theatre. Our tour guide will tell you the secret stories of the Royal family, of the Kings and the Queens’ lives.\n\n\nAffer that, drop you off at Hue hotel to check in.\nOvernight in Hue"},{"title":"DAY 5: PHONG NHA CAVE (B/L/ Snack meal)","description":"In the morning: \n\n\n6h30: Our guide and bus will pick you up at your hotel. On the way, stop to visit La Vang church and our guide will presenting Quang Tri Citadel (Nonstop) which was built in 1824 (The fierce battle of 81 days and nights has made this citadel well-known all over the world) Then to continue the itinerary our guide introduces about many places such as: Ben Hai river, Hien Luong bridge, Doc Mieu base…\n\n\n12h00: Arrive in Phong Nha - Ke Bang national Park. Lunch at restaurant.\n\n\nAfter lunch, cruise along the Son river to Phong Nha Cave. You will feel the magical and magnificent caves. Phong Nha also boasts underground rivers, large caverns and passageways and broad, pristine sandbanks. The most impressive cave - Phong Nha cave is probably also the most beautiful with many fascinating rock formations with imaginative names such as The Lion, Fairy Caves,... inside the Phong Nha Caves, the more illusory the stalactites and stalagmites look as they glitter when  right light is shone on them.\n\n\n3.30 Pm: Back to Hue on Ho Chi Minh trail. On the way back, you have Snack on the bus. \n\n\n7.30Pm: We arrive in Hue and drop you off at your hotel"},{"title":"DAY 6: HUE DEPATURE (B) (No guide)","description":"Have breakfast then Check out hotel. Pick you up to transfer to Phu Bai airport to catch the flight no…\n\n\nWe hope this tour will bring you many unforgettable memories and joyful moments. See you again!"}]},{"name":"Amazing Vietnam 10 Days - North , central to South","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":570,"summary":"This is a north-south-central route that can impress anyone who once have chance to step in this beautiful S-shaped country. You have 10 days package tour taking you visit the beauty of Vietnam from Hanoi, Ha Long, Da Nang, Hoi An, Sai Gon. Besides, you will enjoy local food, speciality, explore culture of local people. The package tour includes the accomodation at hotel, expert guide as well as meals, transportation.\nEnjoy your time !\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177026_fd1e4de3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177026_fd1e4de3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_cc7f51cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_a48bbcaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_68938797.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_2ca4561f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_dcca8b8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_6be395f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_913242ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_ba0d55e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_99f0861b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_63c7f76a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_8a2d95c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_8943a682.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_568a437c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_13416ee2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177026_b6209a7b.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival - transfer to hotel for check in (no meal)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ha Long Bay - overnight on the cruise (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board\n"},{"title":"Day 3: Ha Long – Pearl farm – Hanoi (B/L)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nOvernight in Hanoi."},{"title":"Day 4: Hanoi free day- Train station transfer- Night train to Da Nang (B)","description":"Have breakfast at the hotel. You are free to expore Hanoi Old Quarter, see water puppet show until transfer to Hanoi Train Station for solf sleeper train to Da nang. Time you need to spend on the train is around 14 hours. On the train you can view our beautiful country along the coastal line. You also stay overnight on the train and reach Danang train station the next day."},{"title":"Day 5: Da Nang pick up - transfer to Hoi An for check in (no meal)","description":"Train arrive on the next day. We will pick up and transfer to Hoi An Ancient town. Check in hotel and you are free on your own."},{"title":"Day 6: Hoi An - My Son sanctuary by boat (B/L)","description":"Pick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu capital which was the the former administrative centre of champa kingdom. Discover the majestic ancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock and board on boat cruise along Thu Bon river.\n12:15 am: Enjoy Local food on Boat (My Quang)\n02:00 pm: Back to your hotel. End the tour.\nOvernight in Hoi An."},{"title":"Day 7: Hoi An - airport transfer- fly to Ho Chi Minh (B)","description":"Have breakfast at hotel. You are free until the driver transfer to airport for flight to HoChi Minh.\nHo Chi Minh arrival, we will transfer to hotel for check in.\nOvernight in Ho Chi Minh."},{"title":"Day 8: Ho Chi Minh - Mekong delta 1 day (B/L)","description":"HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.30 )\nEnjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  \nOvernight in Ho Chi Minh."},{"title":"Day 9: Ho Chi Minh - Cu Chi tunnel (B/L)","description":"( start 8.00 – return 14.30 )\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\n\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nOvernight in Ho Chi Minh.\n"},{"title":"Day 10: Ho Chi Minh departure (B)","description":"Have breakfast at hotel. This day you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. Ends of the service !"}]},{"name":"Experience the Highlights of Central Vietnam 6 days 5 nights","duration":6,"travelStyle":["Historical","Group","Partially Guided","Holiday"],"oldPrice":0,"price":934,"summary":"This tour will take you to many significant and special places, including the sanctuary of the ancient Champa kingdom, My Son. You will also visit the cave-riddled Phong Nha Ke Bang National Park and the ancient towns of Hoi An & Hue.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc65.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2be5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2be9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2beb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8404dcc74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194185_5e4b8400d2bf2.jpg"],"destinations":["Hue","Phong Nha-Kẻ Bàng National Park","Hoi An"],"timeline":[{"title":"Arrive in Hue (L/D)","description":"\nYou will be collected from Phu Bai airport by your guide and taken to your hotel. You will then dive into the history of Hue as you visit Imperial Citadel from where the Nguyen Dynasty ruled between 1802 and 1945. As you visit the ruins of the Purple Forbidden City and Dong Ba market, your guide will be on hand with plenty of information about each place. You will take a night boat trip on Perfume River, complete with a Hue folk song performance, then stay overnight at the hotel in Hue."},{"title":"Hue - Phong Nha (B/L/D)","description":"\nToday you visit Phong Nha National Park, a sprawling land of jungles and caves, which has a Jurassic feel about it. On arrival you will stop for lunch at Phong Nha Lake House where you can take in the views of the still lake and the luscious green surroundings. After filling up on a delicious lunch you will start your discovery of Paradise Cave which was only discovered in 2005. The Cave itself offers 31 km of striking stalactites and stalagmites all glimmering in the fractal light that breaks in through the cracks. You will return to the lake house where you will stay overnight."},{"title":"Phong Nha - Hue (B/L/D)","description":"\nBreakfast at lake house, then you will be collected to go explore Phong Nha Cave. This stunning cavern is located in the oldest karst mountains in Asia and much like Paradise Cave was only discovered recently. This enormous underground space is made up of 14 grottoes as well as over 13 kilometres of winding underground river. The walls and dripping stalactites reflect the colours of the river below making for stunning light shows. You will have lunch at a Restaurant in Dong Hoi Town and then return to Hue, arriving at around 5:30PM for the rest of the day free."},{"title":"Hue - Da Nang - Hoi An (B/L/D)","description":"\nAfter breakfast at the hotel, you will take a morning cruise down the Perfume River to visit Thien Mu Pagoda, the symbol of Hue. As you float down the river you will get a feel for the unique culture of Hue as you witness the daily lives of those who live on the banks of the river. You will return to the hotel by car to check out and have lunch, then drive towards Hoi An (about 4 hours). On the way, you will stop at Lang Co Beach, travel over the Hai Van Pass, visit the Cham Museum and visit Marble Mountain. In Hoi An you can check-in to the hotel and have free time for exploring the town, before staying overnight in a hotel."},{"title":"Hoi An - My Son (B/L/D)","description":"\nAfter breakfast at the hotel, you will get a tour of Hoi An's ancient buildings, visiting the Japanese Covered Bridge, the Pottery Museum, Tan Ky old house, the Cantonese Congregation Hall and Silk Street. In the afternoon you will travel to the atmospheric site of My Son, the former sanctuary of the Cham Kingdom. Both lunch and dinner will be served at a local restaurant in Hoi An Town, and you will stay overnight at the hotel."},{"title":"Hoi An - Da Nang Airport (B/L)","description":"\nAfter breakfast at the hotel, you will have free time to wander through the enchanting streets of Hoi An, perhaps buying some last souvenirs. If necessary, we will then transport you to the airport for onwards travel."}]},{"name":"Vietnam 11 days - South to North","duration":11,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":605,"summary":"This is a south-north route that can impress anyone who once have chance to step in this beautiful S-shaped country. Our first destination is the well-known Sai Gon. You will visit Saigon city and then explore the Mekong Delta which has recently been dubbed as a \"biological treasure trove\". Take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Then fly to the North, you have 2 days to explore Sapa with many hill tribe villages, spectacular mountains, amazing waterfalls and romantic valleys. We will also have chance to share cultural experiences with families that live in the area. A full day Hanoi city tour and 2-day Halong cruise are good chances for you to catch best glimpse of Northern Vietnam’s nature and people. So exciting!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/178496_f6259699.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/178496_f6259699.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_3eb0f581.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_cac2db5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_286f7817.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_e71823d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_9374a154.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_be10b86c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_caef26fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_89ed3c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_667bdf35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_7f8af314.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_e092377d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_d8c14b44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_bc2cdfba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_71a819c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_8be6b8de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_db075f97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_0c55c3a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178496_8c8aabd5.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh arrival (no meal)","description":"Welcome to Ho Chi Minh ! The driver will transfer to hotel for check in. The rest of day is your own at leisure.\n\nOvernight at hotel."},{"title":"Day 2: Ho Chi Minh city and Cu Chi tunnel (B/L)","description":"( start 8.00 – return 19.30 )\nAM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nOvernight at hotel.\n"},{"title":"Day 3: Ho Chi Minh- Mekong - Ben Tre - Can Tho (B/L)","description":"Leave Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel (family home-stay with dinner can be arranged on request). Free time to visit bustling Can Tho market."},{"title":"Day 4: Cai Rang Floating Market - Ho Chi Minh (B/L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to visit Cai Răng floating market, which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to HCM city. \nOvernight at the hotel."},{"title":"Day 5: fly Ho Chi Minh to Hanoi (B)","description":"Have breakfast at the hotel. You are free until the driver transfer to airport for flight to Hanoi.\nWelcome to Hanoi ! The driver transfer to hotel for check in. The rest of day is your own at leisure.\nOvernight at hotel in Hanoi."},{"title":"Day 6: Hanoi city tour (B/L)","description":"(OPTION 1: TUESDAY, THURSDAY, SATURDAY, SUNDAY)\n7.30 – 8.30: Meet your tour guide.\n- Star the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.\n- Visit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father, his house- on – stil and  One pillar pagoda- modeled after a lotus flower, a symbol of Hanoi.\n- Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13.00: Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\n- Visit Temples of Literature constructed in 1070- dedicated to Confucius, sages ad talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam’s first university.\n- Leave for a legendary Hoan Kiem Lake and Ngoc Son temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians.\n16.00: Arrive back in your hotel. Tour ends\nOvernight at hotel.\n"},{"title":"Day 7: Hanoi - Sapa- Cat Cat village (B/L/D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\n\nOvernight at the hotel \n"},{"title":"Day 8: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (B/L)","description":"8:00 – Have breakfast at the hotel.\n\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\nOvernight at hotel in Hanoi."},{"title":"Day 9: Hanoi - Ha Long - Sung Sot cave (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 10: Ha Long – Pearl farm – Hanoi (B/L/X)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nOvernight at the hotel in Hanoi.\n"},{"title":"Day 11: Departure (B)","description":"Have breakfast at the hotel. You are free to go shopping until the driver transfer to airport for flight back home.\n\nEnd of the service !"}]}]