[{"name":"Vietnam Legend Family Holiday 18 Days Trip","duration":18,"travelStyle":["Family","Adventure","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1649,"summary":"Legend Travel Group offers family holidays to explore the remarkable natural, cultural and historical wonders in Vietnam. You and your children will have great time together with relaxation moments combined exciting activities; from beach escapes to scenic and historic journeys. Your children will earn the deepest childhood impressions for years. It will be unforgettable trip for your family’s members.\nThis tour needs a minimum of 2 passengers to be guaranteed to depart.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95449_34f0e28e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95449_34f0e28e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_6f772fdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_3c53582d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_71617442.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_1236690b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_38836a37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_04ce4f4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_d2f3d4e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_e3f236d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_50de08eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_e7585675.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_38fe2158.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_1aab52b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_f5287b0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_c76ccb88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_49895f41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_4178311c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_89cf9891.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_e89e9c1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_4c3f4236.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_8c3de0c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_d12918eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_ddea828e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95449_1e1ba129.jpg"],"destinations":["Hanoi","Mai Chau","Halong Bay","Hoi An","Ho Chi Minh City","Mui Ne","Can Tho","Cai Rang"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"You land in Hanoi, and this is where your family’s adventure begins! You will be welcomed and taken from the airport by our representative to your selected hotel in Hanoi. Free at leisure. Stay overnight in Hanoi.\nIf your arrival time is not too late, you could try options of Water puppet show and 1-hour tour on cyclo to visit Hanoi old quarter with your kids.\nDistance: Noi Bai airport - Hanoi city centre: 30 km or 45 minutes transfer\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi - Moon Garden (B/L)","description":"A day trip to Moon\nGarden, Son Tay will bring your family close to nature and local life.\nHere, your children will have chance to make friend with children here. Join some exciting activities like cooking, biking, farming, which help boys and girls gain more fun and knowledge.\nDrive back to Hanoi in late afternoon. Overnight in Hanoi\nDistance: Hanoi city center - Moon Garden: 30 km or 45 minutes driving\nPomihoa Hotel Hanoi or similar"},{"title":"Day 3: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 4: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 5: Hanoi - Halong Bay Cruise stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast on board, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Vietnam. Stay overnight on Boat.\nDistance: Hanoi central - Halong Bay: 180 km or 3.5 hours driving\nGarden Bay Cruise Halong bay or similar"},{"title":"Day 6: Halong Bay Cruise - Hanoi - Danang on overnight train (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight train to Danang.\nRemark: The Halong itinerary is subject to change upon cruise’s management.\nYou will have a small room at mini hotel for shower before train embarking.\nAs usual, the kids were very excited to sleep on the train. Anyway the restaurant is not available on train, just the “mobile” bar with limited menu. So, be sure to take plenty of snacks and fruit for train ride. We will prepare for your family a soft breakfast for next day morning with bread, butter and milk as well.\nThe cabin on train will be 4-berth sharing cabin with A/C.\nDistance: Hanoi central – Train Station: 3 km or 10 minutes driving.\nOvernight on the Train (4 Berth Cabin Soft Sleeper)"},{"title":"Day 7: Danang Arrival - Hoi An ancient town","description":"Arrive in Danang Station at noon time, your family will be picked up and transferred to your selected hotel in Hoi An.\nThis is a fantastic place that you could easily spend a week in. Great food, great cafes and dessert shops, many travelers get clothes and shoes made here. Even the kids got in on the act as they had some shoes custom made for them. They had their feet measured, then got to pick the style, pattern and color of the shoes. It was a lot of fun for them. Stay overnight in Hoi An hotel.\nDistance: Danang station - Hoi An town: 35 km or 45 minutes driving\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 8: Hoi An Ancient town free on leisure (B)","description":"You have the whole day to discover Hoi An on your own. This lively town was once a major port city and has a beautifully preserved Old Town Centre, a Heritage Site boasting traditional houses, temples and plenty of museums. The best thing to do in Hoi An is to walk around this part of town in the evening when the lanterns light up and you can enjoy the shops, restaurants and the magical atmosphere of this ancient place. The market is fun to wander through and doing a boat ride on the river is easy to arrange and worth it.\nStay overnight in Hoi An hotel.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 9: Hoi An Free on leisure (B)","description":"Another day at your own disposal with a spectacular option! If you so wish, we can arrange for your family the trip to Tra Que Herb Village Mountain and then take a cooking class. You’ll ride through the countryside Tra Que, where you learn about agriculture and the traditional Vietnamese Koker. In the class, you’ll learn how to cook specialties such as Tam Huu-rolls; Bahn Xeo pancakes and more! In the afternoon you will return by bicycle to Hoi An. The kids are always curious on making the food and eat it. Let’s try with them. It would be forever memories of their life.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 10: Da Nang - Ho Chi Minh City by 1 hour of flight - Mui Ne Beach (B)","description":"Leave Hoi An for domestic flight to Hochiminh City (called Saigon as well).\nUpon arrival in Tan Son Nhat Airport, you will be greeted and transferred to Phan Thiet directly, where is available one of the most beautiful white sandy beach Mui Ne.\nArrive in Mui Ne in the late afternoon; it is a bit tired day for you and your kids. That’s why the nice resort on the beach with lovely pool are must for your family. Check-in the room and free to enjoy the night of beach.\nDistance: Tan Son Nhat Airport - Mui Ne Beach: 220km or 5.5 hours driving.\nTien Dat Resort Mui Ne or similar"},{"title":"Day 11: Mui Ne Free on the Beach (B)","description":"Today you will be free for your own activities. The town boasts two interesting sites nearby: The sand dunes which are pretty much what they sound like, a seemingly endless expanse of desert-like sand. And the Fairy Spring, basically a shallow creek that runs through the sand dunes. It’s a lot of fun - especially for kids - to walk up it for a few miles, the whole time splashing, jumping, rolling and frolicking in the cool water and its deliciously goopy sand. Stay overnight in Mui Ne Beach.\nTien Dat Resort Mui Ne or similar"},{"title":"Day 12: Mui Ne Free on the Beach (B)","description":"You will have one more day to enjoy the bikini on beach, game with kids and local seafood.\nStay overnight in Mui Ne Beach.\nTien Dat Resort Mui Ne or similar"},{"title":"Day 13: Mui Ne - Saigon by Road (B)","description":"It is time to say goodbye to the sea and wind to join the car return to Saigon. In order to keep your kids not disappointed of leaving beach, we are ensure to provide you the lovely hotel with pool, which is very attractive with kids.\nStay overnight in Saigon.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 14: Saigon - Cai Be Floating Market - Can Tho (B. L)","description":"A cruise through the Mekong Delta is a must for any Vietnam tour and for your family as well. Starting from Ho Chi Minh City for for the 2.5-hour drive to the delta town of Cai Be.\nThe brilliant colors and bustling markets of the Mekong Delta will delight kids as well as adults.\nArrive in Cai Be at noon, then board the Mekong Cruise. A welcome drink will be given on arrival followed by an introduction to the ship and crew. Depart towards Cho Lach on the Tien Giang River and enjoy lunch on the upper deck while en route. Rest on the deck while the ship branches into the Cho Lach Canal for 30 minutes through the traffic of sand and rice barges, past fruit drying facilities and around wooden ship building yards.\nVisit a village on the banks of river Mang Thít, where you can appreciate the way of life here in the Delta. Visit the orchard or rice fields nearby. Back on board the Mekong Cruise a complimentary drink will be served, so why not sit back and enjoy the sunset overlooking the Mekong’s magical waterways.\nArrive Can Tho City at 5:00pm. Check in and overnight in Can Tho City.\nDistance: Saigon - Caibe: 100km or 2.5 hours driving.\nIris Can Tho Hotel or similar"},{"title":"Day 15: Cai Rang - Can Tho (B, L)","description":"A delicious breakfast will be served from 0630 whilst the boat cruises the Tra On floating market, the boat will then depart towards Can Tho. Upon arrival check out of your cabin and transfer onto a local boat to visit the Cai Rang floating market, the nearby arroyos and gardens.\nCruise through the floating market which bustles with wholesalers on big boats. Here, during the early morning market hours, larger sized boats anchor and create lanes that smaller boats weave in and out of. The main items sold here are fruit and vegetables and every boat has a long upright pole at its bow from which samples of the goods for sale are hung. The waterway becomes a maze of hundreds of boats packed with mango, bananas, papaya, pineapple, and even floating pho vendors.\nReturn to land and have lunch in Can Tho.\nThis afternoon, spend time cycling around the quiet lanes and dirt paths of Can Tho. Biking is the perfect way to discover the countryside with your family. The roads are flat and the sites are amazing: cottage industries, small farms harvesting or planting rice, hidden temples and lots of friendly locals who will come out to greet you.\nThen, transfer to a small hotel in Can Tho. This cozy modern hotel is a comfortable place to stay after a long day. Overnight in Can Tho.\nIris Can Tho Hotel or similar"},{"title":"Day 16: Can Tho - Saigon (B, L)","description":"After your breakfast, it’s time to resume the drive back to Ho Chi Minh City. The journey takes around 4-hours. And you’ll stop en route for lunch. Stay overnight in Saigon hotel.\nDistances: Saigon - Can Tho: 180km or 4 hours driving\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 17: Saigon - Cu chi Tunnel and half day city (B, L)","description":"Depart Ho Chi Minh City at 0800 in the morning for the drive to Cu Chi district. Leaving the city behind, the scenery changes to views of rice paddies, villagers drying noodles by the side of the road and other scenes typical to southern Vietnam. Arrive and start the visit of the famous Cu Chi Tunnels which consist of an incredible underground tunnel network constructed by Vietnamese resistance fighters (Viet Cong) during both the French and American wars. Start the visit with the Ben Dinh or Ben Duoc sections of the tunnel. Here you can imagine what it was like to be a guerrilla complete with Russian Carbine rifles and AK 47’s on display.\nReturn to Ho Chi Minh City for lunch.\nThis afternoon, our tour includes the Reunification Hall, formerly known as the Presidential Palace it was towards this modern building that North Vietnamese tanks seized on the morning of April 30 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. Continue to the Old Post Office, the Notre Dame Cathedral. The last stop is Ben Thanh - the central market for the city and one of its liveliest and most colorful areas. Stay overnight in Saigon hotel.\nDistance: Saigon - Cu Chi Tunnel: 75km or 1.5 hours driving\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 18: Saigon - Departure (B)","description":"Today is your last day in Vietnam. After breakfast, check your luggage to make sure you will not forget anything before leaving for home. Our guide and driver will escort you to the end of the trip at airport. End of services. Good bye and hope to see you very soon in Vietnam and Indochina.\nAirport transfer included!"}]},{"name":"Hanoi - Hoalu -Tamcoc -Halong Bay 5days/4nights","duration":5,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":306,"summary":"In and around HanoiUpon arrival at Noibai International airport, our representative will meet and transfer you to downtown for relax.\nOvernight in Hanoi.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128181_87b38909.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128181_87b38909.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_179bec61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_52f960c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_4a557c10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_017549a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_56ca71fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_74f2343c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128181_477d83a4.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Upon arrival at Noibai International airport, our representative will meet and transfer you to downtown for relax.\nOvernight in Hanoi.\n"},{"title":"Day 2: Hoalu – Tamcoc full day (B/L)","description":"In the morning Have breakfast at your hotel\n\n\n07:45 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n\n\n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, 257Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n\n\n18:00 Arrive in Hanoi. Tour ends Overnight in Hanoi."},{"title":"Day 3: Hanoi – Halong Bay (B/L/D) – Dragon Gold Cruise","description":"07:45 - 08:30 Meet your tour guide then go for Ha Long Bay. Have a break 20 minutes en-route to free your legs.\n\n\nEmbark harbor, board Dragon Cruise by a tender. Enjoy a welcome drink, receive cruise briefing. Savor lunch on board and visit Sung Sot amazing cave with millions of surprising stalactites and stalagmites.Stop at Soi Sim island or Titop Island one hour for swimming, sun-bathing… \n\n\nDrop anchor in a calm water area, relax on the sundeck at sunset, taste some local wine, fruits.\nJoin in a cooking session on board with our chef making some special dishes with suggested recipe.\n\n\n19:00 Have dinner on board. Have fun with karaoke singing, or try your luck with squid-fishing. \n\n\n Overnight on Dragon gold Cruise in the middle of Ha Long Bay."},{"title":"Day 4: Halong Bay – Hanoi (B/L)","description":"07:00 Enjoy a new day with complimentary tea and coffee served. Have breakfast on board\nDo kayaking the best way to explore true beauty of Ha Long.\nCheck out your cabin. Photograph wonderful views of Ha Long while sailing back to harbor.\n\n\n11:00:  Savor lunch on board and leave Dragon gold Cruise.\n\n\n12: 30:  Say goodbye to Ha Long Bay then return to Hanoi. Have a rest en-route again to free your legs.\n\n\n17:30 Drop you off at your hotel Overnight in Hanoi."},{"title":"Day 5: Hanoi free & Easy -Departure (B)","description":"Breakfast at hotel. Free and easy till our bus and driver will pick you up at your hotel and drive to the airport for your flight back home. \n\n\nEnd of trip!"}]},{"name":"Grand Vietnam Tour - 16 days/15 nights","duration":16,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1480,"summary":"Exotic Vietnam is a trip lengthens from North to South Vietnam on Grand Vietnam Tour. We explore the colorful hill-tribe villages in Sapa and stay overnight on Halong Bay cruise, discover Hoian and surroundings and explore the waterways and lust orchards of the Mekong Delta then end at the fantastic markets of China Town in Saigon. This trip offers great experience for those who want to discover Vietnam in depth.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153234_af011cc4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153234_af011cc4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_477dcd2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_2357ff06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_29aedb0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_c514a650.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_df105f7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_c797c31e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_0b03150d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_914b7494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_4d70522a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_2deedd06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_c1aa2f39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_2efcfec7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_2ebfd5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_038ad8a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_000f33b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_121a1184.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_d57e2157.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_698bab24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_8b423580.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_8d488116.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_2a4e1296.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_5881c4b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153234_1fc24f4f.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An","Hue","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you\nMeals: N/A\n Accommodation: Hotel in Hanoi"},{"title":"DAY 2: HANOI - CITY TOUR - NIGHT TRAIN TO SAPA","description":"Free in the morning. \nIn the afternoon, half day tour to visit Hanoi. We start with visit to President Ho Chi Minh's mausoleum (Outsite). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university\nFinally, visit the Hoa Lo prison. Free time to relax till transfer to the station for night train to Sapa\nNote*:\nLate checkout at the hotel is not included.\nOur tour guide will not accompany during the train trip\nTrain schedule is subject to change depending on availability\nPrivate compartments on request at surcharge.\nTrain journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages.\n Meals: Breakfast\n Accommodation: Hotel in Hanoi"},{"title":"DAY 3: Y LINH HO - LAO CHAI - TA VAN VILLAGES TREKKING","description":"Sa Pa is a quiet mountain town and home to a great diversity of ethnic minority peoples. Most of the ethnic minority people work their land on sloping terraces since the vast majority of the land is mountainous. Their staple foods are rice and corn. Rice, by its very nature of being a labour intensive crop, makes the daily fight for survival paramount. The unique climate in Sapa has a major influence on the ethnic minorities who live in the area. With sub-tropical summers, temperate winters and 160 days of mist annually, the influence on agricultural yields and health related issues are significant. \n\n05:30 ~ 06:00: Arrive at Lao Cai Train Station. Pick up at the train station and transfer to Sapa. Early check in upon arrival is possible upon room occupancy (Surcharge applicable). Breakfast and Relax for a while to get ready for our full day tour. \n\n9.30am: Meet up your local guide and start trekking for 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. A 2 km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. On the way, we would have chance to learn about the local agriculture producing customs and daily lifestyle. We have lunch at a local family, offering you a worth chance to learn about the local house architecture, which is full of their daily life styles and exclusive custom. We will then get back to Sapa by jeep or motorbike\nMeals: Breakfast/Lunch\n Accommodation: Hotel in Sapa"},{"title":"DAY 4: CAT CAT - SIN CHAI VILLAGES TREKKING - BUS TO HANOI","description":"08:30: Pickup at the hotel. We start a walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. We enjoy picnic lunch by the side of the river, and trek for 6 km to Sin Chai village, which is located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way back to Sapa.\nYou are free to explore the town till bus transfer to Hanoi departing at 3:00pm. Arrive Hanoi at 9pm.\nMeals: Breakfast/Lunch\n Accommodation: Hotel in Hanoi"},{"title":"DAY 5: HANOI - HALONG BAY - NIGHT ON BOARD","description":"7:45 – 08:15 : Pick up at your hotel near by the Old Quarter in Hanoi by shuttle bus\n12:30 – 12:30 : Embark the cruise at Tuan Chau harbor. Enjoy welcome drink, cruise briefing & start cruising.\n13:00 – 15:30 : A stunning lunch is served while cruising into the Halong Bay with thousands of extraordinary shaped limestone islands considered as the heaven on the earth\n15:30 – 17:00 : Explore the area and be charmed by the outstanding masterpiece of the Mother Nature. Visit Mê Cung Cave – one of the most beautiful caves in Halong Bay. Climb up & see the panoramic view of the bay from above. Enjoy swimming in the crystal water of the peaceful Bay. \n17:00 – 19:00 : Return to the cruise the Sunset party and admire the best moment of the day when the sun starts to set. Or enjoy the massage treatment in your comfortable cabin. \n19:00 : Savor an amazing and dreamlike dinner in Fairy cave (or Drum cave) with extremely delicious food which is not only impressed by its incredible taste, but also by great fruit and vegetable carving performance. Socialize with new friends and crew members, enjoy squid fishing or leisurely relax on the top deck in the middle of the tranquil bay.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\nMeals: Breakfast/Lunch/Dinner, Accommodation: Night on board\n"},{"title":"DAY 6: HALONG BAY KAYAKING - NIGHT ON BOARD","description":"6.30 – 07.00 : Start your new day with a Tai Chi session or a photo hunt for the glamour sunrise in Halong Bay in the early morning.\n07.00 – 08.00 : Have breakfast in the peaceful bay while listening to the bird songs.\n08:00 – 10:00 : Transfer to a high quality day boat for a cruise to Thien Canh Son Cave, visit the cave to learn about the karst formation. Enjoy hiking to see the panorama view of the Bay from the cave’s entrance. \n10:00 – 12:00 : Start to down for a beautiful white-sand beach at the foot of Hon Co Island. Go kayaking though the isolated and off-the-beaten-track appeal of the Bay. Enjoy swimming in the blue water or leisurely lying down under the tropical sunshine for sunbathing.\n12:30 – 14:00 : Back to the boat for lunch. \n14:00 – 14:00 : More time for kayaking through the hidden lagoons and explore the biological diversity of the Bay. \n16:30 – 19:00 : Return to the cruise refreshing and stretching your selves on the top deck. Join in the Sunset party and see the beautiful pinky clouds reflecting on the water surface. Or enjoy the massage treatment in your comfortable cabin. \n19:00 : Savor our delicious dinner with incredible traditional Vietnamese food and amazing vegetable carving performance, while being well introduced the philosophies that lie behind each type of cuisine. Socialize with new friends and crew members, enjoy squid fishing or leisurely relax on the top deck in the middle of the tranquil bay.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\nMeals: Breakfast/Lunch/Dinner. Accommodation: Night on board"},{"title":"DAY 7: HALONG BAY - HANOI - FIGHT TO DANANG","description":"7.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\nMeals: Breakfast/Lunch\n Accommodation: Hotel in Hoian\n"},{"title":"DAY 8: HOIAN - FREE AND EASY DAY","description":"Free and easy in the morning to relax in Hoi An. The town was once a bustling port in centuries gone by, before the river silted up.\nAt 3pm, pickup for a walking and street food tour. We will first visit Hoian ancient town with all major interesting sites: Ong Pagoda, Hoi An Museum, Japanese Covered Bridge, Tan Ky Old House, Assembly Hall of Cantonese Chinese Congregation.\nAfter visiting historical tour, We start for our Hoi An Street Food Tour. We all will eat in different restaurants with more many dishes. This tour is the time you would explore the hidden local places by night in beautiful Hoi An. Back to the hotel at about 8pm. \nMeals: Breakfast/Dinner. Accommodation: Hotel in Hoian"},{"title":"DAY 9: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\nMeals: Breakfast/Lunch. Accommodation: Hotel in Hoian"},{"title":"DAY 10: HOIAN - FREE AND EASY DAY","description":"Free and easy day for shopping and personal activities in Hoian ancient town\nMeals: Breakfast. Accommodation: Hotel in Hoian"},{"title":"DAY 11: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"Free in the morning.\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\nNote*:\nTrain schedule is subject to change depending on availability\nTrain journeys are part of a great local experience. The train take about 2.5 hours. Restrooms at either end of the carriages.\n Meals: Breakfast. Accommodation: Hotel in Hue"},{"title":"DAY 12: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel.\n\nToday, we will spend a full day touring Hue city. \n\nIn the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant. \nIn the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village\nThen airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 13: SAIGON CITY + CU CHI TUNNELS TOUR","description":"Pickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon.\nIn late afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon"},{"title":"DAY 14: SAIGON - MEKONG ADVENTURE","description":"07:40am: Pick you up at your hotel and depart for Ben Tre.\n\nAfter arriving at Ham Luong dock, board the boat & cruise along Ham Luong River, a tributary to the Mekong River. The cool breeze from the river and lush tropical islands along its banks will immediately get you excited to explore all the great things ahead.\nArrive and visit various local workplaces to find many wonderful examples of how local people use ageless techniques to create their crafts, including activated charcoal, dried coconut, handy coconut husk brooms, and many family businesses using coir, or coconut fiber, to create amazing art. Drive around the village roads by “Xe Lôi”, the local vehicle, which is a kind of motorized rickshaw. Perfect your day with a delicious and filling lunch at a local host house.\n\nBreak time, treating yourself to a relaxing time to relish the beautiful countryside or cycling around the village. Visit the local fruit plantation, enjoy seasonal fresh fruits, and spend time relaxing while being rowed in a small boat slowly through the natural canals to get a sense of how truly beautiful this area is.Embark on the sampan and return to the dock. Travel back to Saigon. Complete your trip.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon"},{"title":"DAY 15: SAIGON - FREE AND EASY DAY","description":"Enjoy your free day for shopping and personal activities in Saigon.\n Meals: Breakfast. Accommodation: Hotel in Saigon"},{"title":"DAY 16: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Best of North Vietnam Tour 8 Days 7 Nights","duration":8,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":530,"summary":"\n\tAsia Focus Travel provide you the best time to visit Hanoi with package 8 days 7 nights, This is the best stop over tour in Hanoi. You will visit the most interesting tourist attractions in the North of Vietnam including Hanoi City tour, Sapa classic & Hill Tribe  villages tours, Halong Bay – the World natural heritage site recorded by UNESCO , Hoa Lu – the ancient capital date back to 10th century, Tam Coc – considered to be Halong Bay on land. come to us to find the feeling for this tour.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/139229_4906392a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/139229_4906392a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_a471d132.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_c46c7ad7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_58c8afcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_f5b7fb47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_5c7f0212.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_d0fc0377.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_4221b906.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_e53b8fbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139229_7256e04f.jpg"],"destinations":["Hanoi","Lao Cai","Cat Cat Village","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Well come to Ha Noi, our driver meet and transfer you to downtown. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. \nCheck in hotel. Free and easy to discover Ha Noi by yourself."},{"title":"Day 2: Hanoi City Tour - Night train to Lao Cai (Breakfast, Lunch)","description":"Have breakfast at hotel &amp; ready for the trip at the lobby OR the meeting points.\nOur guide will pick you up between 07h45 and 08h30.\n(Please see PICK-UP TIMETABLE)\n08h30: Arrive Tran Quoc Pagoda – the oldest pagoda in Ha Noi built in the 6 th century.\n\n09h00 – 9h15: Visit Ho Chi Minh complex, you have a chance to see the embalmed body\nof Ho Chi Minh then walk around the garden to see 2 houses where he lived &amp; worked\nfrom 1954 to 1969. Then visit One Pillar Pagoda where worships the Godess of Mercy –\nIt is the most unique padoga in the world\n11h00: Visit one of these\n Vietnam Museum of Ethnology to learn about the culture of 54 ethnic groups\nliving in Vietnam (Tuesdays – Thursdays – Saturdays &amp; Sundays)\n Bat Trang ceramíc village to explore the daily life of the local &amp; learn about the\nprocess how to make a perfect product (Mondays – Wednesdays – Fridays)\n12h30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese\ncuisine with 8 delicious dishes.\n13h30 – 13h45: Continue visit Temple of Literature – the first university of Vietnam,\nestablished in the 11 century\n15h45: Leave for Hoan Kiem Lake to visit Ngoc Son Temple, which honors General\nTran Hung Dao who defeated the invader in 13 th certury.\n16h15: Tour finishes. Free time until 19:00 to 19:30 my driver will come to pick you up go to train station go to Lao Cai. Overnight on the train "},{"title":"Day 3: Lao Cao - Sapa - Y Linh Ho- Lao Chai and Ta Van Village (Breakfast, Lunch, Dinner)","description":"Arrive at Lao Cai Train station at about 6.30. Have breakfast at a local restaurant. Drive about one hour to Sapa and relax before exploring Sapa Town\n9:00 – 9:30: Our guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van and Giang ta chai villages. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12 kms.\n17:00 When you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.Dinner and Overnight in hotel.\n"},{"title":"Day 4: Cat Cat Village, Sapa, Lao Cai train station ( Breakfast, Lunch)","description":"7:00 Have breakfast.\n9:00 – 9:30 Our guide takes you to visit a village of Black H’mong people.It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French ( This activity take 2 hours walking up and down to the valley ). \n12:30 -13:00:Back to SaPa town and have lunch on restaurant.You are free and easy to discover Sapa town.\n16:30 – 17:00: Transfer from hotel to Lao Cai train station. Getting on the night train to go back to Ha Noi. Overnight on the train. "},{"title":"Day 5: Hanoi - Halong Bay (Breakfast, Lunch, Dinner)","description":"7:30- 8:00 Pick-up at hotels if located in the Hanoi Old Quarter or Hanoi Opera house by shuttle bus departure to Ha Long Bay with stopovers for  refreshing en route\n11:30 Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin.\n12:30 Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands.\n14:30 Start visit Surprising cave is one of the most biggest and amazing cave in the bay.\n16:00 Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay.\n18:00 Come back to cruise later to enjoy sun set party on sundeck.\n19:00 Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20:00 Join the fishing excursion or singing karaoke, have a drink or dancing at the bar\nOvernight on Ha Long Bay Cruise\n"},{"title":"Day 6: Ha Long Bay - Hanoi (Breakfast, Lunch)","description":"6:00 Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise).\n7:00 Your breakfast will be ready in quite bay.\n8:00 Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay.\n8:30 Start doing kayaking paddle explore by your own way around the bay.\n10:00 Check out your cabin, ready for housekeeping clean cabin to welcome new group.\n10:30 You will have short cooking class fresh Vietnamese spring roll.\n11:00 Lunch is serve onboard\n12:00 Get on harbor take the bus back to Hanoi, say goodbye Halong Bay. \n17:00 Arrive Hanoi drop off back your hotel. \n"},{"title":"Day 7: Hanoi - Ninh Binh - Hoa Lu - Tam Coc (Breakfast, Lunch)","description":"07:45 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\n- Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\n- Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \n- Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n\n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\n- Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. \nOvernight in Ha Noi\n"},{"title":"Day 8: Hanoi Departure (Breakfast)","description":"Breakfast at hotel, free to shpping and our  tour guide  and driver will pick you up at your hotel and drive to the airport for your flight back home. Tour Finish!"}]},{"name":"Hanoi - Oasis Bay Classic Cruise plus Bakhan Village Resort 6 Days","duration":6,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":552,"summary":"The best quality and unbeaten price for 6 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Oasis Class Cruises Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100148_18e06a7e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100148_18e06a7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_a6513424.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_1bc1bf7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_f958d909.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_cabc7fe0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_eed11774.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_26a77098.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_50d4c923.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_abbdbeab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_401e8ecf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_a2950f1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_396c740d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_c1414629.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_715acd2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_0595a73c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_89fa7453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_1c09ed87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100148_1b878d13.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to your central hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Oasis Bay Classic Cruises (B, L, D)","description":"8:30 am to 9:00 am: Pick up at Pomihoa hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts center. Here you are able to watch the produce being made and grab a snack to eat\n12:00 pm reach Tuan Chau International Port and prepare for boarding\n12:30 pm Welcome on board! \n13:00 Welcome drinks, cruise information and check-in\n13:15 - 14:45 Lunch is served at the restaurant\n15:00 Visit Sung Sot Cave (1 hour)\n16:00 - 17:00 Cruise along Halong Bay\nAfternoon tea on the sundeck\nEnjoy an afternoon spa treatment*\nKayaking * option in Tung Sau Pearl Farm or Luon Cave\n17:00 17:45 Cooking demonstration on the sundeck\nAnchor at Coconut Tree Island for overnight stay\n17:45 - 18:45 Happy Hour on the sundeck*\n19:15 Dinner is served at the restaurant\n21:00 Happy Hour on the sundeck*\nEnjoy a spa treatment*\nBoard games & darts\nSquid fishing"},{"title":"Day 3: Oasis Bay Classic Cruises - Hanoi (B, L)","description":"06:30 Tai Chi on the sundeck\n07:00 Coffee & tea with freshly baked pastries in the restaurant\n07:40 Visit Ti Top Island\n08:45 - 09:15 Bill settlement and check out\n09:00 Breakfast at the restaurant\n10:10 Traditional Vietnamese Tea Ceremony\n10:45 Return to Tuan Chau Marina\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: We shall drop you back off at Pomihoa hotel in Hanoi’s old quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Departure. (B)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi - Halong Bay & Bakhan Village Resort Trip. Good bye & see you again!"}]},{"name":"4 Days North Of Vietnam package","duration":4,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":236,"price":196,"summary":"Hanoi, Halong bay, Sapa, Tam Coc are the most popular places in all North of Vietnam. With all inclusive tour, Vietnam Travel Top will bring you to all them and guarantee your satisfaction. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Visit UNESCO listed Halong Bay","Swim in the emerald waters of the stunning Ha Long Bay","Explore the emerald waters by kayak or bamboo boat","Learn more about rice cultivation in the mountain areas"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136666_808b2cca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136666_808b2cca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_17106496.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_436ecdb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_7e2b49f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_767ee652.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_8634484a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_9db0fe03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_8f75add3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_0e092894.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_b8e1aa37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_0cf3307f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136666_d40443bd.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 01 Hanoi Arrival – Check in Hotel (in Hanoi Old Quarter) (Meals: No)","description":"Pick up from the Noi Bai airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself. Note: Check in time is 13:00 P.M."},{"title":"Day 02 Hanoi – Halong One day tour Cruises (Meals: B/L/D)","description":"08h15-08h45: Pick up at your Hotel (around the old quarter) and  start the trip with 3,5 hours to Ha Long bay,short break half way about 20 minutes.\n11:45: Arrival Tuan Chau island.\nCheck on Boat and have Vietnamese traditional Lunch with seafood while cruising though the amazing rocks:Insence Bunner,Stone Dog,Cock fighting …\n13:30:  Explore the longest,biggest and the most beautiful grotto of Ha Long bay(Sung  Sot grotto-Surprising grotto).\n14:45:  Discover Luon Cave(water cave)with some options: do kayaking/ bamboo boat\n15:45: Visit Titop island:\n- Swimming and hiking\n- Trekking Titop peak for taking photos with panoramic view of the bay.\n17:45: Back to Ha Long harbour.\n  -Enjoy sunset party on boat with red wine,fruites,cake.\n21:00: Arrival to Ha Noi-Drop you off at your hotel (around the old quarter)."},{"title":"Day 03 Hanoi - Hoa Lu & Tam Coc (Meals: B/L)","description":"08:00 Picking up from hotel/stay.\n08:30 Starting drive to Ninh Binh Province\n10:00 Arriving at Hoa Lu Ancient Capital\n10:15 Visiting King Dinh and King Le’s temples.\n11:30 Arriving in Tam Coc Wharf.\n11:45 Having buffet lunch with Vietnamese Cuisine.\n13:00 Getting on Sampan boats through caves and visiting countryside landscape\n15:00 Back to Tam Coc Wharf to chill out.\n15:15 Biking on country road around village\n16:00 Getting on shuttle bus to go back to Hanoi\n18:30 Saying goodbye to you at your hotel/stay"},{"title":"Day 04 Hanoi - Back Home (B)","description":"Breakfast at the hotel then free and easy. Wait until our driver come and pick you to the airport Trip ends."}]},{"name":"Hanoi - Glory Legend Cruises plus Mountain Retreat 7 Days","duration":7,"travelStyle":["Discovery","Family","Motor boat","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":539,"summary":"The best quality and unbeaten price for 7 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Glory Legend Cruises Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nDiscover charming of Hanoi - City for Peace.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100145_a20ece71.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100145_a20ece71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_68cc4007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_a932f222.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_7c4c97a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_6dee2b02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_a9cfe3c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_13e3f5e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_de1734e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_efe9a323.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_d84fb2a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_92c2ca27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_234a06fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_a252b09f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_19024452.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_2c9d2bdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_908b0d37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_bf739147.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_8889f3b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_133b4bca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_484849c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_b6d6a64b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_38bb34ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_9b1374d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100145_eb3e9a0e.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 3: Hanoi - Halong Bay (B, L, D)","description":"7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch local crafts being produced and grab a bite to eat\n12:00 pm We will arrive at the port before being transferred to Glory Legend Cruise\nWelcome drink - receive cruise briefing, safety instructions and check in. \nEnjoy a lunch with Vietnamese dishes served while sailing through the bay, passing the imposing limestone formations. \nYou shall then board your bamboo craft piloted by indigenous locals. They will take you through a stunning cave formation into a tranquil bay where if you are lucky you can spot monkeys.\nNext you are able to relax on the beach at Ti Top where you are able to swim in the warm water, get some rays or treck to the top of the outcrop for stunning panorama views.\nBack to the boat and you have free time while sailing to Luon Bo area, and anchor overnight.\nAttend the Cooking class on sundeck. Then enjoy Happy Hour (Buy one drink-get one free). Sit back and relax while watching the magnificent sunset over Halong Bay. \n19:30-23:00: Dinner - Deluxe Vietnamese and International BBQ Set Menu Dinner\nEvening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spending a romantic night on Glory Legend Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat.\n23:00: End of day\nGlory Legend Cruises 3* or similar"},{"title":"Day 4: Halong Bay - Hanoi (B, L)","description":"6:00-7:00: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements.\n7:00-8:00Coffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape.\n8:00-9:30: Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites. \n9:30-11:00 Have brunch while cruising back to the Tuan Chau Wharf. Relax while taking in the final views of Halong Bay\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: We shall drop you back off at hotel. Check in hotel and stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi Departure. (B)","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip with Legend Travel Group. Good bye & see you again!"}]},{"name":"Cycling in the Mekong Delta","duration":8,"travelStyle":["Bicycle","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1658,"summary":"Getting off the popular one-day boat trips and discover the granary of Vietnam, Mekong delta, by cycling on the tracks across countless rivers, orchards and enjoying countryside scenery can leave you unforgettable feelings.","highlights":["Cycle and admire green orchards and gardens planted by local farmers","Discover Cai Rang floating market where numerous colorful boats trade","Ride on the tracks across countless rivers enjoying countryside scenery"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/116832_48b05ae1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/116832_48b05ae1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_800d5340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_e53ab3e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_d83c961f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_7cfbfcb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_1704bb90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_83c999c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_1dc97dd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_6156302b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_4ff55b52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_6158355e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_192ac88c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_eb72f6a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_b0b9b9f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_ec8aa21d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_fda4e0d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_06d0a92d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_58206635.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116832_c24a9298.jpg"],"destinations":["Ho Chi Minh City","Vinh Long","Ben Tre","Can Tho","Chau Doc"],"timeline":[{"title":"DAY 1: ARRIVAL VIETNAM – HOCHIMINH CITY (-/-/-)","description":"Welcome to Vietnam! On arrival in HCM City we will pick you up and transfer you to your hotel. We will first adjust our cycles to your height and then you can either rest from your journey or wander around central HCM City. HCM City is the vibrant and commercial hub of Vietnam. It is a diverse city of the old and the new with many street food stalls, coffee stops, bars, restaurants and colonial French buildings. Feel free to stop for a cool beer or an iced coffee and watch the world go by.\nNote: Standard check-in time is 14h \n"},{"title":"DAY 2: HCM CITY – CAIBE (TIEN GIANG) (B/L/D)","description":"You will be picked up by your bike guide at 7:30 AM from your hotel and take one and a half hour drive to out of Saigon/ Hochiminh City to visit Cai Be floating market (one of the famous floating market in the Mekong Delta!). This is a whole sale market, where tropical fruits and vegetables are sold. iIf you want to know what they sell we can recognize from bamboo poles, they hang what they sell in front of the boats. Stopping in riverside villages and then take a short walk around to see how locals make coconut candy, pop- corn, rice crispy...and lunch stop at local restaurant.\nAfternoon bike ride around Cai Be and along the system of the Upper Mekong River, we will see local riverside market (CaiBe market) on the ways, it is the best local market for tourist to have a look around. Then transfer to your accommodation in Tien Giang for relax and overnight.\nDistance: 25km \nTrail Difficulty: 3/5 \n"},{"title":"DAY 3: VINH LONG – BENTRE – TRAVINH (B/L/D)","description":"We will pass the Rach Mieu Bridge and keep cycling on country roads towards Que Son. The roads are remote winding roads under a green canopy, which are coconut palms that make this region of Ben Tre famous – and it is far from tourists and the bustle of HCM City! On arrival in the town of Ben Tre, we will take a boat trip around the village and have lunch at a local house. In the afternoon, we will shuttle by minivan over the Ham Luong River and use the ferry following which we will keep cycling to Tra Vinh where we stay overnight.\nDistance: 65 km \nTrail Difficulty: 3/5  \n"},{"title":"DAY 4: TRAVINH – CANTHO (B/L/D)","description":"Our first destination today is Tieu Can, where we will discover the beautiful Theravada Pagodas and encounter the Khmer monks (who are originally from Cambodia). A short cycle ride later, we will visit the fascinating Ang Pagoda. From there, we will cycle about 32km to Cau Ke where we will have lunch.\nWe continue our cycle another 21km to Tra On and take a short ferry trip to Luc Si Thanh islet. Once there, we will drive with the van to the Cai Cu harbor and take the ferry to Can Tho, where we will have dinner at a local restaurant and stay overnight.\nDistance: 53 km \nTrail Difficulty: 3/5  \n"},{"title":"DAY 5: CANTHO AT LEISURE (B)","description":"Breakfast at hotel. \nFree all day for relax, swim or shopping in the town center. Lunch and dinner at your own arrangement for more flexibility. Overnight in Can Tho.\nDistance: 0km\nTrail difficulty: 0/5 \n"},{"title":"DAY 6: CANTHO – LONG XUYEN (B/L/D)","description":"After a very early breakfast, we ride on a narrow paved road via Cai Rang floating market. Weave through the morning traders, as we pedal along the banks of the very busy river. Taking in another market, we continue on to Phong Dien Village and eventually stop for lunch. There’s a 30 minutes transfer to the town of Long Xuyen. Dinner and overnight at hotel.\nDistance: 95km\nTrail difficulty: 3/5 \n"},{"title":"DAY 7: LONGXUYEN – TRITON – TRASU – CHAUDOC (B/L/D)","description":"After a short early morning transfer to Tri Ton, the cycling starts to undulate as we ride closer to Chau Doc. This afternoon we cycle to the killing fields of Vietnam at Ba Chuc, where Pol Pot’s regime massacred over 3,000 Vietnamese in 1978. The route loops around to Chau Doc along the border. Dinner and overnight in hotel for the final night in Vietnam.\n(If we will have some spare time, we can also visit the Tra Su Forest, which has a great variety of birds and animals, of which some are listed in Vietnam’s Red Book.)\nDistance: 110km\nTrail difficulty: 3/5 "},{"title":"DAY 8: CHAUDOC – HO CHI MINH OR PHNOMPENH (B/L)","description":"Breakfast at hotel, then you will transfer HCM City for departure or continue your trip to PhnomPenh depend on your program. Lunch at local restaurant. \nNote: Standard check-out time is 12h00 \n"}]}]