[{"name":"Essence of Vietnam 17 Days ( Hanoi/Sapa/ Halong Bay/ Hoi An /Phu Quoc)","duration":17,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":2604,"price":1406,"summary":"Vietnam will surprise you with its rich traditional culture, a host of world heritage sites, stunning inland scenery, and world-renowned cuisine. Start your tour in Hanoi - Vietnam's colonially influenced atmospheric capital, escape from the hustle and bustle of big cities in Ba Vi countryside, then be ready to be amazed by the most famous bay in Vietnam with the \"Dragon\" in its name. Head to the South and discover the amazing network of Cu Chi tunnels which was used by Viet Cong during the Vietnam War then explore the life of locals alongside the mighty Mekong River. Feel the essence of the calming ocean in Phu Quoc which is raw beauty, immerse yourself with white sand and emerald water sea, stay close with nature and sunbathing on the beach. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136951_ac0d3d27.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136951_ac0d3d27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_0748f0e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_36474af4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_0facafdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_2683ad70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_89a091d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_4ebab897.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_711bb102.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_e5eaac85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_f5a1ad75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_80694c47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_73d39928.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_7aada9be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_cf582e6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_fe733b21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_fb9c45e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_84a231d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_f413fef6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_69a3d8fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_c3a5fe60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_97cf828e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_8d53649d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_cfea414e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136951_31441e54.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Mekong Delta","Phu Quoc Island"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and have some rest after the flight. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep. "},{"title":"BA VI ECO TOUR (B/L)","description":"Have breakfast at the hotel then you will be escorted by an experienced English-speaking guide, a countryside located at the outskirt of Hanoi. The approximate travel time is one hour and 30 minutes.\n\nThen arriving at Mr. Duoc’s house, you will be welcomed with fresh honey tea and green lentils or lotus seeds that made by his family.  Imagine a Vietnam in the old time of war through stories of Mr. Duoc, who is not only a veteran who lives during those hard times but also a green tea expert. You will visit his tea plantation which is one of the largest in Ri village and join with locals in green tea processing. Afterward, have a Vietnamese cooking demonstration with another local host and then enjoy a home-cooked lunch in a lovely garden.\n\nAfter that, you will wander around the village and mingling with local people. You will visit the local craftsman who has been skilled at making conical hats from a very young age and other workshops in the village to see how people there make tofu or shell the rice.  As you meander through the countryside you will experience the friendliness of the local people greeting you along the way. Then join your guides for a leisurely cycling trip along the country roads. Observe traditional Vietnamese rural life as the local people work in the paddy fields. Along the way, watch out for a water buffalo plowing a paddy field while ducks swim across the top. Stop at another host family for foot bathing following the recipes of Muong ethnic group and relaxing time before embarking on your private boat for a trip along the Da river. Later, enjoy a transfer between Ba Vi to your accommodation in Hanoi."},{"title":"HANOI – SAPA BY LIMOUSINE (B)","description":"Our driver will bring you to Sapa On the way you have the opportunity to enjoy the beautiful scenery on both sides of this road.\n\nOvernight in Sapa."},{"title":"SAPA – CAT CAT - Y LINH HO –TA VAN (B/L/D)","description":"Met up at your hotel in Sapa by local guide and driver for a short road transfer heading to Cat Cat village. After a couple of minutes, you will follow a road going downhill to Cat Cat village. You will stop by a waterfall and a hydroelectric station for a while before you trek on a dirt trail through rice paddy terraces. You will also enjoy spectacular scenery while walking along a narrow river. You eventually arrive in Y Linh Ho village of Black Hmong minority, where you can take a rest while you are served lunch near the river.\n\nAfter lunch, you head Muong Hoa valley. You will pass through Lao Chai village of Black Hmong minority and then Tavan village of Giay minority by following a very popular trekking route. You will spend the night in local house of Giay minority. You will be able to take a walk to enjoy the valley view as well as swim in the river nearby."},{"title":"TA VAN – GIANG TA CHAI – SU PAN – SAPA (B/L) – LIMOUSINE TRANSFER TO HANOI","description":"Once you get energy for your last day trek by having a delicious breakfast, you leave for Giang Ta Chai village of Red Dao minority. You will trek through a bamboo forest, which belongs to Hoang Lien National Park. On the way, you will pass by a waterfall where you will have time to take a rest and enjoy the surroundings. You will find a nice place to enjoy lunch.\n\nAfter lunch, you continue toward Su Pan, a small village located by the road. Here you start your journey back to Sapa by car and transfer back to Hanoi city."},{"title":"EXCURSION TO THE NATURAL WONDER OF THE WORLDS (B/L/D) - SHARING CRUISE","description":"Our guide and the shuttle bus will pick you up at the lobby of the hotel and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see everyday Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is an opportunity for an evening swim from the side of the boat.\n\nSpend the night on the luxurious boat"},{"title":"BACK TO TRANQUIL CAPITAL (B/L)","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 4.30pm. Drop at the hotel in Hanoi. Free time on your own.\n\nOvernight in Hanoi."},{"title":"HANOI FLY TO HOI AN (B)","description":"After breakfast, our driver will pick you up at the lobby of the hotel and transfer to Airport for the flight to Hoi An. Upon arrival, you will be transferred directly to your hotel. After check-in, free for leisure and shopping in the local markets\n\nOvernight in Hoi An."},{"title":"HOI AN LEISURE DAY (B)","description":"Today you will have free time explore Hoi An at your own pace, seeing what interests you. This ancient town is full of Japanese merchant houses and pagodas, temples and antique warehouses. Or just lounge about in a laid-back riverside café on the bank of the Thu Bon River.\n(OPTIONAL TOUR: HOI AN ECO TOUR)\n\nToday your English-speaking guide will meet you at the hotel and take you to a tour of the countryside and rivers around Hoi An. As you meander through the countryside you will experience the friendliness of the local people greeting you along the way. After that, you will board the Hoi An Eco-tour boat for a river cruise to meet and engage with local fishermen. Enjoy a hands-on experience of traditional net fishing. You will also take a paddleboat trip in a unique Vietnamese bamboo basket boat down the waterways of a coconut palm paradise.\n\nIn the afternoon, leisure time on your own exploring the ancient town or relaxing at the hotel."},{"title":"HOI AN –TO HUE (B) BY BUS","description":"Morning: Having breakfast at your hotel. Check in your hotel then our driver will meet you at lobby – transfer to Hue by bys\n\nAfternoon: After arriving at Hue, checks in the hotel. Next, you are free to visit the city. For example, you can go sightseeing at the Thuan An Beach, Lang Co Beach, Garden House….or take some photos. Spend overnight in Hue.\n\nOvernight in Hue."},{"title":"ANCIENT CITADEL AND CYCLO TOUR (B/L)","description":"08:00 Start your tour of Hue with a visit to the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945. After exploring the ruins of this wonderful monument take a cyclo ride through the ‘Old City’ to Tinh Tam Lake where the Emperors used to come to relax, full of lotus flowers in Summer, there are many local style coffee shops around the lake where university students come to study. Drive onto Thien Mu Pagoda, constructed in 1601, the 21-meter tall tower is the centerpiece of the pagoda.\n\nThis afternoon, depart for the Mausoleum of Tu Duc, built decades before its occupant's death, the tomb was used as a palace retreat before becoming the Emperors’ resting place. Continue to Khai Dinh’s Tomb which is traditional Vietnamese in design with a European touch making it unique from the other tombs in Hue. If you wish, before visiting the tombs pass the city’s vibrant Dong Ba Market where a huge array of fresh produce is on offer.\n\nOvernight in Hue."},{"title":"HUE – FLY TO HO CHI MINH CITY (B)","description":"Have breakfast at the hotel, then have free leisure time until there will be a private cab transfer you to the airport for your next flight to Ho Chi Minh."},{"title":"HO CHI MINH - MEKONG DELTA ( OVERNIGHT AT HOMESTAY) (B/L/D)","description":"Pick up at your hotel in Ho Chi Minh city and start the trip to My Tho. Upon arrival, visit Vinh Trang pagoda which sated back to the late 19th century. Then boarding the sampan and cruising around four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\n\nStop over at Unicorn Island, go walking in the village paths to contemplate orchards, enjoy tropical fruits, and Vietnamese folk music performed by the local people. Visit the fruit plantation. Be rowed in a small sampan through the Thoi Son canal and treat yourself to the beauty of the countryside, visit the family business & bee-keeping farm, enjoy honey tea and coconut candy workshop. Have lunch at the local restaurant. Break time.\n\nThe afternoon is time for cycling around the Tan Thach village, meeting the local people to experience their daily life in the Mekong Delta. Relaxing on hammocks to enjoy the cool breeze is for those do not want to join the cycling trip. Proceed to Can Tho. Your leisure.\n\nOvernight in Can Tho (centrally located hotel/countryside-homestay)."},{"title":"CAI RANG FLOATING MARKET – FLIGHT TO PHU QUOC ISLAND (B)","description":"Breakfast at the hotel/homestay in the early morning. Take a leisure boat trip to explore the picturesque tributaries of the Lower Mekong River (Bassac River) then visit Cai Rang floating market which is the liveliest one in the whole of the region.\n\nWalking trip to visit the fruit plantation and local noodle factory.\n\nOur driver will bring you to the airport. Take a flight from Can Tho airport to Phu Quoc\n\nCheck in hotel and overnight in Phu Quoc Island."},{"title":"PHU QUOC ISLAND LEISURE DAY(B)","description":"Have leisure time today.\n\nAccommodate at the hotel. (Meals: breakfast)"},{"title":"PHU QUOC ISLAND LEISURE DAY(B)","description":"Have leisure time today.\n\nAccommodate at the hotel. (Meals: breakfast)"},{"title":"PHU QUOC – FLIGHT TO HO CHI MINH AND TIME TO SAY GOODBYE (B)","description":"Have breakfast at your hotel then our tour guide will pick you up to the airport. Take a flight to Ho Chi Minh City Later, proceed for departure and board your flight back home. Trip Ends. (Meals: breakfast)"}]},{"name":"Vietnam Discovery in Depth - 17Days","duration":17,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1738,"summary":"The best quality and unbeaten price for 17 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional\nStart in Hanoi and finish in Ho Chi Minh City\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nVisit Trang An and Bai Dinh Pagoda in Ninh Binh\nTrekking in Sapa, learn about hill tribes` culture throughout local people\nStay overnight on Boat in Halong Bay - World Heritage Site\nLearn about Vietnam history of Kings throughout Hue Imperial City\nExplore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\nTaste wonderful Vietnamese local cuisines along the trip\nDiscover 4 World Heritage Sites: Halong Bay, Hue, Hoi An and My Son Sanctuary\nChillout and shopping in Ho Chi Minh City - the biggest City in Vietnam\nAnd more...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50834c7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50834c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef508f1c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef5090a74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef5092354.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef5093b63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50954db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef5097006.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50988e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef509a280.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef509bab9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef509d40b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef509ec7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50a09b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50a26d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50a5b23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50a7c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50a9a39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50ac822.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50aea22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50b0640.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50b1fe1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50b37bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50b4fe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95475_5e33ef50b6a72.jpg"],"destinations":["Hanoi","Ninh Binh","Lao Cai","Sapa","Lao Cai","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival","description":"Today you’ll land in Hanoi. Warmly welcome by our tour guide & driver at the airport & then transfer to hotel for check in. Stay overnight in Hanoi.\n(Check in time: From 14:00)\nDistance: Noi Bai airport - Hanoi city center: 30 km (~ 45 minute drive)\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi - Ninh Binh (B, L)","description":"After breakfast at hotel, depart for Ninh Binh city towards to the South of Hanoi. On arrival, visit Hoa Lu - the ancient capital of Viet Nam, Dinh Temple - where worshipped King Dinh Tien Hoang and Le Temple - where worshipped King Le Dai Hanh.\nWhen finishing Hoa Lu Ancient Capital you spend 45 minutes transfer to Tam Coc.\nAfter lunch at local restaurant, take a small bamboo boat and go along the Ngo Dong River to visit Tam Coc (Three Caves) - “Halong Bay on land” for 2 hours. Then get back to the wharf and leave Tam Coc for Hanoi. Overnight in Hanoi.\nDistance: Hanoi - Ninh Binh: 130 km (~ 2.5 hour drive)\nPomihoa Hotel Hanoi or similar"},{"title":"Day 3: Hanoi full day city tour - Lao Cai (B, L)","description":"After breakfast at hotel, we enjoy a full day city tour of this charming capital city including the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple.\nOptional activities:\nTake one hour cyclo ride through the bustling old quarter streets of Hanoi\nEnjoy a fantastic traditional water puppet show (unique to Vietnam)\nThen transfer to the railway station for the night train to Lao Cai. Overnight on train - 4-berth sharing cabin on train.\nOvernight on the train (4 Berths Cabin sharing)"},{"title":"Day 4: Lao Cai - Sapa - Y Linh Ho - Lao Chai - Ta Van (B, L)","description":"About 06:30: On arrival at Lao Cai railway station, pick up & transfer to Sapa. Have breakfast in Sapa.\n10:00: Start trekking to Muong Hoa valley to visit 3 villages of the H’mong and the Dzay (Y Linh Ho, Lao Chai, Ta Van). Lunch on the way.\nBack to Sapa and spend the night at hotel - Bamboo Sapa 3* Hotel - Superior room (or similar)\nDistance: Lao Cai railway station - Sapa: 40 km (~ 1 hour drive)\nBamboo Sapa Hotel or similar"},{"title":"Day 5 (on Sunday): Sapa - Bac Ha - Lao Cai - Hanoi (B, L)","description":"07:30: Leave Sapa for Bac Ha Market (110 km from Sapa). This is a big market filled with many different hill-tribe peoples. It is the most colorful market in the North Vietnam. At the market, you have chance to enjoy Bac Ha people’s simple but unique kinds of food with special wines made from rice, cassavas, corn and different sorts of fruits such as plumps, apples, peaches…talking to the minorities through the guide’s interpretation. What is more, after visiting the market, you are continuing to visit the H’mong King’s house (King Hoang A Tuong) built by the French colonists and the Chinese in 1920. Return the town for lunch.\nIn the afternoon, spend time walking to another village (Ban Pho village). Around 3 pm, get back to Lao Cai railway station for the night train back to Hanoi.\nOvernight on the train (4 Berths Cabin sharing)"},{"title":"Day 6: Hanoi - Halong Bay (B, L, D)","description":"Arrive in Hanoi railway station around 6:00 am. After breakfast & a short rest at a small hotel nearby, drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. The drive takes 3.5 hours. Halong covers 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on boat.\nDistance: Hanoi central - Halong Bay: 180 km (~ 3.5 hour drive)\nGarden Bay Cruises or similar"},{"title":"Day 7: Halong Bay - Hanoi - Hue (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Turn back to Hanoi for the evening flight to Hue, the last capital of Vietnam feudality. On arrival, pick up & transfer to hotel for check in. Overnight in Hue City.\nDistance: Phu Bai airport - Hue City: 18 km (~ 30 minute drive)\nCherish Hotel Hue or similar"},{"title":"Day 8: Hue full day city tour (B, L)","description":"After breakfast at hotel, take a boat trip on the romantic Perfume River to visit the Hue’s oldest and most revered site, Thien Mu Pagoda & the mausoleum of Emperor Minh Mang.\nLunch at local restaurant.\nIn the afternoon, visit the Imperial Citadel, the Purple Forbidden City, the elaborate mausoleum of Emperor Tu Duc and the Dong Ba market. Overnight in Hue.\nCherish Hotel Hue or similar"},{"title":"Day 9: Hue - Da Nang - Hoi An (B, L)","description":"After breakfast at hotel, drive to Hoi An town, a recognized World Heritage Site. Stop in Da Nang to visit the famous My Khe Beach and Cham Museum which contains the finest collection of Cham sculpture in the world.\nOn arrival in Hoi An, visit the 200 year-old Tan Ky house, Phuc Kien Pagoda, the Assembly Hall, the former merchants’ houses, the 400 year-old Japanese Covered Bridge and the colourful riverside market.\nOvernight in Hoi An Ancient Town.\nDistance: Hue - Hoi An: 130 km (~ 3 hour drive)\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 10: Hoi An - My Son Sanctuary (B)","description":"After breakfast at hotel, our guide and driver will pick you up at your hotel to transfer to My Son Sanctuary – once the capital city of Champa Kingdom (around the 4th to 12th century). My Son is a large complex of religious relics that comprises more than 70 architectural works. They include temples and towers connecting to each other with complicated red brick designs. The major structure of Cham architecture is tower, built to reflect the divinity of the king. Drive back to Hoi An at noon.\nThen free for shopping or relaxing on Cua Dai Beach.\nOvernight in Hoi An.\nDistance: Hoi An town - My Son: 50 km (~ 1 hour drive).\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 11: Hoi An - Da Nang - Nha Trang Beach (B)","description":"After breakfast at hotel, transfer to Nha Trang Beach City - one of the most beautiful beaches all over the world. Upon arrival in Nha Trang, pick up & transfer to hotel for check in. Overnight in Nha Trang.\nDistance: Cam Ranh Airport - Nha Trang City: 30 km (~ 40 minute drive).\nRegalia Nha Trang Hotel or similar"},{"title":"Day 12: Nha Trang full day tour (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nRegalia Nha Trang Hotel or similar"},{"title":"Day 13: Nha Trang (B)","description":"Today is a free day at leisure in Nha Trang for relaxing and unwinding at the resort overlooking beautiful Bay. Snorkel or dive among the coral reefs in crystal blue waters, hike nature trails, cool off in your private plunge pool, indulge in spa treatments or just relax on the white sand beach and admire the unspoiled mountain and sea views. Overnight in Nha Trang.\nRegalia Nha Trang Hotel or similar"},{"title":"Day 14: Nha Trang - Ho Chi Minh City (B)","description":"After breakfast at hotel, transfer to the airport for the flight to Ho Chi Minh City. On arrival, pick up & transfer to hotel in Saigon for check in. Then free for shopping & relaxing. Overnight in Saigon\nDistance: Tan Son Nhat Airport - Saigon center: 7 - 8km (~ 30 minute drive).\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 15: Ho Chi Minh City - Cu Chi Tunnels (B, L)","description":"After breakfast at hotel, we will visit Cu Chi tunnels - an immense network of connecting underground tunnels during American War. Back to the city for lunch.\nAfter lunch at local restaurant, we will visit Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo - Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Our last stop is Ben Thanh market, the biggest whole sales market in Saigon. Stay overnight in Ho Chi Minh City.\nDistance: Saigon - Cu Chi Tunnel: 75 km (~ 1.5 hour drive) \nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 16: Ho Chi Minh City - Mekong Delta - Cai Be Floating Market (B, L)","description":"Breakfast at hotel.\n7:30 a.m.: Depart for Cai Be, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music. Take a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Stay overnight in Ho Chi Minh City.\nDistance: Saigon - Cai Be: 100 km (~ 2 hour drive).\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 17: Ho Chi Minh City departure (B)","description":"Free at leisure until transfer to the airport for the departure flight.\nEnd of services. Good bye and see you again in the next times!\nAirport transfer included!"}]},{"name":"Stopover Vietnam Tour Highlight - 8 Days","duration":8,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":699,"summary":"The best quality and unbeaten price for 8Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Ho Chi Minh City\nHanoi: Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. Take part in Water Puppet show.\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nMai Chau: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the \nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76130_61357b7e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76130_61357b7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_7ef3b972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_ae2158a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_ce79c20c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_e8f76b2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_c55cef01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_b622d64e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_9612954a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_f37760f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_49a10960.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_fefb1508.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_7e2a0a70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_5a9794d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_f0d91dfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_098d79ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_ed25d821.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_e245e23f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_bd984b71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_4293bd41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_4f24d3ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_7c6e5320.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_b9038f16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_34280abc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76130_961e9fcb.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Take part in Water Puppet Show. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi - Halong Bay Cruise & stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises Halong Bay or similar"},{"title":"Day 3: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out.\nGet on the Car and back to Hanoi.\nArrive hotel in Hanoi around 16:00. Check in and stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 5: Bakhan Village - Hanoi fly to Ho Chi Minh City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n16h30. Arrive Hanoi Old Quarter.\nKeep driving to Hanoi Airport directly for afternoon flight to Ho Chi Minh City. Picking up upon arrival, transfer to hotel in Ho Chi Minh City. Overnight in Saigon.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 6: Ho Chi Minh City Tour - Cu Chi Tunnels (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. Return to hotel for free. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 7: Mekong Delta - Cai Be floating market full day (B, L)","description":"Having breakfast at hotel until 7:30 am. Depart for Cai Be, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music. Take a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Check in hotel & overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 8: Ho Chi Minh City Departure (B)","description":"Today you are free for leisure & shopping until transfer to Airport for departure. Finish unforgettable Vietnam trip with Legend Travel Group. Good bye & see you in the next times!\nAirport transfer included!"}]},{"name":"Sapa Trekking & Sightseeing: Sapa - Laochai - Tavan - Catcat - Sinchai - Ma Tra - Ta Phin for 3 Days 4 Nights","duration":4,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":298,"summary":"Sapa is one of the most wonderful places in Asia and is a magical combination of landscapes, ethnic cultures and bracing mountain air. The surroundings are incredible and the atmosphere friendly. There are excellent areas for hiking through lush mountain valleys to the remote villages of diffirent minorities, including the Black H'mong and the Red Dzao ....","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147307_471f56e7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147307_471f56e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_be66f494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_be969161.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_3b4d6efd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_b1fd4325.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_6505446c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_6ac10be3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_0183708c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_bbf4a3f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_375ea4f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_3465ae2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_7e8d8294.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_5553f2e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_8c92d9cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_48e20f38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_7ca0e85d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_135c3790.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_a0ac2ce7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_ad2da109.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_bec519c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_7adbe21c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_60f98d49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_5f58c61e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147307_04493ffb.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Night 1: Take overnight train from Hanoi to Lao Cai","description":"We will pick you up at 8:00PM - 8:30PM at your hotel/stay in the Old Quarter Area or our office at no.24 Au Trieu Street, Hang Trong Ward, Hoan Kiem District, Hanoi, Vietnam and depart to Hanoi Railway Station.\nNight 1: Your will check in the night train and depart to Sapa, over night on deluxe cabin with soft beds."},{"title":"Day 1: Sapa – Lao Chai – Ta Van – Sapa (B,L,D)","description":"Picked up at Lao Cai Station at 6AM upon your early arrival for over an hour drive uphill in a shared mini van to Sapa. 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the.Black H'mong. Continue on 2km of trekking down to Lao Chai village of the H'mong. Lunch at a local family, and then walk through terraced rice fields to Ta Van village of the Dzay minority people where we stay for the night. It gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive\nGet back to Sapa by jeep or motorbike.\nNight 2: You will be have a private deluxe room in 3-star Hotel in the central of Sapa such as Sapa Panorama, Sapa Vista, Sapa Relax & Spa or similar"},{"title":"Day 2: Cat Cat & Sin Chai (B,L,D)","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H'mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 6 km to Sin Chai, the village  located at the foot of Fansipan Mountain, \"the roof of Vietnam and Indochina\". From here you can enjoy huge stunning  landscapes before climbing up on the way a car to return to Sapa\n\nNight 3: You will be have a private deluxe room in 3-star Hotel in the central of Sapa such as Sapa Panorama, Sapa Vista, Sapa Relax & Spa or similar"},{"title":"Day 3: Sapa - Suoi Thau - Ma Tra - Ta Phin - Sapa (B,L,D)","description":"5km by jeep, visit the red Dzao in Suoi Thau, Ma Tra villages. 9km trekking through the forest. Picnic lunch en–route. Reach Ta Phin village where we have chance to learn about the life styles and the custom of the red Dzao minority, enjoy landscapes...then drive back to Sapa.\nPick up and transfer back to Sapa in the afternoon, take a shower and then transfer to bus office and take the bus at 3PM and arrive Hanoi at 10PM\n"}]},{"name":"Spectacular Sapa - 3 Days","duration":3,"travelStyle":["Sightseeing","Adventure","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":231,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.","highlights":["Admire the views from the picturesque hill-station town of Sapa","Embark on scenic drives and a short trek to a colourful minority village","Fall in love with the cultures and traditions of the local people"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/63990_28242511.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/63990_28242511.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_77c7c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_72a79283.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_8aae2829.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_ab27f029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_8ab3d792.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_eaed36e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_3f7e1d61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_5e73a037.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_a996aea1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_9904caa9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_cb636ed9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_0e63ec37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_28edafdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_b3cf3d23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_b70064de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_612b62a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_34003964.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_8a409e1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_cc0d3ab5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_02764a9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_020e1fd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63990_f411197f.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Sapa, picturesque landscapes and colorful hill tribes (L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide to have lunch. After lunch, take a scenic one-hour drive up to the hill station of Sapa. From there we will take a short 30-minute journey south toward Muong Hoa Valley, a stunning place boasting the largest terrace rice fields in Sapa. Muong Hoa Valley is one of the most famous destination for breathtaking scenery and the largest farmland for rice growing in Sapa. If your visit is between May and October, the local harvest period, you will have a chance to see the local farmers in action. From the highest elevation of the mountain range covered by endless forest, rain water follows dozens of streams downhill to the floor forming Muong Hoa. The scenery is romantic and poetic and It is a nice chance to take in the scenery and a great photo opportunity. Exploring the magnificent Muong Hoa valley to enjoy its breathtaking landscapes, you will also pay visit to small and isolated hamlets and villages meet the Black H’mong, Giay and Red Zao at home and at work. The walk takes you from Lao Chai Village of the Black H'mong Minority to the Ta Van Village of the Giay Minority with a stop at the local Catholic Church, taking in the different traditions, cultures and costumes of the two minority groups. \nAfter that, we will return to Sapa and you can spend the rest of your afternoon at your leisure. Overnight in Sapa. "},{"title":"Day 2: Sapa, spectacular charm (B/L/D)","description":"After breakfast, you will check out the hotel and depart for Tram Ton Pass. The road between Sapa and Lai Chau crosses the Tram Ton Pass on the northern side of Fansipan, 15 kilometers from Sapa. At 1, 900 meters this is Vietnam’s highest mountain pass, and acts as a dividing line between two weather fronts. Along the way, take a short walk to Silver Waterfall and head to Heaven’s Gate, where you can see Fansipan Mountain-the highest peak in Indochina. A 1.5-hour downhill ride to Binh Lu includes a stop at Chu Va Village of Flower H'mong. Enjoy a packed lunch on the way. Trek to Pa Pen Village of the Lu Minority where you can talk with the locals and visit the local school (closed on weekends). Return to hotel. Overnight in Sapa. "},{"title":"Day 3: End of the trip, full of experience (B/-/-)","description":"Free day for shopping and discovering Sapa town. \nAs a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. It is interesting \nto buy some presents for your relatives and friends .\nCheck out, transferring to Sapa bus station back to Ha Noi. (B)\n"}]},{"name":"5-day Explore Ha Long Bay and Sapa Highlights","duration":5,"travelStyle":["Adventure","Family","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":320,"summary":"Experiences with different cultures in Vietnam\nYour time will be  in-depth cultural tour in Vietnam with the different cultures of  ethnic groups in Sapa , experiencing the unique beauty in Hanoi as well as stunning landscapes in Ha Long Bay, you have a 4 day tour taking you through Hanoi - capital of Vietnam and Sapa in the north of Vietnam and Ha Long Bay. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/127405_aeed7aff.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/127405_aeed7aff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_8639edac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_fb0ddecd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_d699be5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_e36eb961.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_a5867c3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_d761fb19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_e6de5c3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_1460514b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127405_5eec3d12.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival - Walking Street Food Tour with Water Puppet show(B)","description":"Arrive in Hanoi. Greeted by your guide/driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nExperiences with local Vietnamese foods\nIn the afternoon, you have a food tour on food on Foot with local guide speaking English that  will give you an unique experience to try the foods of the local Hanoi people, \nWe ensure the food is handled hygienically and provide a comfortable venue for the tastings.The tour will finish at Water Puppet Show Theater at 16.00 that lasts 50 minutes.\nAccommodation: 3-star-hotel in Hanoi likely Hanoi Angel Hotel or Hong Ha hotel or similiar"},{"title":"Day 2: Hanoi - Sapa by bus with a short trek to Cat Cat village (L/D)","description":"A short trek to Cat Cat Village which is home of Black H'mong ethnic people\nAt 6.30 am: Our tour guide will meet you at your hotel and you're on the way to Sapa for 6 hours. \nAt 13.00 : You arrive in Sapa Town, then check in and have a lunch with local Vietnamese dishes.\nAfter lunch, you will enjoy a walk around this charming town, paying visit to Sapa market and the old cathedral where you can meet a lot of local ethnic minority peoples such as Black H’mong and Red Zao wearing their traditional colorful dresses selling their farming and gathering products and handicrafts for souvenir. Then get to visit Cat Cat village.\nAfter trekking, you go back to Sapa town and have dinner.\nAccommodation: Overnight in 3-star-hotel in Sapa likely Sapa Relax Hotel & Spa,  Sapa Vista Hotel."},{"title":"Day 3: Sapa - Hanoi by bus with a long trek Y Linh Ho - Lao Chai - Ta Van (B/L)","description":"A long trek through the rice terraces \nAt 7am-8am: After having breakfast at hotel and prepare light pack for trekking, check- out procedures\nAt 8.10am: You will walk along the main road heading south for about an hour before turning right to a foot path down hill to Muong Hoa Valley.Then crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. Here you will pay visiting to some H’mong families, watching them doing their daily works. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai, a large village of the H’mong. Picnic Lunch and then following the river bank to Ta Van of the Zay people. Paying visiting to local homes, village schools… you will enjoy much your cultural discovery of local ethnic peoples as well as breathtaking scenery of the Muong Hoa Valley.\n12.00-15.00: Have a lunch and time at leisure on your own\n15.00: Meet all group members at hotel to get ready for Hanoi\n15.30: Get on bus to go back to Hanoi with one comfort break.\n21.15-21-45: Reach Hanoi\nAccommodation: ovenight in 3 star hotel in Hanoi likely Hanoi Angel Hotel,  Hong Ha hotel or similiar"},{"title":"Day 4: Excursion to Halong Bay one day trip (B/L)","description":"Sightseeing, Exploring suprising Cave, Kayaking, Hiking to Titop island, swimming, sundeck party.\nFrom 07:30 - Picking up from hotel/ stay and depart for Tuan Chau Island, Halong City, stop over for a rest on the way  \n12:30 - Arrive Tuan Chau Harbor, welcome aboard, and safety briefing  - We will take you on an 5 hour journey via 2 day-sleeper boat cruise route which renowned for its striking, passages uninhabited islets and outcrops have been given imaginative names by the locals, due to their perceived shapes, including Cock Fighting and Thumb, while enjoy Vietnamese mouth-watering lunch on boat.  \n13:45 - Arrive Bo Hon archipelago, you will visit Surprising Cave to see a lot of stalagmites and stalagtiles with different shapes of sea lives, then go kayaking or bamboo boat in Luon Cave to discover the beautiful lagoon.  - Visit Titov Island with sandy beach adjacent to the towering limestone mountain with excellent backdrop of the Bay, and climb up Titov Peak for a panoramic view of the bay like paradise.  \n16:30 - Return to the Cruise for Afternoon Tea and cruising back toward Tuan Chau harbor. There are a lot of time for sunbathing on upper deck with music, enjoy great fun of group touring fellows among world iconic natural scenery.  \n17:45 - Disembark for a bus ride back Hanoi, short break on the way  \n21:30 - Drop off at your hotel/stay, trip ends.\nAccommodation: 3 star hotel in Hanoi likely Hanoi Angel Hotel,  Hong Ha hotel or similiar"},{"title":"Day 5: Hanoi departure( B)","description":"Today, you are free till airport transfer for departure flight. Trip ends!"}]},{"name":"Legendary of Vietnam 19 Days","duration":19,"travelStyle":["In-depth Cultural","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2134,"summary":"Are you still looking for that perfect trip to make a year to remember? Then look forward to this incredible almost three week tour around the stunning country of Vietnam! Fall in love with Vietnamese food, marvel at breathtaking landscapes and discover the rich and proud history of this incredible Southeast Asian nation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0056aac4816.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0056aac4816.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_e67c2f6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_1e3c0185.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_9209c5d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_27319e08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_687983f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_e3f1bd5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_fc88d731.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_6a1836eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_b6e3479f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_c25e2ddc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_128107c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_6ccf7a95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_cdec79a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_02b963a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_1c043577.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5f24f998.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0055f150451.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0055f15582b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0055f15a715.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0055f15ee9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0056ab24d78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0056ab308ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95455_5e0056ab35ce6.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Halong Bay","Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Arrival in Ho Chi Minh City (called Saigon), Vietnam","description":"You land in Saigon, and this is where your adventure begins! You will be welcomed and taken from the airport by our representative to your selected hotel in Saigon. Free at leisure. Stay overnight in Saigon.\nDistance: Tan Son Nhat Airport - Saigon Central: 7 - 8km or 30 minute transfer.\nLiberty Parkview Saigon Hotel or similar\nAirport pick up included!"},{"title":"Discover Saigon City Landmarks (B, L)","description":"The meeting point for our Saigon Landmarks Photowalk is in front of Notre-Dame Cathedral. We will make our way to the Saigon River and make stops in some of the most emblematic locations of the city on the way. And take chance to look to capture some interesting street scenes. After a short debrief around a drink, we will finish our photowalk near the Bitexco Tower. The tour is intended for people wishing to hone their photographic skills all the while discovering the historical heart of Saigon.\nRouting: Notre-Dame Cathedral ￫ Saigon Central Post Office ￫ Park ￫ Reunification Palace ￫ Ho Chi Minh Museum ￫ City hall ￫ Eiffel metallic bridge ￫ Bitexco Tower (not included entrance fee to Bitexco Tower).\nOvernight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 3 - 4: Mekong Delta Cruise to visit Cai Be Market 2Days/1Night (2B, 1L)","description":"Mekong Delta River Life Style – where people don’t use motorbike/cars much, but boats, where the people live, work and even entertain on river boat. Take this trip and you’ll have the chance to see the most interesting, exotic rural life in Vietnam with a boat ride on the Mekong Delta River. And Cai Be floating market is typical.\nStay overnight in Can Tho.\nHere is the highlights of the trip that you will never forget:\nKeep your eyes on the green paddy fields existing on the way to Mekong Delta River\nCai be floating market - one of the biggest and famoust floating market in Mekong, enjoy the peaceful moment of local rural life\nWalk to visit Coconut Candy Farm, buy the hand-made items from coconut trees of Mekong Delta as souvenir.\nAfter lunch at seasonal fruit garden, you will be divided from motorized boat group into some 2-pax groups on smaller sampan to do zigzag through a maze of shadow canals to enjoy the fresh air along the canals and water coconut trees scenery.\nCruising along the small and picturesque tributaries by rowing boat, we will see the biggest floating market in Can Tho Province - Cai Rang floating market (the nicest one with heaps of rowing boats).\nVisit a rice husking mill and a rice noodles making shop.\nDistance: Saigon - Vinh Long - Can tho - Saigon: 420km/2days\nIris Can Tho Hotel or similar"},{"title":"Day 5: Saigon - Cuchi Tunel half day trip (B)","description":"This morning explore the amazing network of the Cu Chi Tunnels with length about 200km, which housed entire underground guerrilla villages during the American War in Vietnam.\nFree for your own activities in the afternoon. Stay overnight in Saigon.\nDistance: Saigon - Cu Chi Tunnel: 75km or 1.5 hours transfer.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City - Nha Trang City by flight (B)","description":"Continue your trip with the next destination is our most beautiful sunny beach city – Nhatrang.\nThe afternoon is free at your leisure to stroll along the beach or explore this seaside town. Overnight in Nhatrang hotel.\nDistance: Saigon - Nhatrang by 45 minutes of flight.\nCamranh Airport - Nhatrang city central - 30km or 45 minutes transfer.\nRegalia Hotel Nha Trang or similar "},{"title":"Nha Trang - Islands Tour (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nRegalia Hotel Nha Trang or similar "},{"title":"Day 8: Nha Trang - Hoi An by flight (B)","description":"Leave Nhatrang to Hoi An - an ancient town of Quang Nam Province. This journey need the domestic flight from Nhatrang to Danang airport. Arrive in Danang, you will be greeted to transfer to hotel in Hoi An for check-in. Stay overnight in Hoi An. Discover Hoi An ancient town by night.\nDistance: Danang airport - Hoi An town: 35 km or 45 minutes transfer.\nPhu Thinh Resort Hoi An or similar "},{"title":"Hoi An Cooking Class & Ancient Town Trip (B, L)","description":"In the morning, you will be welcomed by the Chef. Visit Hoi An’s colorful market, and experience the amazing sights, sounds and aromas of this busy market. Here, you will have the opportunity to interact with the local sellers and learn about all the ingredients to be used in the cooking lesson later. We board the boat for a leisurely cruise (25 minutes) along the Hoi An River to the Cooking School. This is a chance to view local river life, so make sure your camera is handy. On arrival, we explore the cooking school’s herb garden, before learning about some of Hoi An’s and Vietnam’s well-known dishes. The cooking lesson runs for about 2 hours – the chefs first demonstrate each dish before we prepare the same dish ourselves. Included in the class is a brief introduction to Vietnamese food carving (plate decoration). After the lesson, we sit down and eat what we have cooked.\nThen, The guide and driver met you when disembark boat to continue half day to explore Hoian town: the Japanese Covered Bridge-the symbol of Hoian. Step back in time to discover the Chinese street with stunning Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture. We then visit Hoi An vibrant market and ancient port to explore the rythm of local daily life and savor the true color, flavor and taste of the oriental. Finally, we visit Phuc Thanh Pagoda - the oldest pagoda in Hoi An built in 1454 with Chinese bonze.\nPhu Thinh Resort Hoi An or similar "},{"title":"Hoi An - My Son Holly Land Visit (B)","description":"In the early morning, our guide and car will pick you up at your hotel for transfer to My Son Holy land- once the capital city of Champa Kingdom (around the 4th to 12th century). My Son is a large complex of religious relics that comprises more than 70 architectural works. They include temples and towers connecting to each other with complicated red brick designs. The major structure of Cham architecture is tower, built to reflect the divinity of the king. Drive back to Hoi An around noon.\nFree in the afternoon. You could try some tailor-made Vietnamese Dress or shopping.\nOvernight in Hoi An.\nDistance: Hoi An town - My Son Holly Land: 50 km or 1 hour transfer.\nPhu Thinh Resort Hoi An or similar "},{"title":"Hoi An - Hue by Road (B)","description":"Our driver will pick you up at your hotel in Hoi An and drop you at your hotel in Hue. On the road, you will have chance to visit Vietnam’s famous spots : Marble mountain, My Khe Beach, Cham Museum, Hai Van Pass, Lang Co beach, oyster farming village, Elephant Springs.\nArrive in Hue, take the trip to visit the Formal Imperial City with famous sights as Imperial Citadel, Forbidden Puple City and Khai Dinh Temple.\nOvernight in Hue.\nDistance: Hoi An town - Hue: 145 km or 3 hours transfer.\nCherish Hotel Hue or similar"},{"title":"Hue - Hanoi by flight (B)","description":"After breakfast, take your morning trip to visit the Royal Tomb of Minh Mang and Thien My Pagoda by boat along the perfume river. After the trip, transfer to airport & take flight to Hanoi. Arrive Hanoi. Check in hotel & overnight in Hanoi.\nDistance: Hue Central - Phu Bai Airport: 14 km or 20 minutes transfer.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Sightseeing full day (B, L)","description":"Having breakfast at hotel then start sightseeing Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to Hochiminh Mausoleum, One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong.\nAfter lunch, stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda.\nTake the outside visit to the Opera House, St. Joseph Cathedral and make sure your camera is handy. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Optional for Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi. \nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Duong Lam Ancient Village (B, L)","description":"Today is such a peaceful day with the short trip to visit the most ancient village in the north of Vietnam – Duong Lam Village, well-known for its preserved ancient houses, some of which date back 400 years. Visit Mong Phu Temple in Mong Phu Hamlet and observe the daily lives of the locals. This evening watch a performance of the famous Water Puppets, which have a history dating back thousands of years.\nDistance: Hanoi central - Duong Lam Village: 60 km or 1.5 hours transfer.\nPomihoa Hotel Hanoi or similar"},{"title":"Excursion to Halong Bay and Stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nDistance: Hanoi central - Halong Bay: 180 km  or 3.5 hours transfer.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi - Lao Cai/Sapa by Overnight Train (Brunch)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nRemark: The Halong itinerary is subject to change upon cruise’s management.\nThe great trip to Vietnam will be much interesting by extending to visit Sapa - northwest of Vietnam’s North.\n7:30pm: Embark on train for the night trip to Lao Cai - Sapa. The cabin is based on 4-berth sharing cabin, overnight on train.\nDistance: Hanoi central - Train Station: 3 km or 10 minutes transfer.\nOvernight on the Train - Deluxe Cabin 4 Berths Soft Sleeper."},{"title":"Lao Cai Arrival - Sapa by Road - Homestay (B, L, D)","description":"Arrive in Lao Cai Station early this morning. Be greeted at the train station, transferred to Sapa town.\nSapa is one of the most interesting sightseeing in the north of Vietnam, with the height around 1500-1650 m above sea level. Sapa is a land of modest, quietly but hides varies wonderful of natural scenes and Sapa is also a nest of hill tribe as: Black H’Mong, Red Dzao, Xa Pho, Tay, Zay…etc. Travel to Sapa, people forget everything, just enjoy the fresh air, clouds, sky, romantic scenery, majestic place, that is the reason why Sapa town is also known as the town in the cloud. With an average temperature of 14-18°C, cool in summer but a bit cold in winter. Sapa always attract tourists in whole year.\nArrive in Sapa around 9am, have a soft breakfast at local restaurant. The room for refresh/changing is confirmed upon availability. Otherwise you could book in advance with extra charge.\nAbout 10:00 am we leave the hotel and start trekking. The first part is on the road but we soon turn to the right and walk on a small path down the valley to the Muong Hoa River and from here to the Black H’mong village Lao Chai. Black H’mong is one of the biggest minority groups in the Sapa area. They are proud of their culture and keep their traditions and way of living. They have their own language and wear traditional indigo blue clothing. After this you continue to Ta Van Village (1.200 m) to visit Zay people. Zay is a fairly small minority group of about 38.000 people who live mainly in the mountains in Northwest Vietnam. The development has meant that some of their old customs have been lost but many women still wear traditional shirts with a purple, blue or green color. The Zay houses are built of wood and bamboo with a clay floor. We stay overnight with a local family in Ta Van and have our dinner here.\nRemark: if the homestay is not convenient for you, the hotel option is available with extra charge.\nDistance: Lao Cai - Sapa: 30 km or 45 minutes transfer.\nHomestay in Giang Ta Chai Village - Private Bed, sharing the House"},{"title":"Giang Ta Chai - Su Pan - Sapa - Night train to Hanoi (B, L)","description":"After the breakfast we continue to visit Red Dzao people at Giang Ta Chai where we also see a waterfall. The Red Dzao women have very colorful red embroidery and coins on their clothing. On their head they wear a red scarf. Some of the women have shaved off their eyebrows because of a nice Red Zao Legend.\nWe continue along small paths in the rice fields, cross the Muong Hoa River and trek up to Su Pan where you will meet the jeep and transfer back to Sapa.\nEvening take a transfer to Lao Cai station for a night train to Hanoi. Overnight on train based on 4-berth sharing cabin.\nOvernight on the Train - Deluxe Cabin 4 Berths Soft Sleeper."},{"title":"Day 19: Hanoi Arrival - Back home by flight (B)","description":"Arrive in Hanoi station in early morning, you need to take some step of walking to the mini hotel nearby the station for breakfast and refresh (4-hours of time use). Depend on your flight time, our guide and driver will come to this hotel to pick you for airport drop-off. End of services. Good bye and hope to see you very soon in Vietnam and Indochina.\nAirport transfer included!"}]}]