[{"name":"Hanoi - Sapa Highlight Package Tour in 7 Days","duration":7,"travelStyle":["Discovery","Family","Group","Partially Guided","Ocean Cruise","Holiday"],"oldPrice":0,"price":1255,"summary":"\n\tLVP Travel will be willing to pick you up at Noi Bai Airport and transfer to hotel mentionded in Hanoi Old Quarter, relax in couple of hours before exploring some places surroundings. Customer must have to inform the Flight number and time of arrival, Driver and Guide will follow and pick up service offered. Single Traveller will be charged 180$ due to the luxury carbin room on Halong Bay Cruise\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_80b5329a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_a3907ab3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_72e0ed1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_33b87d89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_6362cb86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_9ad1fe56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_3f75c070.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_7f44b906.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_98aa96f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_ec7f2be8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_89c80d09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_abd078d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_39406cfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137667_cfe7aef5.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Briefly Descriptions: Experience the contrasts of Northern Vietnam from the charming chaos of Hanoi to the relaxing waters of Halong Bay.  Highlight Vietnam Tour is a fabulous introduction of Vietnam's Culture and Traditional. Begin your journey in the capital city with a Hanoi Capital full day city tour.  Visit the Temple of Literature and the mausoleum of Ho Chi Minh for a touch of history before heading through the busy Old Quarter.  Relax at the end of the day with a coffee at a local lakeside café and marvel at the seemingly endless stream of motorbikes. Enjoy the beautiful scenery diversity hill tribes, very peaceful and green rice terraces in Sapa - the roof of Indochina.\nLeave the hustles of the city behind as you travel east to the Gulf of Tonkin and board a traditional wooden junk boat.  An overnight cruise on Halong Bay is the remarkable opportunity to truly appreciate the beautiful limestone, karts mountains, spending the hours sailing among limestone cliffs and Emerald seas.  Stop to visit a mysterious cave, swimming in the warm waters and feast on fresh seafood.\nwe can tailor your family journey to the central or south of Vietnam with more history & Culture or also stunning sceneries in each destinations\nDay 1: Arrival Hanoi Vietnam (Dinner)\nToday you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Capital City some called The City Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Enjoy for leisure in Hanoi until 7:00pm. Take night train from Hanoi to Sapa. Overnight on the train. (Opt 4 Softbed- Sleeping Carbin or 6 bed sleeping Carbin)\n"},{"title":"Day 2: Sapa","description":"Day 2: Sapa arrival - Black Hmong Village - Red Dao Village (Breakfast, Lunch, Dinner)\nArrive Lao Cai Railway Station at 5 -6:00am. Pick up to Sapa town for check in. Having breakfast and start hiking down to Lao Chai village to visit the Black H'mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town.\n"},{"title":"Day 3: Sapa","description":"Day 3: Lao Cai- Bac Ha Sunday Market - Night train back Hanoi (Breakfast, Lunch, Dinner)\nAfter breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most fabulous and colourful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, buffaloes,horses... all for sales or Barter. This is an unique opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H'mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Overnight on the train.\n"},{"title":"Day 4: Halong Bay","description":"Day 4: Excursion to Halong Bay and Stay overnight on Board. (Breakfast, Lunch, Dinner)\nArrive Hanoi Railway Station at 5:30am. Pick up & transfer to hotel for short rest & breakfast until 8:30am. Leave Hanoi for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\n"},{"title":"Day 5: Halong Bay","description":"Day 5: Halong Bay Cruise - Hanoi. (Breakfast, Lunch, Dinner)\nRising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\n"},{"title":"Day 6: Hanoi","description":"Day 6: Hanoi Sightseeing full day (Breakfast, Lunch, Dinner)\nHanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\n \n"},{"title":"Day 7: Hanoi","description":"Day 7: Hanoi Conclude/ Departure. (Breakfast)\nHave a Free Morning before Taking off to your hometown. comment on your facebook and remind when return Vietnam next trip.\n\n"}]},{"name":"Northern Vietnam Tour to Hanoi, Halong Bay and Sapa","duration":8,"travelStyle":["Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":999,"summary":"This 8- day tour offers all the richness of the Northern Vietnam key sites, its ancient culture of Hanoi capital city combined with magnificent scenery of Halong Bay, friendly people in Sapa. Every aspect of the trip is exciting, from the Old Quarter of Hanoi, to the top luxury cruise on Halong Bay and the unique culture of the ethnic minority people in Sapa.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137096_9c778d62.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137096_9c778d62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_d5f477ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_3ba87995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_d7fb6bfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_d7a9d8cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_729f5f2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_ad98cb0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_82f1e6bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_41487d2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_3a6849c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_1917fd83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_3ddb70f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_36ac5d49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_952de891.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_329bb6fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_5c4b58bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_2596c992.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_dfe5c772.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_dbf369e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_ebca7e15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_75489a07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137096_8e43f7e0.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI – ARRIVAL (-/-/-)","description":"Upon arrival in Noi Bai Airport, you’ll receive cordial welcome and comfortable transfer to hotel. If time permits, enjoy an orientation tour by cyclo around the old quarter streets, an interesting introduction of the city. Like other big cities, Hanoi is hustling and bustling, with thousands of people riding motorbikes, the most convenient means of transportation in the city.\n\nO/N in Hanoi."},{"title":"DAY 2: HANOI CITY TOUR –NIGHT TRAIN TO SAPA (B/-/-)","description":"Today you’ll be on a full day tour to discover the most outstanding attractions of Hanoi. First, pay a visit to the complex of memorials to Ho Chi Minh to know his amazing life. Continue to the One Pillar Pagoda and the Temple of Literature to gain understanding of the two driving forces in Vietnam culture.\n\nAfternoon visit the Museum of Ethnology which exhibits a large collection of artifacts about the cultures of the 54 ethnic groups in the country. Next, hustle back to the peaceful Hoan Kiem area since there is a water puppet show at the popular Thang Long Water Puppet Theater awaits.\nWater puppet is a unique traditional art form and expression of cultural identity. The shows capture Vietnamese traditions; farming, tending buffaloes, and catching fish; entertainment, like swimming contests and lion dancing; and historical legends with traditional music.\n\nThe one-hour show is a fun and insightful look into Vietnamese culture enjoyed by both adults and children. Later, you will be transferred to a hotel to have a break and shower before boarding the night train to Sapa.\n\nOvernight on the train."},{"title":"DAY 3: LAO CAI –SAPA- TREKKING TO LAO CHAI, TA VAN (B/L/-)","description":"The train arrives at Lao Cai station early this morning. Transfer to Sapa where your breakfast is prepared & served. Then, you’ll join us on a trip to the villages of Lao Chai & Ta Van, a home of the H’mong and Dzay. The day is devoted to a beautiful hike through the breathtaking scenery of Sa Pa valley.\nOn road, you’ll interact with the hospitable locals, pass the beautiful rice terraces, a small suspension bridge and fascinating collection of rock carvings. These engravings depict some beautiful images of man, stilt houses and some beautiful decorative patterns. Today, we’ll share our lunch in a village home.\n\nOvernight in Sapa."},{"title":"DAY 4: SAPA EASY TREKKING TO CAT CAT, THAC BAC (B/-/-)","description":"After breakfast at hotel, find yourself among hundreds of the locals while you are leisurely trekking to Cat Cat village which is inhabited by the Hmong. On arrival at the village, take a visit to a home to learn how they live. Relax by a beautiful waterfall before pick up and transfer to Thac Bac, another highlight of Sapa that we should never miss.\n\nBack to the hotel and spend the rest of your day at leisure.\n\nOvernight in Sapa."},{"title":"DAY 5: SAPA FREE &EASY- EXPRESS BUS BACK TO HANOI (B/-/-)","description":"After breakfast, enjoy your free time until a transfer overland by bus back to Hanoi.\n\nOvernight in Hanoi"},{"title":"DAY 6: HANOI –HALONG BAY, OVERNIGHT ON BOAT (B/-/-)","description":"After having breakfast at the hotel, we journey north- east to Vietnam’s greatest natural wonder, Halong Bay. On arrival, we’ll board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Kayaks are also available if specified at time of booking.\n\nSpend the night on board."},{"title":"DAY 7: HALONG BAY - HANOI (B/-/-)","description":"Wake up to fresh coffee before cruising back to the shore. En route the junk weaves through impressive rock formations that invite comparisons from fighting cocks to dragons and even further! After lunch we disembark and return to Hanoi. En route, take a detour to the 500 year pottery village of Bat Trang.\n\nOvernight in Hanoi."},{"title":"DAY 8: HANOI DEPARTURE (B/-/-)","description":"After breakfast, free until transfer to the airport for your departure flight home."}]},{"name":"8 Days Discover North Of Vietnam","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":520,"price":432,"summary":"Hanoi, Halong bay, Sapa, Tam Coc are the most popular places in all North of Vietnam. With all inclusive tour, Vietnam Travel Top will bring you to all them and guarantee your satisfaction. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Visit UNESCO listed Halong Bay","Swim in the emerald waters of the stunning Ha Long Bay","Explore the emerald waters by kayak or bamboo boat","Learn more about rice cultivation in the mountain areas"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136667_ebcd1edd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136667_ebcd1edd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_fd70af9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_437b4a1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_682924fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_fbc2b96b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_7a92a18a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_e90e9927.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_6bbad591.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_443ff3d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_ac6e69ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136667_7abc64b4.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Airport pick up - Check in hotel in Hanoi","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nNote: Check in time is 13:00 P.M.\nOur people will greet and brief all informationa round the trip."},{"title":"Day 2: Hanoi – Halong bay – Overnight on Majestic Cruises (B, L, D)","description":"08h00 – 08h30: Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12h30 – 13h00: Embark on Majestic Cruises followed by a short cruise briefing.\n13h30 – 14h30: Savor a delectable lunch as Majestic Cruises among the limestone islands.\n15h00 – 16h00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16h00 – 17h00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17h00 – 17h30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17h30 – 19h00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19h00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board."},{"title":"Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meal: B, L )","description":"06h30 – 07h15: Start your day with Tai Chi exercises or a photo hunt.\n07h30 – 08h30: Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n09h00 – 10h00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10h15: Return to the boat. Freshen up and check out of your cabin.\n10h15 – 11h00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11h00 – 12h15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12h15 – 12h30: Disembark Majestic Cruise.\n12h30 – 13h00: Transfer back to Hanoi."},{"title":"Day 4: Hanoi - Sapa by bus - Cat Cat village – Sapa Hotel (L, D)","description":"6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costums of H’mong, Dzao, Tay ethnic People.\nWelcome drink and itinerary briefing\nEnjoy the lunch with local Vietnamese dishes, check-in procedures\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. Have dinner and overnight in hotel with night activities."},{"title":"Day 5: Sapa - Y Linh Ho - Lao Chai - Ta Van – Hanoi (B/L)","description":"7.00 – 7.45: Have breakfast at hotel and prepare light pack for trekking\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n12.00 – 15.00: Have a shower at hotel, check out and have lunch and time at leisure on your own.\n15.00: Meet all group members at hotel to get ready for Hanoi.\n15.15: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: Check in hotel in Hanoi"},{"title":"Day 6: Hanoi Free Day (B)","description":"You are free today to relax after Sapa tour or you can visit some villages around Hanoi. please contact Vietnam Travel Top if you need any arrangement. Breakfast and hotel in Hanoi are included."},{"title":"Day 7: Hoa Lu Tam Coc 1 day tour (B/ L)","description":"8.00 – 8.30 am:  Picking up from hotel/stay.\n08:30 Starting drive to Ninh Binh Province\n10:00 Arriving at Hoa Lu Ancient Capital\n10:15 Visiting King Dinh and King Le’s temples.\n11:30 Arriving in Tam Coc Wharf.\n11:45 Having buffet lunch with Vietnamese Cuisine.\n13:00 Getting on Sampan boats through caves and visiting countryside landscape\n15:00 Back to Tam Coc Wharf to chill out.\n15:15 Biking on country road around village\n16:00 Getting on shuttle bus to go back to Hanoi\n18:30 Saying goodbye to you at your hotel in Hanoi.\nNote: Sometimes, we will switch to visit Tam Coc first and then Hoa Lu."},{"title":"Day 8: Hanoi Departure (B","description":"We will arrange car to airport for you, please advise your flight details.\nIf you need any further arrangement: tour to Hoi an, Ho Chi Minh City…please advise."}]},{"name":"Vietnam Specifically the North","duration":10,"travelStyle":["In-depth Cultural","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":905,"summary":"It is your day to visit the Capital of Vietnam today. Let's start from the Ho Chi Minh Mausoleum, his simple house-on-stilts and the One-Pillar pagoda near Ba Dinh Square, where the most solemn ceremonies of Hanoi take place. Go on to the Temple of Literature, the very first high school of Vietnam ScholarsAfternoon, we will visit Hoan Kiem Lake and the nearby Ngoc Son temple, Ly Thai To statue. Walk through the Old Quarter, a fascinating network of narrow alleys and shop houses also known as ‘The 36 Streets’ – each street being named after the merchandise traditionally sold there, ranging from fabrics to crafts and from medicines to tombstones.","highlights":["Stroll through Hanoi city with its best landmarks and historical-cultural sites","Visit Halong Bay renowned for its thousands of limestone and tranquil islets","Be amazed by the sublime natural beauty of Pu Luong's mountains and valleys"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101731_a1e8a8ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101731_a1e8a8ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_77c77111.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_826cc766.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_f6d0085d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_d37358ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_16db2908.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_51cd8b63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_49546115.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_2e651385.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_a765a155.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_75c871c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_ffe262c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_579bebb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_57778e7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_4aedcdf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_008d61a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_b6ca413a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_f3225be1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_13b7b974.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101731_5c4e9530.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi Arrival (-/-/-)","description":"Warmly welcome to Hanoi, the 1000-year capital of Vietnam! \nUpon arrival, you will be greeted by our local driver then transferred to Hanoi center to drop off luggage. Stay at leisure for refreshment after long flight.\nPlease note!\n-Hotel check-in time is 14:00\n-Depend on your arrival time, the program will be adjusted accordingly."},{"title":"Hanoi City Tour (B/-/-)","description":"It is your day to visit the Capital of Vietnam today. Let's start from the Ho Chi Minh Mausoleum, his simple house-on-stilts and the One-Pillar pagoda near Ba Dinh Square, where the most solemn ceremonies of Hanoi take place. Go on to the Temple of Literature, the very first high school of Vietnam Scholars \nAfternoon, we will visit Hoan Kiem Lake and the nearby Ngoc Son temple, Ly Thai To statue. Walk through the Old Quarter, a fascinating network of narrow alleys and shop houses also known as ‘The 36 Streets’ – each street being named after the merchandise traditionally sold there, ranging from fabrics to crafts and from medicines to tombstones. \nOvernight in Hanoi"},{"title":"Hanoi – Farm Tour and Cooking Class at Local Family (B/L/-)","description":"Breakfast at hotel.\nMorning, we leave Hanoi center and drive to the west of city. Our visit will start from a local market since Le Dynasty, the most famous market in the region where many traditional items for sales, including: dogs, cats, pigs, chickens, ducks, and bamboo baskets. Be surprised about bustling and colorful market which is working under the canopy of old tree.  \nNext to the market place is nice vegetable farms, where we take a tour around vegetable fields growing a variety of produce including: cauliflower, cabbage, tomatoes, green peas, Chinese peas and corn, as well as fruit gardens with oranges, pomelos, papaya, etc. Join with a local farmer with his daily work. Depend on the season this will involve ranking, sowing, water greens, picking greens and other garden activities. During the work, learn more about cultivation techniques and lifestyle through the farmer’s stories.\nAt noon time, we will visit a local family and learn how to prepare delicious local meals by fresh ingredients, then make traditional cake while learning more about Vietnamese family's customs. Enjoy special tea and local wine from the host. Bid farewell to the family and driver back Hanoi center later on.\nAt leisure in the rest of the day. \nOvernight in Hanoi."},{"title":"Hanoi – Pu Luong Retreat - Village Life and The Community (B/L/D)","description":"Breakfast at hotel. \nEarly morning, check out and take drive to Pu Luong (150km from Hanoi).\nYou enter Pu Luong Nature Reserve by road via a breathtaking mountain pass giving you a panoramic view of the whole valley. You arrive at your accommodation in time for a delicious lunch, followed by free time to explore the beautiful retreat, with its captivating panoramic views and tranquil setting.\n\nPM: You have the chance to get close to village life and interact with locals living in the hills above the Retreat. Glimpse at daily life, walk around working farmland and rice fields, and get to know more about the local culture. Walking back the retreat for nice dinner.\nOvernight in Pu Luong."},{"title":"Pu Luong Retreat - Uoi – Lan – Hieu Villages (B/L/D)","description":"AM: This is a common and easy walk around the most beautiful valley of rice terraces in front of the Retreat. We start to descend into the beautiful valley facing the Retreat where you walk around tumbling rice terraces. Then we will walk through small paths shrouded in vegetation to slowly reveal a picturesque Uoi village sitting at the base of a towering mountain. Your camera will not be able to sit still when you see the panorama view of the village from above.\nPM: Continue walk down hill to a local home, where you can take rest then take a cycle to go cycling around Lan village. If time permits, we will visit a local family where we can learn about their traditional brocade weaving (not guaranteed). Cycling through the rice paddies and village to village, bridge to bridge to explore more the scenic landscapes surround. You will end up at Hieu Village (the stunning village in the area), you will have a good chance to enjoy the Hieu waterfall, the sole one in the reserve. Ride back to the local home, where the car pick-up point. You will be transferred back to Puluong retreat for dinner.\nOvernight in Pu Luong."},{"title":"Pu Luong - Bang Scenic Village – Hanoi (B/L/-)","description":"AM: After breakfast, take a short ride from the retreat to Dong Dieng village, Going down into the most beautiful valley in Puluong. Along the way you will have a chance to enjoy beautiful terrace rice fields and gorgeous mountains. Take a scenic trails winding to have a look of the landscape of rice field and the village, which were widen in your eyes. You will pass some homes on the way, you can come to visit any local family if you want, this is a great chance to learn more about life style and culture of the locals. It’s time to get back the retreat for lunch.\nAfter lunch, check-out the retreat and drive back to Hanoi. Overnight in Hanoi.\n"},{"title":"Hanoi – Halong Bay (B/L/D)","description":"If you wish to see how the Hanoi people rise and shine in the morning, wake up early and run to a lake close by your hotel, you can join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi quan, jogging, martial arts, classical dance and so on. After breakfast at the hotel, we will head to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006, and check-in our overnight boat. Enjoy a trip on Halong with stops to visit caves or to swim and enjoy the sunset on the sea. Dinner with fresh seafood! Overnight onboard."},{"title":"Halong Bay – Hanoi (B/L/-)","description":"Morning wake up with a taichi-quan or yoga exercises guided by the crew before having breakfast whilst your boat goes on between Halong islets. Return to the Wharf to be back to Hanoi by shuttle bus at midday. Arrive in the city around 3-4pm. Overnight in Hanoi.\nOptional: \nHANOI STREET FOOD TOUR\nNavigating Hanoi's thriving street food scene can be tough. This unique, carefully designed adventure combines expert knowledge with flexibility to pursue your unique interests, bringing you closer than ever to discovering the culinary secrets hiding around every corner.\nSample a wide variety of popular street food dishes, including bun cha (grilled pork patties with noodles), pho (beef noodle), crab noodle, pork porridge, and savory Vietnamese pancakes (ban xeo). Delve deeper into lesser known foods, including grilled quail, golden pillow cakes, beef noodle, eel noodle, shrimp cake, and snails. Enjoy an assortment of drinks and local dried snacks, and even visit a local market place."},{"title":"Hanoi at Leisure (B/-/-)","description":"Breakfast at hotel. \nStay at leisure today at your own for relaxing or shopping around. Overnight in Hanoi. \nOptional: \nNINH BINH – HOA LU – TAM COC – BICH DONG CAVE\nTiming: from 8:00 – 18:00\nOur guide and driver will pick you up from your hotel. Today will be your great chance to visit to Ninh Binh, one of the oldest capitals of Vietnam. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a visit to the shady Dinh and Le temples, the site that used to be the kings’ palace in 10th century. Further discovery in Ninh Binh will be continued by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Back to Hanoi late afternoon. "},{"title":"Hanoi Departure (B/-/-)","description":"At your leisure until your driver comes to meet and transfer you to the airport to take the departure flight. End of services.\nPlease note!\nHotel check-out time is 12:00"}]},{"name":"10 Days Vietnam Natural Sites Package","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":896,"price":744,"summary":"Vietnam is considered a poor developing country after hundred year in the war. But Mother Nature gave Vietnamese a lot priceless gift. Our country is filled with natural beauty. Spectacular mountainous area, amazing limestone in Halong Bay, biggest cave in the world … are all the must go places in Vietnam. Within 10 day you have chance to discover all the best natural site in Vietnam as well as our unique culture. Let’s join us. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Visit UNESCO listed Halong Bay","Swim in the emerald waters of the stunning Ha Long Bay","Explore the emerald waters by kayak or bamboo boat","Admire the amazing sights traversing the paths through varying landscapes and sceneries"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136665_3e6d6aba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136665_3e6d6aba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_3b4f4f33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_2e073a3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_0dc544ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_4314ac2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_0aab36bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_daf14b50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_caea8b4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_8a846470.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_98d2950b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_d7d22705.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_4de61483.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_8463ce17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_2ed6dd23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_8b319290.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136665_78b7d40a.jpg"],"destinations":["Hanoi","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi - airport pick up - Check in hotel (Meal: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist.  After that you are free to visit Hanoi City by yourself."},{"title":"Day 2: Hanoi - Halong Bay day tour (Meal: B,L)","description":"08:00- 08:30 AM: Picking up from hotel/stay and depart for Halong Bay \n10:30 Soft break on the way to stretch the legs\n12:15 Arriving in Ha long bay harbor  \n12:30 Boarding cruise with welcome drink \n13:00 Safety briefing \n13:15 Lunch with Vietnamese cuisine & seafood\n14:00 Stop at Ba Hang cave for kayaking or rowing bamboo boat or relaxing \n15:00 Visiting Thien Cung cave  (the cave of the heavenly palace - famous for its stalagmites and stalactites, the cave has only opened to the public since 1998 )\n16:30 Disembarking to get on shuttle bus       \n18:00 Stopover to stretch your legs \n20:30 Saying goodbye to you at your hotel. "},{"title":"Day 3: Hanoi – Street food tour – Overnight train to Quang Binh (Meal: B,L)","description":"At 11.00, our tour guide will welcome you at your hotel lobby, then start walking around 4Km in old quarter \"36 old streets\" to visit some famous and specialized- food families or stalls/ local restaurants, shops where they run their business everyday, certainly you will watch and taste around 6- 8 particular dishes, we can customize vegetarian or special food too.\nSpecial thing that tour guide would like to introduce some popular authentic food in lovely mini restaurants (not luxury restaurants) where you feel comfortable to sit down and enjoy some favorite dishes and nice drinks too.\nIt's interesting to hear from tour guide about the history of the old quarter in Hanoi, it is thousand years old and today retains much of the old flavor that made the area special in earlier times, each street was the exclusive domain of one trade (guilds) so there are whole streets of blacksmiths, silver shops, paper shops, headstone makers and more. Originally there were just 36 old streets in the old quarter but today there are more than 50 streets.\nIt is very difficult to find some local food stalls and mini restaurants on your own in hidden alleys and sidewalks, certainly the best way to make it easy is joining with Vietnam Travel Top, taking part in this special tour to learn about Vietnamese cuisine, culture, people and language.\nAfter all. Food on Foot Tour will give you an unique experience to try the foods of the local Hanoi people, we ensure the food is handled hygienically and provide a comfortable venue for the tastings. The benefit also goes back to the vendors or restaurants/ families as we buy directly from them.\nAt 14.30 our tour guide say goodbye to you, and will help you order taxi or show you direction back your hotel. You are free in Hanoi till our driver come to pick you up for the overnight train to Quang Binh. "},{"title":"Day 4: Quang Binh – Phong Nha cave 1 day tour - Hue (Meal: B,L)","description":"Arrive in Quang Binh, our driver will pick you up then transfer you to the hotel for a rest and you could have breakfast there.\n9:30 AM Pick you up at your hotel and leave for Phong Nha in Quang Binh Province. Take a boat cruise on the Son River to visit Phong Nha Cave with its grottos (Bi Ky, Cung Dinh, Tien... and Tien Son).\nHave Lunch at local restaurant.\nAfter lunch get on the bus return to Hue\nArrive in Hue at about 07:00 PM. "},{"title":"Day 5: Hue city tour (Meal: B,L)","description":"07.45 - 8.30 AM, We will pick up you at your hotel & transfer to Visit 04 famous sites: Minh Mang Tomb, Khai Dinh Tomb, Tu Duc Tomb, Conical Hat Making Incense Making Village.\n\nAfter having lunch, visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank\n\nAfter you visit Thien Mu Pagoda, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\n\nThe tour ends at 16.30 "},{"title":"Day 6: Hue – Bus to Hoi An (Meal: B)","description":"8.00 AM Our driver will pick you up at the hotel for a transfer to Hoi An. The van makes stops for sight-seeing at the following locations: Marble Mountains, Hai Van Pass, Lang Co Beach. "},{"title":"Day 7: My Son tour (Meal: B,L","description":"7:45 – 8:30: The bus and tour guide pick you up at your hotel\n8:30 : Leaving Hoi An  for My Son HolyLand.\n9:30: Arriving in My Son – the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of ancient buildings at of the Champa  Kingdom with our tour guide.\n12.00: Leaving My Son for Cau Lau boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip! "},{"title":"Day 8: Check out – fly to Ho Chi Minh – check in hotel (Meal: B)","description":"Today you are free in Hoi An Town till our driver come to pick you up for the transfer to Da Nang for the flight to Ho Chi Minh city.\nArrive in Ho Chi Minh, our driver would pick you up then transfer you to the hotel. You are free in the city today "},{"title":"Day 9: Mekong Delta tour (Meal: B,L)","description":"7:30 – 8:00 Picking up from hotel\nStarting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30    Start the motorized boat to visit the Cai Be Floating market, experience how people\nexchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn.\nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature.\nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City. 18:30 Arrive in your hotel. "},{"title":"Day 10: Check out – Pick up to airport – Departure (Meal: B)","description":"Today you are free until our driver come to pick you up and transfer you to the airport for your flight. "}]},{"name":"Vietnam Southern Tour in Focus from Saigon to Mekong Delta, Nha Trang and Da Lat","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1235,"summary":"This tour brings you many chances to discover the wealth of beauty and culture that South Vietnam has to offer, beginning with a comprehensive sightseeing tour of Ho Chi Minh city, the fastest-growing metropolis in SE Asia, the mighty Mekong Delta and the Cu Chi tunnels. Then, relax on Nha Trang beach – ranks among the top of all beaches in Vietnam and enjoy Dat Lat – A little Paris – where many couples come to visit for their Honeymoon.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171049_0c4d54c6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171049_0c4d54c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_4a6d2182.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_f2ac2f80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_f56483f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_5f48e51c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_0f9390dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_adf49803.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_0b1fefed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_83584834.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_e55a4861.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_43f7a2b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_ff6b6faf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_1f7145ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_a4720800.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_d0af7faf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_d4f4f71d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_5b3cb303.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171049_9dca8989.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Dalat"],"timeline":[{"title":"DAY 1: ARRIVAL – HO CHI MINH CITY","description":"On arrival at Tan San Nhat Airport, you are met by our guide and transferred to hotel. The bustling Ho Chi Minh City, still called Saigon by many locals, is a center of commerce, finance, culture and tourism in Vietnam. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. ( If time permits) we stroll around the down town to explore the different local ways of life.\nO/N in Ho Chi Minh City."},{"title":"DAY 2: HO CHI MINH SIGHTSEEING CITY TOUR & CU CHI TUNNELS (B/L/-)","description":" Today we spend a half day exploring the captivating Ho Chi Minh City. The most places of interest are located near the town center. We pass by the now-demolished wartime American Embassy on our way to the Reunification Palace. This famous edifice was a former residence of the President of Southern Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. We follow these with a visit to the Jade Emperor Pagoda and the War Remnant Museum with a wealth of images from the notorious conflicts. The sightseeing ends up with a walk around the retail Ben Thanh Market where anything and everything is for sale!\nAfternoon: Transfer about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range\nO/N in Ho Chi Minh City."},{"title":"DAY 3: HO CHI MINH CITY PACKAGE TOUR – MEKONG CRUISING TOURS (B/L/-)","description":"Breakfast at hotel\nTransfer about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range. In the afternoon, we travel by roads to the Mekong Delta. This plain region boasts the largest rice bowl of Vietnam. On arrival in My Tho we board a boat navigating around the intricate small canals, which is a great way to observe the local lifestyle close-up and catch a view dotted by many islands. The exciting river trip will pass by the lush green vegetation towards the famous Unicorn Island where we have a chance to stroll around an orchard, taste many seasonal fruits and see farmers at work. We navigate some narrower canals using small rowing boats to Ben Tre Province for an interesting visit to some local industries. The extra enjoyment is a lunch at one of the famous local eating spots. We drive back to Ho Chi Minh.\nO/N in Ho Chi Minh City."},{"title":"DAY 4: HO CHI MINH CITY TRAVEL PACKAGE TOUR – DA LAT VACATION (B/-/-)","description":"The journey northwards begins as we depart Ho Chi Minh and pass through the many tea and coffee plantations to the hill station of Da Lat, sometimes known as the “City of Eternal Spring”. The drive is long but views are fantastic all along the way. Once arriving in Da Lat we can soak up the cool climate as much as we want by spending our time to wander around and catch our first glimpse of this town.\nThe influence of the French is evident in local culture and architecture since Da Lat was founded as a hill retreat for the colonials to escape the oppressive heat in the coastal plains and the chaos of Saigon. This charming town is set around a lake and surrounded by forests, waterfalls and rolling countryside."},{"title":"DAY 5: DA LAT – NHA TRANG TOUR (B/-/-)","description":"Pick up  from hotels, drive on the quiet Provincial Road 725 , pass Camly airport, vegetable and flower fields, forests...\nToday we enjoy a drive through the Mang Linh Coffee plantation, Van Thanh Flower village, Cricket farm, Rice wine distillery, the rural market of Nam Ban village, Cuong Hoan silk factory, enjoy the impressive Elephant waterfall roaring like thunder!\nWe follow it with a trip to the sacred Linh An Pagoda.\nTransfer to Nha Trang and have a check in at your hotel in Nha Trang.\nO/N in Nha Trang."},{"title":"DAY 6: NHA TRANG BEACH TOUR (B/L/-)","description":"The turquoise water surrounding a string of islands and the white sandy beach stretching the whole length of Nha Trang City make it one of Vietnam’s premier beach resorts. We board a boat to explore the coastal islands. The ROBINSON OASIS is our first stop. Today we have plenty of time to enjoy swimming and snorkeling on the blue and clear water or simply lazing on a beach. Scuba Diving (your own fee).\nThe thrilling boat trip continues towards TRI NGUYEN AQUARIUM with hundreds of nice and precious marine creatures are bred in the lake, looking a real marine museum. By mid afternoon we cruise back to Nha Trang Pier and complete our day with a short city tour. The impressive LIVE SHOW MUSIC with more than 20 languages and the FLOATING BAR with Sexy Funny Dance \n17:00  END THE TRIP AND TAKE YOU BACK TO MAINLAND.\nO/N in Nha Trang."},{"title":"DAY 7: NHA TRANG– HO CHI MINH CITY TRAVEL PACKAGES (B/L/-)","description":"After breakfast at the hotel, around 8h00 back down to sea level and Ho Chi Minh City (Saigon). It is around an 8-hour drive, on the way to Ho Chi Minh we can stop by Bao Loc, the land of tea, coffee and mulberry. Dambri Waterfall are surrounded by hills of mulberry, tea, and palm trees. Visitors can also enjoy a cruise on the clear lake.\nArrival in Ho Chi Minh will be late afternoon.\nO/N in Ho Chi Minh City."},{"title":"DAY 8: HO CHI MIMH CITY - DEPARTURE (B-/-/)","description":"Breakfast at the hotel. Free for your own activities until transfer to Tan Son Nhat airport for departure."}]},{"name":"Low Budget Vietnam Tour from Hanoi, Halong Bay to Da Nang, Hoi An, Saigon","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":864,"summary":"This 8-day Vietnam Tour inspire you to take in the delight of exploring the best highlights of Vietnam. You will be immersed in the special beauty of Hanoi, cruise around the picturesque backdrop of Halong seascape, walk in the quiet streets of Hoi An Ancient Town, and enjoy the happy hours in busy Saigon.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170891_cb6a01e5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170891_cb6a01e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_5b4348e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_731ce3db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_cbc4a5d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_56ca9e82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_d253e2d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_459828fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_a0d98537.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_3a65ad3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_48127210.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_28f184e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_8f920c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_9f1ae914.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_99065cd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_bf60fc16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_22ea06ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_a6543a58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_6615a13b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_8c238d28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_1135e89c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_4be0a45f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170891_de99f334.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"DAY 1. ARRIVAL – HANOI","description":"Upon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Hanoi."},{"title":"DAY 2. HANOI ONE-DAY GROUP TOUR TO HALONG (B/L/-)","description":"After having breakfast at hotel, you’ll be at leisure in the lobby.\n7:50 – 8:30: Our cruise’s shuttle bus and tour guide pick up at your hotel in Hanoi old quarter, then take about 3.5 hour drive to Halong Bay.\n12:15: Arrive in Bai Chay tourist wharf, welcomed by crew on our cruise and enjoy welcome drinks, take photos12:45: Sailing forward to looking stunning scenery with thousands of limestone mountains and  have seafood lunch while cruising through the emerald water passing by the Dog Stone, the Burning Incense Islet, stop at fishing village for kayaking – you will have 30 – 35 minutes to explore some grottoes and islets by yourself. After that visit Fighting-Cock rock and the Heavenly Palace (Thien Cung cave) – which has opened to the public since 1998 with stalagmites and stalactites. Back to Cruise. Our staff serves you cold tissues and fresh fruits.\n16:15: Back to Tourist wharf and get on bus to Hanoi.\n20:00: Arrive in Hanoi. \nO/N in Hanoi."},{"title":"DAY 3. HANOI – FREE DAY – NIGHT TRAIN TO DANANG (BSS)","description":"Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car)\nBy the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Da Nang on SE1 (19:30 – 11:40 +).\nOvernight on train."},{"title":"DAY 4. DA NANG RAILWAY STATION – HOI AN – FREE (B/-/-)","description":"Upon getting to the Da Nang Railway Station, you’ll be welcome & escorted to your hotel in Hoi An for a check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Hoi An."},{"title":"DAY 5. HOI AN AT LEISURE (B/-/-)","description":"After having breakfast at hotel, you’ll be free on your own to explore Hoi An (No Guide & No Car)\nO/N in Hoi An."},{"title":"DAY 6. HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B/-/-)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Ho Chi Minh City."},{"title":"DAY 7. SAIGON AT LEISURE (B/-/-)","description":"After having breakfast at hotel, you’ll be free on your own to explore Saigon (No Guide & No Car)\nO/N in Ho Chi Minh City."},{"title":"DAY 8. SAIGON – DEPARTURE (B/-/-)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00)\n"}]}]