[{"name":"Vietnam: Hike, Bike & Kayak","duration":11,"travelStyle":["Adventure","Multi-sport","Group","Fully Guided","Hiking & Trekking","Holiday"],"oldPrice":0,"price":1395,"summary":"The spectacular valleys and mountains of Vietnam were simply made for exploration. Put on your hiking shoes and get ready for this immersive journey that gets away from the bright lights of Hanoi and under the skin of Vietnam's bucolic countryside. In between trekking and cycling past lush landscapes, stop in at local villages and learn about traditional life with memorable homestay experiences. It’s not all mountains and trails either, with an opportunity to kayak across the majestic waters of Lan Ha Bay and spend a night in a waterside resort. Prepare to be led off the beaten track. This trip has a number of activities to get your pulse going. Whilst prior training for each activity is not necessary, a moderate level of fitness will help you to get the most out of the included activities","highlights":["Take a tour to the Cat Cat village","Visit Ho Chi Minh Mausoleum","Walk through the streets of Hanoi","Discover Mai Chau valley","Explore spectacular Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/93183_3d0425e9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/93183_3d0425e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_ccd0e14a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_6b4444c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_6c424b6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_9e1ff887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_66562c81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_4ea62838.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_9e83ef5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_0caa257d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93183_12ca5e3a.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Cai","Mai Chau","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao. Welcome to Vietnam! Your adventure begins with a welcome meeting at 6pm. If you have time before the meeting, head out and discover Hanoi. Visit Hoan Kiem Lake and Ngoc Son Temple, start sampling the delicious street food, or visit the Museum of Ethnology and find out more about the homes and lives of Vietnam’s ethnic communities. After the welcome meeting, you may like to join your group for an optional meal at one of Hanoi's fantastic eating spots.\nAccommodation: Hotel"},{"title":"Day 2: Hiking in Sapa","description":"After breakfast climb board a private minibus to Sapa, a town in the Hoang Lien Son Mountains of northwest Vietnam. This journey will take approximately 5 hours. From the market in the centre of Sapa, venture out on a short trek (approximately 2.5 hours) through the surrounding valleys to visit a village called Cat Cat. This is home to the H’mong people, who emigrated from China 300 years ago. In the evening, settle into your hotel in Sapa for the night.\nAccommodation: Hotel"},{"title":"Day 3: Hiking in Lao Chai","description":"Savour the dramatic landscapes and panoramic views of rural Vietnam on a trek from Lao Chai to Ta Van. You'll pass by terraced farms ripe with corn and rice, over bubbling brooks and through bucolic villages. Stop for a picnic lunch before heading on to our homestay with a local family in the evening. The total trek today is around 10 kilometres (6.2 miles).\nAccommodation: Homestay"},{"title":"Day 4: Hiking in Su Pan","description":"This morning trek to Su Pan before taking some time to rest your feet on a bus ride back to Sapa. In the afternoon the group returns to Hanoi (approximately 5 hours). Maybe get a bird's eye view of the city from a rooftop bar and unwind with an iced coffee.\nAccommodation: Hotel"},{"title":"Day 5: Cycling in Hanoi","description":"Vietnam's capital is best explored on foot, which is why the group will head out on a city walking tour. See the final resting place of Vietnam's revered revolutionary at Ho Chi Minh's Mausoleum and Museum before stopping by the Temple of Literature. Although the shrine was originally built in the 11th century, and is therefore considered to be the city's oldest temple, the current structure and shrine to Confucius actually dates from the 18th century. In the afternoon, have a practice on your bike with a warm up cycling trip around Hanoi's West Lake.\nAccommodation: Hotel"},{"title":"Day 6: Cycling in Mai Chau","description":"Leave behind the Hanoi hustle first by vehicle, then jump on your bike and  and cycle to the Mai Chau valley (approximately 60km / 37mi). There are great photo opportunities along the way – stop at a vantage point to take in the view of Mai Chau, home to a variety of minority groups with their own unique culture and languages. Along the way, there's also the opportunity to help local farmers plant rice seeds into the fields. Arrive in Mai Chau and head to the village of Pom Coong, where your local guide will introduce you to your hosts for lunch, and provide information on the region's people, their lifestyles, customs and culture. Lunch is a traditional affair with examples of local cuisine on offer. This is a great opportunity to experience the local area, chat with your hosts, and gain a real insight into life in this fascinating and picturesque region. After lunch, take some time to relax before saddling up for a cycle trip to nearby villages. Back at the homestay, relax with a cold drink while watching the sun set over the peaceful mountains. Alternatively, for the food lovers, why not help your host cook dinner!\nAccommodation: Homestay"},{"title":"Day 7: Cycling in Ninh Binh","description":"After breakfast set out again on your bike on a cycle from Mai Chau to Ninh Binh, a region well known for its green valleys, karst mountains and conservation areas. Today's ride will cover approximately 70 kilometres in total.\nAccommodation: Hotel"},{"title":"Day 8: Cat Ba Island","description":"Catch a bus this morning from Ninh Binh to Hai Phong then jump on a ferry to Cat Ba Island, which sits at the southeastern edge of Halong Bay. Lan Ha Bay, where Cat Ba can be found, is part of Halong Bay with the additional attraction of numerous white-sand beaches. The total travelling time today is approximately five hours. Check in to your peaceful, hilltop accommodation and enjoy a free afternoon taking it easy in a hammock, or opt to keep the pace up with a hike or trip to the beach.\nAccommodation: Lodge"},{"title":"Day 9: Kayaking around Cat Ba Island","description":"Explore the waters and limestone karsts of Lan Ha Bay on a full-day boat trip. Get up close and personal kayaking beside the tree-clad outcrops, with lunch onboard also included. Halong Bay's World Heritage designation was extended to the Cat Ba Archipelago thanks to its similar aesthetic value, and the scenes of turquoise water and junk boats are quintessential Vietnam. No-one will judge you for taking a selfie here. Spend a second night on Cat Ba, with the evening free to visit the local restaurants and bars.\nAccommodation: Lodge"},{"title":"Day 10: Hanoi","description":"Say goodbye to Cat Ba Island and head back to Hanoi (approximately five hours). Arrive in the late afternoon, and perhaps head down to the markets for some last-minute souvenir shopping or to pay a visit to one of the city's many museums or historical sites. Both the Fine Arts Museum and Hoa Lo 'Hanoi Hilton' Prison are great choices. In the evening, perhaps head out for a farewell dinner with your group and toast the end of this active adventure.\nAccommodation: Hotel"},{"title":"Day 11: Hanoi","description":"Your active adventure comes to an end today and there are no activities planned, but there's plenty to see if you'd like to continue exploring Hanoi or further afield, including an Urban Adventure discovering Hanoi's street food by night."}]},{"name":"VIETNAM COLLECTION 1 - Vibrant Vietnam 10 Days","duration":10,"travelStyle":["In-depth Cultural","Group","Partially Guided","Moderate","Holiday"],"oldPrice":0,"price":1075,"summary":"Vietnam is a country of natural beauty, delicate and flavorful cuisine, compelling history, cultural diversity, incredible heritages. The vibrant people make Vietnam a one-of-a-kind Asian destination. This is a country of astounding natural diversity and wonders, ready to reward travelers with countless unforgettable experiences. With an intriguing history spanning back over 4,000 years, including occupations from both the Chinese and French, the country’s architecture and cuisine is a fascinating testament to cultural diversity.","highlights":["2 domestic flights","Arrival Hanoi - Capital of Vietnam","Overnight on luxury cruise in Halong Bay","Visit Hoi An ancient town by bike","Observe the hidden charm of My Son Sanctuary","Optional tour to Ba Na Hills & Golden Bridge","Cu Chi Tunnels & Saigon city tour","Cai Be Floating Market in Mekong Delta","Extend your trip with Footsteps"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fbec25e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fbec25e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc309d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc4a5da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc4cd72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc4f55b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc595ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc5c82d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc5f2c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc6bcde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc6db95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc6f7a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126992_5e1557fc713aa.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HANOI ARRIVAL","description":"Welcome to Vietnam! Upon arrival, meet our team at the airport and drive to city center, all domcument will be sent to you in this day (tour program, domestic airfare, all contacts in details). Free time for relax after a long flight. Overnight in Hanoi. \nHotel check-in time is 14:00 "},{"title":"HANOI CITY TOUR - CYCLO EXPERIENCE (B,L)","description":"Breakfast at hotel. Considered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. Meet your tour guide. Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. Visit Ho Chi Minh’s complex (outside), the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam. Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. After lunch, process to visit Temples of Literature - constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university. Leave for a legendary Hoan Kiem lake and Ngoc Son Temple. Drive back to hotel and drop off. Free time for relaxing in the evening. Overnight in Hanoi. "},{"title":"HANOI - HALONG LEGENDARY BAY (B,L,D)","description":"After breakfast at hotel, check-out hotel. From Hanoi, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994 and 2006. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending- dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming, passing floating villages and approach islets to enjoy their beauty in close distance. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat.\n***Itinerary is subject to change without prior notice"},{"title":"HALONG BAY - HANOI - BACK TO CAPITAL (B,L)","description":"In the morning, doing exercise morning on Sundeck, enjoy light breakfast with coffee, tea, seasonal fresh fruit and bread before keep going to visit Halong Bay, passing by many other rocks, Islets as well as fishing villages. Brunch (lunch) will be served on board before disembarking time. Return to Hanoi, arrive at your hotel in Hanoi in the late afternoon. Check-in hotel. Free time in the evening. Overnight in Hanoi."},{"title":"HANOI - FLY TO DANANG - HOI ANCIENT TOWN WALKING TOUR (B,L)","description":"Breakfast at hotel. Check-out and transfer to airport for fly to Danang (Central of Vietnam). Upon arrival, meet and great service at the airport with our team. Take a short drive to the riverside town of Hoi An (30-miuntes). Upon arrival, enjoy lunch at local restaurant then you will set off on a walking tour to explore this World Heritage Site. Highlights include an ancient merchant house, the Phuc Kien Assembly Hall, the 400-year-old Japanese Covered Bridge, and the vibrant riverside market. Check-in hotel and relax. Free time in the evening. Overnight in Hoi An."},{"title":"HOI AN LANTERN MAKING - FOOD TESTING - SUNSET KAYAKING (B,L)","description":"Breakfast at hotel. Depart to the home of lantern craftsman by bike. Here you will have a brief introduction into the history, shape and color of the lanterns, as well as the many stages of making them. Then you will learn how to practice hands-on through each stage of lantern making under the guidance of the enthusiastic craftsmen: from bending it into frame, cutting cloth, sticking and completing lanterns. You can make your own lantern and keep it as a souvenir. Enjoy lunch with Cao Lau, Banh Mi which are traditional cuisine in Hoi An. Relaxing at your hotel.\nSunset Kayak Tour will begin at 14:00. The tour starts up with pick up from your hotel to our kayak station in Cam Thanh. After a briefing on paddle safety and the area you will be kayaking, we’ll set off to paddle along the cocopalm forest and local villages and up to the Lantern Town. Connect with nature, immerse ourselves in life on the river and enjoy amazing landscapes as we paddle into the sunset. Trip ends after 3-hours. You’ll have time for refreshment at a local cafe near the town center before getting a transfer back to your hotel. Free time for relaxing. Overnight in Hoi An."},{"title":"FLY TO SAIGON – SAIGON BY NIGHT SCOOTER EXPERIENCE (B,D)","description":"Breakfast at hotel. Free time for relaxing until transfer to airport for fly to Saigon (Ho Chi Minh City - South of Vietnam). Upon arrival, meet and great services at the airport with Footsteps' team. Drive to city center, check-in hotel and relax.\nSaigon Food Tour – Saigon by night will begin at 17:30. We designed this 3,5 hours tour for you to enjoy a wonderful evening in Saigon. You will travel to non-tourist destinations and see the real life of local people. This four hours on the back of our own scooters will take you through districts 1, 2, 3, 4, and 10 where you will see the local’s activities in the night time. And guess what, we're gonna sample 10 different dishes during this food challenge. Overnight in Saigon."},{"title":"SAIGON CITY TOUR - CU CHI TUNNELS (B,L)","description":"Breakfast at hotel. We start this day tour by a visit to The Reunification Palace. This is one of the most important buildings in the city. Continue to Notre Dame Cathedral and The Post Office Center for the best examples of classical French colonial architecture in Saigon. War Remnants Museum, which formerly known as the Museum of American War Crimes.\n\nEnjoy lunch at local restaurant. Head to the Cu Chi tunnels - an underground tunnels network constructed by Vietnamese fighters during their struggle for independence. Arriving tunnels, a short introductory video showing how the tunnels were constructed will be given. We then spend time exploring the maze of tunnels including innumerable trap doors, storage facilities, weapons factories, field hospitals, command centers and kitchens. These tunnels consisted of many ‘moving parts’ making them a livable structure for long periods of time. We then drive back to Saigon and end the Cu Chi Tunnels tour at late afternoon. Free time in the evening for relaxing. Overnight in Saigon."},{"title":"MEKONG DELTA - COCONUT VILLAGE (B,L)","description":"Breakfast at hotel. A trip to Mekong Delta offers a glimpse into the unique and distinct agrarian life of the vibrant southern Delta region. We will enjoy a cruise along Mekong River to one of the Islands (located in the town of My Tho) where we will be entertained with traditional music while enjoying some tea sweetened with bee's honey and seasonal fresh fruites. We will then take a paddle-boat to cruise through the narrow canals of the Mekong. The paddle-boat ride provides an interesting look into local cottage industry of making coconut candies. Go around the island by rickshaw to see the life of local people before returning to Saigon. Overnight in Saigon."},{"title":"SAIGON DEPARTURE (B)","description":"Breakfast at hotel. Free time until check-out hotel. Private airport transfer before 3-hours for your departure flight. Standard Check-out time: 12:00."}]},{"name":"Vietnam Discovery","duration":15,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1175,"summary":"Trace Vietnam’s eastern coastline on this 15-day Lonely Planet Experience, tackling the country from south to north and discovering the many wonders that lie along the way. From the modern chaos of Ho Chi Minh City all the way up to old-world Hanoi, you'll experience tumultuous history, colonial charm, vibrant colours, delicious food and inspiring scenery on your adventure. Take a boat cruise along the Mekong Delta, tour the backstreets of Hoi An with a local, enjoy a rural homestay in Da Bac and explore the beautiful karsts of Lan Ha Bay.You may also want to check out our Cambodia and Vietnam Experience (TKRNC) if you have longer time to explore in the region. https://www.intrepidtravel.com/vietnam/cambodia-vietnam-experience-126711 You may also want to check out our Cambodia and Vietnam Experience (TKRNC) if you have longer time to explore in the region. https://www.intrepidtravel.com/vietnam/cambodia-vietnam-experience-126711","highlights":["Shop for lanters in Hoi An","Visit ancient pagodas and cathedrals","Explore the Forbidden Purple City","Cruise around Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1846_e672c501.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1846_e672c501.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_fa1bfffc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_e7f0210d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_a5f2ec28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_de22bf34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_2516373c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_25923ca7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_d5d1590f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_076ce7e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_30db52fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_254fdf12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_6f422273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_14952553.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_32c5ba24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_cfe0aa86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_2645767a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_6b944e6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_335f67fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_9a540682.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1846_ebe41c81.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Ho Chi Minh City, Vietnam. Your adventure begins with a welcome meeting at 6 pm today. As you won’t be spending much time in Ho Chi Minh City, we recommend arriving a few days early to see more of this fascinating city. See the ancient pagodas and cathedrals near the former Presidential Palace, historic Dong Khoi Street, and the chaotic markets of Ben Thanh and Cholon (Chinatown). Better yet, consider taking a day trip such as Urban Adventure’s Cu Chi Experience. See urbanadventures.com/destination/ho-chi-minh-city-tours for more information on the range of Ho Chi Minh City day tours.\nAccommodation: Hotel"},{"title":"Day 2: Mekong Delta","description":"This morning, head away from the city and make your way to the province of Ben Tre, where you’ll get on a boat to tour the canals of the Mekong Delta. This fertile area is famous for its abundance of fruit, flower and rice crops, and is known as the ‘rice bowl’ of Vietnam. During your boat ride you’ll visit some cottage industries along the river before heading to your guesthouse. Staying in simple local accommodation close to the delta, hosted by a Vietnamese family, will be one of the highlights of your trip, giving you a taste of community life as well as the chance to enjoy a traditional home-cooked meal.\nAccommodation: Homestay"},{"title":"Day 3: Mekong Delta – Ho Chi Minh City – Overnight Train","description":"Rise early to the sounds of the river coming alive, and enjoy a simple breakfast before boarding the boat back down the delta and catching a bus back to Ho Chi Minh City. Enjoy some free time in Ho Chi Minh City this afternoon, perhaps with a visit to the War Remnants Museum or Reunification Palace. If you haven’t already, head to Ben Thanh Market for some delicious street food, colourful shopping and even more colourful characters. This evening, board an overnight train bound for Danang. Trains are a common form of transport for the Vietnamese, so sit back and relax into this local experience.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hoi An","description":"Arrive in Danang by train and travel by minibus for approximately 1 hour to Hoi An. Hoi An was recently declared a World Heritage town and is being beautifully restored. It was a major trading port with the West from the 17th century. Today, parts of Hoi An look exactly as they did more than a century ago. Your leader will take you on a sightseeing walk through the Old Town and visit some of the city's major attractions. A sightseeing pass is included in your tour so you can visit a selection of the major sights. Hoi An is also a shopping mecca, so head down to the markets and street stalls to browse paintings, woodwork, ceramics and lanterns. It’s also famous for its tailors who can make beautiful items to order, and with almost three full days here you have the chance to have some unique pieces whipped up.\nAccommodation: Hotel"},{"title":"Day 5: Hoi An","description":"Wake up for a free morning to do as you please. It’s a great opportunity to take a trip out to the My Son temples – a World Heritage-listed site constructed between the 4th and 14th centuries that reflects the rich cultural traditions of the Cham civilisation. In the afternoon, swap walking for cycling with a bike ride through the countryside near Hoi An. There's no better way to explore the peaceful area than on two wheels. You’ll see places few tourists get the chance to see among the green rice paddies and small creeks, which will give you a true insight into rural life in Vietnam.\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"You’ve got another day to explore this historic haven. Perhaps book in your final tailoring fitting this morning to make sure the threads you’re getting made fit like a glove, or hire a bike for a lazy ride out to the South China Sea to relax on An Bang or Cua Dai beach. Hoi An is also known for its great food, so you could book yourself in for a cooking class to take some culinary secrets away with you. Most tours include a trip to the local food markets, and some take you on a short boat journey along the Thu Bon River. Let your local leader know what you're into and they will be able to recommend some activities to suit.\nAccommodation: Hotel"},{"title":"Day 7: Hue","description":"Bid farewell to Hoi An this morning and make your way to Hue. The drive in a private vehicle will take around 5 hours. You’ll be travelling on the incredible Hai Van Pass, through lush mountains and past scenic lookouts, and there’ll be some good places for a photo stop. Once in Hue, you’ll have a free afternoon to explore. Hue was once Vietnam’s imperial capital and has a curious mix of bustling streets and tranquil enclaves. Perhaps visit the Dong Ba Market, which sells everything imaginable and is a great place to spend some time. It’s important to know that Hue is renowned for its cuisine, with some delicious dishes originating from this region, including bun bo hue (Hue’s delicious take on pho), and banh khoai (a filled turmeric crepe). Time to give your tastebuds a workout.\nAccommodation: Hotel"},{"title":"Day 8: Hue – Overnight Train","description":"Enjoy a free day in Hue. Perhaps visit the Imperial Citadel which includes the Forbidden Purple City that was almost totally destroyed during the Vietnam War. The gaping holes left by bombs give you an idea of how much destruction occurred in this country. Another optional activity is a dragon boat cruise along the Perfume River and then a visit to Thien Mu Pagoda – the unofficial symbol of Hue. Here you’ll see an active Buddhist monastery dating back to 1601 and a car belonging to the monk who tragically set himself alight in public to protest against the treatment of Buddhists. You may also like to visit one of the royal tombs, that of Emperor Tu Duc, with its central lake set amid a grove of frangipani and pine trees. This evening, take another overnight train bound for Hanoi. The journey will take approximately 12 hours.\nAccommodation: Overnight sleeper train"},{"title":"Day 9: Hanoi","description":"Arrive in Hanoi at about 5 am and transfer to your hotel. Once you’ve dropped off your bags and freshened up, embark on a walking tour of Vietnam’s charming capital. Explore the 36 streets of Hanoi’s Old Quarter – locally known as this because of each street originally selling a specific type of product. Continue on to the Dong Xuan Market and Hoan Kiem Lake, making sure you check out the unique architecture along the way. Hanoi has a French provincial feel left over from colonial times, but it also has a Buddhist influence and striking modern buildings. The rest of the day is yours to explore Hanoi as you please. In the evening, why not get your group together and head out to a bustling night market for some local fare. Sitting on plastic stools and eating on the roadside is a rite of passage in Vietnam.\nAccommodation: Hotel"},{"title":"Day 10: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung Village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantations are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (approximately two kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so make sure you’ve packed suitable footwear for this activity. After a local handicraft workshop, return to your homestay accommodation for a nice hot shower and a delicious dinner.\nAccommodation: Homestay"},{"title":"Day 11: Hanoi","description":"This morning, take the opportunity to encounter more of the Vietnamese highlands on a ten-kilometre (6.2 mi) trek from Sung Village to Da Bia. The first eight kilometres of the trek is on mostly flat ground along well-worn buffalo tracks. The final two kilometres gradually incline and for a period of approximately 300 metres there are some steps to climb, but the walk will be at a steady and relaxed pace. Keep an eye out for the monumental stone at the peak of Da Bia Mountain during the hike while you walk through local villages, meeting people from the ethnic Muong tribe. Stop for lunch at Da Bia before enjoying a scenic 1.5-hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours), arriving at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter?\nAccommodation: Hotel"},{"title":"Day 12: Cat Ba Island","description":"Get up early for the 7.30 am bus, stop for a quick break, then jump on the ferry. This morning of travel will deliver you to beautiful Cat Ba Island before midday. There's no time to waste, so begin exploring the stunning waters of Lan Ha Bay around Cat Ba. Located in the greater Halong Bay area, Lan Ha Bay is one of Vietnam’s most scenic places, where limestone islands and caves rise from the emerald waters. You’ll have a free afternoon to explore at your own pace, so perhaps get active on a hike, or just enjoy a dip at one of the beaches. Have a relaxing evening on Cat Ba Island.\nAccommodation: Hotel"},{"title":"Day 13: Cat Ba Island","description":"This morning, head out on the water from Cat Ba and continue exploring the limestone karst scenery. Take a boat around Lan Ha Bay with an included lunch while you cruise, then get up close and personal with this striking landscape by kayak. There’s the option to have a net on the side of your kayak and help out the locals’ clean-up efforts. This initiative hopes to eliminate the rising amounts of plastic waste in the bay. Lan Ha and Halong Bay are on many travellers' bucket lists, and with two days in the area you’ll get to tick them off yours.\nAccommodation: Hotel"},{"title":"Day 14: Hanoi","description":"Rise and shine! Perhaps start your morning with a refreshing swim or a Vietnamese coffee (or both). Make sure you soak up as much sun and sand as possible, because this afternoon it's back to Hanoi by ferry and bus. Tonight you may want to head out for an optional dinner with your fellow travellers, sharing some memories and laughs over a local meal and beer.\nAccommodation: Hotel"},{"title":"Day 15: Hanoi","description":"There are no activities planned for today and you’re able to depart the accommodation at any time after check-out. With so much to see and do in Hanoi, we recommend that you spend an extra day or two here, and we’ll be happy to organise additional accommodation (subject to availability). Urban Adventures has some great experiences in and around Hanoi, including Citadels, Karsts & Cycle, which is a great activity visiting the ancient citadel of Hoa Lu and taking a rowboat through the magnificent caves of Trang An. Head to urbanadventures.com/destination/hanoi-tours for more information."}]},{"name":"Vietnam Essential Tour","duration":8,"travelStyle":["In-depth Cultural","Adventure","Family","Private","Fully Guided","Holiday"],"oldPrice":0,"price":780,"summary":"This tour cover most highlight in Vietnam. Start at Ho Chi Minh City, discover the Mekong Delta. Flight to Da Nang - the most beautiful beach in Vietnam, strolling in the acient town of Hoi An. Then take another short flight to Hanoi - The capital of Vietnam. Treat yourself to a perfect getaway to the legendary karst-dotted seascape of Halong Bay – one of the New 7 Wonders of Nature with its serene emerald water.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146398_0d041466.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146398_0d041466.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_8bf8f305.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_bed54ab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_d22f6726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_a82bd3e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_5d77db07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_45fb8fa6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_e7bc5687.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_4dba47f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_a2a33411.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_d9eb7020.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_07a42f86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_624eef77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_3b0b9ca5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_77a56bfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_e1bde0ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_186a1ec9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_a6659e28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_3db6aa2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_a4e41787.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_4adb2029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_a563cbbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_d7b31831.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146398_97993f22.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 Arrival in Ho Chi Minh City","description":"Meal: NA– Accommodation: Hotel in Saigon\nYour guide will greet you at the airport outside the baggage-claim area and then take you to the pre-booked hotel. The rest of the day will be left on your own."},{"title":"Day 2 Ho Chi Minh City - My Tho - Ben Tre","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Ho Chi Minh City\nEnjoy the scenic journey along the National Highway bordered by green rice fields.\nOn arrived at My Tho, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by locals.\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village."},{"title":"Day 3: Ho Chi Minh City – Cu Chi Tunnel– City Tour – Flight to Da Nang","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Saigon\nAfter breakfast, proceed to the Cu Chi Tunnels – comprising more than 200 km of underground tunnels and standing as a witness to the searing memories of the Vietnam War. The main axis system branches out to underground hideouts, bomb shelters, and entrances to other tunnels. Its underground system is comprised of numerous trap doors, living areas, sleeping chambers with bamboo beds, storage facilities, weapon factories, field hospitals, command centers, and kitchens. Nowadays, the remaining parts have become a major tourist attraction, giving its visitors a unique experience and a taste of what underground life was like during the Vietnam War.\nGo back to the city center to have lunch before engaging in a short sightseeing tour around the city with en route visits to the War Remnants Museum, Notre Dame Cathedral, the Old Post Office, and the People’s Committee Hall.\nYou will be transferred to the airport for your flight to Danang. Our guide and driver will wait for you at the airport to take you to Hoi An. Overnight in Hoi An."},{"title":"Day 4: Hoian – My Son","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Hoi An.\nLeave your hotel for My Son Sanctuary, also known as “the Angkor Wat of Vietnam” – a cultural heritage recognized by UNESCO in 1999 located about 50km southwest of Hoi An. The majestic capital of the once-thriving Champa Kingdom with more than 65 architectural works in Hindu style devoted to the god Shiva, unfortunately, is now a cluster of ruins due to age and bombing, standing as a witness to the glorious bygone era.\nDrive back to Hoi An for Lunch.\nIn the afternoon, you will take a half-day walking tour through the narrow winding alleyways visiting some well-preserved historical sites such as Chua Ong Pagoda, Chinese Assembly Halls, the 200- year old Tam Ky ancestral house, and the Japanese Bridge. After that, there will be free time for you to shop or relax. You will stay overnight in Hoi An. At the end of the day, you will embark on a pleasant boat ride to admire the ancient town under the setting sun."},{"title":"Day 5: Hoi An – Da Nang – Fly to Hanoi.","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Hanoi\nThis morning, head over to the airport to catch a short flight to Hanoi – the centuries-old capital of Vietnam. Upon arrival, you will be transferred to your hotel in the city center.\n\nYou will spend time to discover the city with Ho Chi Minh Complex, Temple of Literature and Old Quarter. Spend the night in Hanoi."},{"title":"Day 6: Hanoi – Ha Long Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: On Cruise\nPrescribed as one of the World Heritage Site in 1994, Halong Bay is an essential destination in almost any Vietnam travel packages. After getting picked up from your hotel, you will be transferred by Limousine shuttle bus to Ha Long Bay at 12:00. Upon arrival in Ha Long Bay, you will be welcomed aboard and enjoy lunch while weaving through a myriad of islands and islets towering over and reflected off the emerald waters of Halong Bay. After lunch, take a short trek to a nearby summit for an aerial view of the bay peppered with golden sails, and then proceed to a quiet beach for some swimming or kayaking, or just simply go back to the ship and sunbathe on the sundeck, whatever tickles your fancy.\nLater in the afternoon, pay a visit to a tranquil fishing village to interact with fishermen who have inhabited the bay for almost three generations. Go back on board and enjoy a drink on the sun deck while can enjoy drinks while basking in the glorious sunset. Enjoy dinner and stay overnight on the junk."},{"title":"Day 7: Ha Long Bay- Hanoi","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Hanoi\nKickstart your day with an early Tai Chi Session on the sundeck and you will be rewarded with an unparalleled visual glory of the sun peeking above the watery horizon. After breakfast, you will visit an enigmatic limestone grotto and then go back to the ship for a final glimpse of Ha Long Bay’s fine spectacle as you cruise back to the dock. Check out as the ship arrives at the harbour by noon and drive back to Hanoi. The rest of the day is left on your arrangement. Stay overnight in the city center."},{"title":"Day 8: Hanoi – Departure","description":"After breakfast, you will be transferred to the airport to catch the flight for your next destination. Your memorable tour ends here.\n\n"}]},{"name":"Vietnam Express Southbound - For Solo Travellers","duration":10,"travelStyle":["Discovery","Adventure","Group","Fully Guided"],"oldPrice":0,"price":1285,"summary":"Capture the spirit of magical Vietnam on this compact tour from the colonial charm of Hanoi to the hustle and bustle of Ho Chi Minh City, on this new adventure, designed for solo travellers only. Sip coffee with locals in Hanoi and shop up a storm in the Old Quarter, cruise along emerald waters on a Halong Bay boat trip, travel through old-world Hue and Hoi An, and get lost in the hustle and bustle of Ho Chi Minh City. This is an adventure full of beauty and contrast that introduces Vietnam as a country of incredible food, lively locals, stunning scenery and cosmopolitan cities.This trip is for solo travellers only. If you're planning an adventure with a friend, family member or partner, we've got heaps of other trips you can travel on! If you're planning to travel on your own, with a group of other solo travellers, this trip might be just what you're looking for","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/99774_f4958899.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/99774_f4958899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_dd3f6a5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_6427df41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_3070e50b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f2abfb2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_7875367a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_d57bd734.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_64197a85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_e8fe3af0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_5cb1cdde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_c743acb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_1c55ee92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_090f7179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_a128cfdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_504778a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f65e7d5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_04ebed0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_f26da9ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_671b2fbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_36838504.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_3d14e573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_d187c25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99774_835bbfdd.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm and is followed by a group dinner at KOTO restaurant. This organisation is dedicated to developing the hospitality careers of disadvantaged youth.\n\nIf you arrive early into the capital of Hanoi, there’s plenty to see and do. Consider booking the Hanoi Highlights Urban Adventure with an expert local guide to introduce you to the city. Start by visiting the Temple of Literature, drop into a traditional tea house, and learn the stories of the Hoa Lo Prison museum. This tour concludes at Hoan Kiem Lake, surrounded by modern office buildings and ancient Buddhist temples. Or take it at your own pace and wander the Old Quarter and admire the city’s French-colonial architecture, relax in a park, or enjoy some street food.\nAccommodation: Hotel"},{"title":"Day 2: Halong Bay","description":"Travel by private minibus to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours). The bay is dotted with sandy coves, grottos and 1,600 limestone islands, which have been formed over millennia by wind and water erosion. Board a private boat and cruise the bay, exploring Surprise Cave and perhaps even take up the opportunity to kayak. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. To end the day, spend a night aboard the boat beneath the night sky. Your wooden junk-style boat has twin share cabins with air-conditioning and private facilities. There's also a dining room and bar to enjoy lunch, dinner and breakfast.\nAccommodation: Overnight boat"},{"title":"Day 3: Hanoi - Overnight Train","description":"Return by boat to Ha Long, and at approximately midday travel by bus back to Hanoi. Arrive late this afternoon, and use free time to shop, explore the sights or just relax. Later tonight board an overnight train to Hue.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hue","description":"Arrive into Hue at approximately 11 am and transfer to the hotel. Once the imperial capital of Vietnam, Hue holds the treasures of the country’s royal past. You’ll have free time in the morning to rest or explore. The bustling Dong Ba Market is a great place to sample some of the foods that once graced the Nguyen emperors' tables, such as banh khoai (royal rice cake). Reunite with the group to visit the war-damaged ruins of the Hue Imperial Citadel complex, which once contained temples, state houses and the emperor’s palace.\nAccommodation: Hotel"},{"title":"Day 5: Hue","description":"Today, tour the sights of Hue on the back of a motorbike driven by a local guide. Enjoy a stop at Thanh Toan to see the 18th century covered bridge and villagers shopping at their local market. Visit the 17th-century active Buddhist monastery of Thien Mu Pagoda. During the visit you’ll see the car of a former monk who drove to Saigon in 1963 to set himself alight to protest the poor treatment of Buddhists by the South Vietnamese regime. Enjoy a delicious vegetarian lunch inside a nunnery. Finally, visit the lakeside royal tomb of Emperor Tu Duc before heading back to Hue.\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"This morning travel by bus through coastal rice paddies and the spectacular Hai Van Pass (approximately 3 hours). After a photo stop en route, arrive into Hoi An. Recently declared a World Heritage site, Hoi An was a major international trading port during the 17th, 18th and 19th centuries. Today, parts of the beautifully preserved town retain the feel of centuries past. It's also a shopping mecca, famous for its plethora of tailors. On arrival your leader will take you on a sightseeing walk through the Old Town to visit a handful of the city's major attractions. You’ll also be given a sightseeing pass so you can further explore select attractions at your leisure.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An","description":"Today is a free day to explore Hoi An. Browse the town’s cobbled streets and art galleries, or hire a bike and cycle through rice paddies out to Cua Dai Beach. Shop for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shophouses. Perhaps visit one of the hundreds of tailors in the city to get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class.\nAccommodation: Hotel"},{"title":"Day 8: Ho Chi Minh City","description":"Today take a short early morning flight to Ho Chi Minh City (approximatley 1 hour 30 mins). Formerly known as Saigon, Ho Chi Minh City has a fascinating history and is arguably Vietnam’s capital of commerce and culture. After landing, take a sightseeing bus tour around the city. Pass the Reunification Palace, Notre Dame Cathedral and the Opera House, stopping in at the War Remnants Museum to discover some of the sobering stories of the Vietnam/American War.\nAccommodation: Hotel"},{"title":"Day 9: Mekong Delta/Ho Chi Minh City","description":"This morning head out on a day trip to explore the Mekong Delta. Board a private boat to Ben Tre to visit the coconut gardens, stopping at a local home to sample tropical fruits & coconut jams. Afterwards, paddle in sampans (small rowing boats) past water coconut trees along the Mekong. Take a tuk-tuk tour around the villages, learning about local rural life and how they make their living making coconut products like brooms and coconut fibre mats. Eat lunch at a restaurant in the heart of the Delta, sampling regional specialties such as the famous elephant ear fish. Then it’s back to the boat to cruise the delta’s major waterways to Ben Tre boat pier. After the cruise return via bus to Ho Chi Minh City and perhaps head out to sample some local specialties as a final farewell with your fellow travellers.\nAccommodation: Hotel"},{"title":"Day 10: Ho Chi Minh City","description":"There are no activities included and you’re free to depart your accommodation at any time. If you would like to spend some more time in Ho Chi Minh City, we’re happy to organise additional accommodation (subject to availability). The Cu Chi Tunnels are an interesting day trip nearby, ask your group leader for more recommendations or assistance to book an Urban Adventure."}]},{"name":"Classic Vietnam","duration":15,"travelStyle":["In-depth Cultural","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":2235,"summary":"From south to north, Vietnam is a kaleidoscope of colourful characters, varied cuisine and diverse landscapes. Unlock the mysteries of the Viet Minh in Ho Chi Minh City, explore the beautiful lakes and boulevards of Hanoi, meet the locals as guests at a local Mekong Delta guesthouse, and eat breakfast the local way in Hue. Experience historical temples, laze on the spectacular coastline, gorge on delicious banquets and explore lively cities – all with a touch of comfort – on this 15-day Classic Vietnam adventure. No way? Yes Hue.We cover a lot of distance on this trip, including on overnight trains. Accommodation and amenities are shared and basic, but the experience of rubbing shoulders with the locals makes it all worthwhile.","highlights":["Admire the picturesque landscapes of Vietnam","Learn about the mysteries of the Viet Minh in Ho Chi Minh City","Explore the beautiful lakes of Hanoi","Do a homestay in Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6322644b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6322644b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6323c6c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6323f20a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc63241879.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc63243d05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc632467ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6324a22b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6324c73f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6324ec69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc63251097.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc632535e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc632559c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc63257e39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5e1bc6325a3ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_89d5ff0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_34bf3a53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_5f4a4331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1843_21220e71.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Ho Chi Minh City – a French-infused city with a dynamic atmosphere. If you arrive early, perhaps head to Pham Ngu Lao Street to see the local open-air market or visit Vinh Nghiem Pagoda. Your adventure begins with a welcome meeting at 6 pm where you will meet your tour leader and fellow travellers. Afterwards, enjoy a welcome dinner with your group at one of the city's excellent eateries.\nAccommodation: Hotel"},{"title":"Day 2: Mekong Delta","description":"Travel south by private bus for about three hours to Ben Tre. When you arrive, you’ll board a boat and explore the intricate waterways of the Mekong Delta. The delta is known as ‘Vietnam’s rice bowl’ for its abundance of rice paddies, fruit and flower orchards. During the boat trip, you’ll stop to sample some of the fresh tropical fruit and visit some cottage industries in the area. Around sunset, make your way to your local guesthouse to spend a night with the locals and enjoy a wonderful meal of regional specialties.\nAccommodation: Guesthouse"},{"title":"Day 3: Ho Chi Minh City","description":"Return to Ho Chi Minh City and take a walking tour in town. Experience the hustle and bustle of former Saigon and explore some of the city's more interesting sights such as the Notre Dame Cathedral, the grand post office and War Remnants Museum. In your free time, perhaps visit Reunification Palace or book in to see a cultural show at the Saigon Opera House. Otherwise, go in search for the best food with some of your fellow travellers – your group leader will know where to go for meals of any budget.\nAccommodation: Hotel"},{"title":"Day 4: Phan Rang","description":"Make a day trip to the renowned Cu Chi Tunnels. This former Viet Cong stronghold provides an insight into the resourcefulness and tenacity of the Vietnamese people, and offers a glimpse of what life was like during the war. Your group leader can recommend somewhere local if you'd like a final taste of southern Vietnamese cuisine, before you head for Phan Rang. First, take an afternoon flight to Cam Ranh, and from there, travel 1.5 hours by minibus to the historic city of Phan Rang – your base for the next two days.\nAccommodation: Hotel"},{"title":"Day 5: Phan Rang","description":"Today, take a day trip to Vinh Hy Bay, a beautiful, crescent-shaped harbour between Phan Rang and Nha Trang. On your way to the bay, you’ll stop at the Bau Nai fish market for a glimpse of the bustle of activity as fish are unloaded and locals hurriedly shop for the best deal. Continue through the Vietnamese countryside to the sprawling salt flats – truly a sight to behold. Witness workers raking and collecting salt that has evaporated from the salty waters of Vietnam’s coast, which has been funnelled inland into shallow fields. Next, visit another place of great natural beauty – the moss-covered rock formations and fossilised coral reefs of Hang Rai. Finally, arrive at Vinh Hy Bay, where you’ll have plenty of time to swim and snorkel in its warm, coral-filled waters.\nAccommodation: Hotel"},{"title":"Day 6: Phan Rang/Overnight Train","description":"Enjoy a free day at your own pace in Phan Rang. Perhaps use this time to see some of the grand remnants of the Cham dynasty – an ancient kingdom that had control of the central and southern coastal region of Vietnam from the second to the 17th-century scattered throughout the region. You may like to take an optional visit to the nearby Po Nagar Cham Towers – an archaeological site from the middle ages dedicated to the indigenous goddess, Yan Po Nagar. Alternatively, gain an insight into an ancient tradition with a visit to the oldest pottery village in South East Asia, Bau Truc. This evening, board an overnight train to Da Nang. Conditions are basic on these trains and hygiene standards may be lower than what you’re used to at home, however overnight trains are the best way to brush shoulders with the locals and make the best use of your time.\nAccommodation: Overnight Train"},{"title":"Day 7: Hoi An","description":"Arrive early into Da Nang, then travel by minibus for 1 hour to Hoi An. Upon arrival, your leader will take you on an orientation walk around the World Heritage-listed Old Town. The city was a major trading port with the west during the 16th and 17th-centuries, and has various architectural influences from Europe, China and Japan. Today, the city is being restored and looks exactly like it did over a century ago. You'll see Chinese temples, Japanese pagodas, French-colonial houses, wooden shop-houses and old canals during your walk. After lunch, enjoy free time to participate in optional activities or simply soak up the ambience of the place. You may like to wander Hoi An Market and the street stalls selling paintings, woodwork, ceramics, lanterns and much more. The town is also famous for its talented tailors who can make beautiful items to order within hours.\nAccommodation: Hotel"},{"title":"Day 8: Hoi An","description":"Enjoy a free day to further explore Hoi An and its majestic surrounds. Perhaps rent a bicycle and take a trip out to the nearby Cua Dai Beach. Better yet, why not book into an Urban Adventure, like Hoi An Boat & Bike, which offers a guided tour of the area, including a countryside bike ride and a sunset cruise along the Thu Bon River. Vietnam is, of course, known for its delicious food, and Hoi An is no exception. Unlock the flavours of Hoi An's vibrant Old Town on Hoi An Food Adventure. See urbanadventures.com/destination/Hoi-An-tours for more information. Your leader can help arrange optional activities and tours if this interests you.\nAccommodation: Hotel"},{"title":"Day 9: Hoi An","description":"Spend another day as you please in this historic haven. If you can muster an early rise this morning, head to the local produce market to watch animated shoppers haggling over fresh fish, spices and vegetables. Otherwise, if you’d like, your leader can help you arrange an optional Vietnamese cooking class, or a visit to the ruins of My Son – Vietnam's most important Cham site. Set in a verdant valley, surrounded by hills and overlooked by the massive Cat's Tooth Mountain, the elaborate World Heritage-listed temples here reflect the rich cultural traditions of the Cham civilisation that flourished in this region between the fourth and 12th-century.\nAccommodation: Hotel"},{"title":"Day 10: Hue","description":"Continue on your journey north today and drive over the spectacular Hai Van Pass – an incredibly scenic and mountainous stretch of highway with views of Lang Co Beach. Make a stop at beautiful Lang Co to buy yourself some lunch. Travel time is approximately 5-6 hours, including stops. In the afternoon, you’ll arrive in Hue – Vietnam’s former Imperial capital. Here you’ll visit the Imperial Citadel and the Forbidden Purple City which was almost entirely destroyed by bomb blasts during the war.\nAccommodation: Hotel"},{"title":"Day 11: Hue","description":"After a local breakfast of bun bo hue – a spiced beef noodle soup – take in all the historical highlights of Hue. You’ll stop off at the Thien Mu Pagoda and get the chance to see an active Buddhist monastery dating back to 1601. One of the most poignant displays is a car belonging to a former monk who set himself alight to protest against the treatment of Buddhists. Break up your sightseeing with a dragon boat cruise on the Perfume River. Lunch today will be a delicious vegetarian feast at a nunnery. You’ll also visit one of the royal tombs, that of Emperor Tu Duc, with its lake, frangipani and pine trees. There’s nothing like a culture and history lesson to get you hungry, so be sure to keep snacking on some of Hue’s favourites – it’s not known as Vietnam’s culinary capital for nothing.\nAccommodation: Hotel"},{"title":"Day 12: Hanoi","description":"Fly from Hue to Vietnam’s charming capital of Hanoi. Upon arrival, enjoy a delicious lunch at KOTO restaurant – an Intrepid Foundation supported program that teaches disadvantaged youth hospitality skills. After lunch, take a half-day tour of Hanoi that captures the beauty and the history of the laidback, tree-lined capital. You’ll visit major sights including the Temple of Literature and One Pillar Pagoda. You’ll also pass by Hoan Kiem Lake and enter the ’36 Streets’ of the historic Old Quarter – a series of interwoven lanes and roads that historically sell a certain product in each street. Silk, bamboo, ceramics, kitchen products – and upwards of 32 more! Today, the group will also enjoy a unique water-puppet performance hosted by a local family, who are experts in this art form.\nAccommodation: Hotel"},{"title":"Day 13: Halong Bay","description":"Travel by private minibus for approximately 4 hours to the spectacular World Heritage-listed site of Halong Bay. This is one of Vietnam’s most beautiful places – a bay of emerald waters flecked with sandstone islands and caves. Here you’ll go on a cruise to explore Surprise Cave and surrounding rock formations, and in the warmer months perhaps go kayaking or opt for a swim from Ti Top Island. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. You’ll spend the night on a traditional cruising boat. The sailing junk has twin-share cabins with air-conditioning and private facilities. There's also a dining room and bar where you’ll enjoy all of your meals, including fresh seafood for lunch and dinner.\nAccommodation: Overnight boat"},{"title":"Day 14: Hanoi","description":"Take the 4-hour drive back to Hanoi. Along the way, you’ll stop at Dong Trieu Factory to watch locals creating ceramic art pieces. If you have some free time this afternoon, you may like to visit the Vietnam Fine Arts Museum in the city. This museum plays a crucial role in maintaining and promoting the cultural heritage of Vietnam’s ethnic communities. Tonight, gather together as a group with your leader and enjoy dinner together – a perfect time to reminisce on the highlights of your Vietnam adventure.\nAccommodation: Hotel"},{"title":"Day 15: Hanoi","description":"With no activities planned for today, you are free to leave any time after breakfast, provided you comply with the hotel’s internal check-out times. That doesn’t mean your adventure has to end! If you would like to spend some more time in Hanoi, we’ll be happy to organise some additional accommodation for you (subject to availability)."}]},{"name":"Vietnam Real Food Adventure","duration":12,"travelStyle":["Food & Culinary","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":1950,"summary":"Chop, slice and eat your way through Vietnam, experiencing one of the freshest and most fragrant cuisines on the planet. From pho and ancient buildings in Hanoi, banh khoai and imperial citadels in Hue, banh xeo and lantern-lit streets in Hoi An and banh canh and pulsating markets in Ho Chi Minh City, experience Vietnam’s cuisine and its tightly woven place within the culture. Drink in cafes and beer halls that sprawl out over city streets, buy fruit from wicker baskets draped over a vendor’s shoulders and sit at market stalls as aromatic noodle soups are whipped up in front of you. Experience all of Vietnam’s iconic sights, spend time cooking some of the country’s top dishes and get a true taste of Vietnam on this delectable Real Food Adventure.This trip aims to give you an exciting, diverse and well-rounded experience of a country’s cuisine. While we endeavour to cater for specific dietary requirements, some meals and food activities are set in advance and may be difficult to adjust. In many countries, dietary restrictions are not common or well understood. If you have dietary requirements, please advise your agent at time of booking to receive information on how this may impact on your ability to take part in included activities and meals. Come with an open mind and open mouth, and you won’t be disappointed.","highlights":["Learn about the Vietnamese cuisine","Enjoy a bicycle tour of herb gardens","Tour the floating markets by boat","Experience unique cooking classes"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/50979_4a846963.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/50979_4a846963.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_c7fac891.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_36841daa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_afe81a5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_2337f2b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_fa824da5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_c91f49e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_8e78d3ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_96d97691.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_b2fef007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_aa7d6204.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_6ae7911d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_10e0c2a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_718977b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_44573c87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50979_549f0fb6.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure begins with an important welcome meeting at 6 pm. After your briefing, head out for your first introduction to Vietnam’s lively culinary scene. Stop at a family-owned restaurant and  savour a bowl of noodles with an unexpected secret ingredient! After dinner enjoy a bia hoi. This foamy, light beer is made fresh each day and served in basic, open-walled ‘brew halls’. Pull up a chair and sip your tasty brew.\nAccommodation: Hotel"},{"title":"Day 2: Hanoi","description":"Start the day with a traditional breakfast of pho – a dish that originates in Hanoi – designed to awaken the senses and prepare you for the day. Join your leader on a city tour and tuck into some of Hanoi's renowned street food specialties before heading to a hidden tea house, learning about Vietnamese tea traditions from a true master. Afterwards, visit a local Xo community where an expert winemaker will lead a tasting of local Vietnamese varieties. You’ll walk down alleyways lined with French colonial architecture, passing by artist collectives, pottery workshops and back-alley fashion houses – you’re in the true heart of Hanoi now. Once arrived, head down into the basement of a 100-year-old French villa and into the world of Xo Liquid – an alcohol made of rice wine. Your expert wine maker will take you through his story and explain to you the process of making this traditional product – the knowledge and care for his craft is infectious. After your special wine experience, visit a traditional Vietnamese house, where you’ll be greeted by a local family and enjoy a meal which showcases fresh produce and regional vegetarian cuisine.\nAccommodation: Hotel"},{"title":"Day 3: Halong Bay","description":"Travel by private vehicle to the spectacular World Heritage-listed site of Halong Bay (approximately 4 hours). Set sail on emerald-green waters, gliding between limestone karsts and soaking in the old-world tranquillity. Halong Bay is a secluded harbour with 2000 limestone islands rising from the turquoise waters of Bac Bo Gulf. It spans an area of about 1500 square kilometres and is dotted with beaches and grottos created over thousands of years by waves and wind. Visit one of the lesser known caves, then return to your vessel late in the afternoon and enjoy a delicious feast prepared by an onboard chef.\nAccommodation: Overnight boat"},{"title":"Day 4: Overnight train","description":"Take a bus back to Hanoi (approximately 3.5 hours), then board an overnight train bound for Hue (approximately 12 hours). Although conditions are basic, overnight trains are a rewarding experience. It's an efficient way to travel long distances and a great way to get a sense of the country. Most trains have a dining carriage serving simple food, but some travellers take an opportunity beforehand to stock up on fresh bread, cheese and fruit prior to departure.\nAccommodation: Overnight sleeper train"},{"title":"Day 5: Hue","description":"Hue is Vietnam’s former royal capital and its cuisine is considered by many Vietnamese as the best in the country. The food is influenced by its imperial heritage (small dishes and a focus on aesthetic presentation) and its strong Buddhist heritage, reflected in the high proportion of vegetarian restaurants in the area. On arrival (approximately 8:30am), enjoy a classic breakfast of bun bo Hue – a popular Vietnamese soup containing rice vermicelli (bun) and beef (bo). After leaving your luggage at your hotel, embark on a tour of the city’s imperial monuments on the back of a motorbike! Stop past Thien Mu Pagoda, an active Buddhist monastery since 1601. Here you'll see a car that belonged to one of the self-immolating monks of the 1963 protests. A dragon boat cruise on the Perfume River (approximately 40 minutes) will be followed by a special lunch stop for a vegetarian Buddhist meal at a pagoda, finishing with a visit to the royal tomb of Emperor Tu Duc. The evening is free for your own food adventure. Perhaps ask your leader for the best place to try imperial street specialties like banh hue (rice flour cakes stuffed with shrimp, pork and spices).\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"Start your day with a visit to the Imperial Citadel, which includes the Forbidden Purple City. The latter was almost totally destroyed during the Vietnam War's Tet Offensive, but the foliage-covered ruins are still atmospheric, and the gaping holes left by bombs give an idea of the destruction wreaked upon the country during the war. Head south by bus through coastal rice paddies and traverse the mountainous Hai Van Pass, stopping en route to see the traditional preparation of My Quang – a Vietnamese noodle dish originating from the Quang Nam Province. The local expert will show you how it is made, then enjoy a tasting with your group. Afterwards, continue to Hoi An (approximately 4 hours, with your lunch stop). This beautifully restored city retains the feel of centuries past, making it the sort of place that grows on you the more you explore it. Take the chance to indulge in some shopping and perhaps have some clothes tailored. There's a great array of original paintings, handcrafted woodwork, ceramics, embroidery, lanterns and fabrics on display. On arrival, your leader will take you on an orientation walk around the Ancient Town. Your evening is free to do as you wish, and your leader can recommend the best local examples of Vietnamese cuisine.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An","description":"Start your day with a walking tour of Hoi An, where you’ll see all of the sights, like the Japanese covered bridge and the Old Town’s maze of alleys. Afterwards, head to a rustic food market and keep your eyes out for things to buy – this is a great place to pick up Vietnamese cooking gadgets. In the afternoon, head to a small village called Tra Que – on the edge of Hoi An. It’s named after the vegetables and fragrant herb gardens that are laid around the town and is known as a culinary destination. You’ll take a walking tour through the farmland, meet local villagers, then roll up your sleeves for a hands-on cooking class with a village chef specializing in the cooking of the Pho Hoi people.\nAccommodation: Hotel"},{"title":"Day 8: Hoi An","description":"Today is free for you to explore Hoi An at your leisure and of course your leader can recommend the best food and activities. For early risers, take the opportunity to visit the Hoi An fish markets – they are at their most vibrant in the mornings! Afterwards, if the weather's fine, perhaps hit the local beach for a swim (a great way to get there is by bicycle, which you can hire in town). In the evening, you could enjoy some seafood by the water, or jump on a boat for a barbecue feast on a nearby island.\nAccommodation: Hotel"},{"title":"Day 9: Ho Chi Minh City","description":"Take the short flight to Ho Chi Minh City (approximately 1 hour). Take a guided tour to get a feel for the city's frenetic, fascinating blend of old and new, East and West. You will notice a strong French influence in Ho Chi Minh City, which means excellent coffee and baguettes. Stop past the War Remnants Museum, GPO and Notre Dame Cathedral, finishing up at one of Vietnam’s most pulsing markets, Ben Thanh. This is the perfect place to pick up any last-minute snacks, cooking utensils, ingredients, or presents for friends and family. Tonight, take part in a cooking class where you'll learn some contemporary twists on traditional Vietnamese dishes with a passionate chef. Sit down and enjoy the delicious feast you've prepared over dinner.\nAccommodation: Hotel"},{"title":"Day 10: Mekong Delta","description":"Take a private bus out to the Mekong Delta (approximately 2–3 hours), then cruise up this mighty river on a sampan (traditional boat), one of the most common forms of transportation in these parts. Glide past farms and orchards to your guesthouse, set alongside a family home. Meet your hosts and take some time to wander the garden, relax or lend a hand with dinner preparations. Enjoy a southern Vietnamese feast on the wide verandah overlooking the garden as the sun goes down.\nAccommodation: Homestay"},{"title":"Day 11: Ho Chi Minh City","description":"For those who fancy an early morning cycle, join your hosts on a ride to the nearby village market for breakfast supplies for the group, and then enjoy a meal back at the homestay. Afterwards, return to Ho Chi Minh City by bus. The rest of your day is at your leisure. If you've got energy left in the evening, you might choose to enjoy a final Vietnamese meal with your new friends.\nAccommodation: Hotel"},{"title":"Day 12: Ho Chi Minh City","description":"With no activities planned for today, you are free to depart the accommodation at any time. If you wish to spend more time in Ho Chi Minh City, we’ll be happy to organise additional accommodation (subject to availability)."}]},{"name":"Vietnam at a Glance - 7 Days","duration":7,"travelStyle":["In-depth Cultural","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":529,"summary":"This tour is a guaranteed departure, so even if you are the only one booked onto this tour, you will still be guaranteed to depart!","highlights":["Challenge yourself and crawl through the Cu Chi Tunnels","Explore the striking limestone cliffs and caves in Halong Bay","Be entertained by a performance at a water puppet theatre"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95481_5a0d95.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95481_5a0d95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_f63e53e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_cb447294.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_b4b556fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_5cd10268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_f787e753.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_0c78610d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_949831bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_5f225a9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_240371ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_8a8ead46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_a1e104cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_5c7b19a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_fb185332.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_26b93bef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_bcce0cf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_f6f68969.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_d50525a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_5159056d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_2156f477.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_88f8e895.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_95c24943.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_46ab3012.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95481_4b1282ba.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrive in Ho Chi Minh City","description":"Our driver picks up you at Tan Son Nhat airport and transfers you to the hotel for check-in.\nStay overnight in Ho Chi Minh city (meals not included for this day).\n \nDistance: Tan Son Nhat Airport  Saigon centre: 7  8km (~30-minute drive)\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 2: Cu Chi - Ho Chi Minh City (B, L)","description":"8:30 am This morning enjoy a city tour that includes the Reunification Hall, formerly known as the Presidential Palace. It was towards this modern building that Communist tanks rolled on the morning of April 30, 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. The tour also includes the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda or War museum. Next, we visit the Cu Chi Tunnels, the incredible network of tunnels that once stretched for 210 miles. This underground complex was built by guerilla fighters beginning in 1940 and construction continued throughout the Vietnam War. Stay overnight in Ho Chi Minh city.  (Breakfast, Lunch included)\nDistance: Saigon  Cu Chi Tunnel: 75 km (~ 1.5 hour drive)\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 3: Ho Chi Minh City - Hanoi (B)","description":"After breakfast at the hotel, you will have free time until leaving for Hanoi by flight (Pick-up at the hotel at around 3 hours before departure flight time) \nUpon arrival in Noi Bai airport, be warmly welcomed and transfer to visit the capital of Vietnam - the city of lakes, of peace and historical sites. The out-side trip from the car covers Hanoi Westlake, Flower Market Quang Ba Truc Bach Lake, Hoan Kiem Lake, and cultural city landmarks as Temple of literature, Ho Chi Minh mausoleum (all outside view, sitting on the car). \nLater we walk through the busy traffic to the water puppet theatre and enjoy a performance of the famed traditional art form created by village farmers around the Red River Delta region. (Optional)\nStay overnight in Hanoi.  (Breakfast included)\nDistance: Noi Bai airport - Hanoi city center: 30 km (~ 45 minute drive)\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Halong Bay (B, L, D)","description":"08:00 - 08:30 Pick up at your hotel. Enjoy the interesting scenery on the 3.5 hours-way drive to Halong Bay. 12:30 pm: Embark the cruise for check-in and have lunch. Enjoy the buffet lunch onboard while the cruise sails passing by magnificent sceneries of the World Heritage Site. Explore Sung Sot Cave  Hiking up and down 600 steps to the magnificent limestone formations of the biggest and most marvellous cave in Halong Bay. Then, back to the vessel and continue sailing. Enjoy your relaxing time aboard, among the magnificence of the UNESCO World Heritage Site. A wide range of fine wines or spirits is served in the open-air bar on the sundeck. Participate in cooking class under the attentive instruction of our top chef, to discover the Vietnamese cuisine of traditional spring rolls. Time for dinner and evening entertainments: bar, spa, squid fishing and overnight on the cruise. Stay overnight on Halong Bay Cruise (Deluxe Cabin).\n(Breakfast, Lunch, Dinner included)\nDistance: Hanoi central  Halong Bay: 180 km (~ 3.5 hour drive)\nGarden Bay Cruises 3* or similar"},{"title":"Day 5: Halong - Hanoi (B, L)","description":"Wake up early to enjoy the stunning sunrise on the Bay. Begin a new day with a Tai Chi session on the sundeck. Coffee & tea with assorted homemade pastries will be served onboard. Relax or visit Titop Island. You can take part in an array of exciting activities: swimming, kayaking, trekking, etc. Passengers enjoy Vietnamese breakfast while the cruise passing by other beautiful parts of the Bay. Check out & back to the Tourist Wharf. Return back to Hanoi, stop on the way for restroom and go shopping with a variety of local hand-made products. Arrive in Hanoi. Check in hotel and stay in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*\n"},{"title":"Day 7: Bakhan Village - Hanoi/Concludes (B, L)","description":"Day: Bakhan Village - Hanoi (B, L)\n09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Trip ends at your hotel (arranged by your own). Good bye and see you again!"}]},{"name":"The Unexplored Co To Island - Halong Bay In 8 Days","duration":8,"travelStyle":["Beach","Family","Group","Partially Guided","Holiday"],"oldPrice":2521,"price":1361,"summary":"This short trip let you explore the rough pearl in the Gulf of Tokin. Co To Island humbly stands out from other popular destination yet its declared as one of the five most beautiful island in Vietnam  The island is home to some of Bai Tu Long Bay's best beaches with crystal clear, turquoise water and super fresh seafood. Find yourself immersed in the stunning landsape of Halong Bay and hidden caves in Halong Bay before heading to Co To island. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142644_3cb0557f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142644_3cb0557f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_e08783c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_36934ec7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_3282db8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_43ebc56e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_28d8f777.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_2a5d5aeb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_a775d1cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142644_67e3d35b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"ESCAPE TO VIETNAM COUNTRYSIDE (B/L)","description":"Pick-up at 7:30​ ​am from your hotel’s lobby​.​ ​The drive ​takes​​​ 2 hours and leave the noisy city behind your back! We’re heading to a peaceful and quiet countryside which is really a hidden charm!\n10:00 - Starting your trip at your host’s house by having welcome drink. Short break at your host’s house​.​\n10:45 – Cycling around the village and stop over the local market to experience how people trade their own products for lives. Then heading to traditional Miến village (type of transparent noodle made from starch).\n11:15 - Hands-on farming experiences by growing vegetables and harvesting the raw vegetables in Chau’s garden. Vietnam is the tropical country with the most famous variety ​of ​raw vegetable herbs as: lettuce, mints, fragrant knot weed, coriander, balm-mint, cilantro​ etc. You will see the way ​how local people not only​ always​ have fresh food to eat​​ but also have enough to trade in local market. \nThen ​Mr. ​Chau will take you to a boat trip for the fishing on Da River. On the way, you will experience the local live on river side and stop for fishing with​ Mr​ Chau ​with his local unique technique!\n12:30: Have lunch with the host’s family and short break after ​it.​\n14:00 – ​Say goodbye ​to ​your local host​ and ​head to 30-years-old tea fields in Ri Village. This place it is very important ​in​ providing tea products for the whole North​ of Vietnam​. Beside walking & helping local people to harvest tea leaves, you will know how to take the best part of the tea tree to make the most wonderful drink in the world.\nAfter visiting and learning cultivat​ion of tea leaves, you will come to Mr Duoc’s house – he is a veteran and the owner of a huge tea farm​. ​​From him you will know how we handle the raw tea leaves​,​ make it into the products and get ready to sell on market.\nHave a break time with desserts made of ground green lentils or lotus seeds with your host and listen his story from Vietnam war, as a veteran, he is a witness of Vietnam history and could make you understand about the past of the country.\nThen drive back to Ha Noi in the evening, end the tour at your hotel around 18:30.\n(Meals: breakfast, lu​n​ch)"},{"title":"GREETINGS FROM THE SPECTACULAR HALONG BAY (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise\n(Meals: breakfast, luch, dinner)"},{"title":"CRUSING IN THE DESCENDING DRAGON BAY (B/L)","description":"Rise early for Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Then, our driver will bring you to the harbours , you you take a speedboat to Co To Island\n(Meals: breakfast, lunch)"},{"title":"DISCOVER THE RAW BEAUTY OF CO TO ISLAND (B)","description":"Despite being the furthest inhabited island from the mainland, Co To Island has boomed in the last few years, and today it's a popular destination for domestic tourists. This should hardly come as a surprise, as the island is home to some of Bai Tu Long Bay's best beaches and its widest spread of accommodation and restaurants. Yet despite all of this, the island sees very few foreign faces."},{"title":"WAKE UP IN THE NORTHEN BEACH PARADISE (B)","description":"Find way to Dragon Claw Stones with impressive rocky cliffs and Cloud Bridge Peak to view the sunrise in early morning. Try the fresh and super tasty seafood the relaxing at Van Chai beach or Hong Van beach "},{"title":"LEISURE TIME IN CO TO ISLAND (B)","description":"The land here is a perfect example of the Vietnamese landscape before wide-scale tourism made its impact. There are numerous hills and peaks on Co To, some as high as 170 meters as well as a local lighthouse. The coastline is mostly cliffs or large rocks, but there are many beautiful beaches as well. \nThen travel back to Hanoi."},{"title":"TIME TO SAY GOODBYE - HA NOI DEPARTURE(B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]}]