[{"name":"Discovery South of Viet Nam 4 days","duration":4,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":190,"summary":"Start and end in Ho Chi Minh City! With the adventure tour Discovery South of Viet Nam 4 days, you have a 4 day tour package taking you through Ho Chi Minh City, Vietnam and 3 other destinations in Vietnam. Discovery South of Viet Nam 4 days includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153938_1f8c3423.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153938_1f8c3423.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_735f1831.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_012d23bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_8a24161d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_c681e464.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_490ae868.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_239560ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_3e1e35e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_91912897.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_6e0723b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_5c863864.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_fdce3cc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_0dd1787b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_425a0440.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153938_d7648213.jpg"],"destinations":["Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh (No meal)","description":"Arrival Ho Chi Minh city\nWelcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture.\nFree and easy\nOvernight in Ho Chi Minh.\n"},{"title":"Day 2: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong.\nOn arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nEnjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\nMeet at the bus and return to Ho Chi Minh City. \nOvernight in Ho Chi Minh.\n"},{"title":"Day 3: Cu Chi tunnels- Ho Chi Minh city (meals incl: B/ L)","description":"In the morning, visit Cu Chi tunnels\n8.00am Located 60km from Ho Chi Minh City, Cu Chi is now considered a heroic district for its role during the American war in Vietnam. It is legendary for its network of tunnels, which extends over 220km, and is a popular destination for both Vietnamese and foreign visitors. Today, Cu Chi is a tranquil place of rice paddy fields with ducks and water buffalos bathing in the rivers alongside the road. But this peaceful rural scene belies the terrible destruction and defoliation caused by bombing and mines when Cu Chi was a &quot;Free Target Zone&quot;. Cu Chi still contains plenty of evidence of the fierce battle that took place here and all over this area you will find the remnants of war.\n\nIn the afternoon, we will visit the War Remnants Museum, the Reunification Palace, which was the residence of the President of South Vietnam until the end of the war in April 1975, and some beautiful French colonial structures including the Notre Dame Catheral, Opera House and the Old Central Post Office.\n17:00 come back hotel.\nOvernight in Ho Chi Minh.\n"},{"title":"Day 4: Ho Chi Minh departure(meals incl: B)","description":"Have a breakfast at your hotel.\nFree time and easy until departure time, the driver takes you to the airport for your flight.\nEnd of services!\n"}]},{"name":"The Best Vietnam Family Vacation - 19 Days","duration":19,"travelStyle":["Family","Adventure","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1649,"summary":"Ho Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.\nDa Nang - Hoi An Ancient Town: See ancient sculpture in the Cham Museum, and tour Buddhist cave temples in the Marble Mountains. A walking tour through the UNESCO listed Old Quarter; Countryside bike ride, visit an old merchant house, the Hoi An Museum, and a Chinese assembly hall.\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95500_d4a61d22.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95500_d4a61d22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_e219f45b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0391fde7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0392518c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0392d16f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d039342d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d03939fc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d073510d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0735e8d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d073637f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d073689ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0736e06d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0737373f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a2d7087.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a2e966d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a2f29e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a30cdff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a31395f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a31a856.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0a321321.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0e82ea53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0e8406ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0e848bad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95500_5e02d0e85084a.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Arrive Ho Chi Minh City, Vietnam","description":"You arrive Tan Son Nhat (Saigon) International Airport. Transfer from Airport to Ho Chi Minh City at any time then transfer to hotel in Ho Chi Minh City for check in. Free for leisure. Overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Full day Sightseeing in Ho Chi Minh City & Cu Chi Tunnels. (B, L)","description":"This morning enjoy a city tour that includes the Reunification Hall, formerly known as the Presidential Palace. It was towards this modern building that Communist tanks rolled on the morning of April 30, 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. The tour also includes the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda, Chinatown and Binh Tay Market – the central market for the city and one of the liveliest areas. Next we visit the Cu Chi Tunnels, the incredible network of tunnels that once stretched for 210 miles. This underground complex was built by guerilla fighters beginning in 1940 and construction continued throughout the Vietnam War. We return to our hotel where the evening is free. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Leave Ho Chi Minh City for Hoi An (B)","description":"Enjoy the time in Ho Chi Minh City - heaven of shopping place in Vietnam until noon time. You leave Ho Chi Minh City transfer to Tan Son Nhat Airport in the afternoon fly to Hoi An. Arrive Hanoi airport, pick up & transfer to hotel for check in. Free for leisure. Overnight in Hoi An. Staying in Phu Thinh Resort Hoi An."},{"title":"Day 5 to day 12: (8 Nights) Free for leisure at Phu Thinh Resort Hoi An (B)","description":"Your family has 8 more nights at one of the best Resorts near beach in Hoi An. Free for leisure, go to the beach & pool.\nPhu Thinh Resort Hoi An 4* or similar"},{"title":"Leave Hoi An for Hanoi (B)","description":"You will have free time in the morning in Hoi An until noon time. Leave Hoi An for Hanoi. Arrive Hanoi in the afternoon. Pick up at airport upon arrival. Check in hotel & overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*. Your family will stay there in 2 Nights"},{"title":"Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable beach vacation in Vietnam with Legend Travel Group! Good bye & see you again!\nAirport transfer included!"}]},{"name":"Halong Bay 3 Days 2 Nights at BEST 4 STAR CRUISES: Transfer, Meals, Kayak, Cave, Island - CHEAPEST PRICES","duration":3,"travelStyle":["Boat","Group","Partially Guided","Holiday"],"oldPrice":299,"price":269,"summary":"Halong Bay, “the bay where the dragon descends into the sea’“, is a spectacular seascape in the Gulf of Tonkin. More than 2,000 islands, islets and limestone formations rise from the emerald waters, remarkably shaped by wind and waves.\nThe best way to discover the natural beauty of the bay is onboard our newly built Ha Long cruise, designed to give you the best service you could possibly wish for.\nThe cruise combines charm and great comfort to meet the growing demand of travellers looking for luxurious cruises in the bay. The cruise was launched in 2013, brand new Ha Long wooden junk crewed by a professional loyalty and dedicated team, the newest luxury in Ha Long.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f334.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f334.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f33a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f33b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f33d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f33e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f33f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f342.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f343.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f346.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f347.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f348.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f34b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f34c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f34d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f34e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f350.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f351.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f352.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f353.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195857_5e60ca715f355.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi – Halong Bay – Halong Cruise (L/D)","description":"08:30 Departure to Halong Bay for 3.5 Hours.\n10:00 Arrive in Hai Duong province, and have 20 minute short break.\n12:00 Arrive Tuan Chau harbor, Halong Bay.\n12:15 Welcome to   Cruise and enjoy Welcome drink, Enjoy welcome drink get a brief introduction about cruise and safety guidelines. Check-in your cabin.\n12:30 Have Vietnamese seafood and vegetarian lunch, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\n14:30 Arrival in Pearl Farm, kayaking through the village.\n15:30 Continued exploration the bay.\n16:00 Visiting Titop Island\n17:30 Back   Halong cruise and relax.\n18:00 Join cooking class guided directly by Chef of   Halong Cruise. You have chance to practice Vietnamese traditional dishes such as spring roll or famous cuisine of Vietnam.\n19:30 Time for dinner enjoying special BBQ seafood on the cruise.\n21:00 Evening entertainments: play game on the cruise: cards game, chess, karaoke, squid fishing, and overnight on the Cruise."},{"title":"Explore Halong bay (B/L/D)","description":"06:30 Early morning sun risers can enjoy Tai Chi lesson on sundeck.\n07:00 Morning view of bay’s landscape with a cup of tea or coffee. Have breakfast.\n08:30 Transfer by tender to smaller boat to visit Ho Dong Tien cave and explorer by kayak\n11:30 Back the daily cruise and have lunch.\n13:00 Enjoy kayaking to explore Trong Cave.\n14:30 Visit, swimming a pristine natural cave lapped by the turquoise water.\n15:30 Daily cruise take you back the Cruise for overnight.\n16:30 Arrive   Cruise to refresh and relax and make new friends from new group.\n19:30 Enjoy dinner on cruise.\n21:00 Evening entertainments: play game on the cruise: cards game, chess, karaoke, squid fishing, and overnight on the Cruise."},{"title":"Halong Bay – Hanoi (B/L)","description":"06:30 Early morning sun risers can enjoy Tai Chi lesson on sundeck. 07.00: Morning view of bay’s landscape with a cup of tea or coffee. Have breakfast.\n08:30 Arrive Sung Sot Cave (Amazing Cave) and joining with guide to visiting and explore the cave.\n10:00 Check-out and enjoy a fantastic cruise on the bay.\n11:00 Enjoy the lunch on cruise.\n12:00   Halong Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise. 12:30 Return to Hanoi by shuttle bus.\n14:30 Stopover in Hai Duong province to visit a ceramics workshop.\n16:00 Arrive in Hanoi end your trip."}]},{"name":"Trekking and Kayaking in Cat Ba 4 days 3 nights","duration":4,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":517,"summary":"This four-day tour trekking in Cat Ba National Park and kayaking in Lan Ha Bay ventures into an area of Cat Ba, unseen by many tourists. Unearth the island’s hidden beauty, far from the usual tourist maps. With your local guide, you’ll safely explore the depths of the jungle and the heights of the limestone mountains before emerging from the canopy for a view of the island. Our unique trekking opportunity is a must-see for anyone who wants to discover Cat Ba’s astounding natural beauty and local culture.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc90072.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc90072.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc90076.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc90078.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e573e98757e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc9007a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc9007d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc90079.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e4a3ecc9007b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e573e98757eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e573e98757ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e573e98757ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194127_5e573e98757f0.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi - Hai Phong - Cat Ba Island (L/D)","description":"\nYou will depart from your hotel in Hanoi for Hai Phong City then take the express boat to Cat Ba Island, arriving in Cat Ba Island at about midday. You will transfer across the island to the dock and board a small boat to Cai Beo fishing village. You'll enjoy a lunch of fresh local seafood and spend the rest of the day exploring the village or fishing with the local villagers. You will stay overnight in homestay."},{"title":"Trekking In Cat Ba (B/L/D)","description":"\nYou will enjoy breakfast at the homestay before a beautiful day of trekking. You will trek on Ha Sen Mountain with an experienced and knowledgeable local guide. This is a hard trek which requires a good general level of fitness and some skills in climbing. When you reach the top of the mountain, you will be rewarded with wonderful views of the island and the bay. You will have dinner and spend the night in a homestay."},{"title":"Kayaking In Lan Ha Bay (B, L, D)","description":"\nYou can spend a whole day cruising on junk and paddling and exploring the bay at your own pace while having a closer look at the amazing karsts. You'll explore some of the many caves that lead to stunning lagoons, paddle to some floating villages to see this unique way of life and stop to chill out at one of the many beaches here. You'll be met by a support boat which you'll board to enjoy lunch before you continue paddling in the afternoon. After a day of exploring, you will travel to quite and safety bays to enjoy for dinner and another relaxing night on boat."},{"title":"Cat Ba Island - Hanoi (B/L)","description":"\nYou will have breakfast at the homestay before heading out for the morning to explore more of the amazing karst limestone formations and grottos. You will return to the homestay for lunch where you can relax on the beach, throw around the Frisbee and take a swim. In the afternoon you will cruise back to Cat Ba Island, take a ferry to Hai Phong and then drive back to Hanoi."}]},{"name":"Adventure in Ho Chi Minh City - Mekong Delta 3 days 2 nights","duration":3,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":498,"summary":"While Ho Chi Minh City certainly dominates Southern Vietnam, there is so much more to see and do besides the exciting metropolis. On this 3 day tour of the region we’ll take you to all the “must see’s” and introduce you to the stunning variety and diversity of the country. From walking the streets of Saigon, to crawling through the claustrophobic tunnels of Cu Chi and relaxing on the peaceful waters of the Mekong Delta, this tour will appeal to travellers of any inclination.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142709_c16c9bae.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142709_c16c9bae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_1168dd04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_0db5deb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_38cabf52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_ee39998f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_9a67ad4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_cfb569ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_bbd7e119.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_ad106991.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_898af17d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_b6cbb890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142709_2cd81993.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: CU CHI TUNNELS - HO CHI MINH CITY TOUR ( L )","description":"After breakfast at hotel, we’ll start our journey in Vietnam by heading over to the famous Cu Chi Tunnels. This amazing network of underground tunnels was used by the Viet Cong and Viet Minh during the Vietnam War, and makes up a veritable underground city, running for a total length of more than 250 kilometres. You’ll have the opportunity to crawl through a section of the tunnels, as well as fire several guns used during the conflict at the firing range. There will also be a guided tour of the ingenious yet macabre traps used to great effect during the war.\n\nLunch at local restaurant in Cu Chi consisting of rice tapioca and hot tea, the staple of the diet in the tunnels, before heading back to Ho Chi Minh City, arriving at around 13:00.\n\nThis afternoon, our guide will show you the most interesting sights that Ho Chi Minh City has to offer. We’ll start with the Reunification Palace, a beautifully preserved structure which served as the residence of the President of the Republic of Vietnam, and on April 30th, 1975, was the site of the official end of the American War. Next is the War Remnants Museum. In this amazing yet heart-wrenching museum you’ll get to see various exhibits relating to the American period of the Vietnam War.\n\nAfterwards its time for more colonial architecture, with a visit to The Notre Dame Cathedral, built in 1880 and resembling its bigger brother in Paris, and the Old Post Office, completed in 1891, which serves as one of the best examples of French colonial architecture. For something more ancient, we pay a visit to the Jade Emperor Pagoda, built in a Chinese style and decorated with bright motifs. \n\nOur last stop will be at Ben Thanh Market (occasionally replaced with Tan Dinh Market) where you can practice your bargaining skills while shopping for souvenirs. Spend some time discover local life and culture and you’ll find some of the friendliest, liveliest, and most convivial people in the city here.\n\nWe’ll return your hotel around 18:00 and the rest of the day is free to spend at your leisure."},{"title":"Day 2: MEKONG DELTA - MEKONG EYES CRUISE (B/L/D)","description":"Our activities on the second day depends on the precise date, with tours starting in Cai Be on even dates and in Can Tho on odd dates. The only difference in the options is starting an hour earlier for your drive to Can Tho compared to Cai Be, and the direction that you travel in.\n\nOption 1: Can Tho – Cai Be (odd dates)\nYou’ll be picked up at the hotel (district 1 and parts of district 3) between 07:00 and 07:30 (only included for those pax using the shuttle service) and drive to the cruise vessel where we’ll board and check in at 11:30. \n\nWe’ll enjoy a panoramic cruise along the peaceful river, enjoying lunch on-board around 13:00 and then set out on a guided land excursion at 16:00 where we walk among orchards and small villages. At 17:30 we return to the boat for refreshments and sunset-gazing on the top deck, before having dinner at 19:00 and overnighting on-board.\n\nOption 2: Cai Be – Can Tho (even dates)\nYou’ll be picked up at the hotel (district 1 and parts of district 3) between 08:00 and 08:30 (only included for those pax using the shuttle service) and drive to the cruise vessel where we’ll board and check in at 11:30. \n\nWe’ll enjoy a panoramic cruise along the peaceful river, enjoying lunch on-board around 13:00 and then set out on a guided land excursion at 16:00 where we walk among orchards and small villages. At 17:30 we return to the boat for refreshments and sunset-gazing on the top deck, before having dinner at 19:00 and overnighting on-board."},{"title":"Day 3: MEKONG DELTA - MEKONG EYES CRUISE - HO CHI MINH (B/L/)","description":"Like on the previous day, tours start in Cai Be on even dates and in Can Tho on odd dates.\n\nOption 1: Can Tho – Cai Be (odd dates)\nRise early (06:30) to enjoy the sunrise and early morning views from the cruise, with morning tea served as you float on the mighty river. At 8am you’ll check out of your cabin and go on an excursion in a small sampan boat, exploring the small canals of Tan Phong Islet and visiting a coconut candy producing family.\n\nAt 10am we get on our bicycles (or walk for those who don’t want a bicycle) and ride on back roads in a small village situated amongst the Mekong Canals, before transfer back to Saigon at 11am. On the way back to the city we’ll stop for lunch at a rest stop around noon, and we’ll you off at your hotel in the city around 15:30. As this is the end of our journey it’s time to say your farewells and continue with your onward travel plans.\n\n06.30: Morning cruise and morning tea break served on board\n08.00: Check-out of cabin. Excursion on rowing sampan, exploring small canals of Tan Phong islet, coconut candy producing family.\n10.00: Bicycle ride on back roads or walk in a small village along the Mekong Canals \n11.00: Departure of shuttle to Saigon / end of tour \n12.00: Lunch in Mekong Rest Stop (only included for those pax using the shuttle service).\n~ 15.30: Arrival in Saigon\n\nOption 2: Cai Be – Can Tho (even dates)\nRise early (06:30) to enjoy the sunrise and early morning views from the cruise, with morning tea served as you float on the mighty river. At 8am you’ll check out of your cabin and go on an excursion in a small sampan boat, visiting the local floating market of Cai Rang and a workshop for noodle production run by a local family.\n\nAt 11:30 we transfer back to Saigon, stopping n the way back for lunch in Vinh Long City (only included for those pax using the shuttle service) around 12:30, and we’ll you off at your hotel in the city around 16:30. As this is the end of our journey it’s time to say your farewells and continue with your onward travel plans."}]},{"name":"Adventure to Cat Ba and Lan Ha Bay 3 days 2 nights","duration":3,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":339,"summary":"This 3- day adventure will take you through the karst-studded waters of Lan Ha Bay to the stunning Cat Ba Island. As well as taking in some of the most incredible areas in the north of Vietnam, this action-packed trip is full of unforgettable experiences including cruising on a traditional wooden sailboat, hiking through a beautiful national park, staying with local families, discovering cave systems and kayaking. This tour takes you away from the crowded tourist areas so you get to truly enjoy the beauty of this stunning bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4ca9c531fbe.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4ca9c531fbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b45a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261bfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b45c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261bfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b45e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261bff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b45f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261c01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b461.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261c03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caae03b462.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194260_5e4caad261c04.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"Hanoi - Cat Ba National Park (L/D)","description":"\nYou will be collected from your hotel in Hanoi's old quarter at 08:00 to begin the drive to Dinh Vu Harbour. You will then take a 45-minute high-speed boat to Cat Ba Island. After that, you will go to Cat Ba town for lunch.\n\nIn the afternoon, you will trek to Viet Hai Village through Cat Ba National Park which is a haven for both bird watching and sightseeing amidst the pristine forest and at Frog Lake. Along the way, you will have the chance to see native cats, squirrels, spotted deer, snakes, thousands of butterflies, and if you’re lucky, one of the rare Cat Ba Langurs.\n\nRounding out the day, you’ll enjoy dinner and an overnight stay in a bungalow in the local village of Viet Hai."},{"title":"Lan Ha Bay (B/L/D)","description":"\nBreakfast will be served at 07:30 followed by a walk to the top of Marine Hill which offers panoramic views of both Ha Long Bay and Lan Ha Bay. On returning to Viet Hai Village, you can try a fish massage or take some time to relax before cycling to Viet Hai Harbour. From here you will board the boat to explore the beauty of Lan Ha Bay. Lunch will be served on-board followed by kayaking excursion around Hang Luon Cave, and if it is hot, the boat will take you to some beautiful wild beaches where you can spend some time swimming and snorkelling before having dinner on-board and spending the night on the boat."},{"title":"LAN HA BAY - CAT BA - HANOI (B/L)","description":"\nAfter enjoying breakfast on the boat with the sun rising in the background you will continue the cruise around Lan Ha Bay, weaving among the myriad of limestone peaks. On this last day you will also get to visit a fish and shellfish farm and the colourful floating village of Cai Beo. Lunch will again be served on-board (or on land if we have new passengers waiting to embark). You will disembark at around 11:30, return to Hanoi, ending your tour of Lan Ha Bay and Cat Ba Island.\n"}]}]