[{"name":"Vietnam Explorer 2021/2022","duration":12,"travelStyle":["In-depth Cultural","Historical","Holiday"],"oldPrice":0,"price":5900,"summary":"In and around HanoiWelcome to vibrant Vietnam. Enjoy the day at leisure and settle into a two night Special Stay in Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/202985_10f0abb7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/202985_10f0abb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c5903d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c5903f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c59040.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c59042.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c59043.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c59044.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202985_5f3b5b7c59046.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to vibrant Vietnam. Enjoy the day at leisure and settle into a two night Special Stay in Hanoi."},{"title":"Day 2: Hanoi","description":"Freechoice: Visit the History Museum and Hoa Lo Prison, or join an authentic cooking class. Alternatively, visit Ho Chi Minh Quarter and Mausoleum, including a visit to the Temple of Literature.EnrichAfter attending a customary performance of Hanoi’s famous Water Puppets, learn the secrets behind this illusionary show thanks to your special backstage pass."},{"title":"Day 3: Hanoi > Halong Bay Cruise","description":"Journey to Halong Bay and board the elegant Au Co for an awe-inspiring two night Special Stay cruise through the picturesque waters of this spectacular World Heritage-listed icon."},{"title":"Day 4: Halong Bay Cruise","description":"Begin the day with a Tai Chi lesson. Cruise deeper into the National Park and try some kayaking, explore a cave and discover Cat Ba Island.SundownersExclusive to Scenic guests on board, enjoy a wine tasting against the backdrop of the karst islands at sunset."},{"title":"Day 5: Halong Bay Cruise > Hanoi","description":"Relax during your morning cruising before returning to Hanoi for another Special Stay and undertake a historical bunker tour at the hotel.Freechoice Dining: Tonight enjoy a Vespa foodie tour of Hanoi’s Old Quarter, or dine at the La Terrace at Sofitel. Alternatively, dine in a classic French villa at Home Moc restaurant."},{"title":"Day 6: Hanoi > Hoi An","description":"Fly to Danang and continue to the ancient town of Hoi An where you will enjoy a three night stay, which includes a daily spa journey as part of your stay.Freechoice Dining: Dine at the Morning Glory Restaurant. Alternatively, visit Brother’s Café or Hoi An Café, both located along the river front. "},{"title":"Day 7: Hoi An","description":"Step back in time as you take a walking tour of Hoi An’s World Heritage-listed Old Quarter including the Japanese Bridge and central market before stopping at the home of a former merchant to learn all about what life is like in Hoi An.SundownersThis evening relax at a reception in the Blue Bar with included beer and wine."},{"title":"Day 8: Hoi An","description":"Freechoice: Visit the ancient temple ruins of My Son. Alternatively, enjoy an interactive cooking class at Red Bridge Restaurant or cycle to a farming village through the rice fields outside Hoi An. "},{"title":"Day 9: Hoi An > Hue","description":"Travel via the breath taking Hai Van Pass to Hue, the former imperial capital. Wander through the grandeur of Hue’s Imperial Citadel before checking into your hotel for the night.EnrichThis evening’s Royal Dinner is held in a traditional private garden house accompanied by Hue Royal Court music."},{"title":"Day 10: Hue > Ho Chi Minh City","description":"Visit the Mausoleum of Emperor Tu Duc before flying to Ho Chi Minh City. After arriving at your hotel for the next two nights, take a leisurely guided orientation walk of the nearby sites."},{"title":"Day 11: Ho Chi Minh City","description":"Travel to the Cu Chi Tunnels and learn about the underground labyrinth of war-time passageways.Freechoice Dining: Enjoy a Vespa foodie tour of Saigon by night, enjoy a meal in an old French colonial house or a restaurant specialising in Saigon street food. Alternatively, try Italian at Basilico or international fare at Nineteen Restaurant."},{"title":"Day 12: Ho Chi Minh City","description":"After checking out from your hotel, learn all about Vietnam’s modern history during a visit to the Reunification Palace and War Museum. Following lunch, the remainder of the day is yours until your transfer to the airport for your flight home.This itinerary is a guide only and may be amended for operational reasons such as high and low water. As such, the cruise may operate altered from that stated above."}]},{"name":"Feel Free Vietnam - 15 Days","duration":15,"travelStyle":["Adventure","Beach","Group","Partially Guided","Discovery"],"oldPrice":0,"price":1299,"summary":"Trip Highlights","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb7d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c2a29c948.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c1267eb94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c21628444.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5e50c2a29c954.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193382_5ebbc12513026.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Mui Ne","Ho Chi Minh City"],"timeline":[{"title":"Day 1 - ARRIVE & LET THE ADVENTURE BEGIN!","description":"Today is the beginning of your big adventure in Vietnam. We will pick you up from the airport, get you checked in, then introduce you to anyone else who has already arrived. You may want to take a nap before we head out for dinner and drinks in the evening."},{"title":"Day 2 - EXPLORE THE CRAZY CAPITAL","description":"There is no better way to start your adventure here in Hanoi than by wandering the narrow streets. We stop to try some local flavours before jumping in our 3 wheeled rickshaw to explore the rest. Vietnamese people really khow how to throw a party… let’s grab a stool on ‘Beer Street’ and see where this crazy city takes us!"},{"title":"Day 3 - OVERNIGHT BOAT IN HA LONG BAY","description":"Today’s the day we’ll be cruising through 1 of the 7 natural wonders of the world, Ha Long Bay. We jump onboard a traditional Junk Boat, get checked into our private cabins and enjoy lunch as we set sail, taking in the incredible views… just epic! After lunch we adventure through caves on kayaks, cool off with a swim before sipping on cocktails for sunset!"},{"title":"Day 4 - HA LONG TO KING KONG!","description":"After waking up onboard surrounded by stunning limestone cliffs we make our way further off the beaten track to Ninh Binh. Known for its dense jungle and towering dark limestone cliffs, Ninh Binh was home to the recent King Kong movie - Skull Island. Allow us to introduce you to our local friends and enjoy dinner with the family in their homestay… it doesn’t get much more local than this!"},{"title":"Day 5 - LET’S PADDLE OUR WAY THROUGH NINH BINH","description":"Today is a real highlight for most as we cycle through the countryside stopping to chat to locals while taking in our surroundings. We’ll park our bikes and jump aboard traditional paddle boats cruising through caves & rice fields… a truly unique experience not to be missed! After enjoying a local lunch we trek to the top of the Dragon viewpoint for an incredible 360 view of Ninh Binh and the valleys below. Tonight we board the overnight train to Hue."},{"title":"Day 6 - GIVING BACK TO THOSE WHO NEED IT MOST","description":"A big part of what we do here at Feel Free Travel is integrating with local communities and experiencing local life. Today we head into the countryside to visit some of the poor areas outside of Hue. Our local guide introduces us to the community, educates us on local life before we as a group give back to these heartwarming locals to help support their children with tuition fees. It’s a pretty special feeling that will have your heart throbbing for sure."},{"title":"Day 7 - OPEN TOP JEEPS TO THE CITY OF LANTERNS","description":"Time to take the ride over one of the most iconic roads in Vietnam, the Hai Van Pass. Spend the afternoon cruising in open top jeeps through the windy mountain roads. We’ll stop for lunch on the beach, cool off in the river and check out incredible viewpoints along the way before arriving in the lantern filled Hoi An for a party!"},{"title":"Day 8 - MAKE A LANTERN & CHILL AT THE BEACH","description":"Today is a great day to enjoy it as you want… chill out, go shopping, make your very own lantern or cycle down to the beach for some chill time it’s completely up to you! Or why not visit a local tailor and get some super cheap clothes made! Enjoy a free evening to really explore the City of Lanterns."},{"title":"Day 9 - LEARN TO COOK ON THE RIVER","description":"There is nothing more exciting than being spun around by a crazy local in a bamboo basket boat while attempting to fish for crabs! Sounds like fun huh? It really is! We explore the coconut groves before arriving at our Vietnamese cooking class on the river. Today is the final day for some of the group so we head out in the evening for the final dinner and drinks ;)"},{"title":"Day 10 - SOAK IT UP IN A MUD SPA","description":"After a short flight to Nha Trang, we’ll arrive at our accommodation and head out for a truly unique experience. The mineral mud baths in Nha Trang really do sound crazy… but once you’re in you won’t want to get out! As much as it is great for your skin it’s great fun also! Tonight we’ll get lost in Nha Trangs night markets #STREETEATS"},{"title":"Day 11 - ARRIVE IN THE BEACH SIDE TOWN OF MUI NE","description":"Today we’ll arrive at the beautiful beach town of Mui Ne, famous for its fishing villages and Sahara-like dunes. We’ll spend the afternoon exploring the town before enjoying sunset cocktails by the pool. Tonight’s the night we party on the beach!"},{"title":"Day 12 - GRAB A BOARD & RIDE THE SAND DUNES","description":"After a relaxing morning by the pool we make our way to the local fishing village and visit  Vietnam's very own Grand Canyon - ‘The Fairy Streams’. We take a stroll through the waterways stopping to cool off under the bamboo canopies. \nFor some people this is the afternoon you have been waiting for, sandboarding and optional quad biking on the epic sand dunes of Mui Ne… there is no better sunset than this one!"},{"title":"Day 13 - STREET FOOD & WAR MUSEUM","description":"Arrive in the crazy city of Ho Chi Minh… you’ve never seen so many motorbikes in your life! There is no better way to explore this city than by foot, let’s feast in the local flavours of the south, stop off at some of Saigons most iconic spots before heading to the deeply moving National War Museum."},{"title":"Day 14 - DISCOVER THE CU CHI TUNNELS","description":"Take a peek at the underground life of the infamous Viet Cong soldiers. Learn first hand how these warriors lived beneath the soil using tunnel networks and improvised weapons to defeat their enemy. If you fancy it you can even take a short explore through the hand dug tunnel systems yourself. Get ready for our last night out in Vietnam and experience some of South East Asia’s best nightlife."},{"title":"Day 15 - CHECKOUT & ONWARD TRAVEL","description":"Today is check out day and the end to an incredible trip in Vietnam. We’ll help you sort out your onward travel, giving you ideas on where to go next with the new friends that you have made on the trip or simply helping you get the airport before you fly to your next destination/ home."}]},{"name":"Tour 9 days Ha Noi – Sapa – Ha Long","duration":9,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":900,"summary":"Vietnam is known for beautiful country, good foods and especially friendly people. This tour let you feeling about Vietnam’s most stunning landscapes, ancient history, colorful minority cultures, friendly people and interesting metropolises. Specially, you will have the opportunity enjoy cruising with Cruise 4 star and discover amazing beauty of Halong Bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675fa0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675fa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675fa5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675fa7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675fa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197937_5e9142a675faa.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately by the comfortable car to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city. \n"},{"title":"Ha Noi - Bicycle Tours to Hanoi Countryside (B,L)","description":"After a truly scrumptious breakfast, join a bicycle day tour to the countryside of the city. This tour includes cycling 45 km on flat roads.\nAround 8:00 am in the morning, youare picked up to our bicycle store to choose your suitable bikewhich makes you feel comfortable. You have a safety instruction here.Your exploration for the day: \nBack to your hotel for a rest after the full day. Overnight in Ha Noi\n"},{"title":"Ha Noi – Sapa (B)","description":"In the morning: Bus will come to pick you up and transfer to Sapa town\nAround 2.30 pm: Arrival Sapa town, check in hotel then tour guide take you to visit Cat Cat Village of the H’mong ethnic people, hydroelectric Falls. \nDinner and overnight at the hotel or homestay in Sapa\n"},{"title":"Lao Cai – Sapa – Laochai – Tavan – Giang Ta Chai (Muong Hoa Valley) – (B/L)","description":"Join day tour\nHave breakfast. Depart from Sapa town by car to:\nIn the afternoon the car will pick you up for the return journey to Sa Pa\nOvernight at the hotel or homestay in Sapa\n"},{"title":"Sa Pa – Suoi Ho – Ma Tra – Ta Phin – Lao Cai – Ha Noi (B/L)","description":"Join day tour.\nAfter breakfast and visiting:\nHave a picnic lunch \nAfter lunch you continue our trek to Ta Phin village to visit Red Dao people and handicraft shops. \nIn the late afternoon, you are to return to Hanoi by coach. Upon arrival at the hotel, check in and take the rest after long day on road\n"},{"title":"Ha Noi: Free (B)","description":"Have breakfast, free walking and explore to arround Ha Noi city\nOvernight in Ha Noi\n"},{"title":"Ha Noi – Ha Long Bay (B,L,D)","description":"Join group tour for 2 days and 1 night to visit Ha Long by cruise.\nOur shuttle bus picks up you at the hotel in Ha Noi old quarter then depart to Halong. This 4-hour drive will take you to Halong Bay, a World Heritage Site recognised by UNESCOin 1994. Located in the Gulf of Tonkin, Halong Bay includes some 1,600 islands and islets, forming a spectacular seascape of limestone pillars. Because of their precipitous nature, most of the islands\nare uninhabited and unaffected by a human presence. The site's outstanding scenic beauty is\ncomplemented by its great biological interest.\nUpon arrival in Halong bay, you board our Junk for an overnight boat trip. After lunch you begin our\nfantastic cruise in Halong Bay. The scenery is truly breathtaking and is continuously changing. This\nincludes a visit to Sung Sot Cave, round over Tuan Chau Island, Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island and a swim at Titov beach. Enjoy dinner on board while watching the sunset.\nOvernight on Cruise.\n"},{"title":"Ha Long Bay – Ha Noi (B, L)","description":"After an early breakfast you continue the cruise to visit Man‘s Head island, Tortoise Island, Bai\nTu Long Bay, Toad Island and Bai Tho Mountain.\nAt noon, return to the shore and disembark from the cruise as our crew say farewell. \nGet on bus to get back to Hanoi.\nOvernight in Ha Noi\n"},{"title":"Ha Noi - depart (B)","description":"Have breakfast. Free relax and explore Ha Noi.\nThen Transfer to the airport for your return flight home\n"}]},{"name":"8 DAYS DISCOVER NORTHERN VIETNAM","duration":8,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":785,"summary":"Vietnam – the country of the beautiful landscapes. Once you come to visit, you will be surprised by its beauty. This tour consists of the most interesting tourist attractions in the north of the country. With many trekking, homestaying, kayaking, biking activities, 8 DAYS DISCOVER NORTHERN VIETNAM is the best choice to discover this beautiful part of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/176456_a65263b8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/176456_a65263b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_18c95df1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_c0834667.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_812a5cca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_be343e81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_13ac16ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_f1ed4695.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_22dcd8ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_e04708a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_75096734.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_72353c13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_f09786c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_4678125a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_9c717e99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_7023de28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_2089ebc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_09c987a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_c4b52e49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_2634c597.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176456_3f7d534b.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Pick up at airport. Stay 01st night Hanoian Hotel."},{"title":"Day 2: Hanoi – Halong Bay","description":"Have breakfast, check out and be ready at lobby by 8am for pick up by shuttle bus for 2 days 1 night trip in Halong Bay with 3-star cruise.\n\n12.30: Arrive at cruise office, transferred by tender to Cruise.\n\n12.45: Enjoy welcome drink, be briefing about safety on boat and activities included then check in cabin.\n\n13.30: Delicious Vietnamese set menu while leisurely cruising to the core of Bai Tu Long Bay.\n\n15.00: Arrive to Cap La Island the beautiful area in Bai Tu Long bay. Enjoy kayaking through the karst and breathtaking nature, swimming and relaxing.\n\n17.30: Get back to the boat and enjoys Sunset party while our cruise sailing to the overnight anchorage.\n\n19.00: Sumptuous set-dinner onboard.\n\n20.30: Free time for joining Games\n\nStay 02nd night on Board."},{"title":"Day 3: Halong Bay – Hanoi","description":"06.30: Starting your day with Tai Chi on the Sundeck.\n\n07.00: Breakfast will be served in Western style and furthermore with Vietnamese traditional food \n\n08.00: Explore the Thien Canh Son. Guide will explain the history of Ha Long Bay, Bai Tu Long Bay and this Cave, made by Mother Nature.\n\n09.30: Upon return to the boat you will have 30 minutes to freshen up and finish packing.\n\n10.30: Vietnamese cooking demonstration on boat.\n\n11.00: Enjoy a traditional Vietnamese lunch.\n\n12.00: Disembark in Hon Gai pier\n\n12.30: Farewell Halong Bay then returns to Hanoi\n\n17.30: End of service.\n\nReturn from Halong Bay, enjoy the FREE 01 hour cyclo trip around the famous Hanoi Old Quarter/ Water puppet show. Stay 03rd night at Hanoian hotel."},{"title":"Day 4: Hanoi – Sapa","description":"Have breakfast, check out and be at lobby by 6h50am for pick up to  Sapa 2 days 1 night trip by bus. Arrive to Sapa by noon for lunch, easy trekking trip in small group, back to hotel for dinner and stay 4th night at Standard room on the best 3 star hotel the either Vista/Panorama hotel "},{"title":"Day 5: Sapa - Hanoi","description":"Have breakfast, check out and be pick up at 9am for continue trekking in small group. Finish trekking in afternoon, back to hotel to fresh up and take bus back to Hanoi. Arrive to hotel in Hanoi by 9h30pm. Stay 5th night at Hanoian hotel."},{"title":"Day 6: Hanoi – Ninh Binh","description":"From 8:00 – 8:30, our guide and bus pick you up from hotel and start driving to Ninh Binh, on the way, stop for a short break to stretch your legs. You arrive at Hoa Lu Ancient Citadel to visit King Dinh and Le Temple. Then approach Tam Coc Wharf for buffet lunch with Vietnamese Cuisines in our restaurant.\nIn the afternoon, we cycle to Mua cave with stunning rice fields with buffalos, goats…along the road till approaching Mua cave. You walk up to the top of the mountain, visiting lovely stalactites and stalagmites inside, then take a spectacular view from the top to the valley. You cycle back to the Bungalow check in then attend our Cooking class of how to make local cakes and swim before the dinner around 19:00, then enjoy the night there with bar opposite to the Pool."},{"title":"Day 7: Ninh Binh – Hanoi","description":"From 6:30, welcome a new day with sunrise Tai Chi and a breakfast then visit morning local market to see how local people exchange goods that you have never seen in the tourist places then enjoy the exciting boat trip on Ngo Dong river with sampan boat through caves on the stunning river surrounded by Karsts with rich fauna and flora. You finish the boat trip and check out, clear the bills then savoir authentic lunch made by our chef.\n\nIn the afternoon, you cycle through peaceful villages with rice fields to visit Bich Dong Pagoda surrounded by lotus lake. You walk up to the top and enjoy the panoramic view of dramatic limestone ridges and dotted hamlets and a particularly refreshing moment, then have afternoon tea to highlight a lovely day and get on bus to Hanoi.\n\nFrom 19:00, you are in Hanoi, we drop you off at your hotel, trip ends.\n\nRelax with 60 minutes with Foot Massage at our spa."},{"title":"Day 8: Hanoi Departure","description":"Free time for shopping. Check out. Our car brings you to the airport. Trip ends"}]},{"name":"Family Vietnam In Depth","duration":15,"travelStyle":["Family","Adventure","Group","Fully Guided","In-depth Cultural","Historical"],"oldPrice":0,"price":2280,"summary":"Join us on an in depth journey through magical Vietnam, traversing the country from north to south. Bike alongside the rice paddy fields of Mai Chau and explore the intricate network of waterways in the Mekong Delta. Witness the hustle and bustle of Ho Chi Minh City, the old-world charm of Hanoi, ancient neighbourhoods of Hoi An and dramatic limestone pinnacles of Halong Bay.   Mai Chau - Cycle along rice terraces and through villages dotted with stilt houses   Ho Chi Minh City - Learn about the resourcefulness of the Viet Cong at the Cu Chi Tunnels, visit an underground weapons bunker and explore old Saigon's bustling back alleys   Mekong Delta - Navigate the delta by bike and boat. Stay in a traditional homestay and take part in a Vietnamese cooking lesson ","highlights":["Wander through the bustling narrow streets of Hanoi","Go sea kayaking in a breathtaking limestone landscape","Try your hand at making a kite and a martial arts lesson","Navigate the Mekong Delta by bike and boat","Cycle through rice terraces and villages of stilt houses"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124618_7aa4e696.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124618_7aa4e696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_8a0e045e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_a9f40e07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_63702d9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_49ff3fed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_8b46b13d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_538bb238.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_96ad8a2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_5a9a683e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_8b7710e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_6ed484cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_89cad8a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_995344ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_182eb7c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_67480a58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_0ba5b6d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_b2ab57a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_4eaf1b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_e772eba6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_13c19d56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_4f0e8072.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_0f5440d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_90f83550.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124618_60d7e418.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Join trip in Hanoi.","description":"Arrive in Hanoi. Vietnam's bustling capital is architecturally styled like a French provincial town, with tree-lined boulevards and low-rise buildings. It's a wonderful city to explore on foot.\n \n For those arriving on time our Leader plans to meet you in the hotel reception at 6pm for the welcome meeting and for those that wish, there is the chance to go out for dinner. There are no other activities planned today, so you are free to arrive in Hanoi at any time. If you would like to receive a complimentary airport transfer today, you'll need to arrive into Hanoi's Noi Bai International Airport (airport code HAN), which is 30KM, around one hour's drive from the airport. Should you miss the welcome meeting, your Leader will inform you of any essential information as soon as you catch up.\n \n If your flight arrives earlier in the day, perhaps you might choose to head to the Old Quarter, a maze of narrow lanes named after the various crafts and specialities of the city's artisans. The pavements are filled with food sellers tempting you with steaming noodles, snacks and stir-fried delights."},{"title":"Day 2: Hanoi. Watch locals take lakeside yoga classes, explore night markets.","description":"This morning join our trip leader to see more of Hanoi, visiting the One-Pillar Pagoda, the tranquil Temple of Literatures and the Mausoleum of Ho Chi Minh lying in state.\n  \n The afternoon is then free to perhaps take an optional cookery class, or explore Hanoi's elegant French Quarter by cyclo.  In the evening there is the chance to witness a remarkable performance of traditional water puppetry (optional activity). Set on a flooded stage, the stories tell tales of legendary heroes and everyday life, with dragons and unicorns often sharing the stage with fireworks and naval battles, alternatively head out to sample the delights of Vietnamese cuisine at a local restaurant including regional specialities such as Goi cuon (spring rolls) or Pho, Vietnam's national dish, a light beef or chicken broth flavoured with ginger and coriander, to which are added broad, flat rice noodles, spring onions and slivers of chicken, pork or beef."},{"title":"Day 3: Scenic drive to Mai Chau, bike through paddy fields past tranquil traditional villages.","description":"Hemmed in by hills and set in a tranquil valley, Mai Chau is a world away from the hectic pace of life of Hanoi. The four hour journey provides a glimpse of rural life in the north of the country passing through villages surrounded by paddy fields. On arrival, check-in to our hotel with fine views of local villages distantly related to the tribes in Thailand, Laos and China, lunch is included at the hotel. \n \n This afternoon head out on a biking tour along rice terraces of the Mai Chau Valley dotted with stilt houses. The ride provides opportunities for panoramic views of paddy fields, spectacular karst cliffs and verdant valleys around you, a truly spectacular setting. On the way home, pass by Van Village, home to the White Thai people.  Enjoy dinner and an overnight stay at our comfortable eco lodge featuring a swimming pool to cool off in after an afternoon of cycling."},{"title":"Day 4: Drive to Xam Khoe Village, home to Thai ethnic minority, home cooked lunch with a local family.","description":"After breakfast, drive to Xam Khoe Village and set off on a walking tour to Buoc Village populated by the Thai ethnic minority people, the terrain is mainly flat, sticking to the valley floor traversing the network of banks separating rice paddy fields.  Enjoy local hospitality in a simple stilt-house and a home-cooked lunch prepared by our host family. Take a short drive back to Mai Chau with a stop en route to explore the magnificent Van Mai Valley."},{"title":"Day 5: Continue to Ninh Binh, likened to an inland Halong Bay.","description":"This morning is left free to enjoy a leisurely breakfast. Drive to Ninh Binh in the afternoon. Whilst the town itself is fairly unremarkable, the area around Ninh Binh is beautiful, known for its impressive cave formations and network of waterways, lakes, temples and towering limestone peaks."},{"title":"Day 6: Bike ride through paddy fields to visit Dong Tam Village. Afternoon boat trip to explore cave complex.","description":"This morning stretch our legs as we cycle the back roads through picturesque local communities to Dong Tam village. After a break at a temple we head through the countryside towards the spectacular limestone peaks of Van Long, surrounded by paddy fields and meandering waterways. The landscape is truly spectacular. Our destination is the nearby village of Vuon Thi, where we enjoy a delicious traditional lunch prepared by friendly hill tribe villagers. \n \n After lunch, take a sampan ride along the charming Ngo Dong River to a cave complex, with time to explore the network of caves in the area. Return to Ninh Binh."},{"title":"Day 7: Morning drive to Ha Long Bay. Overnight cruise on a traditional junk boat, visit fishing village, sea kayaking.","description":"Leaving Ninh Binh after breakfast, we drive to the Gulf of Tonkin and the breath-taking scenery of Ha Long Bay. A UNESCO World Heritage Site and one of the most visually impressive landscapes in South East Asia, Halong Bay is the setting for an overnight cruise. Boarding just after midday, set sail towards Bai Tu Long Bay. Lunch is served shortly after embarking, there is ample time after lunch to sit back and admire the towering limestone islands topped by rainforest that Halong Bay is so famous for. \n \n We make a stop to visit a Vung Vieng fishing village by rowing boat or kayak, the choice is yours. The rest of the afternoon is spent further exploring the bay scattered with hundreds of islands and dotted with caves and grottoes. Dinner is served on board, a chance to sample fresh sea food and regional dishes, we anchor overnight in Bai Tu Long Bay.\n \n There are between 10-18 en-suite cabins on board with a restaurant, bar and sundeck area. All bedding is provided. Please be aware, the boat may not be exclusive to our group and consequently we may be sharing with other tourists."},{"title":"Day 8: Witness sunrise over Halong Bay. Visit Thien Canh Son caves. Return to Hanoi to take the Reunification Express overnight train to Hue.","description":"Sunrise takes place around 0630, if the weather is clear it's well worth making the effort to witness sunrise over the bay. A light breakfast of pastries, tea and coffee we disembark to visit the hidden Thien Canh Son caves with numerous stalactite and stalagmite limestone formations in an impressive cavern. Returning to our boat, continue to cruise in the bay. Brunch is served on board. \n \n Returning to Hon Gai harbor, rejoin our vehicle and drive back to Hanoi. The rest of the afternoon is free, with two day use rooms provided for the group to freshen up before we head to the central train station in Hanoi to board the Reunification Express overnight sleeper train to Hue, Vietnam's old imperial capital. \n \n We travel in soft sleeper compartments, with four passengers sharing each compartment with all bedding provided. Please note, breakfast will not be provided on the train, it's advisable to pick up snacks for the morning before boarding the train."},{"title":"Day 9: Travel to the Tu Duc Royal Tombs. Try kite making (and flying!) and visit the Imperial Palace.","description":"Arriving in Hue this morning, we enjoy some of the highlights of this historic city including a visit to the Royal Palace with its Terracotta Warriors guarding the entrance and the iconic Thien Mu Pagoda, home to the oldest monastery in the city. We also visit the house of a national champion kite flier for Vietnam where we are shown how to make traditional Vietnamese kites. Taking time to decorate our kites with iconic symbols such as dragons, birds and peacocks, we take our completed kites to the nearby Citadel grounds to try them out. The Citadel is an impressive monument that is almost 10 km in circumference with the Imperial City located in the centre of the Citadel which is more than 600m long on each side. Access to the Imperial City can be made by four entrance gates although the Noon Gate is only used for the King."},{"title":"Day 10: Hoi An. Martial arts lesson. Make traditional wood paintings, cruise on the Perfume River.","description":"Journey to Trieu Son village, located by the Perfume River on Hue's outskirts for a guided walk and boat ride. First stop is Sinh village where we meet a local family that specializes in making wood paintings.\n \n Later in the morning, take to the open road on a leisurely cycle ride around the village and along countryside lanes to Thanh Tien village, famous for paper flowers. Criss crossing an intricate network of paddy fields, we arrive at Tien Non village where we board our cruise boat, taking us back to Hue (total cycling distance is approximately 6km). \n \n An included martial arts lesson is our next stop with a visit to a dedicated martial arts school that practices the Vietnamese art of Kinh Van, Vietnam's equivalent to Kung Fu, based upon defence techniques from the actions of a tiger, cobra, and bird. The owner's ancestors were chosen to guard the Vietnamese king; knowledge has been passed down from generation to generation to our host, who has been intrusted with teaching this ancient art. Travel over the Truong Son Mountains and through the Hai Van Pass as featured on the TV programme, Top Gear, to the historic merchant seaside town of Hoi An."},{"title":"Day 11: Free day in Hoi An, opportunity to spend the day on the beach.","description":"The morning is free to wander through the historic heart of this World Heritage Site, taking in the wonderfully preserved buildings of what was once one of the busiest trading outposts in South East Asia. Discovering this delightful town, we recommend an early morning visit to Hoi An's fish market which presents the perfect setting for some great photographs.\n \n Wander through Hoi An's historic collection of traditional wooden houses and Chinese temples. This afternoon you could hire bicycles and explore the surrounding countryside, experience a gentle river cruise, or grab the chance to visit some of Hoi An's famous tailor shops. Alternatively take a 20 minute taxi ride to the nearby coast to spend the day on the beach."},{"title":"Day 12: Fly to Ho Chi Minh City. Explore the old quarter in cyclos (cycle carriages with a seat).","description":"Drive to Danang, fly to Ho Chi Minh City. Explore Old Saigon, and discover 'Secret Weapons Bunker'\n \n This afternoon we will experience a different side of Ho Chi Minh City, away from the major sights where we take a walk through Old Saigon's back alleys. We make our way to District 3 by cyclo (cycle carriages with a seat at the front) and turn off the main thoroughfare and into the maze of narrow streets of this bustling district. Our walk takes us past ramshackle shopfronts, through local markets selling anything from colourful fruit to bootleg DVDs, and past houses, churches and schools, all squeezed into the small buildings that line the narrow alleys. It's a fascinating inter-connected community here that is a stones-throw from the city centre, yet feels a far cry from the modern buildings and throngs of tourists. We stop at a local stall for a traditional Vietnamese coffee (brewed coffee served sweet with condensed milk) where we can also sample 'Banh Mi' - a Vietnamese take on the humble French baguette - freshly baked and packed with a combo of traditional and more exotic, aromatic ingredients.\n \n The walk ends the so-called 'secret weapons' bunker'. A small unassuming 'tube house' nestled in a quiet neighbourhood hides a trap door in the floor, concealing a basement stocked full of rifles, grenades and ammunition. The bunker played a key role in the TET Offensive of 1968, it was the base from which the Viet Cong's \"Team 5\" launched their assault, and its location was only revealed after the end of the war. We have some time to explore the house and bunker, filled with decommissioned weapons and photographs, news clippings and memorabilia from the wartime."},{"title":"Day 13: Discover the Cu Chi Tunnels which the Viet Cong used as a hideout during the Vietnam War.","description":"After breakfast this morning drive to visit the infamous Cu Chi tunnels. First constructed by the Vietnamese during their colonial war with the French, the tunnels were later greatly expanded and went on to achieve notoriety during the Vietnam War, when they served as an underground command base for 10,000 Viet Cong troops. Exploring Cu Chi gives some idea as to the conditions that the Vietnamese had to endure (the tunnels are narrow and can be quite claustrophobic). The afternoon allows for more time in the city including an optional visit to the waterpark, a great way to cool off from the mid-day sun."},{"title":"Day 14: Drive to the Mekong Delta, overnight homestay, explore villages by bike.","description":"Leaving the city, journey to the Mekong Delta and board a boat to the start point of our cycle ride. We cycle for around 10-12 km along the flat Cai Thai village path with constant views of the delta as we wind our way around its many tributaries. The route is often shaded which is helpful to combat the humidity (the boat can pick up cyclists at various stopping points if required). Along the way, we visit Mrs Nani's home who will show us how to make rice paper in the traditional way and Mr and Mrs Chin's home who will provide refreshments that include her famous 'Banh Tieu' (traditional doughnut). \n \n Returning to our cruise boat for lunch on-board, we continue sailing along the delta to our night stop. Transferring from our cruise boat to a sampan craft, a small traditional boat regularly used by the villagers to travel along the delta, make the short journey to a traditional homestay, set in a lovely garden setting with a main lounge area and dining room, accommodation is en-suite (shower and toilet) with traditional décor throughout. After settling into our simple but clean accommodation, embark on a gastronomic experience as we take part in a Vietnamese cooking lesson. Typically our hosts usually give a traditional dancing and singing show to accompany the evening meal."},{"title":"Day 15: Morning cruise on the Mekong Delta. Drive back to Ho Chi Minh City where the trip ends.","description":"Leaving the homestay behind, cruise back along the Mekong delta passing small floating markets and soaking up the atmosphere of this unique trading point, a vast network of rivers and islands that crisscross agricultural villages, paddy fields and mangrove swamps. Bidding farewell to our boat crew, drive back to Ho Chi Minh City.\n \n We will aim to be back at Ho Chi Minh City around 3pm. For those with evening flights, a day use room will be provided. If you would like to receive a complimentary airport transfer today, you need to depart from Saigon's Tan Son Nhat International Airport (airport code SGN). The earliest your flight can depart is 5pm.\n \n Why not extend your trip to Indochina with three nights on the tropical white sand beaches of Phu Quoc Island? Nestled in the warm waters of the Gulf of Thailand this Vietnamese island is 90% national park, a thick-rainforest interior framed by idyllic white sand beaches. Easily accessible by a short flight from Hanoi, Siem Reap or Ho Chi Minh City, this is a great way to unwind after an action-packed trip in Indochina."}]}]