[{"name":"Mystique Vietnam in 12 Days/ Mai Chau- Mai Hich - Ha Giang - Sapa - Bac Ha","duration":12,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":2330,"price":1165,"summary":"A breathtaking landscape of mountainous areas located in the north of Vietnam. Hanoi warmly welcomes your very first footsteps into the enticing streets named after their craft guides in the past with a bunch of delectable food and drink. After your relaxation, turn over a new leaf to the intact beauty of nature. All immense and imposing views of mountainous area unable to be captured by any photograph or packed into a word, will show up at a single glance and absorb any travelers. Ba Vi, Mai Hich, Pu Luong, Nghia Lo, Mu Cang Chai, Sapa, Bac Ha will be the names staying for a lifetime. Return to the capital of Vietnam, the journey will enormously appeal to you by boat and cruise excursions. Ultimately, Hanoi is saying the biggest farewells to its new fellows.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c16.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e4faa7c2c179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191902_5e3d4b4e86c1a.jpg"],"destinations":["Hanoi","Mai Chau","Sapa","Ninh Binh","Halong Bay"],"timeline":[{"title":"WELCOME TO VIETNAM – HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Our driver will meet and greet you at the airport. You will be escorted to the hotel by private transportation. Check-in to the hotel and get over the jet lag. After enjoying the first day yourself and return to the hotel for a relaxing sleep.\nOvernight in Hanoi"},{"title":"HANOI LEISURE DAY (B)","description":"Today you have free time to explore the city at your own pace.\n\nOvernight in Hanoi"},{"title":"HANOI - MAI HICH (B)","description":"Leave Hanoi at 8am and travel towards Mai Hich, Mai Chau. The peaceful town of Mai Hich is situated in a stunningly beautiful valley surrounded by verdant green mountains and is famed for its breathtaking scenery and friendly hill tribe peoples. Enjoying the tranquility of the paddy fields and interacting with the local people. Limestone peaks climb in the background and banks of green line the road, and you’ll take regular stops to admire the view across the lush valleys. Upon arrival in Mai Hich, you will meet and greeted by the village hosts at the local homestay.\n\nIn the afternoon, walking or cycling to discover the surrounding villages, and enjoy the beauty of surrounding nature, there's also the opportunity to help local farmers plant rice seeds into the fields.\n\nTonight you’ll enjoy local hospitality in a simple homestay in the village. You can join your host in cooking dinner or even a chance to sample some of the local wine produced in the region.\n\nOvernight in Mai Hich"},{"title":"MAI HICH – PU LUONG – MAI HICH (B)","description":"You will leave Mai Hich for the Pu Luong Nature Reserve where the white Thai and Muong ethnic groups live. While strolling in the park, you will admire a very rich fauna and flora, composed of a multitude of birds and exotic plants. You will then settle into your lodge and have the afternoon free to enjoy the charming vibes around you. Ride through small towns and wave to friendly locals on your way through picture-perfect Vietnam – lush green fields, towering limestone mountains, tranquil waterways and charming historic sites. This is a wonderful chance to see everyday rural life in action as well as take in the beautiful countryside.\n\nOvernight in Mai Hich"},{"title":"MAI CHAU- NGHIA LO (B)","description":"Have departure towards Nghia Lo, Yen Bai. Some stops are planned on the way to visit ethnic villages, you will have an opportunity to meet Hmong and Thai people along the wat. In particular, you will see fields of tea plantation as far as the eye can see and you can enjoy a picturesque landscape during the blossoms season of peach and plum trees, which takes place in late January - early February. You will reach the Muong Lo Valley, where the town of Nghia Lo is located in the late afternoon. Muong Lo is the second largest rice granary in the northwest and is also the capital of the Thai ethnic group.\n\nOvernight in Muong Lo"},{"title":"NGHIA LO – MU CANG CHAI (B)","description":"Breakfast with the locals and departure by air-conditioned vehicle. The road winds along the Hoang Lien Son range, where the tallest mountains of Indochina are found. Start the trekking from Tu Le, you will cross rice terraces and suspension bridges to reach the Thai and H’mông villages. The local people here will welcome you with open arms wide smiles. After lunch at Tu Le, continue your trip to North Vietnam. You will reach the Khau Pha pass, one of the most winding pass of Vietnam, which is the ideal place to get the most beautiful photos on the rice terraces. The landscapes are of exceptional beauty with cultivated valleys and mountains with rice terraces. Mu Cang Chai is considered an unique paradise and one of the best places in Vietnam for landscape photographers.\n\nOvernight at homestay"},{"title":"MU CANG CHAI - SAPA (B)","description":"Depart from Mu Cang Chai to Sapa via Than Uyen. Stop at the top of the pass to enjoy the freshness and see the roof of Indochina, Mount Fansipan (3143m). Once you arrive in Sapa, enjoy some free time to rest your legs. The afternoon is devoted to hiking in the Hoang Lien Son valley, passing through rice terraces, local villages, meeting black Hmongs, red Dzaos .... Night in Sapa."},{"title":"SAPA – BAC HA (B)","description":"After breakfast at your homestay and trek to Giang Ta Phin village – home to the Red Dzao and Black Hmong people. Push on through 18 kilometres of terraced farmland and bamboo scrub for excellent views of emerald valleys and rushing waterfalls as you stroll on by. Take a picnic lunch along the way, then depart by bus to Bac Ha"},{"title":"BAC HA - HANOI (B)","description":"After breakfast at your homestay, visit the Bac Ha fairground market. This is a great place to pick up locally dyed fabrics, hemp plants and handmade textiles. Depending on your availability, you can witness the extraordinary atmosphere of the ethnic markets around this region:\n\nTuesday: Coc Ly market\nWednesday: Sin Cheng market\nThursday: Cao Son market Lun Khau Nhin market.\nSaturday: Can Cau market\nSunday: Bac Ha market\nAfter that, hop on the bus and travel back to Hanoi\n\nOvernight in Hanoi"},{"title":"HANOI – NINH BINH (B)","description":"After breakfast, your English–speaking guide will meet you at the hotel at between 8 am and 8.30 am. You will be transferred by a professional driver from Hanoi to Hoa Lu, which is located 80km to the South of Hanoi. This is the ancient capital of Vietnam in the 10th century and your guide will tell you all about the history of Le and Dinh Dynasties, who ruled this antique citadel.\n\nEnjoy a Vietnamese traditional lunch before boarding into a private sampan to visit Tam Coc, well-known as “Halong Bay inland” and see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. You will then continue with a cycling tour through the stunning scenery of rice fields, karst formations, river and tranquil village (around 5km).\n\nIn the evening, return to Hanoi and enjoy a lovely night on your own.\n\nOvernight on cruise"},{"title":"HANOI – HALONG BAY (B/L/D)","description":"Breakfast at the hotel.Get pick-up by the Cruise at 7:30. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes.\n\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\n\nOvernight on cruise"},{"title":"HALONG BAY - HANOI (B/L)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Then complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Vietnam Beach Vacation 15 Days","duration":15,"travelStyle":["Beach","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1100,"summary":"Bask in sun and culture while exploring one of Asia’s prettiest coastlines in Vietnam.\nThis fifteen-day adventure includes visits to Vietnam’s premier coastal destinations of Hoi An, Halong Bay, Nha Trang and Mui Ne. Enjoy highlights of each destination in this exciting country while perfecting your tan in tropical leisure!\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/134009_4c312e03.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/134009_4c312e03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_c499610b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_c6e9ebe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_bd691ff1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_e1c6c495.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_a5a4a78b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_37346e2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_25f5317d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_1859c3f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_9f132357.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_0b2c2f46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_e8561bc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_b2b71ea7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_ca66ef64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134009_09a505ae.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Can Tho","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Sai Gon (No Meal)","description":"Arrival Ho Chi Minh city\nWelcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture\nOvernight in Ho Chi Minh"},{"title":"Day 2: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"Ben Tre is the best option for a day trip to the Mekong Delta from Saigon, since it is only around 2 hours away, and 15 minutes from My Tho. However, this wonderful destination retains an authenticity which has been somewhat lessened in nearby My Tho.\n\nThis picturesque and friendly Mekong Delta town has historically seen very few travelers, but the recent opening of a bridge connecting Ben Tre and My Tho has made it far easier for day trippers to visit from Saigon.\n\nOur one day cruise excursion starts at 8:00 am from the lobby of your hotel in Saigon with a drive to Ben Tre. While there, you can take a walk along the waterfront, lined with French era shops and houses, and you'll see plenty of coconuts being unloaded from boats for dispatch around the country. Then, jump on a boat for a couple of hours of cruising on the Mekong River. You will enjoy your delicious lunch at a local restaurant or on board. The excursion will end at around 4:00pm where the vehicle will await you for your transfer back to Saigon.\nOvernight in Ho Chi Minh"},{"title":"Day 3: Ho Chi Minh- bus to Mui Ne (meal incl: B)","description":"Departing early in the morning 8:00- 8:30 AM, head by bus to the beach town of Mui Ne –about 220 kilometres from Ho Chi Minh City. This is a wildly popular place for water sports like windsurfing and kitesurfing, and its giant sand dunes are ideal for jeep safaris. The area is also famous for its cheap, fresh seafood. The days will whizz by as you enjoy your last beach adventures and sunsets.\nOvernight in Mui Ne"},{"title":"Day 4: Mui Ne free at leisure (meal incl: B)","description":"Free and easy. Breakfast at your hotel.\nOvernight in Mui Ne."},{"title":"Day 5: Mui Ne-bus to Ho Chi Minh (meal: B)","description":"After having breakfast, the local bus picks up and then take you to come back Ho Chi Minh city.\nArrive Ho Chi Minh and free time\nOvernight in Ho Chi Minh."},{"title":"Day 6: Ho Chi Minh- flight to Nha Trang (meal incl: B)","description":"This day you will take a domestic flight from Ho Chi Minh to Nha Trang. Aside from a lovely beach, Nha Trang has islands where you can snorkel and scuba dive in search of tropical fish and coral. \nOvernight in Nha Trang."},{"title":"Day 7: Nha Trang (meal incl: B)","description":"Enjoy another day at your leisure. Soak up Nha Trang’s tropical beauty with day-trips to secluded beaches on Nha Trang’s periphery including Jungle Beach and Long Beach. Alternatively, head to the photographer’s paradise at the Hon Khoi Salt Fields for some amazing photographs."},{"title":"Day 8: Nha Trang- flight to Da Nang (meal incl: B)","description":"Have a breakfast at hotel.\nFree time until departure tiime, the driver transfer to the airport for your domestic flight from Nha Trang to Da Nang.\nArrive Da Nang, transfer to Hoi An and enjoy your time to discover Hoi An old town.\nOvernight in Hoi An."},{"title":"Day 9: Hoi An- Cham island day tour- Da Nang (meals incl: B/L)","description":"Going to Cu Lao Cham, you will experience the feeling of riding on the surf waves by high speed canoes, heading to this beautiful island.\n\nYou arrive at Lang village and the tour guide will help us understand more about Cham island with its history. Make a visit to the Marine Protected Area, the boat shelter, Hai Tang pagoda, traditional fishing village and the local market, then trek for 20 minutes to Chong village with very nice sloping and winding road and amazing view of the sea, sand and we sometimes can see some wild monkeys on the way if we are lucky enough. Go swimming, snorkeling and having lunch with some seafood. \n15:00 back to Hoi An town, the driver transfer to Da Nang.\nOvernight in Da Nang.\n"},{"title":"Day 10: Da Nang- Ba Na hills-golden bridge (meals incl: B/L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills. \n08:45 am: Arrive Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch). \nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. \nThen, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. \nBack to Danang by car around 04:00 pm. Drop-off at hotel.\n"},{"title":"Day 11: Da Nang- flight to Ha Noi (meal incl: B)","description":"In the morning, free time for having breakfast, sunbathing and discover Da Nang city.\nCheck out and the driver takes you to the airport for your flight to Ha Noi.\nArrive Ha Noi, free time to discover Ha Noi Old Quarter.\nOvernight in Ha Noi."},{"title":"Day 12: Ha Noi- Ha Long bay, overnight on cruise (meals incl: B/ L/ D)","description":"8:00- 8:30 Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12:00- 12:30 Embark on the Cruise followed by a short cruise briefing.\n13:00 Savor a delectable lunch as Ha Long cruises among the limestone islands.\n14:00- 16:00 Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay\n16:00- 17:00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17:00- 17:30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way\n17:30- 19:00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19:00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on Ha Long Cruise in the middle of Ha Long Bay\n"},{"title":"Day 13: Ha Long Bay- Ha Noi (meals incl: B/L)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi.\n17:00 arrive Ha Noi\n\n"},{"title":"Day 14: Ha Noi city full day (meals incl: B/ L)","description":"This full day tour takes you around Hanoi's most interesting sights, including the Ho Chi Minh Complex: Ho Chi Minh's Mausoleum and his Stilts House, the Presidential Palace and the One Pillar Pagoda and, nearby, the Old Quarter also known as the 36 streets and guilds. Also on the tour, the Lake of the Restored Sword and Ngoc Son Temple, the Temple of Literature, peaceful West Lake (with lovers street Thanh Nien), the sedate Tran Quoc Pagoda and Quan Thanh Temple and one of the city's museums, either the History Museum or the Ethnology Museum.\nOvernight in Ha Noi"},{"title":"Day 15: Hanoi departure (meal incl:B)","description":"No activities for today, just wait for transfer to Hanoi airport to take your own flight. End of services !\n"}]},{"name":"Through Viet Nam 13 Days 12 Nights from Hanoi to Ho Chi Minh City","duration":13,"travelStyle":["Holiday","Group","Partially Guided"],"oldPrice":0,"price":740,"summary":"Hanoi: Capital of Vietnam with French style old buildings, lakes, Old Quarter Area\nSaPa: This is best trekking route for travellers with many ethnic groups and terraces rice field\nHa Long Bay: UNESCO world heritage site, famous for its fresh and calm water filled with thousands of islands and islets\nHoi An: Only 30KM from Da Nang, Hoi An is a beautiful, old town with historic architecture, traditional culture and textiles.\nHo Chi Minh City: Biggest city of Vietnam which is famous with Ben Thanh market and war relics, nightlife\nMekong Delta: Vietnam’s biggest agricultural region, the country’s rice basket with colorful floating markets, fruit orchards, rice paddies, bird sanctuaries and quaint villages","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/169673_b4649079.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/169673_b4649079.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_3b70c637.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_68ef8dcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_347a62e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_e1be2baf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_d27fa502.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_16337f25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_6ee963d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_25765dfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_dd2a23e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_8642b2df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_c40841eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169673_50764419.jpg"],"destinations":["Hanoi","Cat Cat Village","Lao Cai","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Ha Noi Arrival ( No Meal)","description":"Arrive in VietNam. The driver and car pick you up at the airport, then transfer you to your hotel for check in.\nThe rest of day is your own at your leisure.\nOvernight in the hotel in Hanoi.\n"},{"title":"Day 2: : Hanoi - Sapa - Lao Chai and Ta Van Village (Breakfast, Lunch, Dinner)","description":"6:30 – 7:00 Tour guide pick you up at your hotel, departure to Lao Cai city.Travelling on new Highway Noi Bai, It will take around 5 hours.\n12:30. Arrival in Sapa town, enjoy lunch in a local restaurant.\n13:00: Bus will take you to the gate of Lao chai village start trekking to Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. Journey will stop at Giang Ta Chai village.\n17:00 Come back to Sapa Town, having dinner and overnigh in hotel. End of the first day.\n"},{"title":"Day 3: Sapa - Cat Cat village - Hanoi (Breakfast, Lunch)","description":"8.00: Driver and guide take you back Sapa to rejoin group together visit Cat Cat village.\n9.00: Exploring Cat Cat – Shin chai village of H’mong – a colonial French discovered area and a renowned resort to officials from the early twentieth century. Arriving to Cat Cat village, visitors will be visit the Hydropower station, the waterfall of Cat Cat village, as well as learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.\n12.00 : Pick up from Cat Cat village and back to Sapa town.  Enjoy a meal at a local restaurant.\nFree time to visit or shopping souvenir\n16.00: Driver take you back to Hanoi. End of tour.\nOvernight in hotel in Hanoi.\n"},{"title":"Day 4: Hanoi - Ha Long Bay overnight on Cruise (Breakfast, Lunch, Dinner)","description":"07:45 - 08:30 Meet your tour guide then go for Ha Long Bay. Have a break 20 minutes en-route to free your legs.\nEmbark harbor, board Cruise by a tender. Enjoy a welcome drink, receive cruise briefing. \nSavor lunch on board and visit Sung Sot amazing cave with millions of surprising stalactites and stalagmites.\nStop at Titop Island one hour for swimming, sun-bathing… \nDrop anchor in a calm water area, relax on the sundeck at sunset, taste some local wine, fruits.\nJoin in a cooking session on board with our chef making some special dishes with suggested recipe.\n19:00 Have dinner on board. Have fun with karaoke singing, or try your luck with squid-fishing. \nOvernight on cruise in the middle of Ha Long Bay."},{"title":"Day 5: Ha Long Bay - Hanoi flight to Hue City (Breakfast, Lunch)","description":"07:00 Enjoy a new day with complimentary tea and coffee served. Have breakfast on board\nDo kayaking the best way to explore true beauty of Ha Long.\nCheck out your cabin. Photograph wonderful views of Ha Long while sailing back to harbor.\n11:00:  Savor lunch on board and leave  Cruise.\n12: 30:  Say goodbye to Ha Long Bay then return to Hanoi. Have a rest en-route again to free your legs.\n17:00 Arrive Hanoi, the driver pick you at your hotel transfer to the airport take flight to Hue \nArrive Hue, pick up from airport to hotel. check in hotel\nOvernight in Hue city "},{"title":"Day 6: Hue City Tour (Breakfast, Lunch)","description":"In the morning:\n07h30 – 8:15 AM: Our driver will pick you up at your hotel in Hue for one day tour conquering beautiful Hue city. Start your day with a visit Minh Mang King’s Tomb – most majestic of all Nguyen Dynasty royal tombs with a complex of 40 constructions: palaces, temples, pavilions, etc. Many said that it’s a perfect combination of the manmade and natural beauty of Hue, where architecture fits harmony into the surrounding landscape.\nThen keep moving to visit Khai Dinh King’s Tomb with a blend of Western and Eastern architecture. Spend 45 minutes visiting this tomb and then get back to the car to visit another tomb.\nThe next visit will be traditional Martial Art Van An which was originated in the Nguyen Dynasty. Then spend another 15 minutes visiting conical hat and incense making village.\nAnd end the morning tour up by visiting the Tu Duc King’s Tomb\nIn the afternoon:\nEnjoy lunch at the local restaurant.\nAfter lunch, visit the Imperial Citadel which is known as the last royal dynasty of Vietnam. Then visit Thien Mu pagoda which is the oldest pagoda in Hue city. You will cruise along the Perfume River about 45 minutes before getting back to Hue City.\nAt 4.00- 4.30 pm: Arrive at the dock and ends Hue city tour full day.\n\n"},{"title":"Day 7: Hue - Hoi An by bus (Breakfast)","description":"7:00 Have a breafast \n8:00 Shuttle bus pick up at your hotel departure to the airport heading down to Hoi an. On the way we stop at the Hai Van Pass, Lang Co Beach and the Marble Mountains.\n In the afternoon we will have time to stroll through the charming Hoi An. The architecture of Hoi An has no equal, with its low houses and wooden painted facades. Visit the Japanese Bridge, which according to local legend is indestructible. We enter the Pottery Museum, the amazing Tan Ky house (which was the first monument of historic interest) and the cantons temple.\nHoi An is a city where you can travel on your own, at ease. Thus, we haven’t included a guided tour, but if you’re interested, you can contact us and we will include one for you.\n"},{"title":"Day 8: Hoi An Free Day (Breakfast)","description":"You have this day free in Hoi An to explore the city at your own pace, there are many things that you can find in the shops in the city. Hoi An is famous for its tailors and its shoemakers. Overnight stay in Hoi An."},{"title":"Day 9: Hoi An - Da Nang flight to Sai Gon (Breakfast","description":"You have this day free in Hoi An to explore the city at your own pace, there are many things that you can find in the shops in the city. Hoi An is famous for its tailors and its shoemakers. \nAfternoon my driver will pick you up at your hotel transfer to the airport to take flight to Sai Gon "},{"title":"Day 10: Ho Chi Minh City + Cu Chi Tunnels","description":"AM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. Discovery Saigon at night by yourself. Overnight in Saigon.\n\n"},{"title":"Day 11: Ho Chi Minh City -My Tho – Ben Tre – Can Tho (Breakfast, Lunch)","description":"Leaving Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrival at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel. Free time to visit bustling Can Tho market."},{"title":"Day 12: Phong Dien – Cai Rang Floating market – Ho Chi Minh City (Breakfast, Lunch)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river ( Bassac River), then proceed to visit Cai Răng floating market (& Phong Dien is optional), which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to HCM city. Overnight in Sai Gon.\n"},{"title":"Day 13: Ho Chi Minh Departure (Breakfast)","description":"Breakfast at your hotel. You have free time to shopping. Then check out and transfer to the airport. End of the service"}]},{"name":"6 Days Northern Vietnam tour with Sapa Adventure, Max 6 Guests","duration":6,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":949,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nIn addition to learning about the history and culture of Vietnam in Hanoi, this 6-day northern tour of Vietnam will take you to appreciate the beautiful terrace scenery of Sapa. You will have plenty of time to hike in the picturesque mountain villages of Sapa and experience the natural scenery of northern Vietnam. Of course, when we return to Hanoi, we will not miss the charming Halong Bay cruise trip.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/176815_1ecbd032.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/176815_1ecbd032.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176815_ac14f945.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176815_82d9165e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176815_469573f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176815_b1b63023.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176815_774b24ff.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"Day 01: Arrival in Hanoi","description":"After claiming your luggage and clearing customs, you will find our guide waiting for you at the Arrival Hall. Then you will be transferred to the hotel in the city center. After a short break, we will take you to the very heart of this capital city for an orientation tour to the most popular sightseeing spots: the Opera House, the Old Quarter, Hoan Kiem Lake and Ngoc Son Temple. A welcome dinner of genuine Vietnamese food is served for you at a local best restaurant in the evening.\nMeal: Dinner\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 02: Hanoi - Lao Cai","description":"We will first proceed to Ba Dihn Square to visit the Ho Chi Minh Complex (it is closed every Monday, Friday & annual maintenance during Sept-Nov), the nearby One Pillar Pagoda and the Presidential Palace. Afterwards, we explore the Temple of Literature, Quan Thanh Temple, the sedate Tran Quoc Pagoda, West Lake and the Temple of Literature. We also have chance to visit one of the city's museums, either the History Museum or the Ethnology Museum based on your interests. A lively traditional Water Puppet Show is scheduled for you next. You will then be driven to the railway station to take an overnight train to Lao Cai. \nMeals: Breakfast, Lunch\nAccommodation: an overnight soft sleeper train "},{"title":"Day 03: Lao Cai - Sapa","description":"When the train gets to Lao Cai in the early morning, our local guide and driver will pick you up from the railway station and drive to Sapa. After breakfast and a short rest, our guide will take you to trek through the terraced rice fields to enjoy the impressive landscape. After that, we will visit two hill villages - Cat Cat and Sin Chai. We leave the remainder of the day free for you to relax on your own.\nMeal: Breakfast\nAccommodation: Pistachio Hotel Sapa (4 stars) or similar"},{"title":"Day 04: Sapa - Hanoi","description":"Our guide will accompany you to take a scenic hike through yawning valleys and hill tribe villages. You get three choices for the hiking today: soft trek (3 km), medium trek (6 km) and long trek (12km). You will get chance to interact with the H'mong, Dzao and Dzay minority people. Lunch is served at one of the hill tribe villages. After completing the tour today, we will transfer you to Lao Cai to board the overnight train back to Hanoi.  \n\nMeals: Breakfast, Lunch\nAccommodation: an overnight soft sleeper train "},{"title":"Day 05: Hanoi - Halong Bay","description":"The train arrives in Hanoi in the early morning. You will take way to hotel nearby the railway station. After having breakfast and a short break, you will be transferred to enjoy another highlight in the Hanoi holiday package: the Halong Bay. We will arrive at noon since the drive takes about 3 to 3.5hours. You then spend the next 24 hours on Signature Cruise in the bay. A tasty lunch with fresh seafood is served on board. En route, you will visit one of the main caves. If weather permits, the ship will stop at an island cove with a sheltered sugar-white sand beach and you can take a dip in the clean and warm water of the Tonkin Gulf. Stay overnight on the ship.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Signature Cruise (4 stars) – Junior Suite"},{"title":"Day 06: Halong Bay - Departure from Hanoi","description":"Enjoy the sunrise or practise Tai Chi under instructions on the top deck if you like. After having a cup of wake-up coffee or tea, you will visit nearby islands by rowboat. Brunch is served as our cruise returns to Halong. Our driver is ready to meet you at the dock and transfer you to the airport to take your outbound flight.\n\nIf you have extra time for the vocation and want to visit other fantastic cites or neighboring countries, we've got extensive options for you to select from. Let's go on to have more fun!\n\nMeal: Brunch"}]},{"name":"Vietnam - A Heart Touching Beauty (Ho Chi Minh/ Nha Trang/Hoi An/ Halong Bay/Hanoi)","duration":12,"travelStyle":["Flexi","Group","Partially Guided","Holiday"],"oldPrice":0,"price":990,"summary":"Start in Ho Chi Minh City and end in Hanoi! With the sightseeing tour Vietnam a heart touching beauty in 12 days - c, you have a 12 day tour package taking you through Ho Chi Minh City, Vietnam and 8 other destinations in Vietnam. Vietnam a heart touching beauty in 12 days - HCM/Nha Trang/ Hoi An/ Halong Bay includes accommodation in a hotel as well as flights, an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9bae04.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9bae04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9bf507.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9c0f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9c2980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9c4cd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9c6896.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9c8a69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9cadfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9cca1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9ce85d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158940_5e25d9e9dd976.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Welcome to Vietnam - Ho Chi Minh Arrival","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. \nUpon your arrival in the bustling Ho Chi Minh City, still called “Saigon” by many locals, your driver will welcomed you at the airport and then transfer you to your hotel . \nAfter check in room, take a rest after long flight. \nIn the afternoon, explore the city and shopping in Ben Thanh market. \nIn the evening, enjoy nightlife with night bar and beer corner at Bui Vien street\nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  \nMeal: None\nOvernight in Ho Chi Minh City Hotel"},{"title":"Ho Chi Minh City Sightseeing & Cu Chi Tunnels (B/L)","description":"Climb down small tunnels to get amazing experiences and blow your mind when special c know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, commandonstructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to centers, weapons factories, and storage. Moreover, taste We start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war. \nspecial tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish. \nReturn to Saigon and end the trip. \nPlease take notes: the Notre Dame Cathedral have been being restored (UNTIL 2022), so the guests just visit outside\nMeal: Beakfast, Lunch\nOvernight in Ho Chi Minh City Hotel"},{"title":"Discover \" Vietnamese Rice Bowl\" Full Day Tour (B/L)","description":"07:30 – 08:00AM-Pick you up at your hotel\nAn unforgettable way of seeing the Mekong Delta is driving along the provincial roads down on the Southern region of Vietnam through paddy rice field, pine-apple plantation, orchard and small hamlets (2 hours’ drive).\nAfter arrival in My Tho, you will ride on a local motor boat along Dragon Island, Unicorn Island, Phoenix Island, Turtle Island and stop at the famous Unicorn Island. While at the Unicorn Island, you will visit natural pure honey at a bee keeping farm, taste some honey wine, rice wine, banana wine…\nWalking on the village and taking rowing boat along the nature water coconut canal to see local’s daily life in Mekong Delta.\nFrom there, you will continue your motor boat trip to Ben Tre province to visit a handmade coconut candy workshop. Then transfer to a small motor boat and travel along the lush, green canals, and stop at local restaurant for Vietnamese lunch.\nAfter that going to another area on the Unicorn Island:\n+ Enjoying some kinds of tropical fruits at the orchard garden and listening to the Southern traditional music.\n+ Local boat will take you back to My Tho, then the bus will drive you back to Sai Gon.\n17:00 – 17:30-Drop off at your hotels.\nMeal: Breakfast and Lunch.\nOvernight in Ho Chi Minh City Hotel\n"},{"title":"Ho Chi Minh - Fly to Nha Trang - Beaches City (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Nha Trang. Upon arrival, transfer to your hotel, check in and free to explore the city and the beach.\nMeal: Breakfast.\nOvernight in NHA TRANG Hotel"},{"title":"Snorkeling Adventure (B/L)","description":"8:00-9:00 : PICK UP AND TRANSFER TO NHA TRANG PORT\n10:00 : MARINE PARK\n* See the Coral Reefs by 3 methods: \n- Snorkeling on the surface\n- Take a Glass Bottom Boat (optional at extra charge)\n- Scuba Diving Package (optional at extra charge)\n12:00 : PRIVATE ROBINSON OASIS *HOT 2020*\n- Have Lunch at ROBINSON Restaurant\n- Relaxing or Swimming on the Beach\n14:00 : LIVE SHOW MUSIC - FLOATING BAR\n- Live Show Music with more than 20 languages\n- Floating Bar with Funny Dance\n16:00 : End the trip and take you back to mainland.\n*Included: All entrance fees, Car & Speed Boat, Guide, Lunch, fruit, wine, insurance, Live music, floating bar, chairs, Mask & Snorkel equipments, Kayaking…\nMeal: Breakfast and Lunch.\nOvernight in NHA TRANG Hotel"},{"title":"Journey to Hoi An, Da Nang- Flight included (B)","description":" Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Hoi An. Upon arrival, transfer to your hotel fpr check in. Free  to enjoy the pool. or you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags.\nMeal: Breakfast \nOvernight in HOI AN Hotel"},{"title":"Become a fisherman at Cam Thanh Village (B/L)","description":"\n\nCam Thanh eco fishing tour provides you with a close-up and intimate exposure to fishing communities. Discovering all manner of photo opportunities - coming and visiting a beautiful rice paddy field;. As well you will experience the friendliness of the local people greeting you along the way. You will also experience paddling the unique Vietnamese bamboo basket boat while the waterways of coconut palm paradise.\n•\t09h00: Getting on boat to a local farming village traveling along picturesque country roads . Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides.\n•\t09h30 :  You will have a chance to meet local fishermen and experience the daily life of their family .\n•\t10h15 :  Learn to paddle the strange and unique Vietnamese bamboo basket boats.\n•\t11h30 : You will join local fisherman on the river and enjoy hand-on experience of round net and cast net fishing\n•\t12h00:  Back to the restaurant for relaxing and enjoy lunch. \n•\t13h00:  Return the hotel by car\n \nMeal: Breakfast, lunch\nOvernight in HOI AN Hotel"},{"title":"Hoi An - Fly to Hanoi Captital - Street Food Tour (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Hoi An. Upon arrival, transfer to your hotel.\nLater, free to explore the Old Quarter, Hoan Kiem Lake.\n20:00 Ends one day17:30 The tour guide will pick up you to enjoy street food tour (walking and discover local life and street food)\nMeal: Breakfast.\nOvernight in HANOI Hotel\n"},{"title":"Hanoi Highlight Attractions tour with Water Puppet Show(B/L)","description":"The colonial capital city Hanoi is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago.\n\nAM: 7.45 – 8.15: Free pick up at your hotel. Then visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West lake (In the pagoda’s garden stands a Bồ Đề (Bodhi) tree, which is attached to a past story. In 1959, on one visit to Vietnam, Indian Prime Minister Razendia Prasat offered the Pagoda a bodhi tree as a gift. The plant was grafted from the holy bodhi tree where Sakyamuni sat in zen (meditation) position and achieved enlightenment in India 25 centuries ago) \n\nLunch at local restaurant.\n\nPM: After lunch proceed to visit the Ethnology Museum (apply on Sun, Tue, Thu &Sat), the Literature Temple, see Vietnam’s first university, constructed in 1070 - it’s gardens and well-preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters, and the beauty of Ngoc Son temple. At the end, journey through Hanoi’s Old Quarter, where you’ll then have a chance for some shopping and exploration. \nLater, you will enjoy a1000 years old vietnamese culture show: Water puppet show\nBack to your hotel for overnight stay\nMeal: Breakfast, Lunch\nOvernight in HANOI Hotel"},{"title":"Hanoi to the World's Wonder : Ha Long Bay (B/L/D)","description":"- 7:45 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. \n   - 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise. Meet the captain, crew and join us for welcome drink as we tell you about life onboard.\n   - Check into your cabin. Time to refresh and unwind.\n   - Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n  -  Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n  - Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n  - Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n  -  Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n   - After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\n   Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom\nMeals: Breakfast, lunch and dinner"},{"title":"Good morning in Ha Long Bay with Tai Chi - Back to Hanoi (B/L)","description":"Morning in the bay:\n- 6:30 – 6:45 Start  your day with Tai Chi exercises or a photo hunt\n- 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in 30-45 minutes.\n- 9:30am: We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store.\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and         more…\n- Join in the Cooking Class, teaching you how to make our specifically (Spring rolls) before an early lunch is served.\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina. \n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00\nNote: The itinerary above maybe changes by the effect of weather or different seasons\nMeals: Breakfast, lunch"},{"title":"Hanoi Departure with Big Thank for Travelling with us (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends AND SEE YOU FOR NEXT TRIP.\nMeal: Breakfast."}]},{"name":"10 Days Classic Vietnam trip from North to South, Max 6 Guests","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":1929,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nJoin this 10-day Vietnam holiday from North to South, you will visit Ho Chi Minh's Complex, cruise on Halong Bay and Mekong River, explore the ancient town, participate in a cooking class in Hoi An and visit the war relics and experience the local market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177217_971298e9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177217_971298e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177217_89062905.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177217_0ee481b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177217_03568fac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177217_e1436c79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177217_1b540a4d.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 01: Arrival in Hanoi","description":"Welcome to Hanoi: Vietnam’s bustling colonial capital. Your guide and driver will meet you outside the baggage claim of Noi Bai Airport and take you to your hotel in the city center. In the afternoon you will enjoy a cyclo tour through the Old Quarter’s narrow streets lined with French colonial buildings and stop at the peaceful Hoan Kiem Lake, followed by a gourmet dinner at a local fancy restaurant.\nMeal: Dinner\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 02: Hanoi City Tour","description":"Today you have a full day to explore Vietnam’s charming capital. Your city tour will take you to Hanoi’s key sites: Ho Chi Minh's Mausoleum (closed on Mondays, Fridays, afternoons & annual maintenance during Sept - Nov) and stilt house, the Presidential Palace, the nearby One Pillar Pagoda, the Temple of Literature, West Lake including the sedate Tran Quoc Pagoda & Quan Thanh Temple and one of the city's museums (a choice between the History Museum and the Ethnology Museum). Later in the afternoon, you will enjoy a traditional Water Puppet Performance, a unique Vietnamese art form hailing from Southeast Asia’s wet-rice culture. \nMeals: Breakfast, Lunch\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 03: Hanoi - Halong Bay","description":"Your pleasant Halong Bay cruise begins with a 3-hour nice scenic drive from Hanoi. Surrounded by emerald waters and ever so periodic sights of thousands of towering limestone cliffs and islands, you’ll never find another place like Halong Bay. It’s absolutely the best way to escape from the buzz of city life. There are also many optional activities like kayaking, swimming, diving, which will definitely make your journey much more fun.\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Signature Cruise (4 stars) or similar"},{"title":"Day 04: Halong Bay - Hanoi - Da Nang - Hoi An","description":"Have a wonderful morning to enjoy the beautiful Halong Bay and have a nice brunch on board. After that, disembark the cruise. Transfer to Noi Bai Airport of Hanoi for the flight to Danang. On arrival, you’ll be met by your local guide and driven to Hoi An. Have some fun on your own for the rest of the day.\nMeal: Brunch\nAccommodation: The Beach - Little Hoian Boutique (4 stars) or similar"},{"title":"Day 05: Hoi An (Walking tour & Boat trip)","description":"By leisurely wandering about the charming historic town, we can see many centuries-old intact buildings including the Japanese Bridge, Chinese Assembly Hall, Chua Ong Pagoda, Tan Ky ancestral house and some colonial architectures. After having lunch at a fancy restaurant, we'll take a pleasant boat trip to a nearby island village and learn about the villagers' traditional way of making pottery. Return to your hotel in the late afternoon. The evening is free for you to relax on your own.\nMeals: Breakfast, Lunch\nAccommodation: The Beach - Little Hoian Boutique (4 stars) or similar"},{"title":"Day 06: Hoi An","description":"Today enjoy a half day join-in cooking class in Hoian. Meet at the Hai Scout Cafe in Hoian’s Old Town. From there you will head to Hoian's colorful market. Explore the market and interact with local vendors to purchase some fresh ingredients for today’s cooking class. You will learn to cook some classic and authentic Vietnamese dishes, which will be served as your lunch later on. After the class, go back to the hotel and enjoy some leisure time in the afternoon. \nMeals: Breakfast, Lunch\nAccommodation: The Beach - Little Hoian Boutique (4 stars) or similar"},{"title":"Day 07: Hoi An - Da Nang - Ho Chi Minh City","description":"After breakfast, you will be transferred to the Da Nang Airport to catch a flight to Ho Chi Minh City. Upon arrival, our local guide and driver will pick you up at the airport and escort you to the hotel to check in. The rest of the day is free at leisure. \nMeal: Breakfast\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 08: Ho Chi Minh City","description":"Today, visit the immense network of underground complex, the Cu Chi Tunnels, which is of great importance to the history of Vietnam. You’ll head back to Ho Chi Minh City and then pay a visit to the War Remnants Museum and the Reunification Palace (the former Presidential Palace). For the following schedule, immerse yourself in the old culture and history of Vietnam with an amble to the Ben Thanh Market, the Old Saigon Post Office and the Dong Khoi Street (formerly Rue Catinat).\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 09: Ho Chi Minh City – Ben Tre – Ho Chi Minh City","description":"Today you will spend a day away from the busy city of Saigon and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong river. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where your car will take you to Ho Chi Minh City.\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 10: Departure from Ho Chi Minh City","description":"You can make the most of your leisure time to explore the city on your own before we transfer you to catch the flight to your next destination. We wish you a nice trip!\n\nMeal: Breakfast"}]},{"name":"6 Days Mekong Delta tour from Ho Chi Minh City, Max 6 Guests","duration":6,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1009,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nThis 6-day trip in southern Vietnam will surely make you experience the real customs of this country. We will depart from Ho Chi Minh City, which was colonized by France for a period of time, leaving behind many famous French buildings, such as the Saigon Central Post Office and Notre Dame Cathedral Basilica. You will also visit the remnants of the war, like Cu Chi Tunnels. Afterwards, we'll take you to Mekong Delta, where you can take a boat on the Ham Luong River to explore local countryside. Experience the local floating market and taste the fruits of the season, which will be the highlights of your trip.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/176835_979a8570.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/176835_979a8570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176835_e244096e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176835_c132e332.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176835_61f95be8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176835_cf41e886.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176835_06eaf19b.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang"],"timeline":[{"title":"Day 01: Arrival in Ho Chi Minh City","description":"Welcome to Vietnam’s financial hub: Saigon (Ho Chi Minh City). Upon arrival, our guide and driver will pick you up from the airport and transfer you to the hotel. We will treat you authentic Southern Vietnamese cuisine at a delightful restaurant in the evening.\nMeal: Dinner\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 02: Ho Chi Minh City","description":"Today we will first proceed to Saigon's China Town, then visit the FITO Museum on traditional Vietnamese medicine. Further onward to Ben Thanh Market to browse over a superb collection of goods. After lunch, we visit the War Remnants Museum and the Reunification Palace. We finish our afternoon at the neo-Romanesque Notre Dame Cathedral and the City's Centre Post Office. The evening program includes dinner and a night cruise on Saigon River for you to enjoy the city's charming night view.\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 03: Ho Chi Minh City","description":"We start the day by attending Ho Chi Minh Cooking Class, a fifty minutes drive from Saigon. You start with picking fresh vegetables and ingredients from the organic farm. Then you join the cooking class and make your own delicious dishes (length: 1 hour and 15 minutes) at the elbow of a master chef. After class, you will be escorted to visit the astonishing Cu Chi Tunnels.\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 04: Ho Chi Minh City - Ben Tre - Can Tho","description":"Today you will spend a day away from the busy city and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong river. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where we will head to Can Tho city - the heart of Mekong Delta.\nMeals: Breakfast, Lunch\nAccommodation: Victoria Can Tho Resort (4 stars) or similar"},{"title":"Day 05: Can Tho - Ho Chi Minh City","description":"In the morning, we make the boat cruise to see the Cai Rang floating market (the nicest one with heaps of rowing boats), truly highlights where you will enjoy the beautiful scenery and see the daily activities of the locals who live along the Mekong canals. Later, you will roam through the village to visit a rice husking mill, rice noodles making shop which are nice chances to discover the daily life of Vietnamese people in Mekong Delta. Around noon, we will transfer back to Saigon and you will have the rest of the time at leisure.\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 06: Departure from Ho Chi Minh City","description":"Your pleasant Southern Vietnam vacation comes to an end today as we transfer you to the airport and help you board the outbound flight. Should you wish to continue your Asian tour instead of going back home right away, we have some extension tour options for you to select from. Let's keep the wonderful experience going on!\n\nMeal: Breakfast"}]}]