[{"name":"Best Selling Vietnam Family Tour from Hanoi, Halong Bay to Hue by train then Hoi An, Saigon, Mekong Delta","duration":13,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1418,"summary":"This stunning Vietnam Tours marvel you with the triple regions of Northern, Central, and Southern Vietnam highlighting Halong Bay, Hanoi, Hue, Hoi An, Saigon, Mekong Delta with numerous activities involving cruises, floating markets, world heritage sites.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171058_983cd664.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171058_983cd664.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_9e67e536.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_31c5c618.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_92c23468.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_248dcd26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_21327784.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_4b0499ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_805b0ceb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_c0cc903b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_f2fbe8a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_4aa4f2c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_8c4c83f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_fc17f5a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_05fe45b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_fd44218d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_3adc02a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_c45a5156.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_c1b2853d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_be277140.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_b0a77578.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_1a99fb3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_8a23cc7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_5cb2d11f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171058_3f8cf6e9.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1 – ARRIVAL – HANOI","description":"Upon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Hanoi.\n"},{"title":"DAY 3 – HANOI – HALONG (GROUP TOUR) (B/L/D)","description":"07:30     Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30    Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30    Great lunch is served while cruising passing by islets.\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises."},{"title":"DAY 4 – HANOI GROUP WALKING TOUR – ½ DAY (B)","description":"After having breakfast at hotel, You will be picked up at hotel to commence our walking tour to visit the Ho Chi Minh Complex, which contains the mausoleum of the nation’s founder Ho Chi Minh, the Presidential Palace and the Ho Chi Minh’s house on stilts. Close to this complex is the One Pillar Pagoda, whose origins date back to the foundation of city. We follow it with a visit to the Temple of Literature, which is well known as the first university of Vietnam. Later on, we will take a short visit at Hilton Prison where Vietnamese soldiers did captured & detained American pilots from 1967 till 1973 to learn more about the history of Vietnam war against American Imperialists.\nAt around 16:00, there’ll be a “Water Puppet Show” prolonging roughly within 1 hour waiting for you. And you can walk by yourself from your hotel to the Water Puppet Theatre for around 3 – 5 minutes.\nO/N in Hanoi."},{"title":"DAY 5 – HANOI – FREE DAY – NIGHT TRAIN TO HUE (B)","description":"Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car).\nBy the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Hue on SE1 (19:30 – 08:50 +).\nOvernight on the train."},{"title":"DAY 6 – HUE RAILWAY STATION – HUE PRIVATE CITY TOUR (B/L)","description":"Upon getting to the Hue Railway Station, you’ll be welcomed & escorted to your hotel in Hue to drop your luggage and get leisure then if the hotel has rooms available, you’ll be allowed to get an early check-in.\nIn the afternoon, we have a boat trip on the romantically named Perfume River visits Hue’s best-known religious site, Thien Mu Pagoda. The beautiful riverside Thien Mu Pagoda is one of the oldest ancient architectural structures for religious work ship in Hue. We include this in a half day cruise on the Perfume River which also gives us a taste of the scenic countryside and an enjoyable visit to the mausoleum of Emperor Minh Mang in a tranquil setting of gardens and lakes.\nThis impressive landmark reflects the beautiful architecture, intricate decor and mysterious statues. Afterwards, We start our sightseeing tour with the massive citadel named the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945 including Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Forbidden Purple City. This royal residence was all but destroyed during the 1968 Tet Offensive, however it is still fascinating to walk among the ruins. Close to this masterpiece is Hue Imperial Museum which displays an interesting collections of bronzes, Chinaware, court robes and various emperors’ personal belongings.\nBy the end of the day, we will have one more chance to take a glancing tour of Hue with a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. Along the way we pass many fantastic eating spots, all ideal for visitors to sample some local delicacies.\nO/N in Hue."},{"title":"DAY 7 – HUE – DANANG – HOI AN (B)","description":"In this morning, after having breakfast at hotel, you’ll be at leisure to walk around your hotel to explore more hidden charms of Hue Ancient Capital by yourself. Later on, we’ll say goodbye to Hue to take a 4-hour scenic drive via Hai Van Pass to Da Nang, Hoi An that offers spectacular views of mountains, the sea, idyllic beaches and villages (we can choose the shorter way by driving through the tunnel).\nUpon arrival in Hoi An, you’ll be helped to check in at your hotel then free by yourself to relax either at your hotel or on the beach.\nO/N in Hoi An."},{"title":"DAY 8 – HOI AN – GROUP TOUR TO MY SON SANCTUARY – BOAT TRIP ON THU BON RIVER (B/)","description":"08:00 – 08:30 AM: Our guide picks you up at hotel and leave Hoi An for visiting My Son Holly Land – the ruins of Cham people and was an imperial city during Cham dynasty. Here you can have more chance to explore and understand of technique of Old Cham people in making red bricks to build Tower which still now a secret to everyone, you can see a large complex of religious relics that comprises more than 65 architectural works. It also surprises for those who are curious with architectural art.\nIn 1999, UNESCO labeled the Cham architecture in My Son as a World Cultural Heritage Site. Moreover, you have chance to enjoy traditional music performed by Cham girls in their colorful uniforms. Then transferring you back about 30km, you will take a boat trip along the Thu Bon River  to Hoi An Ancient Town. After that, back to the pier and come back your hotel by your own way & end of tour.\nO/N in Hoi An."},{"title":"DAY 9 – HOI AN – FREE (B)","description":"After having breakfast, you’ll be free on your own (No Car, No Guide).\nO/N in Hoi An."},{"title":"DAY 10 – HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B/-/-)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Ho Chi Minh City."},{"title":"DAY 11 – SAIGON - MEKONG DELTA IN GROUP (B/L/-)","description":"PICK UP: 7:30am – 8:15am RETURN: 17:30pm \nROUTE: HCMC – My Tho - Ben Tre – HCMC \nHighlight: A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit. Itinerary: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. Riding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. Have lunch at local restaurant. Break time. In the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City. End trip. \nO/N in Ho Chi Minh City.\n"},{"title":"DAY 12 – SAIGON GROUP TOUR TO CU CHI TUNNELS (B/L/-)","description":"After having breakfast at hotel.\nAt around 09:00, you’ll be picked up at your hotel then transferred about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war.\nThe extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range.\nAt around 15:00, you’ll get back to your hotel & have a free time to relax by yourself.\nO/N in Ho Chi Minh City."},{"title":"DAY 13 – SAIGON – DEPARTURE (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00)."}]},{"name":"Authentic Vietnam - 14 Days","duration":14,"travelStyle":["Discovery","Family","Independent","Partially Guided","Holiday"],"oldPrice":0,"price":1671,"summary":"Highlights of trip:\n\n  Visit some of the most popular sites in Vietnam\n  Luxury junk cruise on the legendary Ha Long Bay\n  Homestay in Sapa and Mekong delta -a good opportunity to better understand the daily life of the inhabitants\n  Trekking  to discover Sapa minorities. These hikes are easy and medium level, it is also for children over 4 years.\n  Discovery the poetic city Hue & the ancient town Hoi An.\n  Experience the heart of the Mekong delta with its scenic floating markets. In this semi-aquatic world, you discover how life really is in around this majestic river.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117125_54325b63.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117125_54325b63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_caf1aaa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_8d4135d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_5c9bab12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_989553e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_8139b268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_030ff28f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_3258152a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_b0ec7161.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117125_822a6edb.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Cat Cat Village","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"Day 1 : Arrival Hanoi (No Meal)","description":"When arriving, welcome at the airport and transfer to your selected hotel. Free time at leisure.\n\n\nOvernight in Hanoi."},{"title":"Day 2 : : Hanoi full day city tour – Sapa on Train (B/L)","description":"7.30 am – 8.30 am:  We will pick you up at your hotel to visit Tran Quoc pagoda, Buddhist relics and national heritage which lies on the West Lake.\n\n\n9:30 am   Visit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; President Ho Chi Minh’s stilt house where he lived and worked from 1958 to 1969. and Ho Chi Minh Museum where tourists will learn much about his devotion for Viet Nam.\n\n\n10:30 am Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi\n\n\n11:00 am   Visit Temple of Literature. Although several Temples of Literature can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, which also functioned as Vietnam's first university. The temple was first constructed in 1070 under King Lý Nhân Tông and is dedicated to Confucius, sages and scholars. It is a vast structure that has existed to present day.\n\n\n12:30   We will have lunch at a local restaurant\n\n\n13:40  We will explore the handicraft village of Bat Trang Potttery.\n\n\n16:00   Drive back to legendary Hoan Kiem lake to visit Ngoc Son Temple which worships Van Xuong saint and Tran Hung Dao former general commander. We also observe the beautiful Vietnamese and French architecture around the lake. Then we will bring you back to your hotel. \n\n\n19:30 -20:00: Our driver pick you up at your hotel then transfer to  railway station catch train to Lao cai/Sapa.\nOvernight on train. "},{"title":"Day 3: Lao Cai/Sapa – Y Linh Ho - Lao Chai – Ta Van Village- Sapa (B/L/D) –Trekking","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\n\n\nStart the trip at 9:30 as below.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. \n\n\nLunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Last trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan..\n\n\n•\tBreakfast, Lunch and dinner are all included. Overnight at the hotel in Sapa.\n•\tTrekking level: 6/10\n•\t10Km trekking, 8Km driving from Tavan village back to Sapa"},{"title":"Day 4 : Cat Cat & Sin chai Village (B/L) –Trekking","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\n\n\nStart the trip at 9:30 as below.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. \n\n\nLunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Last trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan..\n\n\n•\tBreakfast, Lunch are included. Overnight at the hotel in Sapa.\n•\tTrekking level: 6/10\n•\t10Km trekking, 8Km driving from Tavan village back to Sapa\n\n\nDinner on your own. Explore Sapa at night and enjoy local street food by yourself.Overnight in Sapa."},{"title":"Day 5: Sapa – Fanxipan Peak with cable car – Hanoi by Public bus ( B/L)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery.\n\n\n9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos).\n\n\n11.00: Come back to Cable Car Station and return to Sapa town\n\n\n12.30: Have lunch in the hotel\n\n\n13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi\n\n\n16.00: Get on bus to go back to Hanoi with two comfort breaks\n\n\n21:30 -22:00: We say goodbye to you at your hotel. Overnight in Hanoi"},{"title":"Day 6 : Hanoi – Halong Bay (B/L/D)","description":"07.45 – 8:30: The Swan shuttle bus will pick you up from your hotel in Hanoi and heading to northeast of Vietnam. At the middle of the way, we have a quick stop to stretch your leg and refresh then continue our way to Halong Bay.\n\n\n12.00: Arrive at Swan office in Ha Long, have a bit time to relax , and then you will transfer to Swan Cruises by tender.\n\n\n12.45: Enjoy welcome drink, be briefing about safety on boat and activities included then check in your cabin.\n\n\n13.30: Have lunch while leisurely cruising to the core of Bai Tu Long Bay. \n\n\n15.30: Arrive to Cap La Island - the beautiful area in Bai Tu Long bay. Enjoy kayaking through the karsts and breathtaking nature, and relaxing. \n\n\n17.30: Get back to the boat and enjoy Sunset Time( enjoy tea and fresh fruits). This time is regarded as “ Happy Hour” while our cruise is sailing to the overnight anchorage. In addition, Cooking class is also organized by our guide at this time. You have a chance to make Vietnamese cuisine by yourself. \n\n\n19.00: Have dinner in the dining room on board.\n\n\n20.30: Free time for joining Games, you may also try your luck with squid fishing. If you want to sing karaoke, please inform our tour guide to be supported.\n\n\nOvernight on Swan Cruise in Cong Do area\n\n\nAttention: According to Halong Bay Board Management, swimming activities need to be allowed to organize by Halong Bay Management Authority)\n"},{"title":"Day 7: Halong bay – Hanoi – Danang/Hoian ( B/L) by plane","description":"06.30: Start your day with Tai Chi on the Sundeck. Enjoy early morning landscape of the bay.\n\n\n07.00: Have breakfast on board (tea and coffee are free)\n\n\n07.45: Explore Thien Canh Son cave. Our tour guide will explain the history of Ha Long Bay, Bai Tu Long Bay and this Cave, made by Mother Nature.\n\n\n08.45: Return to the main boat.\n\n\n09.30: Finish packing and check out your cabin. \n(Please remove all of your belongings from your cabin, you may leave heavy luggage outside of the cabin (our staff will support you transfer directly to the pier).\n\n\n10.00: Join in and show your creativity in fruit carving activity.\n\n\n10.45: Enjoy lunch while our cruise is returning Hon Gai harbour.\n\n\n12.00: Back to the harbor and disembark in Hon Gai pier.\n\n\n12.30: Farewell Halong Bay then our bus will take you back to Hanoi.\n\n\n17.00: End of 2-day-1-night trip on Swan Cruises\n\n\nAttention: The itinerary is subject to change due to the weather, tide level and operating conditions without prior notice.\n\n\n19:30 -20:00: Our driver pick you up at your hotel then transfer to  the airport catch flight to Danang. \nArrival Danang. Driver only pick you up then transfer directly to Danang."},{"title":"Day 8: Danang– My Son Sanctuary (B/L)","description":"After breakfast at hotel:\n\n\n8:30 am: tour guide will pick you up at Hotel, and then we go to visit My Son Sanctuary – one of World’s Heritage Sites\n\n\n10:00 am: My Son Sanctuary, which used to be the citadel of Champa Kingdom, has been keeping the ancient beauty with more than 70 architectural works, which are the temples of the old Champa Kingdom. They still survive until today, despite the destruction of many wars. You will be able to not only discover the old Cham Pa monuments but also admire the Champa traditional dance performed by the professional local artists.\n\n\n12:30 pm: Depart for restaurant near Hoi An\n\n\n1:30 pm: Having lunch in a local restaurant\n\n\n2:30 pm: We will go back to your places in Danang\n\n\nOvernight in Danang."},{"title":"Day 9: Marble mountain - Hoi An (B/D)","description":"3:30 pm: In the afternoon, we will pick you up at the rendezvous. We get the tour started and go to visit Marble Mountains.\n\n\nYou will visit the Non Nuoc Village at the foot of Marble Mountains. The village is famous for stone sculptures and handicrafts. Here you can admire many works of art made from stone and marble by the local artists.\n\n\nIf you want to challenge yourself physically, the Water Mount, one of the five mountains in the cluster, is a very good choice, with more than 150 steps for you to climb up. Here you can visit many natural caves such as Huyen Khong cave, Tang Chon cave, and Hoa Nghiem cave. Besides, there are also religious places, including the first Linh Ung pagoda in Da Nang, Tam Thai pagoda, and many other beautiful pagodas.\nSaying good bye to Marble Mountains and the Non Nuoc village, we will go to Hoian ancient town.\n\n\n5:30 pm: Arriving Hoian, one of the World’s Heritage Site, we will walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda. In Hoian, everything is preserved as they were hundreds years ago.\nAt night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs.\n\n\n7:30 pm: We will introduce to you the specialties of Hoian at dinner. After the meal, we will go back to your places in Hoi An. Overnight in Hoi An."},{"title":"Day 10:Hoi An– Hue Imperila city (B/L)","description":"Enjoy breakfast at hotel. Then, check out hotel\n\n\n7:30 am: In the morning, tour guide will pick you up at hotel, then we start Hue city tour. On the way to Hue, you will pass through Hai Van tunnel, the longest tunnel in Southeast Asia.\nBesides that, you will have some time to enjoy the golden sandy beach of Lang Co Bay – one of the most beautiful bay in the planet.\n\n\n9:30 am: After arriving Hue citadel, you will visit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city.\nThien Mu Pagoda – the most beautiful pagoda of Hue, which is considered as the National pagoda of The Nguyen Dynasty, is your next destination after Khai Dinh Tomb. You can find the relics of Monk Thich Quang Duc – his private car, an eloquent witness of the Buddhist era in Vietnam.\n\n\n12:30 pm: At lunch time, introduce to you Hue specialties – the featured local dishes of this ancient city, in one of Hue’s famous restaurants.\n\n\n1:30 pm: We will take you to Hue Imperial city – the former administrative center as well as the accommodation of 13 Kings of the Nguyen Dynasty – the last feudatory Empire of Vietnam. The Imperial city is preserved as new for hundreds years, and tourists are allowed to visit many places such as Meridian Gate, Thai Hoa Palace and Duyet Thi duong theatre. Our tour guide will tell you the secret stories of the Royal family, of the Kings and the Queens’ lives.\n\n\n3:30pm: Back to Hue city. Overnight in Hue"},{"title":"Day 11: Hue – Hoichiminh city (B) by plane","description":"Flight: Hue – Hochiminh (12:00 -13:25) by Jetstar or Similar \nBreakfast at your hotel then transfer to the airport catch flight to Hochiminh.\n\n\nArrival Hochiminh. Driver only pick you up then transfer to your hotel. \nAfternoon: Free time to relax or explore Saigon by yourself. Overnight in Saigon."},{"title":"Day 12: Cao Dai Temple – Cu Chi Tunnel (B/L)","description":"HCM – Tay Ninh – Cu Chi – HCM ( start 8.00 – return 19.00 )\n\n\nStart from Ho Chi Minh City and depart  for Tay Ninh where the Cao Dai Great Temple is located. Stroll around the temple, which is regarded as one of the impressive architectural structures in South-East Asia. Maybe, the Cao Dai sect is strange to many people as it’s a special hybrid of Buddhism, Christianity, and Confucianism. At its entrance is the Left Eye of God, which is the Cao Dai religion’s symbol.\n\n\nAfter seeing the scenery of the temple, you will attend the midday ceremony organized by the Cao Dai followers to learn about the religious rituals. Go to lunch at a local restaurant, and then be driven towards Cu Chi Tunnels. Be introduced to a short video which is also an overview of the Cu Chi’s history and Vietnamese endurance.\n\n\nStart discovering some permitted areas of the tunnel system, which is seen as an underground village in Ho Chi Minh City. There are field hospitals, weapon factories, kitchen, command centers, storage facilities, and trap doors. This system was made by hand, which proved the Vietnamese’s intelligence and creativity in the Vietnam war. Enjoy cassava (the main food of Vietcong during the time of war) and sip tangy tea. \n\n\nReturn to Ho Chi Minh City\nOvernight in Saigon."},{"title":"Day 13: Mekong delta full day ( B/L)","description":"HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.00 )\n\n\nStart from Ho Chi Minh City and depart to My Tho.  On arrived at My Tho, visit the Vinh Trang Pagoda, a sacred place that is also one of the top local sights. Continue on to the harbor, where you’ll board a boat to explore the Delta region. During the cruise on the Tien River you’ll see the Phoenix, Unicorn, Dragon and Tortoise islands, and fishing villages, stilt houses and fruit plantations along the river.\n\n\n Stop at one of the islets for lunch in an orchard garden.\n Afterwards, you’ll continue on your sightseeing tour of the attractions of Ben Tre. A sampan ride will take you along the natural canals in the shadows of water coconut trees. You’ll get a real sense of the charm and tranquility of the area. Stop to visit a coconut fudge family business, taste some of their products and buy your favorite candies in the workshop. Savor fresh fruits as you sip honey tea and enjoy Southern Vietnamese folk music performed by locals. \n\n\nTake the bus and back Ho chi Minh City\n\nDrop off your hotel. Overnight in Saigon."},{"title":"Day 14: Ho Chi Minh City – Depature (B)","description":"After breakfast, free time before your transfer to the airport . \n\n\nEnd of service."}]},{"name":"Vietnam Beach Holiday Memories - 13 Days","duration":13,"travelStyle":["Flexi","Group","Fully Guided","Holiday"],"oldPrice":1636,"price":883,"summary":"»Hanoi: Immerse yourself in the most charming capital cities in Asia, a mixture between the past and the present; with the city's French colonial history in the tree-lined avenues, grand villas and sidewalk society of the Paris of Vietnam.\n\n»Halong Bay: Enjoy an overnight cruise in the most magnificent bay of the country, one of the UNESCO-recognized World Heritage Sites.\n\n»Hoi An: Walking around the well-preserved ancient town located in central Vietnam and fall in love with the city when the night falls and many colorful lanterns light up to add a special flair to this historical town.\n\n»Nha Trang: Relaxing on the beautiful coastline with bleached sandy beach and clear emerald water.\n\n»Ho Chi Minh City: Discover \"The Pearl of the Orient\" and vibrant nightlife\n\n»Mekong Delta: Explore the maze of waterways and see the local people's life.\n\n»Cu Chi Tunnel: Into some history lesson with a trip to Cu Chi tunnels. A fascinating underground networks built during the Vietnam war.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137389_0205415e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137389_0205415e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_56a8672d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_9b425447.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_c747e2f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_654de5ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_9719b766.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_d755d57e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_825475af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_f852c970.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_14e46d19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_1ad86553.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_01b47356.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_e0f1dc63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_ad03acde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_d36af84e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_9c318330.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_8a76ff28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_7dc77615.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_36a9d346.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_810c5757.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137389_6ee77130.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Upon arrival, your driver will meet and greet you at the airport.  Enjoy a transfer from the airport to your accommodation. Check in at the hotel and have a rest after the flight.\n\nOvernight in Hanoi\n\n"},{"title":"HANOI – HALONG BAY (B/L/D) SHARING CRUISE","description":"In the morning, after breakfast at the hotel, the Cruise team will pick you up. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival to Halong, you will enjoy a cruise on the Bay and explore the limestone rocks and the karst grottoes.\n\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which there will be a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can optionally attend the activities taking part on the boat or just relax.\n\nOvernight on cruise."},{"title":"HALONG BAY – HANOI (B/L) SHARING CRUISE","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and transferred to your accommodation in Hanoi\n\nOvernight in Hanoi"},{"title":"HANOI FLY TO HOI AN (B) - FLIGHT INCLUDED","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Hanoi to Danang. Approximately flight time is one hour and 30 minutes. Upon your arrival, you will be transferred from the airport to your hotel in Hoi An's center.\n\nOvernight in Hoi An"},{"title":"BEING A LOCAL IN ONE DAY (B/L)","description":"Would you like to go fishing with the local fisherman? Why don't you have a fun experience with the funny basket boat. You shouldn't have any hesitance because the day will put a broaden smile in your face. It is very interesting to fish here on the river with the local fisherman as you catch your fish and we cook for you. \nOn the Fishermen & the Waterways  Tour you will enjoy a wide range of experiences - from learning traditional fishing techniques to paddling the strange and unique Vietnamese bamboo basket boats while exploring the now tranquil coconut-palm flanked waterways of a past war. On this tour we provide an authentic social and cultural insight into the local Vietnamese way of life. As well you will take part in some hands-on activities that are fun, safe and interesting to people of all ages\n(Meals: breakfast, lunch)"},{"title":"WANDER IN CHARMING HOI AN","description":"Have the leisure day at your own.\nOver night in Hoi An.\n(Meals: breakfast)"},{"title":"HOI AN FLY TO NHA TRANG (B) – FLIGHT INCLUDED","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Da Nang to Nha Trang. Approximately flight time is one hour and minutes. Upon your arrival, you will be transferred from the airport to your hotel in Nha Trang’s center.\n\nOvernight in Nha Trang\n\n"},{"title":"CHERISH YOUR TIME ON NHA TRANG BEACH (B)","description":"Today you will have free time explore Nha Trang at your own pace, seeing what interests you. \n\nOvernight in Nha Trang"},{"title":"CHERISH YOUR TIME ON NHA TRANG BEACH (B)","description":"Today you will have free time explore Nha Trang at your own pace, seeing what interests you. \n\nOvernight in Nha Trang"},{"title":"NHA TRANG FLY TO HO CHI MINH CITY (B) - FLIGHT INCLUDED","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Nha Trang to Ho Chi Minh. Approximately flight time is one hour and 30 minutes. Upon your arrival, you will be transferred from the airport to your hotel in Ho Chi Minh’s center.\n\nOvernight in Ho Chi Minh"},{"title":"HO CHI MINH - CU CHI TUNNELS TOUR (B)","description":"You will be picked up by an experienced English-speaking guide to Cu Chi Tunnels, located in the countryside near Ho Chi Minh City. Approximate travel time is one hour and 30 minutes. The residents of Cu Chi took the war underground into a highly developed network of tunnels that at its height stretched as far as Cambodia and included meeting rooms, kitchens and triage areas. Imperceptible from the ground, opposing armies could roll their tanks over the bunkers without causing damage to the tunnels below. Living conditions were harsh – in addition to fighting the war, resident’s battled food and oxygen scarcity, venomous insects, and cramped living quarters. Gain important insight into the prolonged struggle against invading armies, and appreciation for the resilience and spirit of the Vietnamese people. After that, travelers can try the delicious manioc which was the main food for guerilla-warriors in Cu Chi during the war. Visitors can try to fire off an AK47 or MK16 or machine guns at the nearby shooting range.\n\nThen enjoy a transferred back to your accommodation.\n\nOvernight in Ho Chi Minh"},{"title":"HO CHI MINH – MEKONG DELTA (B/L) GROUP TOUR","description":"Kick start your day with a hearty breakfast and a trip to Mekong Delta follows, you will be greeted by an experienced English-speaking guide and professional driver to My Tho, the town lies on the left side of the Mekong River. Then boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around the country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people and visits the fruit plantation. Then you will take a hand-rowed sampan through Thoi Son canal and immerse yourself in the beauty of the countryside, visit the family workshops and honey-bee farm, try some honey tea and coconut candies specialties.\nRefuel yourself with a Vietnamese traditional meal and later pedal around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong Delta. If you are not keen on a cycling trip, then enjoy a cool breeze and relaxing time in a hammock.\nAfterward, you will be transferred back to your accommodation.\n\nOvernight in Ho Chi Minh"},{"title":"TIME TO SAY GOODBYE - HO CHI MINH CITY DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home."}]},{"name":"Discover 7 Great Places Of Vietnam 14 days","duration":14,"travelStyle":["Adventure","Family","Private","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":1151,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100296_d19b815f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100296_d19b815f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_cfaac1ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_20acddeb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_35b12219.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_17642f39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_8e586746.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_065d2cf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_0c990cc4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_8899d16e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_948b43c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_bce4de45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_30a06f14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_9664d171.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_f2d1b571.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_8160878c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_9c1d5735.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_f50a0c31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_0ed62806.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_c722397f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_c3e57374.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_b3135b74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_cc2ef739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_3149ce9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100296_c9d3eb62.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Dalat","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: HO CHI MINH CITY ARRIVAL","description":"Meal is not included\nOn arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You have free time for leisure."},{"title":"Day 2: MEKONG DELTA FULL DAY","description":"Meal included: Breakfast, Lunch\n8.00am depart to My Tho city, 1.5 hours drive.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people.\n• The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake.\n• The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree.\n• Having lunch at local restaurant. After lunch, we will freetime for biking, walking.\n• 3.00 Back Saigon. On the way, we will stop at vinh Trang Pagoda.\n5pm get back to Saigon."},{"title":"Day 3: CU CHI TUNNELS HALF DAY","description":"Meal included: Breakfast\n08:30    We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out!\n14:30        The bus back HCM. \nStay overnight in Ho Chi Minh."},{"title":"Day 4: NHA TRANG BY TRAIN","description":"Meal included: Breakfast,\n08:00AM: Our car picks you up at the hotel and departs to Nha Trang by train. During the way, you can see the nice landscape such as: dragon fruit farm, coconut forest, beach, fishing villages, temples,…\nArrive Nha Trang beach city, our car transfer to down town, check in hotel and have a free time.\nEvening: Spend overnight in Nha Trang."},{"title":"Day 5: ISLAND DISCOVERY – THEN CAR TO DA LAT","description":"Meal included: Breakfast, Lunch\n9h00 : Pick-up at the hotel and transfer to Cau Da pier.\n10h00 – 11h30: At Mun Island\n– Observe the structure of Salanganeisland.\n– Snorkelling to view coral reefs covered with multicolour fish.\n11h45- 13h45: At Mot Island\n– Having lunch with dishes: fried salted shrimp, fried fish in sour and sweet sauce, sauteed cuttlefish, grilled rib, spring rolls, softly sauteed noodles…\n– Entertainment program: singing songs & music.\n– Enjoy cooktails at “ Floating Bar”\n\n14h – 15h30: At Con Se Tre Village\n– Relax at Con Se Tre village.\n– Seasonal fruit party.\n\n15h45 – 16h15: At Mieu Island\nVisit Tri Nguyen Aquarium\n16h30: Back to harbour and hotel."},{"title":"Day 6: DA LAT CITY FULL DAY","description":"Meal included: Breakfast, Lunch\n8:30 We will pick you up at your hotel. Then, we will make a trip to discover Da Lat City.\n-Bao Dai King Palace\n-Da Lat Cathedral\n-Robin hill, cable car (exclusive)\n-Datanla fall\n-Flower Garden\n-Truc Lam Zen Monastery\n4:00 Finish the tour and come back hotel. Have free time to enjoy Da Lat. Spend night in Da Lat."},{"title":"Day 7: FLIGHT DA LAT- DA NANG – HOI AN","description":"Meal included: Breakfast\nMorning:\nOur driver takes you to the airport for Da Nang flight.\nArrive to Da Nang, our car take you to Hoi An (40 minutes drive). Check in hotel in Hoi An.\nYou are free to discover the ancient town: Japanese Bridge, lantern road, traditional tailor shop, enjoy the special food. Besides, you can view sunset at Cua Dai beach. Spend overnight in Hoi An."},{"title":"Day 8: TRÀ QUẾ VILLAGE AND MAKING LANTERN LEARNING","description":"Meal included: Breakfast, Lunch\nDeparture : 8 :00 AM & 1:30 PM Time duration: 4 hours\nThe tour will begin at your hotel or tour office.Our tour guide will greet you and provide your bicycle for your trip.\nYour day will start at Tra Que vegetable village. You can relax and enjoy the peaceful countryside then stroll along the vegetable villages. As a special treat, you will be involved with digging, sowing, planting, harvesting the vegetables with hundreds of years rudimentary tools of the farmers. You will enjoy the E Water, a speciality of Tra Que vegetable village, you can feel the strong medicinal flavour from many kinds of vegetables. You could will be a fammer with many interseting activities.\nFinish your time in Tra Que vegetable village, you will ride your bicycle leisurely passing the rice fields, villages, to come to the art of making lanterns.\n– You will visit craftsmen with skillful hands, showing you how to create the brightly colored lanterns. Expertly guided you could make yourself a lantern as a gift to your family.\nFinish your learning, the tour guide will take you back to your hotel."},{"title":"Day 9: PHONG NHA CAVE","description":"Meal included: Breakfast, Lunch\n6:30 Start at your hotel and depart to Phong Nha Cave. On the way, our guide will introduce the Holy Land of La Vang (it is named the Minor Basilica), Hien Luong Bridge and Ben Hai River. When Arriving in Quang Binh, you will have chance to visit some magic location such as: Phong Nha Cave, Ke Bang national Park. After that, you will be served lunch at Xuan Son Boat Station (in Phong Nha).\n13h00 We will start visit Phong Nha Cave by boat on Son River. Then, proceed to explore the caves named Bi Ky grotto, Cung Dinh grotto, Tien grotto.\n15h00 You will be picked you up at the boat station by car and continue to depart for Hue city on Ho Chi Minh Trail, via Truong Son Martyrs’ Cemetary.\n19:30 We will return to Hue and overnight here."},{"title":"Day 10: HUE CITY – HA NOI","description":"Meal included: Breakfast, Lunch\nMorning (8:15 am – 12:30 pm)\n1. Dong Ba Market to see the daily life of local people\n2. Boat trip to Thien Mu pagoda – The oldest pagoda in Hue City\n3. Imperial Citadel of Royal Dynasty of Nguyen Family (1802 – 1945)\n4. Royal Antiques Museum – A collection of ornaments from the Nguyen dynasty\nLunch at local restaurant (Huế specialities, Western and Asian food)\nAfternoon (12:30 – 17:30)\n5. Incense stick village\n6. Khai Dinh King’s Tomb – a blend of Western and Eastern architecture.\n7. Minh Mang King’s Tomb, one is impressed by the majesty and symmetry of the architectural constructions.\n8. On the way back to your hotel, we drop in handicraft village in Hue city – Conical hat village\n16:00 – 16:30 pm: Back to Hue city\nThen our driver will transfer to airport to catch flight to Hanoi. Overnight in Hanoi "},{"title":"Day 11: HA NOI – HA LONG CRUISE","description":"Meal included: Breakfast, Lunch, Dinner\n7.45 – 08.20 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up.\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n– You will have a chance to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 noon approx\n– Arriving Tuan Chau Marina. Welcome aboard the cruise. Meet the captain, crew and join us for welcome cocktail as we tell you about life onboard.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is prepared by our chef.\n– Join us for a relaxing lunch in the restaurant or on the outdoor dining area. Enjoy the stunning views of the Bay, its dramatic limestone islands as we sail through the calm waters.\n\nAfternoon\n– While we make our way to the amazing Van Gia fishing village, relax on the sundeck and watch the world go by or take an afternoon nap in your cabin. Middle afternoon arrive at Van Gia floating fishing village.\n– Drop anchor.\n– Our guide will give you some information and interesting facts about this fascinating village and its local community.\n– Disembark and you can choose which options when you visit the village by Kayak or local bamboo boat to visit the village. They will be your guides through their fishing village where you can meet the locals, see at first-hand what life is like living on the water, we are proud of our working partnership with, and support of this community.\n– Our cruise will take you to the Soi Sim natural beach for swimming and snorkeling, you can enjoy our interesting games such as football, basketball. On the way cruising, you will enjoy with us the sunset party with fruits and wine as our complimentary\n– Back on board the cruise, we head towards the sleeping area.\n\nEarly evening\n– Take an opportunity to refresh and then join friends for a pre-dinner drink in the bar.\n– Dinner is served in the restaurant or outdoor dining area if the weather is permitted, which is a gastronomic delight. After dinner, unwind in the bar where there is a selection of books, magazines and board games or watch a movie on our plasma TV, join some of our team to go cuttle fishing at night. Accommodation and overnight on boat"},{"title":"Day 12: HA LONG BAY – HA NOI","description":"Meal included: Breakfast, Lunch\n06:30 am\n– For the early risers join us for a Tai Chi session on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands.\n– Breakfast, coffee, tea served.\nAfter breakfast, we sail through the waters and pass by a number of caves and we drop anchor at Surprising (Sung Sot) Cave.\n– Disembark and visit Surprise Cave located on Bo Hon Island. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites\n\n09:30 Am:\nWe board the cruise again. Take time to refresh and relax before checking out. Bags can be left in the luggage store. You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12 noon\nReturn to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi.\n16:30-17:00 Arrival back at your hotel. Stay overnight in Ha Noi."},{"title":"Day 13: HA NOI CITY FULL DAY","description":"Meal included: Breakfast, Lunch\nIn the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\n17:00: End of City tour. Stay overnight in Ha Noi."},{"title":"Day 14: HA NOI DEPARTURE / SEE YOU AGAIN","description":"Meal included: Breakfast\nAfter having breakfast at hotel, you have relaxing time in Ha Noi until transfer to the airport for the flight back home. See you again!"}]},{"name":"Vietnam Classic Tour - 12 days","duration":12,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1180,"summary":"Best of Vietnam Tour 12-day tour is ideal for travelers with more time budget, featuring many attractions that Vietnam has to offer. Highlights include Halong Bay's overnight cruise, Golden Hand Bridge, world's heritages of Hue and Hoi An, a homestay in Mekong Delta and two central urbans Hanoi and Ho Chi Minh city.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150591_ca18589b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150591_ca18589b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_8ba20cea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_3b568eb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_3aa836e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_b152a37e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_dfce4107.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_babd154d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_f93b6c3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_0353992a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_6fc580c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_7e7b2287.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_540721ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_8d91fe2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_43ffa58d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_2346b427.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_6c6dbd09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_1a8ba991.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_7af6f379.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_52a141db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_bd4d2533.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_e0c5585e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_25aeda53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150591_df587c83.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you\n Meals: N/A\n Accommodation: Hotel in Hano"},{"title":"DAY 2: HANOI HALF DAY CITY TOUR","description":"Pickup at 08:00. We will spend a half day to visit the city. We start with visit to President Ho Chi Minh's mausoleum (Outside). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university. The day ends with visit to Hoa Lo Prison.\n Meals: Breakfast\n Accommodation: Hotel in Hanoi"},{"title":"DAY 3: HANOI - HALONG BAY - NIGHT ON BOARD","description":"08h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break\n12h00: Arrive at Tuan Chau wharf – Break and photography time\n12h30: Board the Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the bay\n15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen.\n16h30: Enjoy kayaking or swimming (if the weather permits).\n17h00: Back on board and continue cruising.\n19h00: Dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner\n Accommodation: Night on board"},{"title":"DAY 4: HALONG BAY - HANOI - FIGHT TO DANANG","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 5: HOIAN - FREE DAY","description":"Free and easy day to explore Hoian town or swim at nearby beach.\n Meals: Breakfast\n Accommodation: Hotel in Hoian"},{"title":"DAY 6: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 7: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"Free in the morning.\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\nNote*: The train journey is part of a great local experience. Restrooms at either end of the carriages.\n Meals: Breakfast\n Accommodation: Hotel in Hue"},{"title":"DAY 8: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel.\n\nToday, we will spend a full day touring Hue city. \n\nIn the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant. \nIn the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village\nThen airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 9: SAIGON CITY + CU CHI TUNNELS TOUR","description":"Pickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon.\n\n\nIn the afternoon afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 10: SAIGON - MEKONG ADVENTURE","description":"7:40am - 8:10am Pick you up at your hotel and depart for Ben Tre.\nAfter arriving at Ham Luong dock, board the boat & cruise along Ham Luong River, a tributary to the Mekong River. The cool breeze from the river and lush tropical islands along its banks will immediately get you excited to explore all the great things ahead.Arrive and visit various local workplaces to find many wonderful examples of how local people use ageless techniques to create their crafts, including activated charcoal, dried coconut, handy coconut husk brooms, and many family businesses using coir, or coconut fiber, to create amazing art. Drive around the village roads by “Xe Lôi”, the local vehicle, which is a kind of motorized rickshaw. \nPerfect your day with a delicious and filling lunch at a local host house.\nBreak time, treating yourself to a relaxing time to relish the beautiful countryside or cycling around the village. Visit the local fruit plantation, enjoy seasonal fresh fruits, and spend time relaxing while being rowed in a small boat slowly through the natural canals to get a sense of how truly beautiful this area is.Embark on the sampan and return to the dock. Travel back to Saigon. Complete your trip. Finish tour Mekong Delta Adventure Day Tour.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 11: SAIGON - FREE AND EASY","description":"Enjoy your free day for shopping and personal activities in Saigon\n Meals: Breakfast\n Accommodation: Hotel in Saigon"},{"title":"DAY 12: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Vietnam Family Holiday for solo parents","duration":13,"travelStyle":["Family","Adventure","Group","Fully Guided"],"oldPrice":0,"price":1535,"summary":"With great food and lush scenery, the whole family will fall in love with Vietnam. Sail beautiful Halong Bay. Delight at water puppets in Hanoi. Learn about rich emperors in Hue. Get a new outfit tailor-made in Hoi An. Maybe even take a dip in the Vietnam East Sea. With so much to share and do together, you'll experience the culture, flavours, and highlights of a Vietnamese adventure your family will always remember.This trip is for solo parents travelling with their children only. If you're planning to travel on your own with your child, this trip might be just what you're looking for. It will give you a chance to travel with other solo parents!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/106590_a947f469.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/106590_a947f469.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_db7c1381.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_80f65152.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_ac81fc19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_217b00e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_317de96c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_c799aaf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_a35882e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_4bc928c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_b0de07aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_0afd59b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106590_a0c79598.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Hanoi is famous for its beautiful lakes, shaded boulevards, verdant public parks and its thriving Old Quarter. The latter is a veritable architectural museum piece, with blocks of ochre buildings retaining the air of a 1930s provincial French town. You will be transferred from the airport to your hotel, and your adventure begins with a welcome meeting at 5pm. Afterwards, perhaps enjoy some dinner with your family and fellow travellers (this is optional).\nAccommodation: Hong Ngoc Cochinchine Hotel or similar"},{"title":"Day 2: Hanoi","description":"Embark on a full-city tour of town. You will visit the Ho Chi Minh Mausoleum and Museum, and the tranquil Temple of Literature – an oasis of calm in the heart of town. Also head to the Museum of Ethnology to learn more about the diverse heritage of Vietnam. Enjoy some lunch at KOTO restaurant, an excellent establishment and longtime friend of Intrepid which lives by the philosophy of 'know one, teach one'. It supports the underprivileged local youth by giving them a chance at making a career in the hospitality industry. In the evening, sit down to a traditional water puppet performance. This northern tradition, dating back nearly a thousand years, is performed alongside traditional Vietnamese music that employs drums, wooden bells, horns and bamboo flutes.\nAccommodation: Hong Ngoc Cochinchine Hotel or similar"},{"title":"Day 3: Halong Bay","description":"Travel by minibus to the spectacular World Heritage-listed site of Halong Bay (approximately 4 hours). The bay is a breathtaking secluded harbour, with some 2,000 limestone islands jutting out of the waters of the Bac Bo Gulf. Board your private boat and cruise among the dramatic limestone peaks. There's an opportunity to swim in the famous Vietnam East Sea and explore caves filled with stunning stalactites and stalagmites. Spend a peaceful night on board, beneath a sky alive with stars. Your sailing junk has twin-share cabins that have air-conditioning and private facilities. There's also a dining room and bar.\n\nNotes: Due to recent, unforeseen changes by local authorities, many boats are no longer permitted to stay overnight on the bay. This has resulted in a boat shortage. To ensure Intrepid travellers are all accommodated, a larger boat, usually with 12 cabins, may be used, and passengers may be split across multiple boats. An Intrepid group leader will be present on each boat, and the route and onboard inclusions will remain the same.\nAccommodation: Halong Bay Junk"},{"title":"Day 4: Hue","description":"Enjoy breakfast on the boat this morning and perhaps head out for an optional early morning kayak. Return to Hanoi by bus (approximately 3.5 hours). From there you will board an overnight train bound for Hue. As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past. It's a curious mix of bustling streets and tranquil settings. Although conditions are basic on your train journey, overnight trains are a classic South East Asian experience and the best way to travel long distances with the locals. Lie back and enjoy the ride! Most trains have a dining carriage serving simple food, but it's a great idea to stock up on fresh bread, cheese and fruit before you head off.\n\nNotes: Sleeper trains typically have four-berth compartments (occasionally six-berth, depending on seasonal variations) which have bench seats that convert into sleeping bunks. A sheet, pillow and blanket are provided, although some travellers prefer to bring their own sleeping sheet. On occasion, passengers of different genders will be required to share a compartment and there will be occasions where you'll be sharing with local travellers or travellers who are not part of your group.\nAccommodation: Overnight Sleeper Train"},{"title":"Day 5: Hue","description":"Welcome to Hue! Your leader will help you chose a local, tasty breakfast option this morning after you disembark the overnight train. Afterwards, enjoy a dragon boat cruise along the Perfume River. The trip includes a visit to Thien Mu Pagoda, which is considered by many to be the unofficial symbol of Hue. It's an active Buddhist monastery originating in 1601. One of the most poignant displays here is a car belonging to a former monk who, in 1963, drove to Saigon and set himself alight to protest against the treatment of Buddhists by the South Vietnamese regime. You will visit one of the royal tombs, that of Emperor Tu Duc, and see the central lake set amid a grove of frangipani and pine trees. There is also the chance to visit the tomb of Minh Mang. Its lush forest backdrop and impressive architecture make it perhaps the most majestic of all the royal tombs.\nAccommodation: Thanh Lich 2 Hotel or similar"},{"title":"Day 6: Hue","description":"Delve further into the fascinating former capital today. You will visit the Imperial Citadel, which is the best-preserved remnant of a large citidel and Royal centre that once existed on this fortified site. The unique fortifications are fascinating, even though much of this place has sadly been destroyed by war. The foliage-covered ruins make for an interesting couple of hours of exploring. You will visit the Forbidden Purple City, which was almost totally wiped out during the Tet Offensive in 1968. The gaping holes left by bombs give an idea of the shocking destruction wreaked upon the country during the war.\nAccommodation: Thanh Lich 2 Hotel or similar"},{"title":"Day 7: Hoi An","description":"Travelling by bus, head south through coastal rice paddies, then traverse the spectacular Hai Van Pass along the mountains en route to Hoi An (approximately 4 hours). Recently declared a World Heritage site, Hoi An is beautifully preserved and exudes a tranquil atmosphere. It's perfect for strolling around at a leisurely pace, with many beautiful Japanese houses and Chinese temples lining the narrow lanes. Parts of Hoi An look exactly as they did more than a century ago. It's also a shopping mecca – browse local markets and shops for original paintings, handcrafted woodwork, ceramics, embroidery and lanterns. Hoi An has also become famous for its tailoring, with a great variety of fabrics and tailors to choose from.\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 8: Hoi An","description":"After breakfast we head out to spend the morning at Cua Dai beach. This beach is known for its stunning palm-fringed white sand and views of the Cham islands. Transfer back to town for lunch, before spending the afternoon learning how to prepare White Rose Cake. This hands on experience is one the whole family will enjoy!\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 9: Hoi An","description":"Enjoy further free time in this beautiful old town. Perhaps take up a cooking class and learn the secrets of preparing local specialties like cao lau – dark pork broth with thick yellow noodles, sliced pork, bean sprouts, green vegetables and croutons. Street food tours can also be arranged. Alternatively, hire some bikes and take the family out on a cycling trip into the gorgeous surrounding countryside. Another great activity which kids will enjoy is a bamboo basket ride down the waterways of the jungle. For more optional day- and half-day trips, chat to your leader.\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 10: Ho Chi Minh City","description":"Take a short flight to the economic hub of Ho Chi Minh City (approximately 1 hour). Formerly known as Saigon, Ho Chi Minh City is characterised by a vast array of sights and sounds – a fascinating blend of old and new, East and West. Check out Ben Thanh Market and experience a delicious local lunch of street food, and enjoy an orientation walk. Afterwards, you're free to explore the city on your own. Your leader will have plenty of interesting and fun ideas for you and the kids. Consider scooting off on cyclos to Cholon, the Chinatown area of Ho Chi Minh City, for a bit of temple-hopping. Or visit the Vietnamese version of a department store for some serious shopping.\nAccommodation: Lavender Hotel or similar"},{"title":"Day 11: Mekong Delta","description":"Head down to the Mekong Delta and visit unexplored Ben Tre where coconut is everything and anything. The fertile delta is famous for its abundant harvests of tropical fruits and flowers. On arrival, board your private boat and cruise along the maze of waterways to visit some local cottage industries. This is a fascinating behind-the-scenes look at a different part of the local economy. Then head to your overnight homestay by the water. Be invited into a family home for a true local experience – a chance to see daily life from the inside. You'll be sleeping on simple camp beds in dorm-style rooms, with all meals included. Bedding and mosquito nets are provided.\nAccommodation: Homestay"},{"title":"Day 12-13: Ho Chi Minh","description":"Life in the delta starts with the sun, so embrace the day early. You will visit a local market and soya bean workshop before heading back to Ho Chi Minh City for one more night. You should arrive in the afternoon, which will give you time for a final exploration of the city. On Day 13 your trip comes to an end, and you are free to leave at any time. For those who have booked an airport transfer, the leader will confirm your departure time and onward flight details.\nAccommodation: Lavender Hotel or similar"}]},{"name":"Vietnam Special For Solo Travelers","duration":13,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":2348,"price":1268,"summary":"The perks of being a solo travel on a group tour that you are not alone for the whole journey. We’ve got the expert local guide to show you around and ensure your safety; like-minded solo travellers who’ve got the same urge for adventure. We have picked our most popular destinations ; scheduled  solo-only departures and will arrange rooms for you to share with someone of the same gender. In case you would like a little more privacy, we can organize a single supplement for a small charge. All you have to do is pick the date, pack your stuff and let the rest for us.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142945_478895c6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142945_478895c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_e89b2743.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_f220fa45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_629e690e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_9385439c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_6c579252.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_d5b61520.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_0697a71e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_b8bab3ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_54329008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_61494b04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_dc0c36e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_9fad2837.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_da51df4e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_1ebba5ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_696ba7d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_0a5325a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_57f2cc28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142945_d1431da8.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"EXPLORE ANOTHER PART OF BUSTLING HANOI ( B/L )","description":"Pick-up at 7:30​ ​am from your hotel’s lobby​.​ ​The drive ​takes​​​ 2 hours and leave the noisy city behind your back! We’re heading to a peaceful and quiet countryside which is really a hidden charm!\n10:00 - Starting your trip at your host’s house by having welcome drink. Short break at your host’s house​.​\n10:45 – Cycling around the village and stop over the local market to experience how people trade their own products for lives. Then heading to traditional Miến village (type of transparent noodle made from starch).\n11:15 - Hands-on farming experiences by growing vegetables and harvesting the raw vegetables in Chau’s garden. Vietnam is the tropical country with the most famous variety ​of ​raw vegetable herbs as: lettuce, mints, fragrant knot weed, coriander, balm-mint, cilantro​ etc. You will see the way ​how local people not only​ always​ have fresh food to eat​​ but also have enough to trade in local market. \nThen ​Mr. ​Chau will take you to a boat trip for the fishing on Da River. On the way, you will experience the local live on river side and stop for fishing with​ Mr​ Chau ​with his local unique technique!\n12:30: Have lunch with the host’s family and short break after ​it.​\n14:00 – ​Say goodbye ​to ​your local host​ and ​head to 30-years-old tea fields in Ri Village. This place it is very important ​in​ providing tea products for the whole North​ of Vietnam​. Beside walking & helping local people to harvest tea leaves, you will know how to take the best part of the tea tree to make the most wonderful drink in the world.\nAfter visiting and learning cultivat​ion of tea leaves, you will come to Mr Duoc’s house – he is a veteran and the owner of a huge tea farm​. ​​From him you will know how we handle the raw tea leaves​,​ make it into the products and get ready to sell on market.\nHave a break time with desserts made of ground green lentils or lotus seeds with your host and listen his story from Vietnam war, as a veteran, he is a witness of Vietnam history and could make you understand about the past of the country.\nThen drive back to Ha Noi in the evening, end the tour at your hotel around 18:30.\n(Meals: breakfast, lu​n​ch)"},{"title":"CRUISING TO THE MOST SPECTACULAR BAY OF VIETNAM - SHARING CRUISE (B/LD)","description":"07h30: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break.\n12h00: Embark at Ha Long wharf – Break and photography time\n12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n19h00: Vietnamese style set dinner is served on board.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat."},{"title":"WAKE UP IN THE LEGENDARY BAY - OVERNIGHT TRAIN TO SAPA (B/L)","description":"07h30: Have breakfast and enjoy sunrise on the bay.\n09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n10h30: Have lunch while cruising back through Ha Long Bay to the pier\n11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n12h00: Return from Ha Long to Hanoi.\n14h00: Stopover on the way for a refreshment break.\n16h00: Arrive in Hanoi. \nHave leisure time on your own and late check-out at the hotel.\n20:30 - 21:00 Pick-up at the hotel. Transfer to railway station for a night train to Sapa (schedule 21:50 - 06:30)."},{"title":"IMMERSED IN TRADITIONAL HILLTRIBE CULTURE (B/L/D)","description":"We will pick you up at Lao Cai railway station by bus, to take you to the township of Sapa which takes approx one hour arriving at. 08:00am – After breakfast and a morning shower, we will start walking to Cat Cat and Sin Chai villages in the bottom of Muong Hoa valley.Enjoy the spectacular views of the beautiful valley towards Fansipan- highest peak in Vietnam and Indochina.Go through a village of Black H’mong tribe, see people weaving and embroidering their clothes, enjoy colourful rice terraces and the interesting waterfall. Come back to afternoon will be free time for you to explore Sapa ethnic market and town. Overnight at the hotel in Sapa town."},{"title":"SAPA - Y LINH HO - LAO CHAI - TA VAN (B/L/D )","description":"Enjoy your breakfast then check out of the room. Keep your baggage in the hotel then we will walk from Sapa towards\nMuong Hoa valley where can admire magnificent landscape. Here you will discover the wonderful scenery of Hoang Lien mountain ranges and meet Black H’mong tribes. Trek through terraced rice paddies and minority villages along the Muong Hoa River, where we can have a nice swim. Lunch at Lao Chai Village then keep going to Ta Van Village of Zay people\narriving at Ta Van, where we have dinner cooked on a wood fire enjoying the homestay overnight.company and hospitality of our Zay family"},{"title":"TA VAN - SU PAN -SAPA (B/L)","description":"Then enjoy a delicious breakfast ready to trek through bamboo forests towards Giang Ta Chai waterfall, cross over a rattan suspension bridge and enter into Giang Ta Chai village which is inhabited by the Red Zao minorities. Here we will experience their daily life then cross over the Muong Hoa River up the mountain to visit Supan village of the H’mong people. We then take the bus back to Sapa.Take a fresh shower in the hotel before heading to Lao Cai train station for the night train back to Ha Noi.\nOvernight at the A/C soft sleeper cabin to Hanoi (schedule: 21:00 – 05:00)."},{"title":"TRAVELLING FROM HANOI TO THE LANTERN TOWN (B)","description":"Arrive to Hanoi in early morning, check in at the hotel. Take rest and have leisure time before pick up to the aiport for flight to Hoi An.\nOvernight stay in Hoi An."},{"title":"EXPLORE THE ANCIENT RUIN OF KMER (B)","description":"My Son temples were built from the 4th century under the reign of king Bhadravaman, until late 13th century, and early 14th century under the reign of King Jaya Simhavaman III (Che Man). My Son used to be a group of more than 70 temple towers. Each temple has a typical architecture which reflects a historical stage of the Champa kingdoms. Most of the architecture and sculptures were influenced by Indian culture. Most of the temples point to the East, the sun direction. Champa people thought that the East was the place where the gods lived.\n08:00 AM: Pick you up at your Hotel, you up at your hotel in Hoian Town.\n09:30 AM: Visit My Son Holly land, spend 2 hours to enjoy and discover the beauty of Ancient buildings at of the ChamPa Kingdom with our tour guide\n12:00 AM: Leave My Son and transfer to boat – station, get on boat cruise along Thu Bon river to traditional craft village of Thanh Ha pottery and Kim Bong carpentry villages. A snack will be served on boat. Arrive Hoi An river dock at 3PM. Say goodbye.\nThe end of tour"},{"title":"GREETNGS FROM VIBRANT HO CHI MINH CITY (B)","description":"Have breakfast at the hotel and ready to be picked up to the aiport for flight to Ho Chi Minh\nOvernight stay in Ho Chi Minh City."},{"title":"DISCOVER THE LUSH OF MEKONG DELTA (B/L)","description":"(start 7.20am  – return around 17.30 )\n7:20am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh"},{"title":"HISTORY LESSON MYSTERIOUS CU CHI TUNNEL (B)","description":"Depart for Cu Chi tunnel, the trip will take approximately one and a half hours driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. "},{"title":"TIME TO SAY GOODBYE - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Lifetime Vietnam Family Holiday from Hanoi to Saigon via Hue, Hoi An, Halong Bay","duration":13,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1410,"summary":"This trip is designed to offer you a fantastic range of the unique holiday experience of Vietnam’s famous tourist destinations from the north to the Central and South such as Halong Bay, Hanoi, Hue, Hoi An, Nha Trang, Ho Chi Minh City and Mekong River Delta…. ..","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130176_dcf5329f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130176_dcf5329f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_b71bc5df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_09aac014.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_0a70d444.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_4b7d894e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_3a550671.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_a2a517ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_5766b335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_ce0deb84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_0e65d339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_0b5279bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_2fd0e1bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_bfa168bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_1e88a28a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_2dc47da4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_4df35305.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_fd0655b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_37f01cad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_78e07e74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_05378bc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_b2b061e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130176_a0f732d1.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Day 1: Arrival – Hanoi Sightseeing Tour","description":"Arrive in Hanoi, the capital of Vietnam. The city was founded in 1010 on the right bank of the Red River and was then known as ‘Thang Long’, roughly translated as “Soaring Dragon.” Hanoi is one of the most charming cities in South East Asia with its authentic street scenes, large shady avenues, numerous lakes, manicured gardens and well-preserved architecture.\nTransfer from Noi Bai airport to the hotel for check in and short break. If time permits, join us on a city sightseeing highlights. The tour includes a visit to the complex of memorials to Ho Chi Minh (visit outside), the Single Pillar Pagoda, the Temple of Literature and a rickshaw ride through the lively Old Quarter.\n\nOvernight in Hanoi."},{"title":"Day 2: Hanoi – Halong Bay","description":"After having breakfast at hotel, you'll be picked up by our shuttle bus to get to Halong bay\n12h00: Arrive Halong Bay.\n12h30: Boarding Royal Heritage Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the Bai Tu Long Bay.\n15h15: Visit splendid Surprising Cave (Sung Sot Cave). This is one of the most beautiful grottoes in Halong\nBay. You will feel surprised about imposing stalagmites, stalactites and many legend stories about that. \n16h15: Time for kayaking around Luon Cave area. You will have got around 45 minutes to explore Halong bay and some tunnel by yourself.\n17h00: Back to Royal Heritage Cruise and drop anchor in the calm water surrounded by beautiful islets for swimming.\n17h30: Enjoy the complimentary sunset party on the sundeck with green tea and fresh fruits. \n19h00: Dinner is served in the restaurant. \n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. \nRelax and spend a romantic night on our Cruise"},{"title":"Day 3: Halong Bay – Hanoi – Flight to Hue","description":"06h30: Rise up early with Tai Chi exercises or a photo hunt \n07h30: Have breakfast at sunrise\n08h30: Continue your cruise to Titov Island \n09h15: Continue cruising and exploring the Bay by a visit to Hoa Cuong fishing Village, Ba Hang fishing village, Ga Choi Island, Dinh Huong islet and more….\n10h00: Join Vietnamese Cooking Demonstration\n10h30: Enjoying a traditional Vietnamese lunch while cruising back through Halong Bay to the pier.\n11h30: Disembarkation. Time to say goodbye to the crew.\n12h00: Transfer back to Hanoi by our shuttle bus\nAt around 16:00, right after approaching Hanoi's center, our tour guide & driver on another private car will pick you up then transfer to Noi Bai airport for your flight to Hue. On arrival in Hue, transfer to your hotel and check in\nOvernight in Hue"},{"title":"Day 4: Hue Sightseeing Tour","description":"The day is spent discovering Hue, capital of Vietnam from 1802 to 1945 during the reign of the Nguyen dynasty. Begin with a cruise along the peaceful Perfume River, taking in the endless surrounding greenery heading to Thien Mu pagoda, the symbol of Hue city. After embarkation, you’ll climb a number of steps to reach it, but the effort is worth it. \nThe Thien Mu Pagoda has its roots in a local legend: an old woman once appeared on the hill and said that a Lord would come and build a Buddhist pagoda for the country’s prosperity. Hearing of this, Lord Nguyen Hoang ordered the construction of the pagoda of the “Heavenly Lady” (Thien Mu). The octagonal Phuoc Dien Tower (1864) in the front of the complex rises 21 meters high and has seven levels.\nThe seven successive tiers, each of which is dedicated to a human form taken by the Buddha or a step to enlightenment depending on whom you ask. Near the entrance gate are 12 huge wooden sculptures of fearsome temple guardians with real facial hair. Near the rear of the complex houses a national relic: the car in which the monk Thich Quang Duc rode from his temple to Saigon on June 11, 1963. He stepped out of the car in an intersection, sat down in the lotus position, and burned himself to death in protest against the regime’s violations of religious freedom.\nContinue your tour with a visit to the Citadel, seat of the Nguyen Dynasty emperors. Construction began in 1804 under the orders of the first Emperor Gia Long after the site had been selected using principles of geomancy. The site is composed of three sections; the capital city (Thanh Kinh), the imperial city (Hoang Thanh) and the Forbidden City (Cam Thanh). It was largely destroyed in 1968 during the fighting that engulfed Hue following the Tet Offensive. Today, efforts are being made to restore and preserve this invaluable piece of heritage\nIn the afternoon, transfer to the tomb of Emperor Khai Dinh to admire the unusual combination of architecture that blends a traditional Chinese past with a modern Western future. Follow it with a visit to Thuy Xuan incense village, one of the last villages preserving the traditional profession, the elegant beauty of the old Capital. Overnight at the hotel in Hue."},{"title":"Day 5: Hue – Hoi An Sightseeing Tour","description":"Depart Hue for Hoi An along Highway 1 which links Hanoi to Ho Chi Minh city. This drive is reputedly the most beautiful in all Vietnam, taking you past coastal fishing settlements, most notably Lang Co with its stunning lagoon backdrop. The drive also takes you over Hai Van Pass, or ‘pass of the ocean clouds’. En route stop in Da Nang for a visit to the informative Cham Museum, which houses one of the largest collections of Cham artifacts in the world (optional).\n\nEn route, stopping in a village of stone carvers at the foot of the Marble Mountain. Continue on to the delightful town of Hoi An which stands on the banks of the Thu Bon river, some thirty kilometers southeast of Da Nang. Around the fifteenth century, this old port town in the kingdom of Champa was known as Faifo. Check-in to hotel on arrival.  Enjoy lunch at a local restaurant.\n\nThe afternoon is spent strolling through the narrow streets of this atmospheric old town. This former port, a UNESCO World Heritage site, is full of architectural gems that show a range of influences. Visit the Japanese bridge, the temple of the genie of water,  the Fujian temple and the fish market. Around the seventeenth century Hoi An was one of the busiest ports in South East Asia, with Chinese, Portuguese, Japanese, Dutch, French and English merchants visiting the town in search of spices, lacquer ware, and ceramics.\n\nEnriched by the proceeds of this trade many merchants constructed beautiful homes. One can admire these charming houses along Tran Phu Street, one of the oldest in Hoi An. Architecture in the old town tends to show an integration of Sino-Japanese influences in a local style. Most buildings share the same overall plan; built on two levels, they are constructed like a tube between two streets that run parallel. In the late afternoon take a boat ride on the Thu Bon River for the chance to view some beautiful rural scenery, finishing at around sunset. \n\nOvernight at the hotel in Hoi An."},{"title":"Day 6: Hoi An – Tra Que – My Son Sightseeing Tour","description":"Depart early for the village Tra Que, where you can learn more about rural life in the region. Meet the locals and participate in some of their daily activities, whilst learning more about their lifestyle. Finish off your experience with a delicious lunch featuring some of the produce grown locally.\n\nIn the afternoon, continue your exploration of the area with a trip to My Son. Located approximately 60 km south of Da Nang this site is considered the most important Cham site in Vietnam and is classified by UNESCO as world heritage. The collection of temples, shrines and towers were constructed in a stunning valley and is ringed by verdant rainforest."},{"title":"Day 7: Hoi An – Danang – Flight to Nha Trang","description":"Transfer to the airport for your flight from Da Nang to Nha Trang. On arrival, transfer to your hotel and check in.\nThe afternoon is devoted to a city tour of Nha Trang. Visit the famous Cham towers of Po Nagar, a stunning Cham complex and the peaceful Hon Chong promontory. Conclude the tour with a trip to the Long Son Pagoda and its enormous white Buddha. Located on the outskirts of town, it is the oldest pagoda Nha Trang. \nThe rest of time, you'll be free to linger on the beach or explore this picturesque seaside resort. Whilst also being a fishing port, Nha Trang has one of the best beaches in Vietnam. Lined with coconut palms, the beach is a perfect place to relax and enjoy the many sunshine hours that Nha Trang enjoys. With regards to dining, seafood fans should not miss out on some of the delicious local fare. \nOvernight in Nha Trang"},{"title":"Day 8: Nha Trang Beach Leisure (Seat-in-Coach Tour)","description":"In the morning travel to Nha Trang quay where you will board your boat for an unforgettable trip around the man islands that ring the city. After a short cruise, disembark for a beautiful walk to the Tri Nguyen aquarium, on nearby Tri Nguyen Island. Here you can admire many species of fish, shrimp, crabs and giant turtles. The island is also home to a small fishing community named Hon Tam. Here you will have the opportunity to enjoy the laid back atmosphere as you sample some delicious seafood dishes.\nOvernight in Nha Trang"},{"title":"Day 9: Nha Trang – Ho Chi Minh city – Sightseeing Tour","description":"Breakfast. Free until transfer to the airport for flight to Ho Chi Minh City. Arrival in Ho Chi Minh City and picked up by the local guide.\n\nBegin your exploration of this frenetic city with lunch at a local restaurant. Not only is Ho Chi Minh city the most important economic Centre in Vietnam, it also has some very imposing colonial architecture which belies in fascinating past. Almost a hundred years of French rule bestowed upon the city some pearls of colonial architecture. Visit the central post office, designed by Gustave Eiffel, and the Notre Dame Cathedral, inspired by its counterpart in Paris. \nContinue your city tour with a visit to District 5, formerly known as Cho Lon or China Town. Cho Lon, or ‘big market’, with its congested streets is where most of the city’s ethnic Chinese population lives. The district lives up to its name in the form of Binh Tay wholesale market. Founded in 1778 the market sells a stunning array of goods and produce, ranging from fish to incense. Finish your city tour with a stop at Thien Hau temple, otherwise known as ‘Temple of the Heavenly Lady’, to marvel at its intricate friezes and coils of incense. \n\nOvernight in Ho Chi Minh City"},{"title":"Day 10: Ho Chi Minh city – Tay Ninh – Cu Chi","description":"Excursion to Tay Ninh to visit the spectacular Cao Dai temple, the Cathedral of the religion of the same name. This sect, originating in Vietnam, draws freely from other philosophies of Christianity and Confucianism. The architecture of the cathedral is stunning, neither Eastern nor Western. You can attend the main ceremony at Noon (Remove your shoes before entering). Lunch at a local restaurant.\n\nContinue to visit Cu Chi, where the Viet Cong confused the Americans through a miracle of primitive technology. The guerrillas escaped from their enemies through a maze of resistant bomb tunnels that span nearly 200 km. Most of these tunnels are too narrow for Western visitors, who usually, rapidly become claustrophobic. But a small portion of the labyrinth has been enlarged to give tourists a glimpse of the city underground Cu Chi. Back in Ho Chi Minh City at the end of the afternoon.\n\nOvernight at the hotel in Ho Chi Minh City"},{"title":"Day 11: Ho Chi Minh city – Cai Be – Vinh Long – Can Tho","description":"Start early by road to Cai Be located 105 km south of Ho Chi Minh City. Now boarding a boat on the Mekong through the floating markets of Cai Be, where you can admire displays of fruits and vegetables. Explore islands, visiting factories where they prepared delicious sweets based small coconut, popcorns, rice cakes and so on. Lunch in a garden of bonsai or in an old house. You will enjoy the famous fish “elephant ear”. \nContinuation of visit by a small sampan ride through the shady canals to Vinh Long. You will cross over the parkway many small boats carrying fruits, vegetables and fish. Parkway in orchards, tasting tropical fruits. In late afternoon, transfer by road to Can Tho, an important rice in the Mekong Delta, known as the Capital of the West, located at the edge of Hau Giang, arm the southern Mekong. Dinner. At night, it is good to stroll on the docks Ninh Kieu, bordering the river\n\nOvernight in Can Tho"},{"title":"Day 12: Can Tho – Ho Chi Minh city","description":"Parkway morning boat to the floating markets of Cai Rang, then continuation to the discovery of small channels through the islands covered with lush flora. Cycle the parkways and paths through orchards (optional), tasting tropical fruits. Lunch. Landing. Return to Ho Chi Minh city. Overnight in Ho Chi Minh city"},{"title":"Day 13: Ho Chi Minh city – Departure","description":"Free day until departure. Enjoy a last stroll to admire the colonial architecture, visit the colourful markets or take a trip through the frenetic streets in a cyclo. Free until departure from hotel. Transfer to the airport for departure flight. Breakfast included."}]},{"name":"Extraordinary Vietnam Adventure Tour 13 Days ( Tu Lan Cave Camping/ Hanoi/ Mai Chau)","duration":13,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2181,"summary":"Adventure is all about the experiences, let's go off the beaten path on this journey to Vietnam. Starting off the trip in the charming Hanoi, on the back of the bike, exploring the city’s labyrinth of backstreets and admire the faded glory of the architecture around the French Quarter. Travel out of Hanoi to a rustic, rural region that feels a world away from modern life. Mai Chau is an inspiring combination of stunning scenery and fascinating local culture. Next stop, we visit the spectacular terraced mountainside of Sapa and North Vietnam. Bring your hiking boots and head out into the hills, stopping at minority villages to witness traditional local life first-hand. Then deep in the misty, vine-clad mountains along Vietnam's border with Laos lies Phong Nha-Ke Bang National Park, one of the country's most beautiful and unspoiled regions. Discover the breath-taking enormous cave complexes which riddle its towering peaks and explore Tu Lan Cave, an accessible for all levels as a part of Son Doong Cave systems, reputedly the largest cave in the world. Leaving Quang Binh behind, you’ll then fly to Ho Chi Minh for another spot of urban-exploration. A restored Army Jeep will take you to get around the bustling street and to the city’s historic landmarks, from the Opera House to the Notre Dame Cathedral. Also for a full picture of Vietnam’s past, you’ll also stop by the War Remnants Museum which offers powerful insight into the Vietnamese War years.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58db.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142656_5eb234ebb58ef.jpg"],"destinations":["Hanoi","Mai Chau","Sapa","Phong Nha-Kẻ Bàng National Park","Ho Chi Minh City"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"HANOI VESPA TOUR (B/L)","description":"We pick up you and driver through narrow street come to meeting point for join with group at the historic Old quarter our first stop to visit the French quarter and visit Opera house where you will learn about French colonial and architectural and the history\n\nOur Vespa rider you driver you to second destination to see the railway train tracks, we can see how of the locals life & work, just Centimetre from the train tracks in tall narrow houses\n\nAfter short ride on the Vespa toward Ho Chi Minh Mausoleum our rider will stop at the point you can see overview of the area including president place, parliament house and all government office, our guide will tell you about the history and story about Hanoi ...\n\nNow time continue rider through pass to see botanical garden and ride pass Small Alley see the narrow houses to visit Huu Hiep Lake to see the B52 Crash site at the lake, this US bomber was shot down during the 1972 bombing raids of Hanoi, a poignant reminder of recent history\n\nOur next ride to visit west lake one of the biggest lake in Hanoi city, some point we can see overview of the city with beautiful houses and amazing view and see part of the rich people living\n\nDriver to Thanh Nien street Next to west lake is Truc Bach lake where we stop at the monument of John MC Cain and see the lake and the place he get shot down, you will learn about the story of John MC Cain\n\nIt's back on the Vespa for the ride to the An Duong market to see where local people come to buy and sale fresh vegetable and food for the daily life, and stroll around this huge, bustling place take in the vibrant atmosphere that stypifies Hanoi\n\nOur next ride takes us along the riverside get on the red river island to visit a hidden gem village, here also see poor part of people live, and to see people farming on this island and also have chance to meet and chat with people live on this island, and our guide will take you to visit a local family to see how about the daily life\nThen now we driver up through the banana farm see the beautiful and green of the vegetable farm along the way and now the time we get to visit Kumquat farm these little trees are traditional gifts at Tet, the Vietnamese lunar new year, and adorn every family home, symbolizing , Luck. Health, Wealth, Fertility and peace\nAfter long Driver and visiting now our time for relax enjoy Vietnamese coffee and you could try the famous coffee of Hanoi is Egg coffee\nAfter all our last destination we then ride out of the city to the Long Bien Bridge, a magnificent structure build over a hundred of years ago with spans the red river and connects the Hoan Kiem and Long Bien districts and provides shelter to locals living on the boats underneath, on motorbikes & bicycle can traverse so off we go!\nWe then get on the Vespa and head to the local restaurant for you enjoy the Vietnamese cuisine , after lunch our Vespa team will ride you back your hotel stay or you can get off anywhere you want just tell our rider\nOvernight in Hanoi."},{"title":"HANOI - TRANSFER TO MAI CHAU – OVERNIGHT AT MAI CHAU HIDEAWAY (B)","description":"Have breakfast at the hotel, leisure time on your own before the driver come to the hotel and pick you up for transfer to Mai Chau. Arriving in Mai Chau and relaxing time in the beautiful village\n\nOvernight in Mai Chau."},{"title":"MAI CHAU BOATING TOUR (B/L)","description":"Beautiful and various landscapes with limestone mountains, waterfalls, floating villages, Fairy Pond, Hoa Binh Lake\nDiscovering the nature and daily life of Thai and Muong ethnic people.\n8h30 AM: After breakfast, Take a boat trip on Da River as the biggest lake of Vietnam.\n9h00 AM: take a short brake to visit a floating houses and experience fisher man daily life there.\n10h00 AM : we head to Ngoi Hoa Bay then takes around 15 minutes to climb up to Fairy Pond, it’s beautiful and pristine, you will love it at first sight. . The water here is blue like jade.\n11h30 PM: Back to Mai Chau hideaway resort, end of service.\nOvernight in Mai Chau."},{"title":"MAI CHAU – HANOI – TRAIN TO SAPA (B)","description":"Have a breakfast at your hotel. Enjoy your rest of time in Mai Chau then our driver will pick you up to Hanoi\nCheck in hotel in Hanoi and relax. Until 8:30 – 8:45pm, our driver will pick you up from your hotel to train station. Take a night train to Sapa.\n\nOvernight on train."},{"title":"LAO CHAI – TAVAN – GIANG TA CHAI – SAPA (B/L)","description":"The day is devoted to a beautiful hike through the breathtaking scenery of Sa Pa valley. Start by road that descends in the wake of the street Cau May (6 km) En route, admire the rice terraces hidden behind mist of the morning, a truly awe-inspiring sight.\n\nFollow a small track and cross Muong Hoa River and pass well tended rice terraces on your way to the Black Hmong village of Lao Chai. Continuing through the colorful rice terraces you will reach the village of Ta Van Giay. As you continue your trek along the Muong Hoa River you will cross a small suspension bridge, roughly 2km from the settlement. Here you can discover a fascinating collection of rock carvings. These engravings depict some beautiful images of man, stilt houses and some beautiful decorative patterns. We lunch in a home in the village. After lunch the walk continues through a bamboo forest to Giang Ta Chai, a Red Dao ethnic minority village. After taking a rest nearby a waterfall to refresh, you start climbing uphill to a road where the car is ready for your journey back to Sapa.\nOvernight in Sapa."},{"title":"TAPHIN RED DAO HILL TRIBE VILLAGE – TRAIN TO HANOI (B/L)","description":"Have a breakfast at your hotel . Yur journey will be mostly driving downhill toward Lao Cai, before taking a left turn into a small paved road leading to Taphin village. Here you can experience the unmixed cultural life of Black Hmong and Red Dao minorities, 2 largest ethnic groups in the area. They live happily together while maintaining their own tradition from generation to generation. You can recognise them by dressing while they are both very famous of handicraft. You will enjoy walking among local people. The trip also offers you the opportunity to visit the local houses. You will return Sapa by car.\n\nThen our driver will pick you up from your hotel to train station. Take a night train to Hanoi\n\nOvernight on train."},{"title":"TRAVEL FROM HANOI TO QUANG BINH (B/L)","description":"Have a breakfast at your hotel then our driver will pick you up to the airport. Take a flight to Dong Hoi\n\nOvernight in Dong Hoi."},{"title":"PHONG NHA - TAN HOA - TU LAN (B/L/D)","description":"You will be picked up at your hotel and transfer to  Tan Hoa, located 70 km away. After a safety briefing and gear check, you need to sign our Release Form before it's off and away for a full day of trekking. The trek begins with a 2.5 km march across fields of peanut crops, giant water buffaloes, towering corn stalks, and down to the Rao Nan River. The adventure accelerates with a 30 m climb up a rocky hill to a small jungle opening where you can catch your breath before a 100 m descent in elevation down to Hung Ton Valley.\n\nLunch will be enjoyed in the Hung Ton Cave opening and then the adventure picks up again with some serious trekking from Hung Ton Valley and over to Mango Mountain, then back down into Tu Lan Valley (3 km). By midafternoon, Tu Lan campsite will be on the horizon, where swimming can be enjoyed in the beautiful waterfall. Afternoon activities include exploring and swimming through Ken Cave, located next to the campsite, and after that it’s back to camp for a delicious BBQ dinner. Sleep will come easy in comfortable hammocks or tents set up amongst the trees!\n\nOvernight in Tu Lan"},{"title":"TU LAN - TAN HOA - PHONG NHA (B/L)","description":"The second day starts with a hearty breakfast, and more cave exploration. Starting with a brief swim across the river into the heart of Tu Lan Cave System, you will break to enjoy the blue lagoon entrance before making your way 180 m downstream through Tu Lan Cave entrance. Make your way up to explore the dry part with some climbing and squeezing, at which point you will reach the dry exit and trek a short way through the valley into Kim Cave dry entrance. Stay a while for watch out the natural window and then you will be off on a swim (450 m) and trek (500 m) through Hang Kim to To Mo Valley. A picnic lunch will be served next to a stunning waterfall by Hung Ton Cave mouth. Then, you will try to follow a dry path before swimming out through Hung Ton wet cave. Following this is the exploration of a dry passage, and then a trek down into Hung Ton Valley (800 m). Arrival in Tan Hoa is followed by a chance to take in the scenery with a cold drink in hand. Showers are available for those who would like to clean up and change, and then departure back to Phong Nha is at around 4 pm, with arrival in Phong Nha by 5:30 pm (Note: 6:00 - 6:30 pm from November to March).\n\nOvernight in Quang Binh"},{"title":"QUANG BINH – FLY TO HO CHI MINH CITY (B)","description":"Have some rest and free time until you will be transferred to the Dong Hoi airport for your flight to Ho Chi Minh.\nUpon arrival you will be met at the airport and transferred to your accommodation.\n\nOvernight in Ho Chi Minh City"},{"title":"HO CHI MINH CITY BY JEEP CAR (B/L)","description":"8:00am (or 1:30pm) Jeep pick you up at hotel and begin the city tour.\n\nFirst stop on your tour Jeep will take you go to visit the Independence Palace/ the Reunification Palace. The palace is symbolic of the end of the Vietnam War during the Fall of Saigon on April 30, 1975, when the North Vietnamese Army tank number 843 crashed through the gates of what was at the time the residence of the President of the Republic of Vietnam.\n\nNext, you will admire the Museum of American War Crimes/ the War Remnants Museum is the most popular museum of Ho Chi Minh City. It gathers a collection of the machinery, weapons, photos, and documentation of Vietnam’s wars.\n\nAfter the Museum, you will see Notre Dame Cathedral and the Old Post Office are the two of the best highlights of old Saigon architecture, and are located next to each other and right in the heart of Ho Chi Minh City.\n\nAnd then, Jeep will take you visit some famous road in Saigon as Dong Khoi street, Nguyen Hue strt. Jeep go ahead to visit to Ben Thanh Market, a lively market in District 1, where your guide can help you barter for goods. And then, Jeep go to Bui Vien street and go back your hotel .\n\n12:00pm (or 5:30pm) finish the tour.\n\nOvernight in Ho Chi Minh city."},{"title":"HO CHI MINH CITY DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]}]