[{"name":"Simply Vietnam","duration":12,"travelStyle":["Discovery","Group","Fully Guided"],"oldPrice":1539,"price":1489,"summary":"With its long history, interesting culture, and gorgeous scenery, Vietnam offers something for everyone. On this Vietnam tour, you’ll overnight in Hanoi, Ha Long Bay, Phong Nha National Park, Hoi An, Hue, and Ho Chi Minh City. Sightseeing tours in the cities feature the must-see historic sites, including Hanoi’s Temple of Literature, built in 1070, and One Pillar Pagoda, built in 1049; Hoi An’s Japanese Covered Bridge; Hue’s Forbidden Purple City, the emperor’s residence constructed in 1804; and Hoi An’s Thien Mu Pagoda. In Ho Chi Minh City, your sightseeing includes the War Remnants Museum and the Cu Chi region, where you'll have a chance to enter and explore the deep, narrow tunnels constructed by the Viet Cong during the war.You'll enjoy seeing some of Vietnam's most gorgeous sights and destinations via the water. Cruise on Ha Long Bay, a UNESCO World Heritage Site with some of the world's most amazing limestone scenery. You'll sail by islets, caves, beaches, and floating villages. In Phong Nha National Park, a boat ride on the Son River takes you to Phong Nha Cave. You'll also enjoy a cruise in Hoi An on the Thu Bon River, where you'll pass unspoiled countryside. These are just some of the many highlights on this tour through Vietnam. From the historic sites to the gorgeous scenery, this Vietnam tour designed for savvy, value-minded travelers is a vacation of a lifetime!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/52389_114c8cff.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/52389_114c8cff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_4142e52a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_b01aaa19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_d421cb7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_401c9225.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_a253c238.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_a448e16d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_e5da9b35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_1126a79b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/52389_e14ab8e2.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Day 1: HANOI, VIETNAM","description":"Welcome to Vietnam’s capital city. Hotel rooms are available for a mid-afternoon check-in."},{"title":"Day 2: HANOI","description":"Today’s included sightseeing tour takes you to many of the city’s highlights, including the TEMPLE OF LITERATURE, a peaceful series of walled courtyards and gateways, and ONE PILLAR PAGODA, designed to resemble a lotus blossom. You will also see Ho Chi Minh’s stilt house, Hoan Kiem Lake, and the fascinating network of alleyways and shop houses that make up the Old Quarter. This evening, enjoy a performance of Hanoi’s famed WATER PUPPETS. (B,D)"},{"title":"Day 3: HANOI-HA LONG BAY","description":"Drive to Ha Long Bay, one of Vietnam’s favorite destinations, and board your DAY CRUISE through the stunning bay. Enjoy lunch on board as you sail through the dramatic limestone islands, then explore the Sung Sot (Surprising Cave) and visit Titov Island. (B,L)"},{"title":"Day 4: HA LONG BAY–HANOI–PHONG NHA-KE BANG NATIONAL PARK","description":"Return to Hanoi this morning and fly to Dong Hoi. From here, journey inland to remarkable PHONG NHA-KE BANG NATIONAL PARK, a UNESCO park littered with beautiful jungles, caves, and underground rivers. Your lodging tonight is a charming farmstay at the base of park. (B,D)"},{"title":"Day 5: PHONG NHA-KE BANG NATIONAL PARK","description":"This morning, take a BOAT RIDE on the Son River to PHONG NHA CAVE, famous for its rock formations with names like the “Lion” and the “Buddha.” The afternoon is at your leisure to enjoy the activities and serene views at your hotel. (B,L,D)"},{"title":"Day 6: PHONG NHA-KE BANG NATIONAL PARK–HUE","description":"Drive to Hue, stopping at the DMZ bridge en route. Upon arrival in the imperial walled city of Hue, visit the FORBIDDEN PURPLE CITY, modeled after Beijing’s famed Forbidden CIty. During your visit, you will see Thai Hoa Palace, the Halls of the Mandarins, and the Nine Dynastic Urns. (B)"},{"title":"Day 7: HUE–HOI AN","description":"Begin today with a visit to pretty THIEN MU PAGODA, made up of seven tiers, each dedicated to a step assumed by Buddha to reach enlightenment. Continue up the river to the IMPERIAL TOMB OF MINH MANG, a majestic complex of courtyards, pavilions, and temples in a beautiful setting. Head south through spectacular Hai Van Pass (weather permitting) and visit the CHAM MUSEUM, then continue to the charming town of Hoi An. (B,L)"},{"title":"Day 8: HOI AN","description":"Start today with a CRUISE on the Thu Bon River, passing unspoiled countryside. Then, a leisurely WALKING TOUR through Hoi An Ancient Town brings you to the Japanese Covered Bridge. The remainder of the day is at your leisure. (B)"},{"title":"Day 9: HOI AN–HO CHI MINH CITY","description":"Enjoy your morning at leisure. This afternoon, fly to Ho Chi Minh City, Vietnam’s largest and most vibrant city, packed with timeless traditions. (B)"},{"title":"Day 10: HO CHI MINH CITY","description":"Today’s sightseeing tour takes in Dong Khoi Street, the main shopping thoroughfare, Notre Dame Cathedral, and the Central Post Office. Afterward, visit the REUNIFICATION PALACE and the WAR REMNANTS MUSEUM, as well as the Chinese district. (B)"},{"title":"Day 11: HO CHI MINH CITY. CU CHI TUNNELS EXCURSION","description":"Today, visit the CU CHI TUNNELS, an extraordinary network of tunnels more than 120 miles long that was used by the Viet Cong as a hideout and secret village during the war. See secret trapdoors, underground kitchens, living areas, and meeting rooms. If you are feeling adventurous, you may enter and explore the deep, narrow tunnels. (B)"},{"title":"Day 12: HO CHI MINH","description":"Your tour ends with breakfast this morning. (B)"}]},{"name":"9 Days Essential Vietnam trip from South to North, Max 6 Guests","duration":9,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":1749,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nOur 9 day Essential Vietnam trip includes almost all important cities of Vietnam. Departs from Ho Chi Minh City in the south, there are a large number of French-style buildings, full of French style, followed by the Mekong Delta to experience the local flavor. Then you will come to the cities of central Vietnam - Hoi An and Hue. There are two World Heritage Sites that can not be missed. One is the Hue Ancient Buildings and the other is the Hoi An Ancient City. Finally, we will come to the quiet capital city Hanoi and indulge in the beautiful natural scenery of Halong Bay by a relaxing cruise trip.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/176668_2e649c7e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/176668_2e649c7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_144913d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_cbd5020b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_aa4535c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_4d175109.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_4421b5ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/176668_5ba12f14.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 01: Arrival in Ho Chi Minh City","description":"Welcome to Vietnam's financial hub: Saigon (Ho Chi Minh City). Upon arrival, our guide and driver will pick you up from the airport and transfer you to the hotel. Enjoy the rest of the day at your leisure to recover from jet lag and explore the city on your own. \nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 02: Ho Chi Minh City","description":"After breakfast, let's start the day tour with Ho Chi Minh City's China Town - Cholon, where you will visit some of the Temples dedicated to the worship of Tin Hau, Avalokitesvara, Buddha or Taoism. Later, we will enjoy the first Museum of Traditional Vietnamese Medicine (FITO). After lunch, we visit the War Remnants Museum and former Presidential Palace. As a conclusion of the day, you will have time to visit some French colonial architecture such as the Notre Dame Cathedral and the Old Post Office. \nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 03: Ho Chi Minh City - Ben Tre - Ho Chi Minh City","description":"Today you will spend a day away from the busy city and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong river. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where your car will take you to Saigon.  \nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 04: Ho Chi Minh City - Danang - Hoi An","description":"We will see you off to take a flight to Danang and our local guide will transfer you to the ancient town Hoian. We will have a half-day walking tour through the winding streets with some stopovers at attractions including Chua Ong Pagoda, the Chinese Assembly Hall, the 200-year old Tam Ky ancestral house and the famous Japanese Bridge. Finally,you will have a short relaxing experience on the river by boat to conclude today's tour.  \nMeal: Breakfast\nAccommodation: The Beach – Little Boutique Hoian (4 stars) or similar"},{"title":"Day 05: Hoi An - Danang - Hue","description":"This morning we will drive you to Hue by a private car. You will gothrough Hai Van pass, have a drink at the beautiful Lang Co Beach before continuing on to Hue. We will have an afternoon walk around the town and visit some attractions including the Imperial City (The Citadel), Hue Royal Palace, and the Mausoleum of Tu Duc. \nMeal: Breakfast\nAccommodation: Moonlight Hotel (4 stars) or similar"},{"title":"Day 06: Hue - Hanoi","description":"This morning, you will have a private boat cruise down the river to visit Thien Mu Pagoda. Later spend some time at the busy Dong Ba Market and the ornate Minh Mang's tomb before boarding the flight to Hanoi. Upon arrival, your guide will meet you at the airport and transfer you to check in at the hotel. \nMeal: Breakfast\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 07: Hanoi","description":"Today you will have a full day to explore this ancient and charming city thoroughly. First, we will arrive at Ba Dinh Square area, from which you will visit the nearby attractions to Ho Chi Minh's Mausoleum (closed on Mondays, Fridays, evenings & annual maintenance during Sept – Nov) and the stilt house, One Pillar Pagoda, the Presidential Palace. Then we go to the West Lake area, pay a short visit to the sedate Tran Quoc Pagoda & Quan Thanh Temple by the lake. In the afternoon, visit the Temple of Literature and the History Museum or the Ethnology Museum. The tour today ends by enjoying a special Water Puppet Performance at Hoan Kiem Lake area. \nMeal: Breakfast\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 08: Hanoi - Halong Bay","description":"Your guide and driver will meet you at the lobby of your hotel and then set out on around 3-3.5 hours drive to the UNESCO World Heritage Site: Halong Bay. Board the cruise at around noon and have lunch onboard while sailing out into the mysterious bay. You will take an excursion to one limestone cave to view a great many stalactites and stalagmites. Stay overnight on the cruise.\nMeals: Breakfast, Lunch & Dinner\nAccommodation: Signature Cruise (4 stars) or similar"},{"title":"Day 09: Halong Bay - Hanoi - Departure","description":"You may find it interesting to participate in Tai Chi on the top deck. After a morning cup of coffee or tea, take a rowboat to explore some of the nearby islands. Then back to the junk for brunch. Upon your arrival at the dock, your guide and driver will meet you and transfer you to Noi Bai International Airport for your departure flight home. Your memorable Vietnam travel ends here.\n\nMeals: Brunch"}]},{"name":"Ha Noi - Ha Long Bay - Overnight On Cruise 4 Days 3 Nights Package Tour.","duration":4,"travelStyle":["Family","Group","Partially Guided"],"oldPrice":0,"price":233,"summary":"Highlights :\n\n \tTake Cycle Tour.\n \tVisit Ha Long Bay.\n \tVisit Ha Noi Old Quarter \n \tVisit Thien Canh Son Cave.\n \tKayak around fishing village.\n \tVisit Vietnam Museum of Ethnology\n \tCooking class on Cruise ( On request )\n \tTake overnight on cruise in Ha Long Bay.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df288.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df288.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df26d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df26f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df272.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df274.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df275.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df277.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df279.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df27a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df27c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df27d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df292.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df27f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df280.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df282.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df284.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df285.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df287.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e819abf50c17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df28b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df28d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197405_5e818461df28f.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"HA NOI ARRIVAL (-/-/-)","description":"You will be met by Luco Travel’s tour guide and driver at Noi Bai International Airport and transfer to Hanoi’s Old Quarter. Check in hotel. Free & Easy, or you may like this option as below:\n                        Option : “ Xich Lo ” – Cycle Tour & Water Puppet Show.\nPick up at the hotel by “ Xich Lo”, driver you around Ha Noi’s Old Quarter, Hoan Kiem Lake, Ngọc Sơn Temple an hour and drop off you at the Ha Noi Water Puppet Show.\nWe will watch the Water Puppet Show. Traditional content of water puppet performance contains daily life of Vietnamese farmers (cultivating, tending buffalo, catching fishes…), communal entertainment (swimming contest, dragon dancing…), and/or historical legends (Le Loi returns precious sword…), with a performance that has appealed to audiences for centuries. Back to hotel.\nOvernight in Ha Noi, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"HA NOI - HA LONG BAY - BAI TU LONG BAY (B/L/D)","description":"07:30. Breakfast at hotel and check out.\n08:00. After that our bus will pick you up at your hotel and depart to Ha Long Bay. Ha Long Bay is located in Northern Vietnam and is one of the country’s most popular tourist attractions. Aside from being popular with tourists, it is also a culturally recognized UNESCO World Heritage Site. The bay is well known for its scenic karst topography, which is a subject of many popular photos of Vietnam.\nThe term “Ha Long Bay” literally translates to “Bay of Descending Dragons”. However, it was not until the 19th century that this name was officially designated. It was known in ancient times as simply Luc Thuy or An Bang. This natural heritage site was inscribed into the UNESCO World Heritage Sites in Vietnam list in 1994; there were extensions to the site that were added in 2000.\nOn the way to Ha Long Bay, we will have a short break of about 20 minutes. The car will arrive at Bai Chay, Hon Gai Harbor.\n12:00. Pick-up at Hon Gai harbor. Transfer to Tonkin Cruise Boat by tender (5 -10 minutes) \n12:45\tEnjoy a welcome drink, then check in to your cabin \n13:30 Cruise through Bai Tu Long Bay & enjoy lunch aboard with a set menu.\n15:30 Explore VungVieng Fishing Village: Guests may choose to discover the daily life of the fisherman communities by bamboo boat or kayak around Vung Vieng area. ( both options lasting about one hour )\n17:30\tRelax and enjoy the sunset while the boat is cruising to Cong Dong-Cong Do area to anchor overnight.\n18:00\tFree time or take part in the cooking class: learn how to cook traditional Vietnamese cuisines. ( Cooking class can be arranged upon request  )\n19:30. Enjoy delicious BBQ dinner \n21:00\tFree evening to join some activities like board games, squid fishing, or karaoke ( upon request)\nOvernight on Cruise, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"HA LONG BAY - THIEN CANH SON CAVE - HA NOI (B/L/-)","description":"07:00. Wake up early in the morning for Tai Chi exercise.\n07:10. Have breakfast on cruise.\n07:30\tVisit Thien Canh Son Cave (the only cave in Bai Tu Long)\n08:30\tReturn to the boat, relax on the sundeck or watch fruit carving demonstration\n09.30: Check out ò the cabin while our boat heads back toward the harbor.\n10:00 Transfer by tender to the pier and relax inside the pier building while waiting for return transportation.\n10:30    Enjoy the last scenery of the Ha Long Bay over lunch when the boat cruises back to shore.\n11:30:   After lunch, you will board our tender and head back to the wharf where you will be met by your return trip vehicle to transfer you to Hanoi.\n17:00 Arrive in Ha Noi, check in and relax. \nFree & Easy\nOvernight in Ha Noi, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"HA NOI CITY TOUR - DEPARTURE.(B/-/-)","description":"Today is departure day. Breakfast at the hotel, check out, you will visit the memorial complex for the historic figure and father of modern Vietnam - Ho Chi Minh, You will visit the Presidential palace, Uncle Ho's house on stilts, One Pillar Pagoda, and the Temple of Literature - Vietnam's first university that built in 1076, You will also - the picturesque West Lake and the sixth century Tran Quoc Buddhist Pagoda. \nLater, you will enjoy lunch at a local restaurant with special Vietnamese food. You’ll then proceed to check in at the hotel.\nAfternoon:  You will visit the fascinating Vietnam Museum of Ethnology - which is both a research centre and a public museum exhibiting the ethnic groups of Vietnam. The mission of the museum is scientific research, collection, documentation, conservation, exhibition and preservation of the cultural and historic patrimony of the nation’s different ethnic groups. The museum also serves to guide research, conservation, and technology that are specific to the work of an ethnographic museum. \nYou will also visit Hoan Kiem Lake with Ngoc Son Temple where a legendary turtle is reserved, and Hanoi’s Old Quarter, also known as the ‘36 streets’ with plenty of photo opportunities all around you. \nEnjoy some free time for last minute purchases on Dong Xuan Market before your transfer to the airport for your onward flight . Then, home sweet home.\n"}]},{"name":"Vietnam experience 15 days","duration":15,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":925,"summary":"Vietnam excursion 15 days 14 nights package tour will take you to visit the famous destination from the north, central to south.  You have chance to put footprints in Hanoi, Ha Long, Ninh Binh, Hue, Hoi An, Da Nang, Sai Gon, enjoy the cuisine, meet local people, find the cuture. So lovely !\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/185838_754321f2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/185838_754321f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_88edc4bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_b0d09ec2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_746e8728.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_e821f89b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_fcfd5d24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_e0f8dbd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_a61a5843.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_256ec455.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_7d2debbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_fe3e88bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_605a1d18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_0ac520d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185838_24d8ecb1.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City","Mekong Delta","Ben Tre","Can Tho"],"timeline":[{"title":"Day 1: Ha Noi Arrival (no meal)","description":"Welcome to Ha Noi, our driver will meet and transfer you to downtown Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day will be free at your own leisure.\nOvernight in Ha Noi.\n"},{"title":"Day 2: Hanoi - Ha Long - Sung Sot cave- Titop island (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 3: Ha Long – Pearl farm – Hanoi (B/L/X)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard.\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nOvernight at the hotel in Hanoi.\n"},{"title":"Day 4: Hoa Lu – Tam Coc – Mua cave (B/L/X)","description":"07.30 – 8.00 : Get picked up by our friendly guide then depart for NinhBinh province\n09.15 : Have a short break for 15 – 20 mins to relax\n10.30 : Visit Hoa Lư ancient capital of Vietnam between 968 and 1010. You have a chance to\nlearn about Vietnamese history in the feudal system under Dinh, Le and Ly Dynasty\n11.45 : Have buffet lunch in the restaurant with a lot of local foods goat meat, fried rice….\nVegetarian foods is always available in the buffet lunch\n13.00 : Visit Tam Coc by 1.5 hour bamboo boat. During the boat trip, you will be surprised by\nthe charming beauty here with paddy field, river, water, cloud,sky and stunning cave system. All\nmake a masterpiece which Vietnamese people called “ Halong Bay on land”\n14.30 : Continue the tour with 45 mins - cycling around the village to discover the life of local\npeople.\n15.30 : Get back to Limousine Bus then leave for Mua Cave ( Dancing Cave). Walk up almost\n500 steps, you can reach to the top of Lying Dragon Mountain &amp; have an amazing panoramic view of Tam Coc from here.\n16.30 -17.00 : Get on the bus to return to Hanoi\n19h00-19h30 : Get dropped off at Hotel in Hanoi.\n"},{"title":"Day 5: Hanoi -train station transfer - overnight on train to Hue (B/X/X)","description":"Today you are free in Hanoi till our driver come to pick you up for the transfer to the train station.  The train journey will take around 13 hours. On the train you can view the beautiful countryside and coastline. Stay overnight on the train and arrive at the Hue train station at the next morning."},{"title":"Day 6: Arrive in Hue - transfer to hotel (no meal)","description":"Arrive in Hue, our driver would pick you up then transfer you to hotel. Check in the hotel and then you are free in the town (Check in time : 14.00 (2 p.m))."},{"title":"Day 7: Hue City 1 day (B/L/X)","description":"MORNING: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conical Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nAFTERNOON: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue.\n"},{"title":"Day 8: Bus Hue to Hoi An – Free and easy (B)","description":"Have breakfast at the hotel. The bus pick up at the hotel and transfer to Hoi An. On the way, the bus will stop at some destinations. If you would like to visit it, please buy entrance fee by yourself.\n\nArrive Hoi An, you check in the hotel. The rest of day is your own at leisure. \nVisit Japanese Bridge, PhucKien Pagoda, Phung Hung Old House and Quang Dong Assembly. Enjoy a walking tour through the narrow lanes of the town lined with century-old building and illuminated by hundreds of colorful lantern by yourself. \nOvernight in Hoian.\n"},{"title":"Day 9: My Son sanctuary 1 day by boat (B/L)","description":"Depart: 07:30 am | End of tour: 02:00 pm \nPick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu capital which was the the former administrative centre of champa kingdom. Discover the majestic ancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock and board on boat cruise along Thu Bon river.\n12:15 am: Enjoy Local food on Boat (My Quang)\n02:00 pm: Back to your hotel. End the tour.\nOvernight in Hoian.\n"},{"title":"Day 10: Ba Na Hill 1 day (B/L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n09:00 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:00 pm. Drop-off at hotel. End of tour.\nOvernight in Da Nang.\n"},{"title":"Day 11: Da Nang –fly to Ho Chi Minh City (B)","description":"Breakfast at your hotel. You are free until the driver transfer to Da Nang airport, take flight to Ho Chi Minh City\nArrive Ho Chi Minh city, the car pick you up at your hotel. Relax and free. \nOvernight in Saigon.\n"},{"title":"Day 12: Ho Chi Minh City & Cu Chi Tunnels (B/L)","description":"AM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. Discovery Saigon at night by yourself. Overnight in Saigon.\n"},{"title":"Day 13: Ho Chi Minh -My Tho – Ben Tre – Can Tho (B/L/X)","description":"Leaving Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrival at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel. \n\n"},{"title":"Day 14: Cai Rang Floating market – Ho Chi Minh City (B/L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river ( Bassac River), then proceed to visit Cai Răng floating market (& Phong Dien is optional), which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to HCM city. Overnight in Sai Gon.\n"},{"title":"Day 15: Ho Chi Minh City (B)–Departure","description":"Breakfast at your hotel. You have free time to shopping. Then check out and transfer to the airport. \n----------- End of service ----------\n"}]},{"name":"The Most Amazing Vietnam 13days/12nights","duration":13,"travelStyle":["Discovery","Family","Group","Fully Guided","Sightseeing","Holiday"],"oldPrice":0,"price":1988,"summary":"Highlights of trip:\n\n  Visit some of the most popular sites in Vietnam\n  Visit to Cu Chi Tunnels to explore the biggest defensive underground system in the Vietnam War period\n  Luxury junk cruise on the legendary Ha Long Bay.Discovery the poetic city Hue & the ancient town Hoi An.\n  Experience the heart of the Mekong delta with its scenic floating markets. In this semi-aquatic world, you discover how life really is in around this majestic river.\n  Relaxing in Nha Trang Beach \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117121_650d7cce.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117121_650d7cce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_1d8928ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_301055ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_20bf9316.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_76faec33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_eac74d74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117121_27cc162e.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Saigon Arrival ( No Meal )","description":"The first time in the most bustling city of Vietnam.\n\n\nArrival at Tan Son Nhat Airport. Our guide pick up you here and proceed to hotel for checking-in.\n\n\nOvernight at the hotel in Ho Chi Minh City."},{"title":"Day 2: Cuchi Tunnel – Saigon City tour (B/L)","description":"Explore the boiling life-style of the biggest city in Vietnam\nBreakfast at your hotel.\nIn the morning, we start visiting Saigon City: Reunification Palace, Notre Dame Cathedral, Saigon Post Office, Ben Thanh market.\n\n\nAfter the lunch, you will go to Cu Chi Tunnels to explore the biggest defensive underground system in the Vietnam War period.  Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. \n\n\nThen, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs.\n\n\nOvernight at the hotel in Saigon."},{"title":"Day 3: Saigon – Mekong Delta (B/L)","description":"Mekong Delta – a rural but lively floating life.\nBreakfast at your hotel – Follow the bus and tour guide to transfer to Cai Be.\nTake a boat excursion to experience Cai Be floating market – one of the most colorful places on Mekong River.  \n\n\nUpon arrival in Cai Be, have a boat ride to the remaining site of a very renowned wholesale floating market on Tien River many years ago. This site entitles you to know something about the local trading habit that has changed due to the age of modern society when more terrestrial transportation and high-technique of agriculture have dominated everywhere. There, you can realize how diverse the area is and how rich orchard gardens are, which makes it the basket of fruit in the lower part of the Mekong River.  \n\n\nRamble in small villages where you will uncover the beauty of Ba Kiet ancient house and get to know about the indigenous culture. Then we will paddle through small canals – an exciting experience since you can look around, unwind and soak up the wonderful atmosphere of the Upper Mekong Delta. Additionally, after arrival in Tan Phong Island, let yourself immerse in the tranquility of nature.\n\n\nGet back to the dock by sampan and then take the bus back to Ho Chi Minh City. End the trip.\nOvernight at the hotel in Saigon."},{"title":"Day 4: Saigon – Nha Trang Beach (B) by plane","description":"Fly to Nha Trang – the city of beaches\nBreakfast at your hotel – Move to the airport – Flight to Nha Trang city – Check in at the hotel near beach – Enjoy your leisure time.\n\n\nNha Trang is a center of beaches, islands, and interesting oceanic activities. For this reason, Nha Trang is always eventful with a lot of foreigners who want to enjoy the beautiful beaches. With free time here, you can explore around city with its famous sights as Ponour Tower, Dam market, Long Phuoc Pagoda, etc. Tasting some local foods or lying lazily in its private beaches are the ideal ways.\n\n\nOvernight at the hotel in Nha Trang City."},{"title":"Day 5: Nha Trang : Island & Beach ( B)","description":"A day of Islands & Beaches in Nha Trang, Khanh Hoa.\nIt is called “the city of beaches”, Nha Trang is amazing with swimming, snorkeling, or scuba diving. In the recent time, Nha Trang also serves “Walking under the sea tour”. Spend entire your day sauntering to anywhere you want to experience the oceanic programs. Overnight at the hotel in Nha Trang City.\n\n\nYou can refer this below itinerary for your day in Nha Trang: (Charge on request)\nAfter breakfast, Nhat Long bus & tour guide take you to the pier to go to Mun Island. \nWe start to visit Tri Nguyen Aquarium, then going to Tranh beach and Mun Marine Bank, and coming over a fishing Village named Con Se Tre.\n\n\nAt the end of day 5, we go back to Nha Trang City. Overnight at the hotel in Nha Trang City."},{"title":"Nha Trang – Danang – Hoi An (B/D) by plane","description":"Welcome to Hoian - preserved ancient commercial port\nBreakfast at your hotel – Move to Nha Trang Airport – Take a flight to Danang City.\n\n\nAfter arriving, we will pick you up at the rendezvous. We get the tour started and go to visit Marble Mountains.\nYou will visit the Non Nuoc Village at the foot of Marble Mountains. The village is famous for its stone sculptures and handicrafts. Here you can admire many works of art made from stone and marble by the local artists.\nIf you want to challenge yourself physically, the Water Mount, one of the five mountains in the cluster, is a very good choice, with more than 150 steps for you to climb up. Here you can visit many natural caves such as Huyen Khong cave, Tang Chon cave, and Hoa Nghiem cave. Besides, there are also religious places, including the first Linh Ung pagoda in Da Nang, Tam Thai pagoda, and many other beautiful pagodas.\n\n\nSaying good bye to Marble Mountains and the Non Nuoc village, we will go to Hoian ancient town. Upon Arriving Hoian, we will walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda. In Hoian, everything is preserved as they were hundreds years ago.\n\n\nAt night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs.\nWe will introduce to you the specialties of Hoian at dinner. After the meal, we will go back to your hotel in Hoi An"},{"title":"Tra Que Village- Hoi An (B/L)","description":"You will spend half-day discovering Tra Que Village.\nBreakfast at the hotel.\n\n\nLocal guide will see you at your hotel with your bicycle. You will cycle to a local farm in Tra Que Village. A short stroll will take you around the vegetable garden and then you can join the farmers in preparing the land and fertilizing it with seaweed from the local lake. The following steps are raking the ground, sowing, watering, picking vegetable and many other gardening activities. After all these activities, you will take a short rest and enjoy foot bath before getting to preparing lunch with a local family. \n\n\nYour lunch will consist of many local delicacies including “Tam Huu” spring roll, “Banh Xeo” or local pancake of people in Vietnam middle region. You can join the cooking with the chef on these meals. After your morning excursions and your lunch, you will take a Vietnamese traditional post-prandial nap before learning how to harvest and wrap the vegetables.\n\n\nSaying farewell to the host family and riding back to Hoi An. In the evening, you will have more time to take a stroll around Hoi An and enjoy its beauty, along with the luminous lanterns.\nOvernight at Hoi An hotel."},{"title":"Da Nang - Hue City Tour (B/L) - Hanoi by plane","description":"Breakfast at your hotel.\nIn the morning, you will be picked up at the rendezvous in Danang, then we start Hue city tour. On the way to Hue, you will pass through Hai Van Tunnel, the longest tunnel in Southeast Asia.\n\n\nBesides that, you will have some time to enjoy the golden sandy beach of Lang Co Bay – one of the most beautiful bay in the planet.\nAfter arriving Hue citadel, you will visit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city.\n\n\nThien Mu Pagoda – the most beautiful pagoda of Hue, which is considered as the National pagoda of The Nguyen Dynasty, is your next destination after Khai Dinh Tomb. You can find the relics of Monk Thich Quang Duc – his private car, an eloquent witness of the Buddhist era in Vietnam.\nAt lunch time, introduce to you Hue specialties – the featured local dishes of this ancient city, in one of Hue’s famous restaurants.\n\n\nWe will take you to Hue Imperial city – the former administrative center as well as the accommodation of 13 Kings of the Nguyen Dynasty – the last feudatory Empire of Vietnam. The Imperial city is preserved as new for hundreds years, and tourists are allowed to visit many places such as Meridian Gate, Thai Hoa Palace and Duyet Thi duong theatre. Our tour guide will tell you the secret stories of the Royal family, of the Kings and the Queens’ lives. Afterward, we will head to Da Nang International Airport.\nOvernight at the hotel in Hanoi."},{"title":"Hanoi City Tour (B/L)","description":"Having breakfast at the hotel.\nWe will pick you up at your hotel to visit Tran Quoc pagoda, Buddhist relics and national heritage which lies on the West Lake.\n\n\nVisit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; President Ho Chi Minh’s stilt house where he lived and worked from 1958 to 1969. and Ho Chi Minh Museum where tourists will learn much about his devotion for Viet Nam.\n\n\nJust next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi.\n\n\nVisit Temple of Literature. Although several Temples of Literature can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, which also functioned as Vietnam's first university. The temple was first constructed in 1070 under King Lý Nhân Tông and is dedicated to Confucius, sages and scholars. It is a vast structure that has existed to present day.\n\n\nWe will have lunch at a local restaurant.\nWe will explore the handicraft village of Bat Trang Potttery.\n\n\nDrive back to legendary Hoan Kiem lake to visit Ngoc Son Temple which worships Van Xuong saint and Tran Hung Dao former general commander. We also observe the beautiful Vietnamese and French architecture around the lake. Then we will bring you back to your hotel.\nOvernight at the hotel in Hanoi."},{"title":"Hanoi – Hoa Lu - Tam Coc (B/L)","description":"Having breakfast at the hotel.\nTour guide and shutter bus will pick up you at the hotel in Ha Noi old quarter and Hanoi Opera House then departs to Ninh Binh province. On the halfway stop for a short break of 20 minutes.\n\n\nArrive at Hoa Lu, which is once depicted the ancient capital of Viet Nam, settled up in the 10th century. Visit temples of two dynasties of Dinh and Le with very unique architecture in the old time. After that visiting the excavation area beside the Le Dai Hanh temple. You experience the vestiges of Royal Palaces ground dated back 10th century. Then back to the bus and transfer to Tam Coc.\n\n\nHave lunch buffet with Vietnamese traditional dishes, in case you are vegetarian, we have other food options for you.\nIn the afternoon\nBoard the sampan boats (2 people share a boat) in Tam Coc dock to drift down the river among the villages, mountains and lush rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a strange feeling. \n\n\nBoat returns to Tam Coc pier. And then we have 30 minutes for cycling ride along country lane. \nGet on the bus back to Hanoi, on the half way stop for short break 20 minutes.\n\n\nArrive at the hotel in Ha Noi old quarter and Hanoi Opera House.\nDinner on your own.\nOvernight at hotel in Hanoi"},{"title":"Hanoi - Ha Long Bay (B/L/D)","description":"07.45 – 8:30: The Swan shuttle bus will pick you up from your hotel in Hanoi and heading to the northeast of Vietnam. At the middle of the way, we have a quick stop to stretch your leg and refresh then continue our way to Halong Bay.\n\n\n12.00: Arrive at Swan office in Ha Long, have a bit of time to relax, and then you will transfer to Swan Cruises by tender.\n\n\n12.45: Enjoy welcome drink, be briefing about safety on boat and activities included then check in your cabin.\n\n\n13.30: Have lunch while leisurely cruising to the core of Bai Tu Long Bay. \n\n\n15.30: Arrive to Cap La Island - the beautiful area in Bai Tu Long bay. Enjoy kayaking through the karsts and breathtaking nature, and relaxing. \n\n\n17.30: Get back to the boat and enjoy Sunset Time( enjoy tea and fresh fruits). This time is regarded as “ Happy Hour” while our cruise is sailing to the overnight anchorage. In addition, Cooking class is also organized by our guide at this time. You have a chance to make Vietnamese cuisine by yourself. \n\n\n19.00: Have dinner in the dining room on board.\n\n\n20.30: Free time for joining Games, you may also try your luck with squid fishing. If you want to sing karaoke, please inform our tour guide to be supported.\nOvernight on Swan Cruise."},{"title":"Ha Long Bay - Hanoi (B/L)","description":"06.30: Start your day with Tai Chi on the Sundeck. Enjoy early morning landscape of the bay.\n\n\n07.00: Have breakfast on board (tea and coffee are free).\n\n\n07.45: Explore Thien Canh Son cave. Our tour guide will explain the history of Ha Long Bay, Bai Tu Long Bay and this Cave, made by Mother Nature.\n\n\n08.45: Return to the main boat.\n\n\n09.30: Finish packing and check out your cabin. \n\n\n(Please remove all of your belongings from your cabin, you may leave heavy luggage outside of the cabin (our staff will support you transfer directly to the pier).\n\n\n10.00: Join in and show your creativity in fruit carving activity.\n\n\n10.45: Enjoy lunch while our cruise is returning Hon Gai harbour.\n\n\n12.00: Back to the harbor and disembark in Hon Gai pier.\n\n\n12.30: Farewell Halong Bay then our bus will take you back to Hanoi.\n\n\n17.00: End of 2-day-1-night trip on Swan Cruises."},{"title":"Hanoi - Departure (B)","description":"Goodbye charming Capital Breakfast at your hotel – Enjoy a pleasant morning in Hanoi. Nhat Long Travel’s private car will pick you up at Noi Bai Airport. \n\n\nEnd of services!"}]},{"name":"Cycling Vietnam","duration":14,"travelStyle":["Bicycle","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":2449,"summary":"We ride from vibrant Saigon in the south to the thrilling capital of Hanoi in \nthe north on this two week cycling tour, travelling on tarmac roads through \ncolourful fishing villages, folding rice terraces and mountains cloaked in \njungle. The vast shoreline of white sandy beaches is ours to discover along \nthe way, with time to swim in the sea on a tropical island retreat. Stopping \noff at the ancient trading port of Hoi An, home to temples and wooden \nmerchant houses, we delve into the peacefulness of rural Vietnam before \nascending the Hai Van Pass, riding along twisting coastal roads that lead to \nremarkable views of the misty forest below.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33406_dd9eb2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33406_dd9eb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_468813.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_4d09b37d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_f8c14444.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_1d5efc14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_993fdd60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_31225f11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_6a8a226e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_e7d3e627.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_7bec8c31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_2d144de5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_da8b2aaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_2db77d37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_9a01aec8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_fac6d880.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_4c9070e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_d6f5e1c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_d3afb92d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_a43e5578.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_60fe7dcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_d461287e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_0fa573b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_b173f041.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33406_226b3da3.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Dalat","Quy Nhon","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Start Saigon","description":"Ho Chi Minh City (HCMC), formerly known as Saigon, is an exciting and \nabsorbing city where bicycles battle with lorries and temples stand defiantly \nalongside modern developments. Devastated by the Vietnam War, Saigon is now a \nbustling free market city where anything goes. The Ben Thanh Market and Notre \nDame Cathedral are within easy walking distance and are highly recommended.\n\nThis evening there will be a welcome briefing with you leader followed by an \noptional group dinner at a local restaurant.\n*Huong sen Hotel or similar*"},{"title":"Day 2: Transfer out of the city; cycle to the Cu Chi tunnels","description":"This morning we drive out of the city, before riding to the Cu Chi Tunnels. \nThis offers a great introduction to cycling in Vietnam and a chance to \nfine-tune the bikes. The tunnels were Viet Cong sanctuaries, used by the \nguerrillas as living quarters and escape routes. The network covers 3 levels \nand approximately 240km of tunnels. Some parts have been widened for \ntourists, but the tunnels were originally very narrow and it is still \nnecessary to crawl on hands and knees. Claustrophobes may prefer to stay \noutside in the sunshine!\n\nIf you prefer not to visit the tunnels you can have an unguided free day in \nSaigon. Places of interest include: the Emperor of Jade and Giac Lam pagodas, \nthe former Presidential Palace (now the Reunification Hall), Ben Thanh market \nand the War Remnants Museum. \n* Huong sen Hotel or similar*"},{"title":"Day 3: Cycle towards the coast and drive to Mui Ne","description":"After an early breakfast we head out of Saigon by bus and then start cycling \ntowards the coast. We hit the backroads and head through tropical fruit and \nrubber plantations also passing some small fishing villages as we make our \nway closer to the coast finishing our ride in time for lunch. We then \ntransfer approx. 3 hours to Mui Ne, a tranquil white sand beach where we can \nwitness our first sunset over the Eastern Sea. We spend approx. 4-5 hours on \nthe bus today. \n\n*Sea Links Beach Hotel or similar*"},{"title":"Day 4: Cycle to Dalat in the Central Highlands","description":"We cycle towards Dalat; the route is undulating with occasional climbs. Along \nthe way we pass coffee and tea plantations as well as flower gardens and pine \nforests as we reach higher altitude. We rejoin the bus before the road climbs \nsteeply to the mountain town of Dalat. We spend approx 3.5 hours on the bus \ntoday.\n\nDalat is a pleasant hill station, formerly known as Le Petit Paris, and has \nbeen described as the most beautiful town in Vietnam. It was favoured by the \nFrench for its climate, and is now a popular honeymoon resort for the \nVietnamese. \n*La Sapinette Hotel or similar*"},{"title":"Day 5: Cycle through Bidoup N.P.; to the coast and boat transfer to Whale Island","description":"Today's ride is predominantly undulating and approximately 30km downhill \nthrough pine forests and paddy fields as we descend nearly 1,500m travelling \nthrough the Bidoup Ba National Park. This area is home to rare pine forests \nas well as small villages inhabited by the ethnic minority people of the \ncentral highlands. Once we arrive at the coast, we head by bus (approx. 1.5 \nhours) to the coast near Nha Trang before boarding a boat to our tropical \nisland retreat of Whale Island for the next two nights. Today you can cycle \nup to 90km according to preference.\n*Whale Island Resort or similar*"},{"title":"Day 6: Cruise around islands with seafood lunch and snorkelling","description":"Having a rest from the bikes today we get the opportunity to really relax and \nunwind. We will join a boat trip in the morning for a spot of snorkelling and \nswimming in the turquoise sea before a seafood lunch is served. In the \nafternoon there is the option to visit a local fishing village, see the Whale \ntemple or walk around the island to the viewpoint for a 360 degree view of \nthe stunning mountainous coastline and the surrounding coves and white sand \nbeaches.\n*Whale Island Resort or similar*"},{"title":"Day 7: Coastal ride to Quy Nhon","description":"We set off early in the morning and first take a short transfer from Whale \nIsland through Dai Lanh & Ca Pass before setting off on our bikes at Vung Ro \nBay where we ride along the coast to Tuy Hoa and O Loan Lagoon to Chi Thanh. \nIn Chi Thanh, we stop for lunch and a short rest before continuing to ride to \nLa Hai where we complete 100km of cycling today, the longest ride of the \ntrip. From La Hai, we then transfer 1 hour to our hotel in Quy Nhon. \n\n(Approx. 2 hours in the bus today).\n\n*Seagull Quy Nhon Hotel or similar*"},{"title":"Day 8: Further coastal ride stopping en route at sand dunes; then transfer to Hoi An","description":"Leaving Quy Nhon we travel through a new economic zone over the Thi Nai \nPeninsula and Nhon Hoi Bridge, the longest sea bridge in Vietnam. Getting off \nour bikes we will visit a market, where its not unusual to be pulled aside \nfor a photo as this part of the country does not see many western tourists. \nThe coast line features secluded bays, sand dunes and beaches with colourful \nfishing boats bobbing on the Eastern Sea. We will cycle until we arrive at \nPhu Ly and then drive to Hoi An. If time permits, we will cycle the last 12km \nonce we turn off Highway 1 into Hoi An.\nHoi An, the original European trading port in Vietnam dating back to the \nmid-sixteenth Century is now a living museum, with attractive wooden \nmerchant's houses and pagoda-style temples with Chinese, Japanese, Vietnamese \nand European architectural influences. It is also a marvellous place to \nwander around and enjoy the thriving riverside market. We spend two nights in \nHoi An which is also a fantastic place to buy local art or have some clothes \ntailor-made for you. Its best to bring a picture or a sample of what you want \nmade. Approx. 6 hours in the bus today. Cycle approx. 50km.\n*Hoian River Green Boutique or similar*"},{"title":"Day 9: Sightseeing in Hoi An; free afternoon","description":"This morning we take a guided walking tour of Hoi An to explore some of the \nstructures of historical significance in the Old Town, including bridges, \ntemples, wells and houses. Those less interested in architecture can cycle \nthe 5km to the lovely Cua Dai beach or cycle to the Marble Mountains, which \nare 19km from town. These five marble hills, formerly islands, contain many \ncaves, some of which were used as Buddhist (and Viet Cong) sanctuaries.\n\nAlso nearby is My Khe beach, a famous US R & R spot in the war, and Da Nang, \nwhere there is a Cham Museum, which despite being in poor condition, is very \ninteresting. It is also possible to visit My Son, one of the most important \nCham temple sites in Vietnam where Cham kings were buried as early as the \nfourth century. Although wartime bombing has destroyed much of the site, \nthere are a number of interesting stone towers and sanctuaries.\n*Hoian River Green Boutique or similar*"},{"title":"Day 10: Ride over the spectacular Hai Van Pass; cycle and drive on to Hue","description":"Today we turn north again for the drive/cycle to Hue. The route traverses \nover the spectacular Hai Van Pass - the 'Pass of the Ocean Clouds'. The views \nare stunning though those who prefer to avoid the 580m climb can always take \na lift in the support vehicle. Once at the top it will all seem worth it as \nyou plummet back to the ocean, then continue through small villages and \ntimeless rural scenes to the outskirts of Hue, from where we transfer to our \ncity centre hotel. Approx 2.5 hours in the bus today. Cycle approx. 80km.\n*Park View Hotel or similar*"},{"title":"Day 11: Explore Hue and surroundings by bike and boat; overnight train to Hanoi","description":"Hue is often claimed to be the cultural and historic centre of Vietnam and \nthere is plenty to see. We take a guided tour of the city and surrounding \ntombs. The most memorable site is the citadel, with walls six miles in \nlength: inside are the palaces and halls of the Mandarins, and the remains of \nthe Forbidden Purple City, where only the emperor and his eunuchs and \nconcubines were allowed. We then take a boat along the Perfume River to the \nelaborate tombs of the Nguyen emperors, who ruled Vietnam from Hue. Tu Duc's \nTomb is very elaborate and set in beautiful gardens. Along the way we will \nvisit the famous Thien Mu Pagoda. The pagoda was a centre for anti-government \nprotests in the early 1960s and it houses the Austin car that transported a \nmonk, Thich Quang Duc, to Saigon in 1963 where he burned himself in protest \nagainst the president. The photograph of his self-immolation was printed in \nnewspapers all around the world. In the afternoon we will board the \nReunification Express for the overnight ride to Hanoi, 688km to the north. \n*Overnight Train*"},{"title":"Day 12: Arrive Hanoi; drive to Halong Bay; board boat and cruise/kayak among spectacular limestone formations","description":"We usually arrive in Hanoi in the early morning and stop for a local \nbreakfast and a stretch of the legs, before we are met by our bus for an \napproximate 4 hour drive to Halong Bay. This is one of the most stunningly \nbeautiful sights in South East Asia with around 3000 limestone peaks rising \ndirectly from the clear emerald sea. We cruise amongst this amazing karst \nscenery, stopping to kayak in the sea allowing us to get to places \ninaccessible by boat (weather permitting) and enjoy a seafood lunch on \nboard. We overnight on board in twin share cabins with en suite facilities.\n* Overnight Boat*"},{"title":"Day 13: Further cruising in Halong Bay; return to Hanoi","description":"Visit Me Cung cave and enjoy further time to cruise the many islands of \nHalong Bay. We then return to Hanoi late afternoon. This charming city \ncontains many beautiful old buildings and the atmosphere is completely \ndifferent from that in Saigon in the south, mainly due to the much more \nconservative nature of the North Vietnamese. Also, unlike its industrial \ncounterpart, the centre of Hanoi has a faded charm with broad tree-lined \navenues dating from the French period as well as some attractive lakes and \npagodas. In the evening there is the option to enjoy a performance of Hanoi's \nfamous water puppets.\n\n*Lenid Hotel or similar*"},{"title":"Day 14: End Hanoi","description":"For land only clients, the tour ends this morning in Hanoi after breakfast."}]},{"name":"Vietnam Highlight with 12 Days 11 Nights","duration":12,"travelStyle":["Holiday","Group","Partially Guided"],"oldPrice":0,"price":780,"summary":"Discover Vietnam from the north to the south, you are given opportunity to visit some of most mesmerizing destinations that would bring you wonderful moments to share with your friends. The itinerary also consists of most worth-trying activities in this lovely nation, from a night cruise trip in world heritage Halong Bay to wandering under tranquil atmosphere of old town Hue and Hoi An, or experiencing the difference in life between modern city and urbanized Mekong Delta in the South of Vietnam. Pack-up your luggage and join us on this unforgettable journey with lots of amazing memories that are waiting you ahead. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/175042_2144daa1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/175042_2144daa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_f778869b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_fd8302b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_d19cf7da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_fd4ad279.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_35cd9396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_4c274e01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_46e893cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_8f649642.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_462fbd31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_21c87590.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175042_d4eab3ba.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Ha Noi Arrival ( No Meal)","description":"Today you’ll land in Hanoi. Warmly welcome by our driver at the airport & then transfer to hotel for check in. Stay overnight at hotel in Hanoi. (Check in time: From 14:00) Distance: Noi Bai airport - Hanoi city center: 30 km (~ 45 minute drive)"},{"title":"Day 2: : Hanoi - Sapa - Lao Chai and Ta Van Village (Breakfast, Lunch, Dinner)","description":"6:30 – 7:00 Tour guide pick you up at your hotel, departure to Lao Cai city.Travelling on new Highway Noi Bai, It will take around 5 hours.\n12:30. Arrival in Sapa town, enjoy lunch in a local restaurant.\n13:00: Bus will take you to the gate of Lao chai village start trekking to Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. Journey will stop at Giang Ta Chai village.\n17:00 Come back to Sapa Town, having dinner and overnigh in hotel. End of the first day.\n"},{"title":"Day 3: Sapa - Cat Cat village - Hanoi (Breakfast, Lunch)","description":"7:00   Have breakfast at hotel. \n9:00  Trekking from hotel to Exploring Cat Cat  village of H’mong – It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.\n12:30 Enjoy a meal at a local restaurant in Sapa Town.\n15:00 Driver take you back to Hanoi. \n21:00 End of tour at Hotel\n"},{"title":"Day 4: Hanoi - Ha Long Bay overnight on Cruise (Breakfast, Lunch, Dinner)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board"},{"title":"Day 5: Ha Long Bay - Hanoi - Da Nang (Breakfast, Lunch)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nMy driver will wait you at your hotel go to the airport to take a flight to Da Nang city\nArrive Da Nang, meet my driver at the airport transfer to hotel. check in hotel and overnight in Da Nang "},{"title":"Day 6: Da Nang - Hue City (Breakfast, Lunch)","description":"07h30: Pick up guest at hotels and depart to Hue city.  World Cultural Heritage, Go through Hai Van Tunnel\n10h30: Arrive at Hue city. Visit the Tomb of Tu Duc king or Khai Dinh king - Romance, lyrical reflects the life of the king of talented but  situation in the country intricate.\n11h40: Have lunch at restaurant with local foods.\n12h30: Visit the Imperial Citadel, (the Palace of 13 Nguyen’s Kings, the last feudal dynasty of Viet Nam: Ngo Mon Gate, Thai Hoa Palace, The Temple, Hien Lam pavilion, Nine Urns), having experiences with virtual 3D scanning concept “Finding the lost palace”\n15h00: Visit Thien Mu pagoda ancient, was built in the early of XVII Century. Shopping at Dong Ba Market. (optional)\n16h00: Leave Hue for Da Nang city. Shopping Local Specialities. \nOvernight in Da Nang \n"},{"title":"Day 7: Da Nang - Ba Na Hill - Golden Bridge - Hoi An (Breakfast, Bufffet Lunch)","description":"07h00 – 08h00: \tPick up at HOTEL. Depart to Ba Na Hills. \n09h00:\tArrive at the cable car station Suoi Mo, up the cable car route that achieves 4 world records.\n09h30:   \tFreedom check-in the 150-meter long \"Golden Bridge\" supported by the huge hands. Visit the Le Jardin, Debay Wine Cellar of French. Visit the Linh Ung pagoda, admire the 27m high Buddha statue, Loc Uyen Garden, Quan Am Cac. Continue to Gare Debay use the second cable car route to go to the top of Ba Na. \n\tThe tour guide will take guests to visit Fantasy Park, join in adventurous, fun, and modern games such as Love Swing, Skiver Pilot, Fire Racing Track, Bumper Car, Ghost House...\n11h30: \tHave lunch buffet at Restaurant\n12h30: \tFreedom to rest. Conquer the Peak of Chua mountain at the height of 1,487m – Visit Ba Chua Thuong Ngan Temple. Enjoy the panorama view of the Da Nang City and Da Nang Bay\n14h30: \tReturn to cable car station and back to Da Nang\n15h00: \tShopping Local Specialities. Send - off at HOTEL. \nMy driver will take you to Hoi An\nCheck in Hoi An hotel and overnight in Hoi An \n\n"},{"title":"Day 8: Hoi An Free Day (Breakfast)","description":"Freeand easy full time for visit Hoi An ancient town "},{"title":"Day 9: Hoi An - Da Nang flight to Sai Gon (Breakfast)","description":"Free time and take flight to Ho Chi Minh City.\nYou will be met at the airport and transferred to hotel in SaiGon. After checking into the hotel, the rest of the day is yours to enjoy. SaiGon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. \n"},{"title":"Day 10: Ho Chi Minh City + Cu Chi Tunnels (Breakfast, Lunch)","description":"Morning: 08:00 am to noon time Start the trip for exploring the great atmosphere around of lively China town. Get into the rythm of this busiest and colourful scenes of Binh Tay market and Thien Hau Temple in the morning. We then visit the War Remnants Museum. Enjoy lunch at restaurant\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nOvernight in Sai Gon \n"},{"title":"Day 11: Ho Chi Minh City -Mekong Detal 1 day (Breakfast, Lunch)","description":"Breakfast at hotel. \n07.45: The tour guide pick up at the hotel. Enjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  \nOvernight in Sai Gon.\n"},{"title":"Day 12: Ho Chi Minh Departure (Breakfast)","description":"Free at leisure until transfer to the airport for the departure flight. End of services."}]},{"name":"Viet Nam Explore 12 days 11 nights (Ha Noi- Ha Long- Hue- Hoi An- Ho Chi Minh- Mui Ne)","duration":12,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":650,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the discovery tour Viet Nam Explore 12 days 11 nights (Ha Noi- Ha Long- Hue- Hoi An- Ho Chi Minh- Mui Ne), you have a 12 day tour package taking you through Hanoi, Vietnam and 8 other destinations in Vietnam. Viet Nam Explore 12 days 11 nights (Ha Noi- Ha Long- Hue- Hoi An- Ho Chi Minh- Mui Ne) includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153101_e633646e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153101_e633646e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_22fec826.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_eb079a3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_07503df5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_1f00772b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_d5179392.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_07835466.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_1205c2f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_94be9d1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_a6140212.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_753d1d9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_b08bae18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_7df23e85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_70bf283f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_81c644ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_9635df0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_a2a056b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_788b2638.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_5c624ea9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_4481ba64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_a0500850.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_22de4b1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_4fb8fe4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153101_708257ab.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mui Ne","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Ha Noi arrive (No meal)","description":"Hanoi welcome: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited. You will be warmly welcomed by our tour guide at the airport and transferred to your hotel in the city center of Hanoi. \nFree and easy.\nOvernight in Ha Noi\n"},{"title":"Day 2: Hanoi- Ha Long Bay (meals B/ L)","description":"08:00 - 08h30:Our guide and chauffeur will pick you up at your Hotel (around Hanoi Old Quarter) and start the trip with our Limousine, experiencing 170km to Tuan Chau island with short break en-route.\n11h45 - 12h00:Arrival Tuan Chau harbor, welcome aboard and safety briefing\nA gourmet lunch is served in the restaurant while our cruise taking you on an odyssey journey wends among remote archipelagoes via crowd avoidance route and opens up views of one stupendous seascapes after another, passing uninhabited islets and outcrops including stone Thumb, Duck, Cock Fighting…\n13h30:Explore the longest,biggest and the most beautiful Grotto of Ha Long bay (Sung Sot grotto - Surprising grotto.\n14h30:Our cruise will take you to HangLuon Cave. You can choose to get on a bamboo boat rowed by a local, gently glide through water tunnels into secluded sea lagoons or do kayak and explore the cave by yourself; while the others stay on boat sailing to Titop island for trekking and taking photos with panoramic view of the day.\n17h15:Returning aboard.Attending cooking lesson to make some Fresh Spring Rolls by yourself. Enjoy sunset party on boat with red wine, fruits, cake...\n17h45:Disembark, bus ride back Ha Noi city with a short break half way.\n20h00- 20:30 :Go back to hotel in Ha Noi.\nOvernight in Ha Noi"},{"title":"Day 3: Hanoi city tour- fly to Hue (meals: B/ L)","description":"Today, take your time to visit Hanoi city tour with famous places: Tran Quoc pagoda, Ho Chi Minh’s complex, Temples of Literature , Hoan Kiem lake and Ngoc Son Temple .\nHaving lunch at local restaurant.\nFinish tour, the driver transfer back to hotel and then take a flight to Hue.\nArrive Hue, check in hotel and free time at night.\nOvernight in Hue"},{"title":"Day 4: Hue city tour one day (meals: B/ L)","description":"One day to discover Hue city, you will visit The Citadel, The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conicat Hat Village & The Incense Making Village. \nIn the afternoon: visit Thien Mu pagoda, then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n17:00 come back hotel.\nOvernight in Hue\n"},{"title":"Day 5: Hue- bus to Hoi An (meals: B)","description":"The bus picks up at 8:00- 8:30 AM\nArrive Hoi an at 14:00- 14:30 PM. \nGroup bus will stop 4 places, time for each of place 10- 40 mins:\nThanh Toan Bridge 15- 20 mins. No Entrance fee\nLang Co beach 15-20 mins. No Entrance fee\nHai Van Pass 15-20 mins. No Entrance fee\nMarble Mountain 30- 45 mins. Entrance fee by yourself (40,000 vnd/ person/ one time (around US$2)\nArrive Hoi An 14:00- 14:30 PM, drop off Tran Hung Dao str-Hoi An ( 5-7 mins by walking to hotel).\nOvernight in Hoi An\n"},{"title":"Day 6: Hoi An- My Son holyland- Da Nang airport- fly to Ho Chi Minh (meals: B/ L)","description":"7:30 am: Our minivan picks you up at your hotel. Spend 2 hours to enjoy and discover the beauty of Ancient buildings of the Champa Kingdom. Those relics were made by red bricks which still surprises those who are curious about architectural art.\nHave chance to enjoy traditional music performed by Champa girls in their colorful uniforms.\nLeave My Son for Cao Lau boat station. Take a boat trip on Thu Bon River. Experience the lifestyle of local people and enjoy fresh air.\nHave lunch on the boat before stopping at Kim Bong Carpentry Village – The traditional country village.\n14:30 pm: The boat trip finishes at Bach Dang Boat station.\nCome back hotel, free time until deaprture time.\n\nSuggestion flight from Da Nang to Ho Chi Minh: departure time after 17:00\n\nOvernight in Ho Chi Minh"},{"title":"Day 7: Ho Chi Minh city- Cu Chi tunnels tour (meals B/L)","description":"Time: start 8.00 – return 19.00\nItinerary:\nWe start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war. \nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish. \nReturn to Saigon and end the trip. \nPlease take notes: the Notre Dame Cathedral have been being restored (UNTIL 2022), so the guests just visit outside.\nOvernight in Ho Chi Minh."},{"title":"Day 8: Ho Chi Minh- bus to Mui Ne (meal: B)","description":"Have a breakfast at hotel\n8:00 AM ready at the bus office and 8:30 AM depart to Mui Ne.\n12:00 Arrive Mui Ne, check in hotel and free time at beach.\nMeals: Lunch and Dinner by yourself\nOvernight in Mui Ne"},{"title":"Day 9: Mui Ne free and easy (meal: B)","description":"Free and easy by your own day at Mui Ne beach.\nMeals: Lunch and Dinner by your account.\nOvernight in Mui Ne"},{"title":"Day 10: Mui Ne free and easy- go back Ho Chi Minh (meal: B)","description":"Breakfast at your hotel and free your time at beach.\n12:00 bus picks up at hotel and transfer back to Ho Chi Minh city.\n16:00 arrive Ho Chi Minh. The bus drop off at bus office and you walk to  go back hotel.\nOvernight in Ho Chi Minh."},{"title":"Day 11: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong.\nOn arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nEnjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\nMeet at the bus and return to Ho Chi Minh City. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.\nFree time in the evening.\nOvernight in Ho Chi Minh."},{"title":"Day 12: Ho Chi Minh departure(meals incl: B)","description":"Have a breakfast at your hotel.\nFree time and easy until departure time, the driver takes you to the airport for your flight.\nEnd of services!"}]},{"name":"Cycle Vietnam’s Back Roads","duration":14,"travelStyle":["Bicycle","Adventure","Group","Fully Guided"],"oldPrice":0,"price":1699,"summary":"Are you bored of spin classes and biking the same old trails at home? The cure is Vietnam. This 14-day trip is one of Asia's classic cycling journeys, riding from Hanoi to Ho Chi Minh City, giving you a unique viewpoint of the countryside. With thousands of kilometres of stunning beaches and beautiful coastal roads, as well as some of the freshest seafood around, this ride is an indulgent experience whether in or out of the saddle. Prepare to have your cycling legs challenged.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/66103_5951412f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/66103_5951412f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_4793b450.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_4d71f5bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_905ef1de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_84b62a58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_983cad40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_2d820270.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_a41cbb2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66103_41562402.jpg"],"destinations":["Hanoi","Hue","Hoi An","Quy Nhon","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrive at any time.\n\nAccommodation:\n- La Dolce Vita Hotel (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n\n\n"},{"title":"Day 2: Hanoi/Huế (1B)","description":"Opt to attend a performance at the famous Water Puppet Theatre with some free time before heading south.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 13:00 - 14:00 Hr(s)\n\nIncluded Activities:\n- Ho Chi Minh Mausoleum and Museum Visit\n\n\n"},{"title":"Day 3: Huế (1B)","description":"Cycle through Hue and to landmarks like the Citadel and Tu Duc's tomb.\n\nAccommodation:\n- Emm Hotel Hue (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Hue Cycling Tour\n\n\n"},{"title":"Day 4: Huế/Lăng Cô (1B)","description":"Take a full day exploring the countryside to the south of Hue before continuing along the coast following the route of the Reunification Express.\n\nAccommodation:\n- Lang Co Beach Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cycling Hué to Lăng Cô\n\n\n"},{"title":"Day 5: Lăng Cô/Hoi An (1B)","description":"Cycle up and over the famous Hai Van Pass – the geographic north-south divider of Vietnam. Cycling this stretch is a great adventure. Travel to the picturesque Hoi An and enjoy the historic town.\n\nAccommodation:\n- Hoi An Silk Boutique Hotel Villa & Spa (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cycling Lăng Cô to Hội An\n\n\n"},{"title":"Day 6: Hoi An (1B, 1L)","description":"Take a day to relax and rest in Hoi An after a challenging day of cycling. Enjoy a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project.\n\nAccommodation:\n- Hoi An Silk Boutique Hotel Villa & Spa (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 7: Hoi An/Tam Kỳ (1B)","description":"Cross the Thi Bon River by boat and continue cycling along the stunning Vietnamese coastline. The route to Tam Ky is filled with picturesque views and tall sand dunes. Overnight in Tam Ky.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Thi Bon RIverboat\n\nIncluded Activities:\n- Cycling Hội An to Tam Kỳ\n\n\n"},{"title":"Day 8: Tam Kỳ/Quảng Ngãi (1B)","description":"Follow the backroads of Vietnam, passing paddy fields and villages to My Lai and the sobering Massacre Monument. Continue by bus to Quang Ngai and unwind by the coast.\n\nAccommodation:\n- Sa Huynh Beach Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cycling Tam Kỳ to Quảng Ngãi\n\n\n"},{"title":"Day 9: Quảng Ngãi/Quy Nhon (1B)","description":"Cycle south along the coast. Stop at Eo Gio beach before continuing by bus to Quy Nhon for the night.\n\nAccommodation:\n- Seagull Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 00:30 - 00:45 Hr(s)\n\nIncluded Activities:\n- Cycling Quảng Ngãi to Quy Nhon\n\n\n"},{"title":"Day 10: Quy Nhon/Tuy Hòa (1B)","description":"Pedal from Quy Nhon to Tuy Hoa – the longest cycle of the trip. Follow the coastline over undulating hills all the way to the beach.\n\nAccommodation:\n- Kaya Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cycling Quy Ngon to Tuy Hòa\n\n\n"},{"title":"Day 11: Tuy Hòa/Nha Trang (1B)","description":"Cycle the coastal route to Vung Ro. Pass beautiful beaches, friendly villages, and thousands of waving children. Stop at Đại Lãnh beach for lunch, before hopping back in a vehicle for the drive to Nha Trang.\n\nAccommodation:\n- The Art Nest Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 02:00 - 02:30 Hr(s)\n\nIncluded Activities:\n- Cycling Tuy Hòa to Vung Ro\n\n\n"},{"title":"Day 12: Nha Trang (1B)","description":"Spend the day on the beach soaking up the sun, explore the local shops and markets, or visit nearby historical towns.\n\nAccommodation:\n- Diamond Nha Trang Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\n\n"},{"title":"Day 13: Nha Trang/Ho Chi Minh City (1B)","description":"Fly to Ho Chi Minh City, where there is some time to explore Vietnam's biggest and busiest city.\n\nAccommodation:\n- Liberty Park View Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Plane: Cam Ranh International Airport to Tan Son Nhat International Airport 01:00 Hr(s)\n\n\n"},{"title":"Day 14: Ho Chi Minh City (1B)","description":"Depart at any time.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]}]