[{"name":"Vietnam Classic Tour in 9 Days","duration":9,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1650,"summary":"\n\tOUTLINED ITINERARY\n\n\tDay 1 – Hanoi Arrival\n\n\tDay 2 – Hanoi City Tour (B/L)\n\n\tDay 3: Hanoi – Halong (B/L/D)\n\n\tDay 4: Halong – Hanoi (Brunch)\n\n\tDay 5 – Hanoi – Hue (B/L)\n\n\tDay 6 – Hue – Da Nang – Hoi An (B/L)\n\n\tDay 7 – Hoi An – Da Nang – Ho Chi Minh (B)\n\n\tDay 8 – Mekong Delta (B/L)\n\n\tDay 9 – Departure (B)\n\n\t \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141421_a07ac014.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141421_a07ac014.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_6cdcba73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_183ec208.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_531c0379.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_efb1766d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_b658405d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_a9cfa4ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_8689b14f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_6eda12cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_4f93662f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_b081292b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141421_35b11d53.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1 – Hanoi Arrival","description":"You will be warmly welcomed upon arrival at airport in Hanoi and transferred to your hotel. You will have free time. Overnight in Hanoi. "},{"title":"Day 2 – Hanoi City Tour (B/L)","description":"In the morning, you will visit Ho chi Minh Mausoleum, One Pillar Pagoda, President Palace. Continue your day at Temple of Literature – the first university of Vietnam. Then visiting the Tran Quoc pagoda dated back to early 10th century and is considered as the most ancient pagodas in Hanoi. After lunch at a local or Indian restaurant we keep driving to Hoa Lo prison museum – also known as the “the Hanoi Hilton”.  Finish your day with a water puppet show - an unique Vietnam traditional art. Transfer back to your hotel for relaxation. Dinner on your own. Overnight at the hotel. "},{"title":"Day 3: Hanoi – Halong (B/L/D)","description":"In the morning leave Hanoi for Halong Bay, arriving around noon. Board a traditional wooden junk and begin your exploration of magical Halong Bay, one of Southeast Asia’s premier tourist destinations. \n\nAn excellent, fresh seafood lunch and dinner will be served on the boat. Overnight onboard the comfortable and charming junk.\nJunks in Halong: They are large wooden boats of 25 meters. All are well-equipped: air-conditioned cabins with two beds, private bathroom and toilet. It is an ideal place to make full use of the bay: observe fishing villages, bathe in the sea, watch the sunset and sunrise or simply indulge yourself, etc… The food is excellent: the fish and seafood are captured from the early haul of the morning.\n"},{"title":"Day 4: Halong – Hanoi (Brunch)","description":"You'll wake up on the bay to the sounds of waves and birds welcoming the new day. You will have an opportunity to view the sunrise over the bay and after breakfast, visit a beautiful limestone grotto. You will have a walk back to the boat for a final glimpse of Halong Bay while cruising back to the dock. Then you will drive back to Hanoi and stay overnight. "},{"title":"Day 5 – Hanoi – Hue (B/L)","description":"You will transfer to the airport for your noon flight to Hue. Upon arrival at Phu Bai Airport you will be transferred directly to your hotel. In the afternoon you will embark on a tour of the city, including the Citadel and the Forbidden Purple City, the Imperial Museum and Dong Ba market. You will stay overnight in Hue."},{"title":"Day 6 – Hue – Da Nang – Hoi An (B/L)","description":"Rising up in the ancient land, you will enjoy your breakfast in the hotel and then board a private boat for a cruise on the romantic Perfume River. You will visit the Lady Pagoda (Thien Mu Pagoda), and then take a drive to visit King Minh Mang's tomb and King Tu Duc's tomb before lunch at a local restaurant. You will then head to Hoi An Ancient town over the Hai Van pass. You will stop in Danang for a visit to the Cham Museum and handicraft villages at the foot of Marble Mountains before arriving in Hoi An. Once in Hoi An, you will check into the hotel and have some free time to explore the town. You will stay overnight in Hoi An."},{"title":"Day 7 – Hoi An – Da Nang – Ho Chi Minh (B)","description":"Transfer from Hoi An to the airport in Danang for the flight to Ho Chi Minh. Pick up and transfer to the hotel for check in before touring the historic landmarks of the colonial city once known as Saigon. Stops include the Old Saigon Post office, Notre Dame Cathedral, the Reunification Palace, the War Museum and the ethnic Chinese district of Cho Lon. Overnight in Ho Chi Minh."},{"title":"Day 8 – Mekong Delta (B/L)","description":"Departure for My Tho for a visit to the Mekong Delta. Take a boat cruise on the fabled Mekong River (Ben Tre). Enjoy the quiet byways, then stop for a visit at a local orchard to taste exotic seasonal fruit \n\nand view a coconut candy workshop. Continue with a riding on a horse-cart and continue with a sampan cruise along My Tho canals to a stilt restaurant on Turtle Island. Enjoy lunch and back to Saigon late in the afternoon. Free time. Dinner on your own. Overnight at the hotel.\n"},{"title":"Day 9 – Departure (B)","description":"You will have free time in the morning. Then our guide will pick you up at the hotel and transfer to airport for your onward flight. Tour ends!"}]},{"name":"Explore central Vietnam 6 days 5 nights (Da Nang- Hoi An- Hue)","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":360,"summary":"This is a route you will be impressed by breathtaking view through central Vietnam. The trip covers Da Nang, Hoi An, Hue with hotel in the centre.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/175043_6a2d50c1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/175043_6a2d50c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_855b6327.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_2f136ad0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_332b5405.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_d8dc21a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_78efe25a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_d409a9fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_3f06e424.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_929c05e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_85d6b79a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_37cf334d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175043_b46229ab.jpg"],"destinations":["Hoi An","Hue"],"timeline":[{"title":"DAY 1: DA NANG ARRIVAL - TRANSFER TO HOI AN (NO MEAL)","description":"The driver pick up at the airport and then transfer to hotel for check in. The rest of day is your own at leisure.\nOvernight in Hoi An."},{"title":"DAY 2: MY SON SANCTUARY BY BOAT (B/L/X)","description":"Hight lights: Discover various culture values in My Son – a World Heritage recognized in 1999 by Unesco, Explore Cham-style Art of Architecture, Cooking class.\nMy Son, located 50 km from Hoi An, was an imperial city during the Cham dynasty between the 4th and 12th centuries. My Son sanctuary is a large complex of religious relics that comprises of more than 70 architectural works. They include temples and towers that connect to each other with intricate red brick designs. The main component of the Cham architectural design is the tower built to reflect the divinity of the King.\nITINERARY: \tDepart: 07:30 am | End of tour: 02:00 pm \nPick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu capital which was the the former administrative centre of champa kingdom. Discover the majestic ancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock and board on boat cruise along Thu Bon river.\n12:15 am: Enjoy Local food on Boat (My Quang)\n02:00 pm: Back to your hotel. End the tour.\nOvernight in Hoi An.\n"},{"title":"DAY 3: CHAM ISLAND - VISITING AND SNORKELING TOUR (B/L/X)","description":"7:30 am – 8:00 am: Pick up at hotel and transfer to Cua Dai Harbor. On the way moving by speed boat to Cham Island, tourists can get closer to the nature, breathe fresh air and admire crystal-clear water within 20 minutes before arriving at Bai Lang.\n\n 8:00 am – 10:30am: Visit the Marine Protected Area, The Boat Shelter, Hai Tang pagoda, Traditional fishing Village. In these destinations, tourists will have chances to explore Cham Island and its history.\n\n10:30 am – 11:30 am: Reach the restaurant and change clothes for swimming and snorkeling. Then, get back on board to go to explore coral reef and biological system of Cham Island.\n\n11:30 am: Enjoy lunch with seafood at our restaurant. Tourists can blow theirs mind with nature while resting in a hammock.\n\n1:30 pm: Return to Bai Lang for leaving\n\n2:00 pm: Back to the hotel.\nOvernight in Hoi An."},{"title":"DAY 4: BA NA HILL 1 DAY (B/L/X)","description":"07:30 – 08:00 am: Pick up guests at the hotel and transfer to Ba Na Hills.\n09:00 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:00 pm. Drop-off at hotel. \nOvernight in Da Nang.\n"},{"title":"DAY 5: DA NANG- HUE CITY 1 DAY (B/L/X)","description":"Depart: 07:00 am | End of tour: 06:00 pm \nPick up guests at the hotel in Da Nang transfer to Hue Ancien capital. On the way stop at Lang Co beach for relaxing and take picture.\n10:00 Visiting Khai Dinh tomb, unlike Hue’s other tombs, it being a synthesis of Vietnamese and European elements. Even the stone faces of the mandarin honour guards are endowed with a mixture of Vietnamese and European features.\nHave lunch in Hue city.\nAfternoon: Continue exploring the Imperial Citadel, where the 13 emperors of the Nguyen Dynasty lived. Then visit the symbol of Hue city - Thien Mu Pagoda, which built on a hillock overlooking the Perfume river.\nAfter visiting, free time shoping, then go back to Da Nang. \n"},{"title":"DAY 6: DA NANG DEPARTURE (B/X/X)","description":"Have breakfast at hotel. You are free until the driver transfer to airport for flight back home.\nEnd of the service !"}]},{"name":"VNA003 - 11days Essence of Vietnam","duration":11,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":902,"summary":"Starts/Ends: Hanoi / Ho Chi Minh or Vice Versa\nTour Duration: 11 days 10 nights\nDates: No fixed departure dates. You may go whenever you wish.\nTour Type: Landscape and Nature, Cruise Holidays, and Historical\nActivity Level: Regular itinerary, moderate walking\nTour Customizable: Absolutely! (Tell us your specific requirements in the inquiry form)","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/109670_089fe662.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/109670_089fe662.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f34945.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f34947.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f34949.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f3494a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f3494b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f3494d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109670_5e52800f3494e.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 01: Fly to Hanoi","description":"Fly overnight to Hanoi. On arrival you will be met by your expert tour guide and transferred to your hotel. The rest of the day is at leisure and overnight in Hanoi\n3star: Gondola Hotel - Superior Room \n4star: Tirant hotel - Deluxe Room \n5star: Melia Hotel - Deluxe Room "},{"title":"Day 02: Hanoi City Tour (B/L)","description":"After breakfast, our guide pick up at hotel at 8.00AM. Sightseeing today includes explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake including the sedate Tran Quoc Pagoda; and one of the city’s museums (a choice between the History Museum and the Ethnology Museum). End the day’s explorations; watch a traditional puppet show on water that shows off an ancient art form"},{"title":"Day 03: Hanoi - Halong Bay - Overnight on Cruise (B/L/D)","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 - 8.20AM and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Spend the night on our luxurious boat\n3star: Swan cruise - Deluxe Cabin\n4star: Calypso cruise - Deluxe cabin\n5star: Signarture Royal Cruise - Sernior Suite"},{"title":"Day 04: Halong Bay - Hanoi - Fly to Da Nang (B/L)","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbour and the return drive to Hanoi for your flight to Da Nang. Upon arrival, transferred to Hoi An for check in.\n3star: Calla Villa - DLX Room \n4star: Lantana hotel - Sup Room \n5star: Silk Sense River Resort - Sup Garden"},{"title":"Day 05: Hoi An - Cycling to Tra Que (B/L)","description":"09.00AM, Cycling into the countryside to the small farming community of Tra Que Vegetable Village. Here you can enjoy the lush green countryside and see the farmers at work, later learn to make Vietnamese spring roll and free on foot massage by herbs. Enjoy a free afternoon back in Hoi An, it is time for you to explore art and handicraft galleries, try on clothes tailor-made, relax at the riverside restaurants or take the short journey to the nearby beach. Overnight in Hoi An"},{"title":"Day 06: Hoi An - My Son (B)","description":"My Son Sanctuary, situated around 50km away from Hoi An, is another Cultural Heritage site recognized by UNESCO in 1999 with 32 epitaphs and 71 monuments. The unique Hindu sanctuary is the perfectly ideal destination for those who want to learn everything about the Champa Ancient Kingdom including the history, culture, and architecture.\nThis morning (afternoon), you will set out on a drive to the southwest of Hoi An to My Son Sanctuary for a My Son half day tour. This is where the Cham culture in Central Vietnam started in the 4th century, declined in the 13th century, and ceased to exist in the 15th century. The once capital of the Champa Kingdom dedicated to the worship of the god Shiva is now a cluster of partially ruined and heavily damaged Hindu temples, with only 20 left, due to age and bombing during the Vietnam War. This unique and majestic sanctuary stands as a witness to a glorious bygone era of the once-thriving Cham culture\n"},{"title":"Day 07: Hoi An - Transfer to Hue - City Tour (B/L)","description":"After check out hotel, 8AM take the scenic route to Hoi An from Hue via Hai Van pass, on the way, our driver will stop at Lang Co Beach, Marble Mountain. Upon arrival, you will board the Dragon Boat for a cruise on the romantic Perfume River heading out for the countryside. Being the ancient capital, Hue is surrounded with ancient tombs of emperors past, and a visit to the most beautiful tombs will be on the itinerary for today. The charming Lady Pagoda (Thien Mu Pagoda) will be the first stop of the day. You will enjoy a great view on the Perfume River and surrounding area. Thien Mu Pagoda is considered the symbol of Hue, and of Buddhism in Vietnam. From here you will rejoin your car and visit King Minh Mang’s Tomb OR King Tu Duc’s Tomb. Enjoy lunch at a local restaurant before continuing to visit Hue Citadel and Dong Ba Market. Overnight in Hue. \n3star: Serene Palace Hotel - Junior Room \n4star: Romance hotel - DLX Room \n5star: Pilgrimage Village - Sup Room "},{"title":"Day 08: Hue - Fly to Ho Chi Minh (B)","description":"Morning, flight to Ho Chi Minh. Upon arrival, transferred to hotel for check in. \n3star: GK Central Hotel - Sup Room \n4star: Grand Silverland hotel - Premier Room \n5star: Majestic Hotel - Colonial Deluxe Room "},{"title":"Day 09: Ho Chi Minh City Tour - Cu Chi Tunnel (B/L)","description":"Breakfast at hotel, meet our guide at 8.00 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City.\nHave a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there. \n"},{"title":"Day 10: Ho Chi Minh - Cai Be Floating Market (B/L)","description":"After breakfast our guide and driver will pick you up to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends at Cai Be, then get on bus return to Ho Chi Minh. Overnight in Ho Chi Minh City."},{"title":"Day 11: Ho Chi Minh Departure (B)","description":"The morning is at leisure before boarding your flights home"}]},{"name":"Charming Vietnam – 12 Days - Flash Deal + Bonuses","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":1499,"price":824,"summary":"Vietnam Allure Travel is your ideal way to Vietnam. This 12 Day tour will let you immese in Vietnam Beauty from Hanoi capital to manificent Halong, from Beautiful ancient Hoian to Bustle and Hustlle Saigon and unforgetable Mekong Delta water life. \nThe tour take you the bustle city, beautiful island, cave, beach, terraced field, river, meet local people, learn Vietnamese culture, as well as taste the delicous local food. \n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/169418_5e40ffae8503a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/169418_5e40ffae8503a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_dfec9494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_3013a561.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_963402f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_47c2a9f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_b85c7f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_fd43fc81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_f94f7dca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_17adc008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_e0adcd70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_5e40ffae8504f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_c266c951.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_2bfc8308.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_69129114.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_af882611.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_72eee1ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_9fee60ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_86194f47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_2619a764.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_80746daf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169418_5e40ffae85060.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"Hanoi arrival – Airport pick up\nOn arrival, at Noi Bai International Airport, you will be welcomed by our driver who will take you to your hotel in Hanoi City Center to check in.\n\nBe relax and self -explore Hanoi city. Hanoi is over 1000 years old and is currently the capital of Vietnam, as well the commercial, political, and cultural heart of the country.\n\nOvernight at hotel (Meal: No)Start point\n International Arrival Terminal, Sân bay quốc tế Nội Bài, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay\nIn the morning, be picked up from hotel and transferred to Halong Bay.\n\nTake a boat trip to explore one of the world’s great natural wonders, cruising the thousands of limestone islands filled with caves of all shapes and sizes. The sails of junks and samfans gliding along the clear and emerald waters of the bay form a magnificent picturesque scene that blends with the sky.\n\nIn the afternoon, you also get a chance to visit Sung Sot cave, swim and relax in Titop island and enjoy Sunset Party on sundeck.\n\nAfter dinner, socialize with other guests, take part in board games, fish for squid, or just laze around.\n\nStay overnight on board (Meal: B-L-D)"},{"title":"Day 3: Hanoi","description":"Halong Bay – Hanoi\nDo TaiChi in early morning and enjoy the peaceful morning of Halong Bay. Kayak around Drum cave; visiting Ba Hang fishing village, Dog Islet, and more.\n\nWhile heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch. Disembark from the junk at noon and transfer to Hanoi.\n\nReturn at hotel around 16.00 pm. Recheck in at hotel.\n\nOvernight at hotel (Meal: B-L)"},{"title":"Day 4: Sapa","description":"Hanoi – Sapa – Cat Cat village\nEarly transfer by bus to Sapa. Arriving around lunch time, you will have lunch and visit Cat Cat village (light trekking required), where you may wish to try the local apple wine or purchase a hand-woven blanket and Sapa town.\n\nOvernight at hotel (Meals: B-L-D)"},{"title":"Day 5: Hanoi","description":"Lao Chai – Ta Van – Giang Ta Chai – Bus back Hanoi\nAfter breakfast, start a 5 hour trek to visit Lao Chai – Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. Visit Sapa’s ancient rock formations with engraved images big and small, the unique patterns of the ancients, as well as admire the picturesque bridge to the clouds clear over the Muong Hoa stream.\n\nLunch at restaurant in the middle of village.\n\nReturn to hotel in Sapa around 14.00pm.\n\n15.00 Good bye Sapa. You will be picked up at hotel and taken a bus journey to Hanoi.\n\nArrive at Hanoi around 21.30 pm, check in at hotel again.\n\nOvernight at hotel (Meals: B-L)"},{"title":"Day 6: Hoi An","description":"Hanoi – Flight to Da Nang – Hoi An ancient town\nAfter breakfast at hotel, the rest of the day is spent at your leisure until our driver come and transfer you to airport.\n\nTake a 1- hour- flight to Danang. Be picked up airport and transferred to Hoian by private car.\n\nArrive Hoi An and check in. The rest of the day is spent at your leisure, discovering the beauty of  Hoi An.\n\nOvernight at hotel (Meals: B)"},{"title":"Day 7: My Son","description":"Hoi An – My Son holly land\nHave breakfast at hotel, after that be picked up for My Son Half day tour.\n\nArriving in My Son – the Holly land surrounded by the marvelous mountains, 48km west of Hoi An. My  Son  was  chosen  as  a  religious  center,  built  in  the  late  4th  century  under  the  Cham’s  King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures.\n\nWander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Spend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa  Kingdom with our tour guide.\n\n12.00: Leaving My Son for Cau Lau boat station and taking a boat trip on Thu Bon river.\n\nYou could visit the living of the local people and feeling the fresh air. You will have soft lunch (My Quang traditional noodle), then  get boat trip visit Thu Bon river, stopping for visiting at Kim Bong Carpentry Village – The traditional work village.\n\n14:30: The boat trip will finish at Boat station  then return to hotel.\n\nOvernight at hotel (Meals: B-L)\n\n"},{"title":"Day 8: Hoi An","description":"Hoi An Free and Easy\nHoi An Ancient Town is an exceptionally well-preserved example of a South-East Asian trading port dating from the 15th to the 19th century. Its buildings and its street plan reflect the influences, both indigenous and foreign, that have combined to produce this unique heritage site.\n\nSpend the entire day at your leisure.\n\nOvernight at hotel (Meals: B)"},{"title":"Day 9: Ho Chi Minh City","description":"Da Nang – Flight to Ho Chi Minh city (formly Saigon)\nEnjoy breakfast at hotel, free time until our driver transfer you to Da Nang airport to take flight to Ho Chi Minh city.\n\nArrive in Ho Chi Minh and check in hotel. The rest of the day is spent at your leisure, discovering the most active city in Vietnam.\n\nOvernight at hotel (Meals: B)"},{"title":"Day 10: Mekong Delta","description":"Mekong Delta – My Tho – Ben Tre\n07:30 – 7.50am: Our tour guide and driver will pick you up at your hotel and then start tour. Enjoy the scenic journey along the National Highway bordered by green rice fields.\n\nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank.\n\nProceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by locals.\n\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village.\n\nMeet the bus and return to HCMC.\n\nOvernight at hotel (Meals: B,L)"},{"title":"Day 11: Ho Chi Minh City","description":"Cu Chi tunnel\n07:30 – 7.50am: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors. The peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitor will find it hard to imagine the destructions, damage and defoliation all over the area, cause by bombing and mines, when Cu Chi was “A Free Target Zone”. The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battle ground that took place there and visitors will see the remnants."},{"title":"Day 12: Ho Chi Minh City","description":"Ho Chi Minh city – Departure\nHave breakfast at the hotel then free and easy. Enjoy the last day in Ho Chi Minh city then be picked up at hotel and transferred to airport.\n\nGood bye Vietnam. Trip ends."}]},{"name":"5-day Amazing Northern Vietnam: Hanoi - Ninh Binh - Sapa - Halong Bay cruise","duration":5,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":268,"summary":"Embrace Northern Vietnam's nature beauty: Ninh Binh - Sapa - Halong Bay. This tour is suitable for people who already booked accommodation in Hanoi before or people prefer to choose accommodation in Hanoi by yourselves.\n\nHighlights:\n* Visiting Hoa Lu - the ancient former capital city and rowing through caverns that cut their way through mountains along the river in Tam Coc\n* Enjoying the sublime natural beauty and cool climate of Sapa's mountain and valleys - Mingling with traditionally dressed locals in a traditional ethnic minority village\n* Trekking through the picturesque Muong Hoa Valley\n* Cruising on a traditional junk boat through scenic Halong Bay\n* Kayaking to discover hidden lagoons or relaxing on deck and soaking up the views","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/160109_e9da8703.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/160109_e9da8703.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_75768379.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_82cd53ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_8b9be127.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_bb6d82e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_d8aab7b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_c05ecfa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_26139f27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_b209db57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_409cdf47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_cc6bc8bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_62b8dcf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_bd271163.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_e6563c60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/160109_e736c981.jpg"],"destinations":["Hanoi","Ninh Binh","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: HANOI - HOA LU - NINH BINH - HANOI (L) SIC Tour","description":"07:50 -08:30: A 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Further discovery in Ninh Binh will be continued in the site that used to be the kings’ palace in 10th century and now famous for the wooden relieves of the shady Dinh and Le temples. Late afternoon back to Hanoi."},{"title":"Day 2: HANOI - SAPA BY BUS - CAT CAT VILLAGE (L/D)","description":"06:30 - 07:00: Take a luxury bus from Hanoi to Sapa town. Have lunch and check-in hotel. Walking to Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon."},{"title":"Day 3: SAPA - LAO CHAI - TA VAN - HANOI BY BUS (B/L)","description":"A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people. Bus picks you up at Ta Van Bridge to Sapa. Have lunch in hotel. Relax and leisure on your own. 15:30 Back to Hanoi by bus."},{"title":"Day 4: HANOI - HALONG BAY - OVERNIGHT ON CRUISE (L/D)","description":"Around 08:00 - 08:30, head to Halong Bay, a Natural World Heritage as designated by UNESCO. We’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages. Back to the boat for dinner late afternoon."},{"title":"Day 5: HALONG - HANOI (B/L)","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf around 11.00. Return to Hanoi around 4PM. Free at your own leisure."}]},{"name":"North and Central Vietnam 7 Days 6 Nights (Hanoi, Halong Bay, Danang and Hoi An)","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":565,"summary":"Asia Focus Travel provide for you just a week to discover all most of beautiful place start from Hanoi, you'll head to the coast for an overnight cruise on the emerald green waters of Hạ Long Bay. After returning to Hanoi, you'll jet to the central coast where you'll cap the adventure with a tour of Hội An, the most ancient and well-preserved port city in Vietnam.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f18.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363e4ee42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193249_5e3e363620f26.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hoi An"],"timeline":[{"title":"Ha Noi Arrival - Street Food Tour (Dinner)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \n17:30 to 18:00 The tour guide will pick you up at your hotel to join with street food tour \nBest list of street food (chosen carefully), from 6-8 dishes among hundreds of\ncuisine list, including dishes and drinks. (*if you’re a vegetarian (no meat, no\nfish), it’ll be limited in the choice of food for you).\nOvernight at hotel in Ha Noi."},{"title":"Hanoi - Ninh Binh - Hoa Lu - Tam Coc (B,L)","description":"8:00 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\nDepart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi\nOvernight in Hanoi \n"},{"title":"Hanoi - Ha Long Bay - Sung Sot Cave (B,L,D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 4: Ha Long - Pearl Farm - Hanoi - Fly to Da Nang, Hoi An (B/L/X)","description":"6.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off at my office and then the driver transfer to airport for flight to Da Nang .\nDa Nang arrival, you will be greeted by the driver and transfer to hotel for check in.\nOvernight at hotel in Hoi An "},{"title":"Day 5: Hoi An Baset Baset Boat Tour Adventure (B/L)","description":"Pick up from : 7:00 AM\nCome back: 16:00 \npick up at your hotel at your hotel from 7:00 to 7:15 Am \nTour start right after after picking up time.\nWalking through fishing village to experience fishing life.\nBasket boat riding,dancing,racing,fishing with the locals.\nExploring Coconut Forest with the locals.\nLearning about Coconut Handy Craft Makings.\nEnjoying local meal with coffee and fruit.\nAfter spending with our locals for 1.5 hours,we drop you off in Hoian.\nOvernight in Hoi An \n"},{"title":"Hoi An - Ba Na Hill - Golden Bridge (B/Buffet Lunch )","description":"Morning (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n08:45 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness.\nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion.\n11:45 am: Have lunch in restaurant (buffet lunch).\nAfternoon: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Hoi An  by car around 17:00 to 17:30  pm. at your hotel \nOvernight in Hoi An \n"},{"title":"Hoi An Departure (B/X/X)","description":"Have breakfast at the hotel. You are free to go shopping until time the driver transfer to the airport for  next destination. End of services \n"}]},{"name":"10 Days Vietnam Flavors","duration":10,"travelStyle":["Food & Culinary","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1239,"summary":"In and around HanoiOn arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. \nThe journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.\nEvening: \nYou will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.\nAccommodation: Hanoi Essence Hotel & Spa\nMeals: Dinner","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/166758_d7d8ec0d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/166758_d7d8ec0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_3a39a28d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_84ef85fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_1c018c5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_7f1c99a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_fbf90378.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_6d709125.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_ac3468d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_628a28bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_3c579f13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_945dd902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_af5ba9e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_a5ecffe6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_6894ab77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_86c9c184.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_ea054422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_9d263775.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_ee1904e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_086ec6b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_1090cd7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_69ec9dad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_10d09d1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_eb0aaa42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166758_d18fedb2.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Hanoi arrives. Airport pick up service. Hanoi Street Food Experience. (D)","description":"On arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. \nThe journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.\nEvening: \nYou will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.\nAccommodation: Hanoi Essence Hotel & Spa\nMeals: Dinner"},{"title":"Hanoi Morning Cooking Class Experience. (B,L)","description":"Local luxurious villa of 500m2 area with nice garden then is very promising for you to slacken your furious pace of life. It is an immeasurable experience to enjoy freshness and quietness in our green garden while we are sharing common spiritual values through Rose Kitchen chefs’ cultural stories and tales. And our cooking is ready afterward!\nThis exciting program is the ideal way to enjoy an authentic cultural and culinary experience. It’s also perfect for the serious home cooks who want to learn how to cook Vietnamese healthy food for their family and friends, for spouses accompanying husband or wife on a business trip, or the adventurous travellers wishing to explore more than just the sightseeing of our great city.\nMorning Class : 09:00 – 13:30\n- Get picked up from your hotel\n- Take a walk to local market to buy ingredients\n- Getting a fascinating glimpse into local culture\n- Transfer to local home\n- Learn how to cook the real Vietnamese traditional food under the guidance of professional cook\n- Enjoy your own cooking creation and numerous food from instructor\n- Tasting unique and special local wines\n- Cooking Class ends and get dropped off at your hotel\n03 Courses and more are available:\nCourse 1\n- BBQ pork with noodles and fish sauce (Bun Cha)\n- Fried spring rolls (Nem)\n- Banana flowers salad with chicken or green papaya salad with dried beef\n- Vietnamese Egg Coffee\nCourse 2\n- Chicken/Beef soup (Pho)\n- Green mango salad with seafood\n- Grilled fish-\nVietnamese Egg Coffee\nCourse 3 (For vegetarian)\n- Spring rolls (fresh or fried)\n- Bana flowers salad or green papaya salad with peanuts\n- Tofu in tomato sauce\n- Eggplant with ginger sauce\n- “Che” (Vietnamese traditional dessert) or Egg Coffee\nRemark:\n- Special food request is available.\n\nAccommodation: Hanoi Essence Hotel & Spa\nMeals: Breakfast, Lunch. "},{"title":"Hanoi - Lan Ha Bay. Overnight boat trip (B,L,D)","description":"After breakfast at homestay, ready at our office in old quarter no. 62 Hang Buom Str, Hoan Kiem, Hanoi for shuttle bus pick up to Hai Phong city. Journey there through the rich farmlands, observe everyday life of Vietnamese villagers as they work the rice fields, take pigs to the market on bicycles and plough the fields with their water buffaloes. Arrive in Hai Phong City late morning and board in V'spirit Premier Cruise – a new brand name of 4* stars cruise with the high level of customer service. Enjoy an unbeatable relaxing environment that is sure to to exceed your highest expectations in Lan Ha Bay and Halong Bay. The cruise not only features the latest safety features but was also designed throughout to give a sense of space and luxury, enhancing the cruise experience in comfort and luxury.\nLunch is served on board.\nTowards the end of the day set anchor for the night. As the sun sets over the bay dinner is served on board with fresh seafood, salads, and fruits.\nOvernight on board in Lan Ha Bay.\nAccommodation: V'spirit Premier Cruise - Deluxe Double/Twin Room \nMeals: Breakfast, Lunch, Dinner. "},{"title":"Lan Ha Bay - Hanoi. Train overnight to Hue (B,L)","description":"On your return to Hanoi enjoy a wholesome brunch as your boat weaves through strange-shaped limestone rock formations. Upon disembarkation, your driver will meet you for the transfer to Friends Travel Vietnam Office for some hour relaxing, have shower before taking an overnight to Hue leave at 19.30PM\nAccommodation: Deluxe Soft sleeper sharing train cabin.  \nMeals: Breakfast, Lunch. "},{"title":"Vespa Tour Street & Eats of Hue (D)","description":"Arrive Hue train station in morning time at 9.00am, take a taxi to your hotel for luggage tore & hotel check-in. \nEvening from 5:30pm - Taste the flavours of Hue.\nHue is a city that boasts over 1,000 specialty dishes. We’d love to try them all in one Hue food tour, but we have found the perfect amount to give you the best Hue has to offer. Kicking off with cocktails or cold beer, you’ll meet your tour guide and get ready for an evening of dining & learning about Hue cuisine. From here, take a short stroll to a family owned Banh Beo restaurant, where you can give a go at rolling your own “cake”. After attempting to master this art, sit down and relax with a beer and get your first tastes of Hue cuisine. Next, take a ride through the city and get a beautiful view of the Perfume River, ending up at our next stop- a bustling local restaurant. Try some classic Vietnamese dishes such as grilled pork skewers & Vietnamese pancakes- Hue style. From here, nighttime has arrived, so you’ll zoom through the lit Citadel walls and by the local riverside stalls. This ride will bring you to another local favourite where you can try some more daring dishes if you’d like (you’ll be pleasantly surprised!). After this restaurant, you will enjoy the final stop of the food tour, a popularVietnamese dessert shop to taste some things on the sweeter side.\n*Hue Food Tour Highlights – Cocktails & Beer (All you can drink), Banh Beo, Local grilled pork skewers & Hue style pancake restaurant, riding through the city at night, local specialty cuisine restaurant, dessert shop\nAccommodation: Hue Huong Giang Hotel \nMeals: Dinner."},{"title":"Easy Rider Hue - Danang - Hoian (B,L)","description":"After breakfast at hotel, our driver will pick you up hotel lobby around 8.00AM. Jump on the back of the motorbike with our Easy Riders and give a spin off to Hoi An. Your luggage will tight up on the back of the bike.\nWe will drive safely via the famous Hai Van Pass, visit the Marble Mountains, China Beach and lagoon and as highlight we will stop at the Elephant Springs* where we will have a swim. * only in the summer season for swimming available.\nWe will be drop you of at your hotel around 4PM. Tour finish. \nAccommodation: Hoian Laluna Riverside\nMeals: Breakfast, Lunch. "},{"title":"Vespa Tour: Hoian Bike Tour Street & Eats (B,D)","description":"Evening: 5.30pm - Taste the flavours of Hoi An\n\nStarting out at our central Hoi An café, sample the delicious local street food delight that is Banh Can while watching the streets & stalls come to life and sipping a cocktail. After the first taster, head out on the Vespas to try the famous ‘White Rose’ dumplings in town. We then head to lantern lit An Hoi Islet and jump in a local boat for a slow ride alongside the ancient town to Cam Nam Island where we join the locals for a seafood starter overlooking the Thu Bon River as the sun sets on Hoi An and enjoy a few cold beers. A leisurely drive along the banks of the river and through the alleyways and streets takes us to a lively local restaurant where we cook a hot pot at the table and learn the art of wrap ‘n’ roll – Vietnamese style! A short ride through the busy streets and alleys takes us to our last port of call, and a recent addition to Hoi An’s vibrant dining scene, a modern Vietnamese restaurant in a new neighbourhood, where we tuck into some awesome BBQ specialties, grilled DIY style at our table! As is customary, cold beers are consumed, and we finish with the delicious dessert of Banh Flan, a light version of crème caramel.\n\n Accommodation: Hoian Laluna Riverside \nMeals: Breakfast, Dinner. \n"},{"title":"Hoian Free & Easy. (B)","description":"Free & easy by yourself in Hoian to explorer Hoian town or fee time on the beach (An Bang). \n\nRecently declared a World Heritage site, Hoi An was a major international trading port during the 17th, 18th and 19th centuries. Today, parts of the beautifully preserved town retain the feel of centuries past. It's also a shopping mecca, famous for its plethora of tailors. On arrival your leader will take you on a sightseeing walk through the Old Town and visit a handful of the city's major attractions. You’ll will also be given a sightseeing pass so you can further explore select attractions at your leisure.\n\nToday is a free day to explore Hoi An. Browse the town’s cobbled streets and art galleries, or hire a bike and cycle through rice paddies out to Cua Dai Beach. Shop for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shop houses. Perhaps visit one of the hundreds of tailors in the city to get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class.\n\nAccommodation: Hoian Laluna Riverside \nMeals: Breakfast"},{"title":"Hoian - Danang. Flight Danang - Ho Chi Minh. (B, D)","description":"Your private car will pick you up at your hotel in Hoian & transfer to Danang Airport for domestic flight to Ho Chi Minh city. \nHo Chi Minh airport pick up service upon your arrival with sign-board under your name. Drop off at hotel for check-in & luggage store. \nEvening: \nYou will join Vespa tour “Ho Chi Minh After Dark” to explorer local life and enjoy various street food dishes. We pick you up at the hotel and first stop is to Café zoom to \"watch the world goes by\" (quoted by The Lonely Planet) and enjoy cocktail and appetizer before adventuring into favorite local eating spot. \nGuests experience the nightlife of Saigon the way locals do, all from the back of a vintage Vespa. The tour will start with a ride to part Chinatown and then heading to District 4 through busy streets and alleys to see the night life of locals and enjoy street sea- food and cold drinks, places that foreigner won't be found. \nLeaving district 4 to district 3 the tour pass through downtown district 1 to take in the sights on the way to Banh Xeo, specialty of Saigon and southern food with the locals. Then the tour will continue to a hidden Vietnamese-style coffee shop to have a taste of Vietnamese music (live) as a local. After this the tour will bring guest to a lively music venue to enjoy the drinks with live music.\nGuests ride pillion behind our drivers to enjoy and experience the Vietnamese night life with friends. This tour includes free flowing drinks and all you can eat, so come with an appetite. Kids? No worries! We can adjust this tour to be more kid-friendly!\nMeals: Breakfast, Dinner.\nAccommodation: Beautiful Saigon Boutique Hotel "},{"title":"Ho Chi Minh City (B)","description":"Free & easy to Ho Chi Minh.\n\nWe recommend you go to Mekong Delta The ‘rice bowl’ of Vietnam, the delta is carpeted in a dizzying variety of greens. It's a water world that moves to the rhythms of the mighty Mekong, where boats, houses and markets float upon the innumerable rivers, canals and streams that criss-cross the landscape like arteries.\n\nMeals: Breakfast."}]},{"name":"VNA002 - 10days Vietnam Classic Tour","duration":10,"travelStyle":["Discovery","Family","Group","Partially Guided","Sightseeing","Holiday"],"oldPrice":0,"price":767,"summary":"Starts/Ends: Hanoi / Ho Chi Minh or Vice Versa\nTour Duration: 10 days 9 nights\nDates: No fixed departure dates. You may go whenever you wish.\nTour Type: Landscape and Nature, Cruise Holidays, and Historical\nActivity Level: Regular itinerary, moderate walking","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/109652_6cfce080.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/109652_6cfce080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_c4a84380.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_52617e31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_c5d00823.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_8b29046f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_bd1addb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_da896705.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109652_f9747467.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 01: Fly to Hanoi","description":"Fly to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel. The rest of the day is at leisure. Overnight in Hanoi.\n3* Gondola Hotel: Sup Room  \n4*: Tirant hotel: Deluxe Room  \n5*: Melia Hotel: Deluxe Room"},{"title":"Day 02: Hanoi City Tour","description":"After breakfast, our guide will pick you up at hotel at 8.00 and start sightseeing today includes explore Vietnams charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanois key sites: the Ho Chi Minh Complex (Ho Chi Minhs Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake and one of the citys museums (a choice between the History Museum and the Ethnology Museum or Hoa Lo prison). End the days explorations with a cyclo tour through the Old Quarter or enjoy a traditional water puppet show."},{"title":"Day 03: Hanoi Halong Bay","description":"After breakfast, our guide and shuttle bus will pick you up at lobby of hotel at 8.00 -8.20AM and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and overnight on board. \n3* Swan Cruise: Deluxe Cabin \n4*: Calypso Cruise: Deluxe Cabin \n5*: Signature Roya Cruise: Senior Suite"},{"title":"Day 04: Halong Hanoi Fly to Da Nang","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bays towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi for your flight to Da Nang.  Upon arrival you will be welcomed by our driver and transfer directly to Hoi An for check in hotel. The rest of the day is at leisure.\n3* Calla Villa: Deluxe Room  \n4*: Vinh Hung Riverside: Superior Garden \n5*: Silk Sense River Resort: Sup Garden"},{"title":"Day 05: Hoi An My Son","description":"My Son Sanctuary, situated around 50km away from Hoi An, is another Cultural Heritage site recognized by UNESCO in 1999 with 32 epitaphs and 71 monuments. The unique Hindu sanctuary is the perfectly ideal destination for those who want to learn everything about the Champa Ancient Kingdom including the history, culture, and architecture.\nThis morning (afternoon), you will set out on a drive to the southwest of Hoi An to My Son Sanctuary for a My Son half day tour. This is where the Cham culture in Central Vietnam started in the 4th century, declined in the 13th century, and ceased to exist in the 15th century. The once capital of the Champa Kingdom dedicated to the worship of the god Shiva is now a cluster of partially ruined and heavily damaged Hindu temples, with only 20 left, due to age and bombing during the Vietnam War. This unique and majestic sanctuary stands as a witness to a glorious bygone era of the once-thriving Cham culture\n\n"},{"title":"Day 06: Hoi An Tra Que Village","description":"Cycling into the countryside to the small farming community of Tra Que Vegetable Village. Here you can enjoy the lush green countryside and see the farmers at work, later learn to make vietnamese spring roll and free on foot massage by herbs. Enjoy a free afternoon back in Hoi An. It is time for you to explore art and handicraft galleries, try on clothes tailor-made, relax at the riverside restaurants or take the short journey to the nearby beach. Overnight in Hoi An."},{"title":"Day 07: Hoi An Fly to Ho Chi Minh","description":"Free at leisure until transfer to airport for flight to Ho Chi Minh. Upon arrival Ho Chi Minh, you will be welcomed by our tour guide/ driver and transfer to hotel for check in. Free & easy in your own way.\n3* Gk Central Hotel: Superior Room  \n4* Grand Silverland: Pre DLX Garden \n5* Majestic Hotel: Colonial Deluxe"},{"title":"Day 08: Ho Chi Minh Cu Chi Tunnels","description":"Breakfast at hotel, meet our guide at 7.30 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City.\nHave a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there. \nAfter that, taste the typical boiled tapioca and hot tea before you come back to Saigon.\n"},{"title":"Day 09: Ho Chi Minh Mekong Delta","description":"After breakfast our guide and driver will pick you up at 6.30AM to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local hous. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends, getting on bus and drive back to Ho Chi Minh. "},{"title":"Day 10: Fly back home/ next destination","description":"After breakfast, our driver (no tour guide) will pick you up at lobby of hotel in Ho Chi Minh and transfer to Tan Son Nhat International Airport for flight back home."}]}]