[{"name":"10 Days Heritage Vietnam Holiday: Halong Bay - Hue - Hoi An - Cu Chi tunnels.","duration":10,"travelStyle":["Holiday","Group","Partially Guided"],"oldPrice":1067,"price":694,"summary":"The 10 Days Heritage Vietnam Holiday will provide a truly wonderful trip that you will remember for a lifetime. Imagine having 10 days to discover all of the most beautiful and interesting heritage sites of Vietnam and its marvelous culture from the North to the South Halong Bay - Hue Royal city - Hoi An ancient streets  to Cu Chi tunnels, the mountains to the beaches, the bustling cities to the serene, quiet countryside. Let us touring you the beauty of our unique natural landscapes and the history and depth of our ancient traditions. This 10 days itinerary in Vietnam promises to be a great journey with unexpected experiences to Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9229.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9229.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d922e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9230.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9232.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9233.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9235.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7c3d9236.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193309_5e3fb7bb010f7.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. \nUpon arrival, please go to custom desk as your first point of entry into the country and\npresent these documents for visa upon arrival. After collect visa and luggage, Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag.Or You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nMeal: None\nOvernight in Hanoi."},{"title":"HANOI HIGHTLIGHT SIGHTSEEING GROUP TOUR(B/L)","description":"The pick-up starts from 7.30 am to 8 am.  The colonial capital city Hanoi is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago. This full day tour takes you around Hanoi's most interesting sights, including the Ho Chi Minh Complex: Ho Chi Minh's Mausoleum and his Stilts House, Presidential Palace and the One Pillar Pagoda nearby, and the Old Quarter also known as the 36 streets and guilds. Also on the tour - the Lake of the Restored Sword and Ngoc Son Temple, the Temple of Literature, peaceful West Lake with lovers street Thanh Nien, the sedate Tran Quoc Pagoda and Quan Thanh Temple and one of the city's museums, either the History Museum or the Ethnology Museum.  Please note that the HCM Mausoleum is closed on Fridays and Mondays and most museums are closed on Mondays. \nMeals: breakfast, lunch\nOvernight on Haloi Hotel."},{"title":"HANOI A JOURNEY TO THE WORLD HERITAGE SITE - HALONG BAY SHARED CRUISE AND BUS(B/L/D)","description":"Halong Bay overnight cruise always attracts all clients when they visit Vietnam. Halong Bay 1 night cruise will be the highlighted trip in your 10 day itinerary in Vietnam for you.\nAfter having breakfast at the hotel, we will take an approximately 3.5-hour drive to Halong Bay - the UNESCO World Heritage Site, where we will begin our traditional Junk Cruise in this natural wonderland of jutting limestone islands and sparkling turquoise water.\nEnjoy a fresh seafood lunch onboard while soaking in the incredible views of this mystical bay.\nIn the afternoon, we will cruise around some of Halong's well-known islands and pay a visit to one of the largest caves in Halong Bay- Halong Bay Sung Sot Caves.\nAt some point, we will stop at an island featuring a sheltered white-sand beach to enjoy the warm waters of the Gulf of Tonkin (if the weather is suitable).\nMeals: breakfast, lunch\nOvernight on the junk.\nNotes: \nThe itinerary is a sample of one cruise. The itinerary will be different if you choose a different cruises."},{"title":"HALONG BAY MORNING ACTIVITIES - FLY TO ROYAL CITY - HUE(B/L)","description":"Start your day with Tai Chi exercises (a Chinese system of physical exercises) or just watch the sunrise over the bay's towering islands and enjoy coffee or tea. Afterward, we will explore the nearby islands by rowing boat or kayak. Using these smaller boats, you can discover some of the hidden corners of Halong Bay.\n\nTurn back the junk towards the harbor and contemplate the beauty of the amazing rock formations of the Bay before returning to Halong City. Our driver will pick you up there for the transfer to Noi Bai Airport to catch your short flight to Hue city\n\nUpon your arrival in Hue airport our driver will transfer you to the hotel in the royal city for check-in then enjoy the fisrt night in Hue city.\nMeals: breakfast, lunch\nOvernight on Hue hotel\nNotes: \nThe itinerary is a sample of one cruise. The itinerary will be different if you choose a different cruises.\n"},{"title":"HUE - A CULTURAL HERITAGE SITE VISITING GROUP TOUR(B/L)","description":"08:00 - 08:15: Pick up at the meeting point in the center of Hue city and cruise on the Perfume River. Visit the ancient and sacred Thien Mu Pagoda.\nVisit the Citadel - The palaces of the Nguyen Dynasty (1802-1945), the last dynasty of Vietnam - Noon Gate, Thai Hoa Palace, Imperial Ancestral Temple and Hue Royal Antiques Museum.\n11:00: Then, visit and shopping at Dong Ba Martket. Lunch at a local restaurant.\n14:00: Visit Minh Mang tomb, one of the most interesting emperor tombs in Hue.\nWe visit Khai Dinh Tomb. The tomb represents a fusion of traditional Vietnamese style and modern influence. The tomb is almost entirely made of concrete and includes many European architectural details.\nAnd go to Conical hat village, Incense stick village\n17:00: Come back to your hotel in the late afternoon. \nMeal: Breakfast, Lunch and Dinner\nOvernight in Hue Hotel."},{"title":"HUE BUS TO HOI AN ON THE UNIQUE ROAD THROUGH HAIVAN PASS AND LANG CO BEACH(B)","description":"8:00-08:30: Departure to Da Nang from Hue city center. Stop to visit and take pictures at: Thanh Toan TILE – ROOFED BRIDGE, Lang Co Beach, Hai Van Pass “the clouds pass” to have a panoramic view on the Vietnam East Sea.\n12:00 – 12:30: Arrive in Da Nang, stop to visit Marble Mountains and stone carving village.\n14:00: Arrive in Hoi An. Go to your hotel.\nMeal: Breakfast,\nOvernight in Hoi an Hotel.\n"},{"title":"GOING TO CHAM ISLAND: SNOKERING AND BEACH ACTIVITIES GROUP TOUR(B/L)","description":"“Cham Island is located of the coast of Hoi An and is a beautiful and fun getaway. We will start the day at Cua Dai Beach to embark on a speed boat toCham Island. After a short 40 minute ride you will arrive at Cu Lao Cham, a large island that consists of several small islands about 25 nautical miles off the coast. The island has a plethora of beautiful coral reefs and stunning scenery along with about 3.000 residents living at Lang and Huong beaches. The living reef around Cham Island offers some of the best opportunities in Asia to see exotic fish in their natural habitat.” 08:00AM Pick up at hotel ( Hoi an city) to Cua Dai harbor. Relaxing in fresh cool wind , you will enjoy the beautiful landscape on a Hoi An Green speed boat to Cham Island. 08:30AM Arriving at Lang Beach.Visiting the Marine Protected Area, The Boat Shelter, Hai Tang pagoda, Traditional fishing Village. 10:00AM Swimming and snorkeling. 11:30AM Staying at Bai Chong or Ong Beach ecological zone, swimming, taking time to enjoy a sea food lunch. 14:00PM Packing luggage for return trip to Hoi An 14:30PM Seeing you off at your hotel and finish your trip.\nMeal: Breakfast and Lunch.\nOvernight in Hoi An Hotel."},{"title":"HOI AN FREE VISITING IN THE MORNING - FLY TO HO CHI MINH(B)","description":"After breakfast, you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags. Later, transfer to the airport and fly to Hcm. Upon arrival, transfer to your hotel for relaxing and free discovery.\nMeal: Breakfast  \nOvernight in Ho Chi Minh Hotel."},{"title":"MUST SEE -HISTORICCAL SITE OF CU CHI TUNNELS HALPDAY MORNING GROUP TOUR(B/L)","description":"Start from Ho Chi Minh City and depart for Cu Chi Tunnels. Traveling to this destination will take you about 1.5 hours. Understand in advance a part of the Cu Chi’s history and hardships Vietnamese suffered in the past through an introductory video. This overview also shows you information about the process of making the tunnel system and the Vietnamese’s endurance.\nWhen reaching Cu Chi Tunnels, begin discovering the permitted areas of the tunnel systems like living areas (bedrooms and kitchens) and martial facilities (storage, fiend hospitals, weapon factories, and command center). Crawling through tiny tunnels to explore the system is actually a great experience.\nAfter the exploring, sip tangy tea and enjoy cassava – the main food of former Vietnamese guerillas. The final activity is to try your hand at the real shooting gun. After this, you are taken back to Ho Chi Minh City.\nMeal: Breakfast and Lunch\nOvernight in Ho Chi Minh Hotel."},{"title":"HO CHI MINH DEPARTURE TO HOME(B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends AND SEE YOU FOR NEXT TRIP.\n\nMeal: Breakfast."}]},{"name":"Quick Look Vietnam from Ho Chi Minh City to Hanoi - 7 Days","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1032,"price":619,"summary":"Ho Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Floating markets.\nHanoi: Sightseeing activities: Water Puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter. (optional, discover by yourself)\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/188726_8d8a0017.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/188726_8d8a0017.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_538daf67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_68550cc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_ffb24d57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_373eb47d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_67ff4d91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_1dd5cea1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_a6bde574.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_3b42dae7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_61624579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_b2c1d288.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_463594e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_48d3b8c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_30a445fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_83d1609a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_9526eb83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_09a76241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_d4369193.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_2f66b596.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_f86943c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_ddcc5b1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_d971e6e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_717a2514.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188726_96ad7101.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Ho Chi Minh City Arrival","description":"Today you’ll land in Ho Chi Minh City. Warmly welcome by Car Driver at airport then transfer to Saigon Downtown. Check in hotel. Stay overnight in Ho Chi Minh City\nAirport Pick up is Optional service. You`ll pay extra 15 US$/ Per Person (pay in location) if you need picking up at airport upon arrival or you can arrange your own transfer from airport to hotel. In case of arriving before departure date of the trip, you will check in the hotel by your own following the address below:\nLiberty Parkview Hotel Saigon\nAddress: 265 Phạm Ngũ Lão, Phường Phạm Ngũ Lão, Quận 1, Hồ Chí Minh, Vietnam\nPhone: +84 28 3836 4556"},{"title":"Day 2: Ho Chi Minh City - Cu Chu Tunnels full day (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War.\nArrive hotel around 5:00pm. Check in hotel and stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 3: Full day to Mekong Delta/River Boat Trip - Fly to Hanoi (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City around 3:00pm - 4:00pm. Pack your luggage the transfer to Airport for flight to Hanoi (1,5 hours). Pick up upon arrival Hanoi Airport by Driver. Transfer to hotel in Hanoi for check in. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 4: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises Halong Bay or similar"},{"title":"Day 5: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi\nPomihoa Hotel Hanoi or similar"},{"title":"Day 6: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 7: Bakhan Village - Hanoi/Concludes (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Trip ends at Pomihoa Hotel Hanoi or any hotels inside Hanoi Old Quarter (upon requests). Good bye and see you again!\nNotes: You can extend your trip by staying the same hotel or plan your own arrangements. If you need any helps from Legend Travel Group, please let us know!"}]},{"name":"Vietnam Escape 12 Days","duration":7,"travelStyle":["Flexi","Group","Partially Guided","Holiday"],"oldPrice":0,"price":970,"summary":"This tour drives you to the highlight beauties and make understanding of Vietnam’s people, culture and landscapes, from Hanoi - the historic and colonial Capital - to Ha Long Bay - famed for its beautiful landscapes -. You will have the chance to journey from the peaceful, quiet beautifully preserved streets of old Hoi An and Hue to the busy avenues of Saigon. You will also have the chance to visit the very foundations of the revolution and some of the major historic sites of the Vietnam War such as the Cu Chi Tunnels. This tour will also give you a taste of life on the Mekong River and its tributaries.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159059_023034da.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159059_023034da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_7f5f96f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_045f0891.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_02df38a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_761f22f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_4778a17c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_e29115a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_3e3b6442.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159059_3a02014b.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Halong Bay","Hanoi"],"timeline":[{"title":"Welcome to Vietnam - Ho Chi Minh Arrival","description":"Your trip begins with arrival in Vietnam,\nUpon your arrival in the bustling Ho Chi Minh City, still called “Saigon” by many locals, your driver will welcomed you at the airport and then transfer you to your hotel . \nAfter check in room, take a rest after long flight. \nIn the afternoon, explore the city and shopping in Ben Thanh market. Enjoy Swimming pool in the hotel by your own way.\nIn the evening, enjoy nightlife with night bar and beer corner at Bui Vien street\nMeal: None"},{"title":"Ho Chi Minh City Sightseeing & Cu Chi Tunnels (B/L)","description":"\nWe start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war. \nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish. \nReturn to Saigon and end the trip. \nPlease take notes: the Notre Dame Cathedral have been being restored (UNTIL 2022), so the guests just visit outside\nMeal: Breakfast, Lunch.\nOvernight in HCM city Hotel"},{"title":"Discover \" Vietnamese Rice Bowl\" Full Day Tour (B/L)","description":"07:30 – 08:00AM-Pick you up at your hotel\nAn unforgettable way of seeing the Mekong Delta is driving along the provincial roads down on the Southern region of Vietnam through paddy rice field, pine-apple plantation, orchard and small hamlets (2 hours’ drive).\nAfter arrival in My Tho, you will ride on a local motor boat along Dragon Island, Unicorn Is-land, Phoenix Island, Turtle Island and stop at the famous Unicorn Island. While at the Uni-corn Island, you will visit natural pure honey at a bee keeping farm, taste some honey wine, rice wine, banana wine…\nWalking on the village and taking rowing boat along the nature water coconut canal to see local’s daily life in Mekong Delta.\nFrom there, you will continue your motor boat trip to Ben Tre province to visit a handmade coconut candy workshop. Then transfer to a small motor boat and travel along the lush, green canals, and stop at local restaurant for Vietnamese lunch.\nAfter that going to another area on the Unicorn Island:\n+ Enjoying some kinds of tropical fruits at the orchard garden and listening to the Southern traditional music.\n+ Local boat will take you back to My Tho, then the bus will drive you back to Sai Gon.\n17:00 – 17:30-Drop off at your hotels.\nMeal: Breakfast and Lunch.\nOvernight in HCM city Hotel"},{"title":"Ho Chi Minh - Fly to Da Nang - Hoi An - Flight included (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Danang. Upon arrival, transfer to your hotel. After check in, you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags\nMeal: Breakfast.\nOvernight in Hoi An Hotel"},{"title":"Ba Na Hill - Golden Bridge - Fantasy Park (B/L)","description":"7:00 – 8:00: Picking up at HOTEL. Departing to Ba Na Hills.\n9:00: Arriving at the cable car station Suoi Mo, moving up the cable car route that achieves 4 world records.\n9:30: Checking–in on the 150-meter long \"Golden Bridge\" supported by the huge hands. Visiting the Le Jardin, Debay Wine Cellar of French. Visiting Linh Ung pagoda and admiring the 27m high Buddha statue, Loc Uyen Garden, Quan Am Cac. Continuing to Gare Debay and using the second cable car route to go to the top of Ba Na.\nVisiting Fantasy Park, joining in adventurous, fun, and modern games such as Love Swing, Skiver Pilot, Fire Racing Track, Bumper Car, Ghost House...\n12h00-13h00: Have a lunch and rest at the restaurant \n13h00-15h00: Visit and play game at the Fantasy Park. Explore King Peak at an altitude 1.487m\n15h00-16h00: Return Cable car.\n16h30-17h30: The car and tour guide’ll transfer you to your hotel.\nMeal: Breakfast and Lunch\nOvernight in Hoi An Hotel"},{"title":"A Fisher Experience Trip to Cam Thanh Coconut Village B/L)","description":"Cam Thanh eco fishing tour provides you with a close-up and intimate exposure to fishing communities. Discovering all manner of photo opportunities - coming and visiting a beautiful rice paddy field;. As well you will experience the friendliness of the local people greeting you along the way. You will also experience paddling the unique Vietnamese bamboo basket boat while the waterways of coconut palm paradise.\nTour Duration: 4hours\nITINERARY:\n•\t09h00: Getting on boat to a local farming village traveling along picturesque country roads . Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides.\n•\t09h30 :  You will have a chance to meet local fishermen and experience the daily life of their family .\n•\t10h15 :  Learn to paddle the strange and unique Vietnamese bamboo basket boats.\n•\t11h30 : You will join local fisherman on the river and enjoy hand-on experience of round net and cast net fishing\n•\t12h00:  Back to the restaurant for relaxing and enjoy lunch. \n•\t13h00:  Return the hotel by car.\nMeal: Breakfast, Lunch\nOvernight in Hoi An Hotel"},{"title":"Hoi An - Journey to Royal Stories - Hue City (B/L)","description":"\n7:00 – 7:30: Departure to Da Nang from Hoi An. \n8:00 – 8:30: Departure to Hue from Da Nang. Stop to visit and take pictures at: Lang Co Beach, Hai Van Pass “the clouds pass” to have a panoramic view on the Vietnam East Sea.\n11:00 – 11:30: Arrive in Hue. Have lunch at restaurant\nThen, we visit:\n- Khai Dinh tomb: The tomb represents a fusion of traditional Vietnamese style and modern influence. The tomb is almost entirely made of concrete and includes many European architectural details.\n- Thien Mu Pagoda: ancient and sacred\n- Citadel: The palaces of the Nguyen Dynasty (1802-1945), the last dynasty of Vietnam - Noon Gate, Thai Hoa Palace, Imperial Ancestral Temple\n16:00: Back to your hotel in Hue\nMeal: Breakfast, Lunch\nOvernight in Hue Hotel"},{"title":"Hue - Fly to Hanoi Capital - Street Food Tour - Flight Included (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to HANOI, Upon arrival, transfer to your hotel.\nYour expert English-speaking local guide will give you an insight into the intricacies and traditions of Vietnamese food culture including details on ingredients and historical backgrounds of popular northern dishes. We eat as we go, trying seasonal fruits and sampling a tasty French-inspired snack from a street cart.\nWalking through the maze of bustling streets that make up Hanoi’s Old Quarter, we tempt our taste buds with the famed Hanoi dish such as Bun Cha Hanoi, Banh Cuon at a local eatery. Watch in awe as the skilled chefs demonstrate for you how this tasty dish is put together. Continuing into the atmospheric heart of the Old Quarter, we wander past street stalls and quiet residential lanes where you can observe local life that has changed little since Hanoi was founded over 1000 years ago.\nOur next two snack stops are at outdoor barbecue stalls. We sit down with the Hanoi locals and sample various meat, vegetable and bread specialties that are flame grilled over hot coals for extra flavor.  It’s the time for dessert as we venture down a small alley to join in the local tradition of feasting on fresh fruit served in a cup and smothered with crushed ice and condensed milk – this specialty is one not to be missed!\n17.30 Your local guide will then take you to one of Hanoi’s best kept secrets, a hidden street food restaurant to taste top ten street foods in Hanoi is Banh My Hanoi, Vietnamese Rice Wine, and famous Egg Coffee. This hard-to-find cafe is one of the few left in the narrow street inside the old quarter of Hanoi. Or, if coffee is not your style, a cold beer awaits!. At the end of the trip you are free to continue exploring the area or your guide will assist you with directions or a taxi back to your hotel.\nMeal: Breakfast, Dinner\nOvernight in Hanoi Hotel"},{"title":"Hanoi Highlight City Tour Full Day B/L)","description":"Begin your day by a visit to the Ho Chi Minh mausoleum and hear about the man who led Vietnam’s campaign for independence from French colonial rule. After dedicating his life to the liberation of his country from foreign rule, Ho Chi Minh died in 1969 and his body was preserved for posterity. During the year, the mausoleum is closed for a month and Uncle Ho is given a bit of a spruce up! Then wander the grounds to see the One Pillar Pagoda and the Presidential Palace. Next, visit the Imperial Citadel of Thang Long, the apex of regional political power for more than a millennium where research and excavation is still underway, and then head to another 11th century relic, the Temple of Literature, which was built in homage to the Chinese scholar Confucius.\nIn the afternoon, visit the Ngoc Son temple set on a tiny island on the picturesque Hoan Kiem Lake. You’ll hear how it got its name from a legend of an emperor, a magic sword and a giant turtle! Take a breezy cyclo ride through the Old Quarter’s 36 streets, named after the products that were sold from their shops. Today, vendors on Tin and Bamboo Streets still sell the same wares.\n\nMeal: Breakfast, Lunch\n\nOvernight in Hanoi"},{"title":"Hanoi to the World's Wonder - Ha Long Bay (B/L/D)","description":"  - 7:45 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. \n  - 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise . Meet the captain , crew and join us for welcome drink as we tell you about life onboard.\n  - Check into your cabin . Time to refresh and unwind.\n  - Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n -  Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n - Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n - Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n -  Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n  - After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\n  Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom\n  Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nMeal: Breakfast, Lunch and Dinner\nOvernight on cruise in Halong Bay."},{"title":"Good morning in Ha Long Bay with Tai Chi - Back to Hanoi (B/L)","description":"Morning in the bay:\n- 6:30 – 6:45 Start  your day with Tai Chi exercises or a photo hunt\n- 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in 30-45 minutes.\n- 9:30am: We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store .\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and         more…\n- Join in the Cooking Class , teaching you how to make our specifically (Spring rolls) before an early lunch is served .\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina. \n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00\nNote: The itinerary above maybe changes by the effect of weather or different seasons\nMeal: Breakfast, Lunch\n\nOvernight in Hanoi"},{"title":"Hanoi Departure with Big Thank for Travelling with us (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Hanoi-Athena Elegance Cruise 6 Days/5 Nights","duration":6,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":586,"summary":"Free transfer round trip Airport-HanoiSpend 2 nights on La Vela PremiumUnique Water Puppet ShowDiscover Cave & Swim at Titop BeachAll accommodation included","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100255_74fdfdc6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100255_74fdfdc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_09ceaa3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_45f1c340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_a225ce66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_942f5906.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_f87d5d86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_260f9dab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_1357fe27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_f14ae945.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_25e08796.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_588ba5f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_5cecd218.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100255_d8565ee8.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"Landing at Noi Bai Airport, Hanoi, you feel warmly welcome by our helpful tour guide & car driver at the airport. Then your first impression is right on the way to Hanoi downtown - a city of beautiful lakes, shaded boulevards, public green parks, and the capital of Vietnam. Check into your hotel. You stay overnight in Hanoi."},{"title":"Day 2: Hanoi - Athena Elegance (B, L, D)","description":"7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00 pm reach Tuan Chau International Port and prepare for boarding\n12:30 pm Welcome on board! \n13:00 Welcome drinks, cruise information and check-in\n13:15 - 14:45 Lunch is served at the restaurant\n15:00 Visit Sung Sot Cave (1 hour)\n16:00 - 17:00 Cruise along Halong Bay\nAfternoon tea on the sundeck\nEnjoy an afternoon spa treatment*\nKayaking * option in Tung Sau Pearl Farm or Luon Cave\n17:00 17:45 Cooking demonstration on the sundeck\nAnchor at Coconut Tree Island for overnight stay\n17:45 - 18:45 Happy Hour on the sundeck*\n19:15 Dinner is served at the restaurant\n21:00 Happy Hour on the sundeck*\nEnjoy a spa treatment*\nBoard games & darts\nSquid fishing"},{"title":"Day 3: Discover Halong full day (B, L, D)","description":"06:30 Tai Chi on the sundeck\n07:00 - 08:30 Coffee & tea with freshly baked pastries\nBreakfast at the restaurant\n08:45 Transfer to day boat\n09:00 Visit Ti Top Island (1 hour)\n12:00 Lunch at the restaurant\n14.00 Discovery\n15:30 Return to Athena Elegance Cruise\n17:15 Cooking demonstration on the sundeck\n17:45 - 18:45 Happy Hour on the sundeck*\n19:15 Dinner is served at the restaurant\n21:00 Happy Hour on the sundeck*\nEnjoy a spa treatment*\nBoard games & darts\nSquid fishing"},{"title":"Athena Elegance Cruise - Hanoi (B, L)","description":"06:30 Tai Chi on the sundeck\n07:00 Coffee & tea with freshly baked pastries in the restaurant\n07:40 Visit Ti Top Island\n08:45 - 09:15 Bill settlement and check out\n09:00 Breakfast at the restaurant\n10:10 Traditional Vietnamese Tea Ceremony\n10:45 Return to Tuan Chau Marina\n11:00 - 12:00: Lunch \nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: We shall drop you back off at your hotel in Hanoi’s old quarter. We hope you had a legendary journey and hope to see you again! \n* Payable upon bill settlement and cabin checkout"},{"title":"Hanoi City Tour full day (B, L)","description":"After breakfast at hotel, we enjoy a full day city tour of this charming capital city including the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour cyclo ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). Stay overnight at Hotel"},{"title":"Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Authenic Experiences in Hanoi & Sapa with Cooking Class, Market, Ethnic Group People, Trekking,...","duration":5,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":328,"price":262,"summary":"Learn about Vietnamese culture by sightseeing tour or street food tour, then move to local house and take part in cooking class, go to market to sell and buy goods.\nThe day after, this journey will bring you a brief understanding of Sapa and its tribal peoples while enjoying its fascinating scenery, paying visit to Sapa town and 3 tribal villages of Black H’mong and Zay peoples which is well-known for its breathtaking scenery.\nNote: this tour only suppy for group from 2 people onwards.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/157258_a8569202.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/157258_a8569202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_4bf56965.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_d3b8a153.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_d0fe66d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_59adfa63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_6103ad9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_2e11e600.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_81c749fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_10badbf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_96c8cdf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_1151f127.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_198c3060.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_4a1e171e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_349ff8ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_f55d6e77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_b1731b89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_565bb7c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_7134cc43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_3495c3a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157258_10f9d0ee.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Hanoi arrival (Lunch, Dinner)","description":"Our driver and tour guide will pick you up at Noi bai International Airport, the plane ticket will be arranged by customers and the pick-up time can be flexible.\nThen, you will have half-day tour to visit Hanoi city. We start with visit to President Ho Chi Minh's mausoleum (Outsite). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university\nAfter finishing city tour, we are going to local house outside Hanoi city, take part in cooking class, sing karaoke and talk to local people."},{"title":"Day 2: Cu Da Acient Village - Local Market (Breakfast / Lunch / Dinner)","description":"8AM: Wake up and enjoy breakfast at local market and visit Cu Da Acient Village.\nCu Da Ancient Village is a Hanoi tourist destination for those who love to learn architecture, or want to learn about Vietnamese history, traditional villages, or simply come here to have moments release your soul into a peaceful setting, feel like time is standing.\nTake part in local market with local people there by selling and buying some neccessary food for lunch and dinner."},{"title":"Day 3: Bus to Sapa - Y Linh Ho - Lao Chai - Ta Van (Lunch/Dinner)","description":"Wake up early and take transportation to bus office then take sleeping bus and depart to Sapa Town at 7AM.\n1PM: Stop at Sapa town, lunch will be served at hotel or restaurant.\n3PM: Start trekking thorugh villages with 12 km of trekking, visit Y Linh Ho and Lao Chai villages of the H’mong minority. after lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay where we stay overnight in a local family. Here you have opportunity to experience their daily life, work and original custom.\n Trekking level: 5/10\n 12 Km of trekking "},{"title":"Day 4: Ta Van - Giang Ta Chai - Su Pan (Breakfast / Lunch)","description":"8AM: Breakfast will be serving at the homestay\n9:30AM: Start trekking with 8 km walking to visit 2 villages of the red Dzao, the H’mong (Giang Ta Chai & Su Pan). Visit a beautiful waterfall and rattan bridge. Enjoy landscapes… through bamboo forest on the way to the main road to get the jeep to return to Sapa.\nTour finish in Sapa by 3PM then we take you to bus station and take the bus to get back Hanoi at 10PM\nOvernight at hotel in Hanoi.\n Trekking level: 5/10"},{"title":"Day 5: Hanoi departure","description":"Enjoy free time on last day in Hanoi and be ready for departure. The flight will be arranged by customer and airport service can be flexible."}]},{"name":"Best of Vietnam 10 Days","duration":10,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":795,"summary":"Vietnam's reinvention as Southeast Asia's most exciting tourist destination has long since been complete. After wars for the larger part of the 20th century, the country is now a hotspot for foodies, beach bums and thrill-seekers alike. Its capital, Hanoi, has managed to retain its old-style feel despite an economic boom. Its Old Quarter is a riot of delectable food stalls, markets and labyrinthine streets. Ho Chi Minh City serves up a more modern edge, while the UNESCO-protected town of Hoi An has kept its charm despite the swathes of tourists. Vietnam's natural wonders, from Ha Long Bay to the Mekong Delta via the beaches of Da Nang, make it truly magical.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159192_5e3d394c90113.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159192_5e3d394c90113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_4aef8b91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_e68f013b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_c95ebee8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_7783aa48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_7b3ff429.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_cbb9b035.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159192_2af84d0b.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Welcome to Vietnam - Ho Chi Minh Arrival","description":"HELLO/ XIN CHAO VIETNAM. Your trip begins with arrival in Ho Chi Minh City. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. Then you can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.  \nMeal: None.\nOvernight in Ho Chi MInh City Hotel."},{"title":"Mekong Delta and waterways to coconut land of Ben tre(B/L)","description":"07:45 – 08:00AM-Pick you up at your hotel\nAn unforgettable way of seeing the Mekong Delta is driving along the provincial roads down on the Southern region of Vietnam through paddy rice field, pine-apple plantation, orchard and small hamlets (2 hours’ drive).\nAfter arrival in My Tho, you will ride on a local motor boat along Dragon Island, Unicorn Island, Phoenix Island, Turtle Island and stop at the famous Unicorn Island. While at the Unicorn Island, you will visit natural pure honey at a bee keeping farm, taste some honey wine, rice wine, banana wine…\nWalking on the village and taking rowing boat along the nature water coconut canal to see local’s daily life in Mekong Delta.\nFrom there, you will continue your motor boat trip to Ben Tre province to visit a handmade coconut candy workshop. Then transfer to a small motor boat and travel along the lush, green canals, and stop at local restaurant for Vietnamese lunch.\nAfter that going to another area on the Unicorn Island:\n+ Enjoying some kinds of tropical fruits at the orchard garden and listening to the Southern traditional music.\n+ Local boat will take you back to My Tho, then the bus will drive you back to Sai Gon.\n17:00 – 17:30-Drop off at your hotels.\nMeal: Breakfast and Lunch.\nOvernight in Ho Chi MInh City Hotel.\n\n"},{"title":"Cu Chi Tunnels in the Morning - Fly to Da Nang - Flight included (B/L)","description":"Start from Ho Chi Minh City and depart for Cu Chi Tunnels. Traveling to this destination will take you about 1.5 hours. Understand in advance a part of the Cu Chi’s history and hardships Vietnamese suffered in the past through an introductory video. This overview also shows you information about the process of making the tunnel system and the Vietnamese’s endurance. When reaching Cu Chi Tunnels, begin discovering the permitted areas of the tunnel systems like living areas (bedrooms and kitchens) and martial facilities (storage, fiend hospitals, weapon factories, and command center). Crawling through tiny tunnels to explore the system is actually a great experience. After the exploring, sip tangy tea and enjoy cassava – the main food of former Vietnamese guerillas. The final activity is to try your hand at the real shooting gun. After this, you are taken back to Ho Chi Minh City.\nLater, transfer to the airport and fly to Da Nang. Upon arrival, transfer to your hotel in Hoi An.\nMeal: Breakfast and light Lunch.\nOvernight in Hoi An Hotel."},{"title":"Going to Cham Island - Snorkeling and Beach Activities (B/L)","description":"“Cham Island is located of the coast of Hoi An and is a beautiful and fun getaway. We will start the day at Cua Dai Beach to embark on a speed boat toCham Island. After a short 40 minute ride you will arrive at Cu Lao Cham, a large island that consists of several small islands about 25 nautical miles off the coast. The island has a plethora of beautiful coral reefs and stunning scenery along with about 3.000 residents living at Lang and Huong beaches. The living reef around Cham Island offers some of the best opportunities in Asia to see exotic fish in their natural habitat.”\n08:00AM Pick up at hotel ( Hoi an city) to Cua Dai harbor. Relaxing in fresh cool wind , you will enjoy the beautiful landscape on a Hoi An Green speed boat to Cham Island.\n08:30AM Arriving at Lang Beach.Visiting the Marine Protected Area, The Boat Shelter, Hai Tang pagoda, Traditional fishing Village.\n10:00AM Swimming and snorkeling.\n11:30AM Staying at Bai Chong or Ong Beach ecological zone, swimming, taking time to enjoy a sea food lunch.\n14:00PM Packing luggage for return trip to Hoi An\n14:30PM Seeing you off at your hotel and finish your trip\nMeal: Breakfast and Lunch.\nOvernight in Hoi An Hotel."},{"title":"Hoi An Free Morning - Fly to Hanoi - Flight included (B)","description":"After breakfast, you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags.\nLater, transfer to the airport and fly to Hanoi. Upon arrival, transfer to your hotel.\nMeal: Breakfast \nOvernight in Ha Noi Hotel."},{"title":"Hanoi - Good morning Sapa - Ethnic Hmong Village Visiting (B/L/D)","description":" 6.30 – 7.00: Pick up from your hotel in Hanoi Old Quarter or meeting point (Hanoi Opera House), get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costumes of H’mong, Dzao, Tay ethnic People. Our tour guide will inform short information to you before checking in then enjoy the set menu lunch with Vietnamese cuisine.\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, go trekking down to the valley bottom to the waterfall - Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk up hill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. Free at leisure until 19:00 Have dinner and overnight in hotel with night activities. \nMeal: Breakfast, Lunch and Dinner.\nOvernight in Sapa Hotel."},{"title":"Day 7: Sapa - Lao Chai - Ta Van - Bus back to Hanoi (B/L)","description":"7.00 – 8.00: Have breakfast at hotel, check out the room and prepare light pack for trekking. (Big luggage keep in hotel store)\n8.00: A short trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Our bus picks you up at Ta Van Bridge to get back Sapa.\n12.30 - 13.30: Have lunch in the hotel.\n13.30 - 14.45: Relax and leisure on your own, have shower in the public bathroom in the hotel if you want.\n14.45 - 15.00: Meet all group members at hotel to get ready for Hanoi.\n15.30: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: We say goodbye to you at your hotel in Hanoi Old Quarter. \nMeal: Breakfast, Lunch.\nOvernight in Hanoi Hotel."},{"title":"Hanoi - Ha Long Bay: Wonder of the World (B/L/D)","description":" - 7:45 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. \n - 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise . Meet the captain , crew and join us for welcome drink as we tell you about life onboard.\n - Check into your cabin . Time to refresh and unwind.\n - Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n-  Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n- Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n- Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n-  Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n - After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\n Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom\nMeal: Breakfast, Lunch and Dinner.\nOvernight in Halong Cruise"},{"title":"Tai Chi -Kayaking - Cooking Class - Bus to Hanoi(B/L)","description":"\nMorning in the bay:\n- 6:30 – 6:45 Start  your day with Tai Chi exercises or a photo hunt\n- 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in 30-45 minutes.\n- 9:30am: We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store .\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and         more…\n- Join in the Cooking Class , teaching you how to make our specifically (Spring rolls) before an early lunch is served .\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina. \n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00\nNote: The itinerary above maybe changes by the effect of weather or different seasons\nMeal: Breakfast, Lunch.\nOvernight in Hanoi Hotel.\n\n\n\n"},{"title":"Hanoi Departure Day(B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends\nMeal: Breakfast,\n"}]},{"name":"Family Relaxing Package","duration":5,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":310,"summary":"Best of family tour packages guarantee relaxation and activities for the complete family. Right from adults and kids to elderly, family packages include a vast range of sightseeing trips, historical tours, fun activities and a lot of relaxing time. From beach destination to city getaways, plan your holidays with loved ones for an unforgettable affair. Browse through the itineraries of our list of family holiday packages in Hanoi, and book one that matches the interests and preferences of every member of the family. What’s more? As our package are easily customizable, people can also get in touch with our travel experts, and get their choice of attraction and activity included or excluded in the package. So, whether one enjoys beaches, natural beauty, or historical monuments, our tour packages have got everyone covered.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/157061_3f31ee9b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/157061_3f31ee9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_2bc37125.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_8a7e8fff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_dc75043d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_9e0e4bae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_13268280.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_80c38b39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_d14eb87e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_20bfff70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_74922709.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_ee2a1f26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_9b98c4e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_493c42f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_ae514016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_3bc5daa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_db72c92e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_df17264d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_45eddb2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_859d1009.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_6b54be42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157061_159c8bfb.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Pick up at airport, we offer FREE tour guide for the 03 hours walking tour. Stay 01st night at The Hanoian Hotel (Connecting room)"},{"title":"Day 2: Hanoi City Tour","description":"Join in the day trip to visit Hanoi city tour by private car with driver and private tourguide. Enjoy the FREE 30 minutes foot massage. Stay 2nd night The Hanoian Hotel (Connecting room)"},{"title":"Day 3: Hanoi - Halong Bay","description":"Spend 2 days 1 night trip in Halong Bay with one the best 3 star cruise in either Swan Cruise or equivalence. Stay 3rd night on Board. (Connecting room)"},{"title":"Day 4: Halong Bay - Hanoi","description":"Return from Halong Bay trip to Hanoi. We offer FREE 01 hour cyclo/puppet show. Stay 4th night at The Hanoian Hotel (Connecting room)."},{"title":"Day 5: Hanoi Departure","description":"Our car brings you to the airport.Trip ends"}]},{"name":"Vietnam Paradise For Honeymoon/ Halong Bay - Phu Quoc Island","duration":10,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":803,"summary":"No newly-wedded couple can resist the attraction of this dreamy journey. Your trip will get off to an impressive start in Hanoi, an eclectic mixture of old and new with abundant traditional streetscapes and cultural heritage sites. Then, edge forward to Ba Vi to experience the authentic local life which has never listed in any textbook of travel. Take part in a flurry of recreational activities with friendly residents. Travel to Phu Quoc island with the most stunning white-sand beaches in Vietnam. Celebrate your honeymoon in the essence of untouched beaches under the coconut palm.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd6670a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd6670a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd66701.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd66705.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd66707.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191876_5e3bebdd66709.jpg"],"destinations":["Hanoi","Halong Bay","Phu Quoc Island","Ho Chi Minh City"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Welcome to Hanoi, the oriental gem of the Indochina, our driver will meet you at the airport and transfer to hotel, rest of the day will be at your own plan and exploration.\n\nOvernight in Hanoi"},{"title":"HANOI LEISURE DAY (B)","description":"Today you have free time to explore the city at your own pace.\n\nOvernight in Hanoi"},{"title":"BAVI ECOTOUR - PRIVATE TOUR (B/L)","description":"Have breakfast at the hotel then you will be escorted by an experienced English-speaking guide, a countryside located at the outskirt of Hanoi. The approximate travel time is one hour and 30 minutes.\n\nThen arriving at Mr. Duoc’s house, you will be welcomed with fresh honey tea and green lentils or lotus seeds that made by his family. Imagine a Vietnam in the old time of war through stories of Mr. Duoc, who is not only a veteran who lives during those hard times but also a green tea expert. You will visit his tea plantation which is one of the largest in Ri village and join with locals in green tea processing. Afterward, have a Vietnamese cooking demonstration with another local host and then enjoy a home-cooked lunch in a lovely garden.\n\nAfter that, you will wander around the village and mingling with local people. You will visit the local craftsman who has been skilled at making conical hats from a very young age and other workshops in the village to see how people there make tofu or shell the rice. As you meander through the countryside you will experience the friendliness of the local people greeting you along the way. Then join your guides for a leisurely cycling trip along the country roads. Observe traditional Vietnamese rural life as the local people work in the paddy fields. Along the way, watch out for a water buffalo plowing a paddy field while ducks swim across the top. Stop at another host family for foot bathing following the recipes of Muong ethnic group and relaxing time before embarking on your private boat for a trip along the Da river. \n\nOvernight in Hanoi."},{"title":"CRUISING TO THE BEAUTY OF NATURAL WORLD - HALONG BAY - SHARING CRUISE (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise at 7:30 am. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes.\n\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat.\n\nOvernight on cruise"},{"title":"MORNING IN VIETNAM MOST FAMOUS BAY (B/L)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites or at the floating village. From here, you will sail back to the main harbor and return to Hanoi (around 16:30-17:00). Drop at hotel in Hanoi. Free at your leisure time.\n\nOvernight in Hanoi"},{"title":"FLY FROM HA NOI TO PHU QUOC (B) – FLIGHT INCLUDED","description":"Have a healthy breakfast then transfer to the airport to take a flight to Phu Quoc Island –the most wonderful island of Vietnam.\n\nOvernight in Phu Quoc"},{"title":"CHERISH YOUR LEISURE TIME ON THE BEACH (B)","description":"Have leisure time today.\n\nOvernight in Phu Quoc"},{"title":"CHERISH YOUR LEISURE TIME ON THE BEACH (B)","description":"Have leisure time today.\n\nOvernight in Phu Quoc"},{"title":"CHERISH YOUR LEISURE TIME ON THE BEACH (B)","description":"Have leisure time today.\n\nOvernight in Phu Quoc"},{"title":"TIME TO SAY GOODBYE PHU QUOC – HO CHI MINH DEPARTURE (B)","description":"From Phu Quoc island you will be transferred back to Ho Chi Minh city for departure flight.\n\nPlease NOTE: your International flight back home should be in the afternoon"}]}]