[{"name":"Vietnam Experience (including Mekong Delta)","duration":12,"travelStyle":["In-depth Cultural","Group","Fully Guided","Coach / Bus","Sightseeing","Historical","Holiday"],"oldPrice":1435,"price":1148,"summary":"Looking for the full experience tour of Vietnam? This trip takes you through Ho Chi Minh, Hoi An, Hanoi & Halong Bay with plenty of action and highlights to immerse yourself into this enchanting culture. Picture yourself relishing the rice region of Mekong Delta by taking a traditional boat through floating markets & local fruit farms, stopping in exciting & iconic hot spots & popular local foodie haunts for a true Vietnam experience.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198433_333200b0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198433_333200b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16962.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16965.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16966.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16968.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa1696a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa1696b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa1696d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa1696e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16970.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198433_5ea7a5aa16974.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City","description":"Welcome to Ho Chi Minh city, formerly known as Saigon. This is one of Asia's most exhilarating cities, steeped in grand history and post-Vietnam war memories. This evening you'll meet your travel comrades and explore the Ben Thanh markets, offering the freshest traditional Bánh mì, Pho and Bia hơi. Oh yes, this is the right way to get the Vietnam party started."},{"title":"Day 2: Ho Chi Minh City to Mekong Delta","description":"It's goodbye busy city and hello river life today as we make for the Mekong Delta for an extra special overnight experience you won't be forgetting fast.Travelling down the river on local sampans, peace and tranquillity will be at an all time high. This afternoon we'll spend our time getting a serious learning fix by visiting a local tea garden and seeing the floating markets, learning about local industries along the river and the way of life here and meet some of the friendliest people on earth. Definitely one to give us all the local feels, topped off with a night at our Mekong Guesthouse."},{"title":"Day 3: Mekong Delta to Ho Chi Minh City","description":"After an early breakfast we'll make our way back to Ho Chi Minh, detouring past the staggering 250-kilometres of tunnels that make up the Viet Cong’s Cu Chi.See traps, hidden doors & some of the 250kms of tunnels that Vietnamese resistance fighters dug by hand, and even go down into the skinny tunnels to experience them first hand in this look into Vietnam's staggering past.Back in the addictive mayhem of Vietnam's biggest city you will have free time to carry on your explorations. Continuing to eat your way through Vietnam's culinary highlights would be one wise way to use your time (we think)."},{"title":"Day 4: Ho Chi Minh City to Nha Trang","description":"With some traditional R'n'R on our afternoon agenda, the morning can be used to put on our discovering boots. We'll dabble in history and religion before taking flight to a coastal town overlooking the South China Sea.Golden sand beaches, turquoise oceans, water sports galore - this is Nha Trang. This afternoon why not book in for a mineral mud bath and hot thermal spring experience before heading out to dinner with your crew. Ah, the good life."},{"title":"Day 5: Nha Trang","description":"Good news - we're kicking it in Nha Trang for another night. Have a massage, sign up for the optional cruise, or just hang on the beach saving your energy for seaside bar fun as the sun sets."},{"title":"Day 6: Nha Trang to Hoi An","description":"Catch you later Nha Trang and hello Hoi An.Get your bearings with a guided tour through the Old Quarter, and fall deeply in love with this perfect spot. Japanese Bridge, French Colonial vibes and brightly coloured buildings are endlessly charming. You'll be feeling hungry no doubt, so tonight we'll bet we can tempt you with our optional Vietnamese cooking class to get your cooking skills on form and show off to your friends back home. With our expert chef leading the charge, you'll soon be feeling like a bit of an expert. Armed with new skills, ask your Trip Manager about where to head for a night out with the group."},{"title":"Day 7: Hoi An","description":"A short drive from Hoi An are the famous Marble Mountains, a collection of 5 peaks that represent the 5 Elements in Vietnamese folk lore – metal, wood, earth, fire and water. Our local guide would be delighted to take us on a tour through the Thuy Son caves and grottos which are home to some of the most beautiful and intricate stone carvings in the area. The Marble Mountains were also the hiding place of the US Forces during the Vietnam Conflict and even a military hospital! Hear about the history while taking in panoramic views and later, kick back at An Bang Beach before heading back to Hoi An for more Free Time Addons."},{"title":"Day 8: Hoi An to Hue","description":"Though we'll have grown content with Hoi An life, this morning the show must go on. After all, the former imperial town of Hue has invited us over, and we'd be foolish to turn it down.Intricately decorated pavilions, lotus flower ponds, and colourful artworks mark our first sightseeing venture in Hue. Totally in awe of Tu Duc Mausoleum, we move on to the 7-story Thien Mu Pagoda & learn of the horrific history of the Hue Buddhist massacre as well as taking in a cyclo ride to see the city from a whole new angle."},{"title":"Day 9: Hue to Hanoi","description":"Today we fly out of Hue in the direction of Vietnam's time capsule capital. A trio of influences and filled with romance, 2-nights here will see us utterly smitten.With an epic fusion of French, Chinese & Vietnamese influence, you'll be nothing short of ecstatic as we check-in to our Hanoi hotel, right in the middle of the bustling Old Quarter. Our time will be spent weaving through a maze of 36 trading streets filled with colourful goods for sale, and unwinding in the walled gardens of the Temple of Literature. Later, we'll roam French-style boulevards and maybe dine on a nom ngo sen lotus-stem salad, dau chien ron fried tofu & a few bia hoi beers."},{"title":"Day 10: Hanoi to Halong Bay","description":"After a Hanoi history 101 lesson we move on to Halong Bay where a night on a UNESCO World Heritage-listed site awaits.A drive through stunning scenery will evoke plenty of 'oh wow's, but it only gets better as we board our home for the night, a Chinese-style junk boat in Halong Bay. Feel the serenity kicking in immediately as we drift the limestone island seas of the Gulf of Tonkin. We will pass hidden lagoons, thick forests & dreamy grottos, & stop to explore the Sung Sot Caves. A fresh seafood dinner and sunset at our docking spot will polish off a wonderful daypacked with No Regrets moments and simply unforgettable experiences."},{"title":"Day 11: Halong Bay to Hanoi","description":"Today will be all about the leisurely vibes as we wake up to breakfast and a grotto swim. Make the most of your time on the junk boat & kayak your way around Halong Bay - the views don't get much better than this.After heading back to Hanoi we find ourselves enjoying our final night together on tour. Save the choir of tears for tomorrow - this evening is all about making the most of your free time and staying positive. The quirky world-famous water puppet performance in Red River Delta makes for the perfect send off, should you fancy opting for something a bit different."},{"title":"Day 12: Depart Hanoi","description":"Enjoy one final breakfast with the squad this morning before the trip wraps up. Hug it out and make plans to reunite sometime soon - Latin America, perhaps?"}]},{"name":"Ultimate Vietnam - 14 Days","duration":14,"travelStyle":["Discovery","Group","Fully Guided"],"oldPrice":0,"price":1074,"summary":"\n\tLooking for the Ultimate Vietnam experience? Our 14-day / 13-night trip from Hanoi to Ho Chi Minh City includes the very best of Vietnam, including heaps of activities on our journey through the mountains, beaches and bustling cities. Our experienced tour leaders will ensure you have the trip of a lifetime and you’ll discover the best this amazing country has to offer.\n","highlights":["Head into Hanoi for exotic foods and fresh beer","Kayak through the emerald waters of Halong Bay","Marvel at the incredible beauty of lantern-lit Hoi-An","Learn to make tasty traditional Vietnamese dishes","Relax in and explore pure paradise in Ninh Van Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/80210_5dfaed22b2cba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/80210_5dfaed22b2cba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_f3f085c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_ab4f95d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_b37d9fa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_1c98c363.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_cc559582.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_094a2462.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_97e287cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_a06b4ae8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80210_59f31968.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Dalat","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Welcome to Vietnam!","description":"Our trip begins with a welcome dinner at our favourite restaurant in Hanoi. Meet your group and share a few drinks with your new travel buddies. We’ll tell you everything you need to know about the next 13-days and nights."},{"title":"Day 2: Foodie Tour & Culture Show","description":"One thing Vietnam is famous for is the diverse range of exotic food. Our local guide will take us on a tour to some hidden places where you can sample weird, interesting and tasty food whilst getting to know your way around the city. Later today we go to see a water puppet show – probably one of the most random things you will experience in your life and a big part of the Vietnamese culture.\n\nGet ready to party, Hanoi-style! Vietnam is very different – in a good way!  Mingle and dance with locals and other travellers in the alleys of Hanoi, grab yourself a tiny stool and join the crowd for some ‘fresh beer’."},{"title":"Day 3: Discover Halong Bay","description":"We leave Hanoi and get to Halong Pier, where we board our home for tonight. Cruise Halong Bay and Lan Ha Bay on a typical Vietnamese “junk” boat. Enjoy magical scenery as you cruise and kayak through crystal clear waters past hundreds of lime stone karsts. We stay overnight on a Vietnamese junk boat, moored in a secluded cove within Halong Bay."},{"title":"Day 4: Private Island Stay","description":"Enjoy a night at our secret spot, hidden on a private beach in Halong Bay. It doesn’t get more idyllic than this! Chill in a hammock, go for a swim or kayak, play some beach volleyball and karaoke at night."},{"title":"Day 5: More of Halong & Party Night in Hanoi","description":"Wake up to the sound of the ocean and enjoy your surroundings on the island. After breakfast we had back towards Hanoi for another night on the town."},{"title":"Day 6: Fly to Hoi An","description":"It may not seem that way, but Vietnam is actually a pretty large country. To get the most out of your 13-days, our trip includes a flight from Hanoi to Hoi An. With red lanterns hanging from trees, buildings and shops all around town, Hoi An is known as the City of Lanterns. At night, when the lanterns light up the streets, we’ll take you on a walk through town and show you our favourite bars."},{"title":"Day 7: Markets & Vietnamese Cooking Class","description":"You think you’ve had good food before? You haven’t tried proper Vietnamese cuisine – made in Vietnam, by you! Learn to cook the most delicious dishes in a private cooking class. Yum Yum!"},{"title":"Day 8: Beach & Overnight Bus","description":"Spend time in beautiful Hoi An where life is amazingly laid-back with a city center perfect for relaxing, eating and shopping and a beautiful beach a short bike ride from town. Later tonight, we get on the sleeper bus – you haven’t been to Vietnam if you haven’t been on a sleeper bus!"},{"title":"Day 9: Relax in Paradise","description":"You'll jump on an overnight sleeper bus and wake up in beautiful Ninh Van Bay, just outside of Nha Trang, it's pure paradise! The hostel you will be staying at is located amongst the beautiful rolling hills of Vietnam's countryside, nestled in the valleys a stone's throw away from the beach. After breakfast the day is yours to do what you wish but be sure to meet your guide in the afternoon to explore the surrounding areas with a light hike! Otherwise relax by the pool, challenge your group to a game of beach volleyball, unwind with a movie in the outdoor cinema, pamper yourself at the spa or take to the water in a kayak. "},{"title":"Day 10: Explore Da Lat","description":"The central city of the Vietnam highlands is famous for its cool temperatures and stunning waterfalls. Da Lat is known as the romantic city of Vietnam with lots of locals heading here to get married. We get here late afternoon, which gives us enough time to explore this cute town and visit ‘Crazy House’, if you like."},{"title":"Day 11: Let’s walk down a Waterfall","description":"The next day get ready for the ultimate thrill! We’ll head to the woods, get our gear and start the adventure in the canyon. Hike through lush green rain forest, do some abseiling, walk down a pounding waterfall before we get to the ‘washing machine’. Adrenaline rush guaranteed!"},{"title":"Day 12: Arrive in Ho Chi Minh City","description":"We leave the mountains and take the bus to our final stop Ho Chi Minh City. This city is buzzing and great to have a good night out."},{"title":"Day 13: Cu Chi Tunnels & Farewell","description":"Obviously, you can’t visit Vietnam and not learn about the country’s history including the Vietnam War. Our local guide takes us to the Cu Chi Tunnels and gives us a good insight into what happened here.\n\nLater tonight we get ready for the final night and enjoy farewell drinks on one of the rooftop bars. Tonight’s accommodation is still included in your tour."},{"title":"Day 14: Farewell","description":"Time to check out (unless you choose to stay a little longer) and make your way to whatever is next on your list. Whether it’s just heading to the airport to catch your flight home or travelling on to more adventures, we will help you with the planning."}]},{"name":"VIETNAM COLLECTION 2 - Magical Vietnam 12 Days","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Moderate","Holiday"],"oldPrice":0,"price":1170,"summary":"Welcome to Vietnam! \nVietnam is a country of natural beauty, delicate and flavorful cuisine, compelling history, cultural diversity, incredible heritages. The vibrant people make Vietnam a one-of-a-kind Asian destination. With an intriguing history spanning back over 4,000 years, including occupations from both the Chinese and French, the country’s architecture and cuisine is a fascinating testament to cultural diversity. ","highlights":["2 Domestic flights","Visit Cu Chi Tunnels","Discover Mekong Delta - Cai Be Floating Market","Cable car to Ba Na Hills Fantasy Park & Golden Bridge","Hoi An Ancient Town bike tour","My Son Sanctuary - Cham Civilization","Eco Tour - Basket boat & fishing village","Overnight on cruise in Halong Bay","Explore Hanoi Old Quarter","Extend your trip with Footsteps Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/127069_8e445c8c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/127069_8e445c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_9969c274.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_eeae635c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_ae74916d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_fe8b1f30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_a4b80a54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_e5a9249a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_f8d9e6cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_0e5baa74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_499457a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_1415d2be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_651c732e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_21119605.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_05329441.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_809bd02e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_48bbb0f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_957dc976.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_42f92f98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_3725643a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_d00c0198.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_5e0aca65cf0aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_5e0aca9d6a236.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_5e0acae2390df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127069_5e0acb2c3f9d9.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"SAIGON ARRIVAL - VIETNAM XIN CHAO!","description":"Welcome to Vietnam! Upon arrival, meet our team at the airport and drive to city center, all domcument will be sent to you in this day (tour program, domestic flight tickets, all contacts in details). Free time for relax after a long flight. Overnight in Saigon.\nHotel check-in time is 14:00"},{"title":"CITY TOUR - CU CHI TUNNELS (B,L)","description":"Breakfast at hotel. We start this day tour by a visit to The Reunification Palace. This is one of the most important buildings in the city. Continue to Notre Dame Cathedral and The Post Office Center for the best examples of classical French colonial architecture in Saigon. War Remnants Museum, which formerly known as the Museum of American War Crimes.\nEnjoy lunch at local restaurant. Head to the Cu Chi tunnels - an underground tunnels network constructed by Vietnamese fighters during their struggle for independence. Arriving tunnels, a short introductory video showing how the tunnels were constructed will be given. We then spend time exploring the maze of tunnels including innumerable trap doors, storage facilities, weapons factories, field hospitals, command centers and kitchens. These tunnels consisted of many ‘moving parts’ making them a livable structure for long periods of time. We then drive back to Saigon and end the Cu Chi Tunnels tour at late afternoon. Free time in the evening for relaxing. Overnight in Saigon."},{"title":"MEKONG DELTA - COCONUT VILLAGE (B,L)","description":"Breakfast at hotel. A trip to Mekong Delta offers a glimpse into the unique and distinct agrarian life of the vibrant southern Delta region. We will enjoy a cruise along Mekong River to one of the Islands (located in the town of My Tho) where we will be entertained with traditional music while enjoying some tea sweetened with bee's honey and seasonal fresh fruites. We will then take a paddle-boat to cruise through the narrow canals of the Mekong. The paddle-boat ride provides an interesting look into local cottage industry of making coconut candies. Go around the island by rickshaw to see the life of local people before returning to Saigon. Overnight in Saigon."},{"title":"SAIGON - FLY TO DANANG - HOI AN ANCIENT TOWN WALKING TOUR (B,L)","description":"Breakfast at hotel. Check-out and transfer to airport for fly to Danang (Central of Vietnam). Upon arrival, meet and great service at the airport with our team. Take a short drive to the riverside town of Hoi An (30-miuntes). Upon arrival, enjoy lunch at local restaurant then you will set off on a walking tour to explore this World Heritage Site. Highlights include an ancient merchant house, the Phuc Kien Assembly Hall, the 400-year-old Japanese Covered Bridge, and the vibrant riverside market. Check-in hotel and relax. Free time in the evening. Overnight in Hoi An."},{"title":"HOI AN EXCLUSIVE TOUR - LANTERN MAKING - FOOD TESTING - SUNSET KAYAKING (B,L)","description":"Breakfast at hotel. Depart to the home of lantern craftsman. Here you will have a brief introduction into the history, shape and color of the lanterns, as well as the many stages of making them. Then you will learn how to practice hands-on through each stage of lantern making under the guidance of the enthusiastic craftsmen: from bending it into frame, cutting cloth, sticking and completing lanterns. You can make your own lantern and keep it as a souvenir. Enjoy lunch with Cao Lau, Banh Mi which are traditional cuisine in Hoi An. Relaxing at your hotel.\nSunset Kayak Tour will begin at 14:00. The tour starts up with pick up from your hotel to our kayak station in Cam Thanh. After a briefing on paddle safety and the area you will be kayaking, we’ll set off to paddle along the cocopalm forest and local villages and up to the Lantern Town. Connect with nature, immerse ourselves in life on the river and enjoy amazing landscapes as we paddle into the sunset. Trip ends after 3-hours. You’ll have time for refreshment at a local cafe near the town center before getting a transfer back to your hotel. Free time for relaxing. Overnight in Hoi An."},{"title":"TRA QUE HERB VILLAGE BIKING - COOKING CLASS (B,L)","description":"Breakfast at hotel and meet Footsteps's Team at hotel lobby. Depart to Tra Que Herb village by bicycle. Tra Que is a charming little village of Hoi An, the village is named after the sweet scented vegetables that spice up the everyday meals of the Pho Hoi people. En route, tourists have time to take photos of farmers, buffaloes, duck farms... Take a short stroll around the vegetable garden and listen to the history of the village. Then join gardening activities in preparing the land, fertilizing with seaweed, raking the ground, sowing, watering, picking vegetables... After spending time with the farmers, enjoy foot soak and foot massage before getting to preparing lunch with a local family. Join cooking with “Tam Huu” spring roll, “Banh xeo” - a local pancake. Bid farewell to your host family before back to your hotel. End the tour."},{"title":"HOI AN - DANANG - FLY TO HANOI (B)","description":"Breakfast at hotel. Free time for relaxing until transfer to airport for fly to Hanoi. Upon arrival Hanoi, meet and great services at the airport with Footsteps's Team. Drive to city center. Check-in hotel and relax. Overnight in Hanoi."},{"title":"HANOI CITY TOUR - A DAY IN HANOI - CYCLO EXPERIENCE (B,L)","description":"Breakfast at hotel. Considered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. Meet your tour guide. Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. Visit Ho Chi Minh’s complex (outside), the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam. Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. After lunch, process to visit Temples of Literature - constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university. Leave for a legendary Hoan Kiem lake and Ngoc Son Temple. Drive back to hotel and drop off. Free time for relaxing in the evening. Overnight in Hanoi."},{"title":"NINH BINH - WORLD HERITAGE SITE (B,L)","description":"Breakfast at hotel. Guide & driver will pick you up at your hotel, then leave by coach to Hoa Lu. Visit the historic capital of Vietnam and the famous ancient temples of Le and The Dinh Dynasties. Then our vehicle will transfer you from Hoa Lu to Tam Coc for lunch at noon. After lunch, take a boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone in Tam Coc. Drive back to Hanoi in the afternoon and drop off at your hotel. Free time for relaxing in the evening. Overnight in Hanoi."},{"title":"HANOI - HALONG - LEGENDARY BAY (B,L,D)","description":"After breakfast at hotel, check-out hotel. From Hanoi, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994 and 2006. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending- dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming, passing floating villages and approach islets to enjoy their beauty in close distance. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat.\nItinerary is subject to change without prior notice"},{"title":"HALONG - HANOI - BACK TO CAPITAL (B,L)","description":"In the morning, doing exercise morning on Sundeck, enjoy light breakfast with coffee, tea, seasonal fresh fruit and bread before keep going to visit Halong Bay, passing by many other rocks, Islets as well as fishing villages. Brunch (lunch) will be served on board before disembarking time. Return to Hanoi, arrive at your hotel in Hanoi in the late afternoon. Check-in hotel. Free time in the evening. Overnight in Hanoi."},{"title":"Hanoi Departure (B)","description":"Highlight: Airport transfer / Breakfast at hotel. Free time until transfer to airport for flight back home. Tour ends. Thank you and see you in the next trip. \nPick up time will be 03 hours before in advance for international flight "}]},{"name":"North Vietnam - 5 Days","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":448,"price":242,"summary":"Minimum of 2 people per booking.\nBooking at least 30 days in advance.\nDiscover North Vietnam’s cultural diversity and breathtaking scenery.","highlights":["Stroll through Vietnam’s first university dating back to the 10th-century","Tantalise your tastebuds with traditional Vietnamese cuisine","Cruise past limestone islands majestically rising out of emerald water"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/134546_f173ea6a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/134546_f173ea6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134546_8e365f36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134546_45692b7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134546_5be40bf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134546_8adee94f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134546_4acc0f41.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ha Noi - Arrival (-/-/-)","description":"Arrive at Noi Bai Airport. Pick-up and transfer to the hotel. Overnight in Ha Noi."},{"title":"Day 2: Ha Noi - Ha Long Bay (B/L/D)","description":"The shuttle bus will pick you up at your hotel and depart for Ha Long Bay. The cruise will pass exquisite scenery; limestone islands majestically rising out of emerald water, seductively scattered with grottoes and caves. Stay overnight on the Junk Cruise. "},{"title":"Day 3: Ha Long Bay - Ha Noi (B/L/-)","description":"After breakfast, swimming and sunbathing. After lunch, return to Ha Noi. Overnight in Ha Noi."},{"title":"Day 4: Ha Noi - City Tour (B/-/-)","description":"You visit the Temple of Literature (The first Imperial School in Vietnam), Hoan Kiem Lake, the Jade Mountain Temple, But Tower (Pen-Shaped Tower), Dai Nghien (Ink Stand), The Red – painted wooden and the Huc Bridge…Have a cyclo (pedicab) ride around Ha Noi ancient town. Overnight in Ha Noi."},{"title":"Day 5: Ha Noi – Departure (B/-/-)","description":"Transfer the airport.\nEND TOUR.\n"}]},{"name":"Xin Chao Vietnam - From Hanoi/ Hoi An To Ho Chi Minh City","duration":11,"travelStyle":["Adventure","Group","Fully Guided","Holiday"],"oldPrice":1538,"price":831,"summary":"This journey has been perfectly designed for those keen to experience Vietnam's diversity in just 11 days. You will dive into Vietnam's energetic cities,  several UNESCO World Heritage sites, including the world famous Hoi An old town and the ancient capital Hue, whilst savouring the breathtaking scenery of Halong Bay as well as the Mekong Delta. Explore the country's turbulent past, meet the friendly, resilient locals and get lost in spectacular panoramas on this tour of discovery. This tour is an absolute blast that can not forget during the years in your life. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137467_766b77.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137467_766b77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_14805b2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_5f03c85f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_b345f179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_1fe4e5de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_c6058923.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_fd2816f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_52f94a88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_ce149f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_5e88fd93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_dffced5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_aa15014f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137467_ec0ae4f5.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"DAY 2: EXPERIENCING VIETNAMESE LIFESTYLE IN COUNTRYSIDE (B/L)","description":"08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive your Mr Duoc’s house with a welcome drink.\n10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place that to enjoy beautiful scenery of the village. This Tea Plantation plays important role in providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea.\nMr Duoc is a veteran in Vietnam War and the owner of a large tea farm. He also is an expert in handling the raw tea leaves, he will introduce you how to make a good green tea before selling.\nYou will have great time listening to the host’s stories of his life in Vietnam war and enjoying the tea with green lentils or lotus seeds that made by his family.\n11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you will have great time to enjoy lunch with food you done.\n12:30: Have lunch with the host’s family and short break after lunch.\n( Meals: breakfast, lunch)"},{"title":"DAY 3: EXPLORE THE MAGNIFICIENT HALONG BAY (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise around 7:30 am. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise.\nNote: * In case of bad weather (the boat is not allowed to push off or not allowed to overnight in the sea), the Ha Long bay tour could be cancelled without notice. We will consider other replacement tour or refund based on the specific circumstances\n(Meals: breakfast, lunch, dinner)"},{"title":"DAY 4: WAKE UP WITH THE DRAGON IN THE BAY - FLY TO HOI AN ANCIENT TOWN (B/L)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Then, taking the flight to Hoi An. Check in your hotel and have free time to get your energy back. \nNote: * In case of bad weather (the boat is not allowed to push off or not allowed to overnight in the sea), the Ha Long bay tour could be cancelled without notice. We will consider other replacement tour or refund based on the specific circumstances\n(Meals: breakfast, lunch)"},{"title":"DAY 5: RIDING BASKET BOAT AND FISHING LIKE A LOCAL (B)","description":"Start of the tour - 8:00 - 8:30, finish 12:00-12:30\nWould you like to go fishing with the local fisherman? Why don't you have a fun experience with the funny basket boat. You shouldn't have any hesitance because the day will put a broaden smile in your face. It is very interesting to fish here on the river with the local fisherman as you catch your fish and we cook for you. \nOn the Fishermen & the Waterways of a Past War Tour you will enjoy a wide range of experiences - from learning traditional fishing techniques to paddling the strange and unique Vietnamese bamboo basket boats while exploring the now tranquil coconut-palm flanked waterways of a past war. On this tour we provide an authentic social and cultural insight into the local Vietnamese way of life. As well you will take part in some hands-on activities that are fun, safe and interesting to people all of ages.\n(Meals: breakfast, lunch)"},{"title":"DAY 6: IMMERSE IN THE CAPTIVATING OF LANTERN TOWN (B)","description":"Enjoy the free time and have relaxing time in Hoi An\n(Meals: breakfast)"},{"title":"DAY 7: STEP BACK IN TIME AT THE IMPERIAL CITY OF HUE (B) BY BUS","description":"Having breakfast, you will have free time to explore the town on your own. Ready for pick up for transfer to Hue. \nAfter arriving at Hue, checks in hotel. Next, you are free to visit around the city. For example, you can go sightseeing to the Thuan An Beach, Lang Co Beach, Garden House….or take some photos. Spend overnight in Hue.\n(Meals: breakfast)"},{"title":"DAY 8: TRAVEL TO THE PEARL OF THE ORIENT (B)","description":"Have breakfast at the hotel, then have a free leisure time until there will be a private cab transfer you to the airport for your next flight to Ho Chi Minh.\n(Meals: breakfast)"},{"title":"DAY 9: DISCOVER THE MYSTERIOUS CU CHI TUNNELS (B)","description":"Have breakfast and check-out from the hotel. Depart for Cu Chi tunnel at 8:00 - 08:30 am, the trip will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time exploring the remaining area and tunnel systems which includes the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special native Cu Chi tapioka will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon at 13:00 - 13:30. Trip ends.\n(Meals: breakfast)"},{"title":"DAY 10: EXCRUSION ON THE MIGHTY MEKONG DELTA (B/L)","description":"(start 7.20 am  – return around 17.30)\n7:20 am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Then boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nThen you will take a hand-rowed sampan through Thoi Son canal and treat yourself with the beauty of the countryside, visit the family workshops and honey-bee farm, enjoy honey tea and coconut candies there. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoying cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh\n(Meals: breakfast, lunch)"},{"title":"DAY 11: BIGGEST FAREWELL AND WARMEST THANK YOU - HO CHI MINH DEPARTURE","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"Vietnam Historic & Phu Quoc Island","duration":14,"travelStyle":["In-depth Cultural","Family","Group","Partially Guided","Historical","Holiday"],"oldPrice":0,"price":1280,"summary":"Vietnam is a treasure trove waiting to be discovered, so scratch your travel itch with our the best Vietnam holiday destinations in 14 days, allowing you to not only see but ‘live’ the place! Start the country’s very heart and soul – Hanoi – formerly known as Thang Long or Ascending Dragon, with imprints of the bygone eras vividly etched on its every corner. Embrace the revitalizing display of natural beauty and cruise the signature emerald waters of Ha Long Bay – or the Bay of Descending Dragons, peppered with bizarre rock formations!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146173_0fe3f196.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146173_0fe3f196.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_8be8e4bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_5f14867e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_c6791ae2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_836f652a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_ba50d147.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_250f4f77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_0db77ba5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_06dd8b80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_e47a673a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_40db1c71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_5eaf16dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_c97eb083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_70b7911d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_c56b074d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_0c03bf70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_6a91b2ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_d09cf200.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_9a86cba7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_f672a63a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_d49d1e32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_ceb64868.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_177a8586.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146173_14a175d3.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Arrive in Hanoi","description":"Meal: NA – Accommodation: Hotel in Hanoi.\nYour guide will greet you at the airport beside the baggage-claim area and then take you to the pre-booked hotel. The rest of the day is left for your own arrangement."},{"title":"Hanoi","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Hanoi.\nStart your tour today by a visit to Ho Chi Minh Mausoleum in the centre of Ba Dinh Square, where the embalmed body of Vietminh leader Ho Chi Minh is stored, followed by the Presidential Palace and Ho Chi Minh’s stilt house at the Palace’s back garden. Then, you will visit One Pillar Pagoda – symbol of Hanoi and the Temple of Literature – the first university in Vietnam. Keep touring around the West Lake that is bordered with many significant places such as Tran Quoc Pagoda and Quan Thanh Temple before lunch. Then a comfortable rickshaw ride tour around the ancient Old Quarter is included, and you will pass by the Hoan Kiem Lake along the way. At the end of the day, enjoy a Water Puppet Show, the proudest and most intricate traditional folk art of the country."},{"title":"Day 3 Hanoi – Halong Bay","description":"Meal: Breakfast, Lunch, Dinner – Accommodation: On Cruise\nAfter breakfast you will head out for a 3-4 hour ride to the pier and begin your amazing Halong Bay cruise around noon. Sail around the UNESCO world heritage site and marvel at the grotesque limestone Karsts featuring in the islands of Halong Bay, such as Dinh Huong and Ga Choi etc. You have chance to have swimming in the beautiful bay, or kayaking in the picturesque area. Back to the boat and relax while sailing to peaceful area for overnight."},{"title":"Halong Bay – Hanoi – Danang – Hoi An","description":"Meal: Breakfast, Lunch ( or Bruncch)– Accommodation: Hotel in Hoi An\nToday, you will continue sailing around Halong Bay. In the morning, a Tai Chi lesson is arranged on the deck, or you could just sock in the beautiful view of limestone islands, charming beaches and amazing grottos. The cruise will pass by the Bai Tu Long Bay later. Enjoy your nice brunch when admiring the attractive scenery. Afterwards, your tour guide would wait for you at the dock and transfer you to the airport for your flight to Danang. On arrival, our car and guide will pick up at the airport and transfer to hotel in Hoi An."},{"title":"Hoi An","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Hoi An\nToday’s exploration starts with the mysterious My Son Sanctuary, a group of ruined Hindu temples dating back to the Champa Kingdom, also known as “Angkor Wat in Vietnam”. Later in the afternoon, you will have a tour around the ancient town and visit some well-preserved historical sites, like Japanese Bridge, Chinese Temple and the former Vietnamese merchants’ houses."},{"title":"Hoi An Free","description":"Meal: Breakfast– Accommodation: Hotel in Hoi An\nToday you are free for relax on the beach, strolling in the town or whatever make you fancy."},{"title":"Hoi An-Hue","description":"Meal: Breakfast– Accommodation: Hotel in Hue\nThis morning, you will be transferred to Hue, another prominent historical city in Vietnam, via the Han Van Pass. Along the way, the Marble Mountain, famous for delicate stone sculptures and crafts, will be visited. You will arrive in Hue in the afternoon. After checking in, the rest of the day is on your own."},{"title":"Hue-Ho Chi Minh City","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Ho Chi Minh City\nToday you will visit Minh Mang Tomb about 12km from Hue city center, with unique architecture. Then, a Royal Dragon Boat will take you to the seven-storey Thien Mu Pagoda while sailing along the Perfume River. Hue was capital of Vietnam in 19th Century with long history, so move on your journey to one of Vietnam’s seven UNESCO World Heritage Sites, Imperial Citadel and the Forbidden City, to find a hidden charm of Vietnam. In the convenient time, you can do some shopping in the biggest local market in Hue before the guide transfers you to the airport for your flight to Ho Chi Minh City. Upon arrival, you will be picked up and taken to the pre-booked hotel."},{"title":"Ho Chi Minh City","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Ho Chi Minh City\nToday’s highlight will definitely be a tour around the famed Ho Chi Minh City landmarks. First, you will stop at the Notre Dame Cathedral, widely known as Red Church, then followed by a visit to the Old Post Office. Afterwards, you can appreciate some Vietnam War exhibits in the War Remnants Museum, and drop by the Independence Palace symbolizing the reunification of Vietnam. After Lunch, continue your journey to the China Town and the Ben Thanh Market, where a wide variety of Vietnamese food and souvenirs can be found."},{"title":"Ho Chi Minh city- Cai Be Floating Market (Mekong Delta)","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Ho Chi Minh City\nToday you will embark on a tour around the mighty Mekong River Delta. In the early morning, the guide will take you to a charming riverside town, Cai Be. Along the way, stop at a candy factory to observe the candy-making process, and enjoy traditional music in an orchard garden. After a nice lunch at a riverside restaurant, you will take a motor boat to visit some fluvial islands and also have an opportunity to explore the peaceful countryside by bicycle. Later in the day, the driver will wait at Vinh Long Pier and transfer you to Saigon. Relax and Overnight in the hotel."},{"title":"Saigon – Flight to Phu Quoc Island","description":"Meals: Breakfast – Accommodation: Phu Quoc hotel (4 star)\nYou are free in the morning until the time check out and transfer to the airport for your flight to Phu Quoc. Free in Phu Quoc."},{"title":"Phu Quoc Free","description":"Meals: Breakfast – Accommodation: Phu Quoc hotel (4 star)\nYou are free for these day to discover the beautiful island, relax, snorkeling, diving or whatever make you fancy."},{"title":"Phu Quoc Free","description":"Meals: Breakfast – Accommodation: Phu Quoc hotel (4 star)\nYou are free for these day to discover the beautiful island, relax, snorkeling, diving or whatever make you fancy."},{"title":"Depart from Ho Chi Minh City","description":"Meals: NA – Accommodation: N/A\nFlight back to Ho Chi Minh City for your departure flight."}]},{"name":"Hanoi - Sapa - Halong Bay & Bakhan Village 8 Days","duration":8,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":581,"summary":"\n  The best quality and unbeaten price for 8 Days Trip\n  100% Guaranteed Departure\n  NO hidden Cost, NO Optionals\n  Start in Hanoi and finish in Hanoi\n  Visit Hanoi, stay in Boutique hotel inside the Old Quarter\n  Discover Sapa with overnight train experiences\n  Stay overnight on Boat in Halong Bay - World Heritage Site\n  Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n\nThis tour is a guaranteed departure, so even if you are the only one booked onto this tour, you will still be guaranteed to depart!","highlights":["Indulge in a delightful picnic amongst luscious countryside","Delve into culture and meet the locals of Ta Van village","Wander through the mystical wonder of Sung Sot cave"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95664_fb66970e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95664_fb66970e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_74040bf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_40bdbe35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_7c07ab3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_1de49310.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_3aedbd19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_1478cb99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_e30eb73a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_6270fdc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_90502f46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_8d87f34b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_5bf9d02b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_bbb40d79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_6472aa63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_c837d9f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_90d565dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_6e1635b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_da4bc1d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_7cc3237d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_c57e4a4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_5540032f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_143e789b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95664_3e68cde9.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Lao Cai","Cat Cat Village","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Free for leisure in Hanoi until 7:00pm (mini hotel available from 14.00 to 20.00 (optional, 30 US$/Room/2 people). Take night train from Hanoi to Sapa. Stay overnight on the train based on 4-berth sharing cabin with A/C.\nOptional tour for morning flight arrival US$50/person:\nTake a short tour to visit Hanoi city landmarks including: Hochiminh Mausoleum, One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong; stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. Also take the outside visit to the Opera House, St. Joseph Cathedral and make sure your camera is handy.\nOvernight on the Train, 4 Berth Cabin, Soft Sleeper\nOrient Train or similar"},{"title":"Day 2: Sapa arrival - trekking to Villages (B, L)","description":"Arrive Lao Cai Railway Station at 6:00am. Pick up to Sapa town. The hotel check-in will be subject to availability. Refresh at Coffee Bar and breakfast are included for your group before taking the trek to hill-tribe villages.\nAbout 10:00am, start your amazing trekking to Lao Chai village to visit the Black H’mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the friendliest one in the mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back to Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town.\nBamboo Sapa Hotel 3* or similar"},{"title":"Day 3: Lao Cai- Bac Ha Sunday Market - Night train back Hanoi (B, L)","description":"Attention: Bac Ha market is available on Sunday only, the replacement will be Can Cau (Sat)/Lung Khau Nhin (Thus)/ Coc Ly (Tue) or others ethnic markets.\nAfter breakfast at hotel, you leave Sapa for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most wonderful and colourful markets in extreme North Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, horses… are all on sales. This is a golden opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H’mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Stay overnight on the train based on 4-berth sharing cabin with A/C.\nOrient Train, 4 Berths Cabin or similar"},{"title":"Day 4: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Arrive in Hanoi Railway Station at approx. 5:30am. Pick up & transfer to the mini hotel nearby station for short rest & breakfast until 8:00am. You will be picked up at hotel for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see.\nWe’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasantly air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on a cabin on a boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 5: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served. Cruise check-out time is around 10:30am. Disembark and rejoin our bus for driving back to Hanoi city. There will be one rest stop on the way for restroom and short shopping for handicraft souvenirs and local handmade products. Arrive Hanoi about 4:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. The Pub Street is opened until 12:00pm along Ta Hien, Dao Duy Tu, Hang Buom, Ma May ets streets. You will be filled of fun with local beers and street foods. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 7: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 8: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group! Have a safe journey home or to next destination. Goodbye and see you again in Vietnam and Southeast Asia."}]},{"name":"South and Central Vietnam Golf","duration":9,"travelStyle":["Adventure","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":1450,"summary":"Our 9 day South and Central Vietnam Golf Tour features the best golf courses of 3 cities. You will start your golf holiday in Ho Chi Minh (Saigon city) – the bustling metropolis and enjoy 3 rounds of golf at different courses in Saigon and Vung Tau. Head for Central Coast of Vietnam with 3 nice golf courses. You also explore more about Vietnam Nature and Culture.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146549_bf511d6b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146549_bf511d6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_41711326.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_9fa087e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_83586d0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_d49eb794.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_ec926788.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_897ab736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146549_e484d4c5.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi"],"timeline":[{"title":"Day 1 ( Mon): Saigon Arrival.","description":"Meal: NA- Accommodation: Hotel in Saigon\nWelcome to the biggest city in Vietnam – Ho Chi Minh City ( Saigon). On arrival, our car and guide will pick up and transfer you to your hotel in city central. Enjoy the rest of the day at your leisure."},{"title":"Day 2 (Tue): Ho Chi Minh Golf Tours at Vietnam Golf & Country Club","description":"Meal: Breakfast- Accommodation: Hotel in Saigon\nSet amongst 300 hectares of land, two great golf courses have been carved out of the existing woodland with minimal land movement, leaving you to feel that the land was always destined to be a golf course, so natural is the layout and design.\nAfter having breakfast at the hotel, we drive to Vietnam Golf and Country Club for golfing. Vietnam Golf & Country Club is the first International 36-holes golf club in Vietnam and is widely regarded as Vietnam’s Premier Golf and Country Club. Play a round of 18 holes and we drive you back to Saigon. Stay overnight in Ho Chi Minh."},{"title":"Day 3 (Wed): Long Thanh Golf – Vung Tau","description":"Meal: Breakfast- Accommodation: Hotel in Vung Tau\nThe Long Thanh Golf Club offers 36 holes of golf in the former rice paddies and scenic countryside surrounding Saigon. The Ho Chi Minh City golf course is located 30 kilometers north of the city on a hill with unobstructed views back towards the Vietnamese capital.\nBoth the Hill and Lake course are well maintained throughout the year and the golf courses are a longtime favorite among locals. Many expatriates and Vietnam golf visitors prefer Long Thanh Golf Club over its more famous neighbor Vietnam Golf & Country Club.\nBreakfast at hotel and driver will take you to Long Thanh Golf Resort. The course was built in 2001, this beautiful golf course is set on a hill in the scenic\ncountryside and is just one hour away from Ho Chi Minh City with an amazing view of the city itself from the links. The golf course itself is spread across 7,011 yards with 36 holes that each have their own character and shape. With such a wide variety of holes, this course will satisfy both serious amateur and professional golfers. Tee off at either Lake or Mountain Course. After the game, we will drive you to Vung Tau (1 hour). Check-in hotel and enjoy your leisure time at the hotel or make your own exploration of the city’s nightlife. Overnight at hotel in Vung Tau/HoTram."},{"title":"Day 4 (Thus) The Bluffs Ho Tram Golf Course","description":"Meal: Breakfast- Accommodation: Hotel in Vung Tau\nThe Greg Norman designed Bluffs Ho Tram Strip golf course is located 80 kilometers southeast of Ho Chi Minh City in Ba Ria-Vung Tau Province on the southern Vietnamese coastline. It takes around 2 hours to reach by a mix of highway and local roads from Ho Chi Minh City. The Bluffs Ho Tram is a unique links-style par-71 golf course on a rugged site often accompanied by strong onshore breezes.\nBreakfast at hotel and you will be brought to The Bluffs Ho Tram Strip Golf Course – The Bluffs Ho Tram Strip was designed by Greg Norman to capture the true essence of links-style golf. Set on the coastline — as almost all great links courses are — The Bluffs is routed over and around towering sand dunes, which have been shaped over thousands of years by the elements. Enjoy the ultimate experience of playing true links golf among the dunes of southern Vietnam and having dramatic ocean views."},{"title":"Day 5 (Fri) Vung Tau – Danang via Saigon","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An.\nMorning transfer back to Ho Chi Minh City by vehicle or by hydrofoil. Direct private transfer from the jetty to Tan Son Nhat Intl airport to catch one hour flight to Danang. Meet a local tour guide and drive to hotel for check-in. Rest of time will be at your own leisure. Tonight you will stay overnight in Hoi An."},{"title":"Day 6 (Sat) BRG Da Nang Golf Resort","description":"Meal: Breakfast- Accommodation: Hotel in  Hoi An\nBRG Da Nang Golf Resort (Danang Golf Club) opened in 2010 and immediately leaped to fame being recognized as one of the 15 best new courses in the world by USA GOLF magazine. Da Nang Golf Resort has been awarded a number of awards, amongst them 2011, 2012, 2013 best golf course in Asia by the readers of Asian Golf Monthly as well as the 2012 Best Golf Course in Vietnam by USA Golf Digest and the 2014 IAGTO Diamond Award.\nBreakfast at the hotel and this morning are spent with a round of golf at the Dunes Course which designed by Australian golf legend and former world No. 1 Greg Norman. Danang Golf Club offers breathtaking views of the Marble Mountains, East Sea, and Cham Islands. After a round of incredible golf game, you will be transferred back to your hotel and rest of time will be at leisure. Free to enjoy the Peaceful Hoi An Town."},{"title":"Day 7(Sun) Montgo Merrie Links Vietnam","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An\nThe Montgomerie Links, located just off historical Danang Beach and minutes from the Danang City, is a stunning 7090 yard, par-72 golf course. The course has been rated as one of Asia’s ten most elite courses by the 2012 Forbes Travel Guide as well as most recently has been voted as “Vietnam’s Best Championship Course 2013” by the Vietnam Golf Magazine.\nA morning round of golf is spent at the Montgomerie Links – Rated as one of “Asia’s 10 Most Elite Golf Courses” by Forbes in 2012. The course routing is an exciting mixture of heathland and links-style holes which cater to players of all abilities. Overnight at the hotel in Hoi An."},{"title":"Day 8 (Mon) Laguna Lang Co Golf Resort","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An\nLaguna Lang Co Golf Club in central Vietnam near Lang Co Bay and a 3-kilometer beach in the Chan May region of Central Vietnam, an area renowned for its pristine coastline, natural scenery and proximity to UNESCO World Heritage sites. The site is located between the ancient city of Hue 30 kilometers to the North and Danang 35 kilometers to the South.\nBreakfast at the hotel and then we will drive you to Laguna Lang Co Golf Resort which is located between Hue and Danang City (1 hour and 20 minutes by car) The 18-hole, par-71 championship course designed by Sir Nick Faldo. The Lang Co Golf Club delivers a golfing experience that can be enjoyed by the most experienced players and beginners alike"},{"title":"Day 9 (Tue): Hanoi Departure","description":"Meal: Breakfast- Accommodation:  NA.\nFree at leisure until transferring to the airport for departure flight. End of service."}]},{"name":"Vietnam Hike, Bike & Kayak","duration":10,"travelStyle":["Multi-sport","Group","Fully Guided","Discovery","Holiday"],"oldPrice":1649,"price":1402,"summary":"Perfect for the active adventurer, this trip will have you hiking, biking, and paddling through the best of Vietnam. Kayak through Halong Bay’s towering limestone karsts, trek the Mai Chau area, and cycle through small towns for an authentic taste of Vietnam. When you’re not pedalling or paddling, you'll visit the country's cultural highlights like the Cu Chi Tunnels and Emperor's Tomb, or overnight at a local family’s homestay. Whether by bike or on foot, this tour will keep you grounded in Vietnam's intriguing culture.","highlights":["Hike, bike and paddle through Vietnam","Crawl through the old Vietcong tunnels in Cu Chi","Try your hand at making your own noodles in Hoi An","Kayak through Halong Bay’s towering limestone karsts"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/10457_d939def7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/10457_d939def7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_c526cde9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_1a06e377.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_7d8b44ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_b0ad8310.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_501c2bf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/10457_095100c2.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Mai Chau","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"There are no activities planned until an evening welcome meeting.\n\nAccommodation:\n- White Lion Hotel (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n\nAdditional Notes: Please note: most nationalities require a visa to enter Vietnam. Please double check requirements with your travel agent or local Vietnamese Embassy.\n\n"},{"title":"Day 2: Ho Chi Minh City/Hoi An (1B)","description":"Cycle to the Cu Chi Tunnels for a guided tour. Travel through the countryside and stop at local points of interest along the way. In the afternoon, fly to Hoi An via Danang.\n\nAccommodation:\n- Pho Hoi Riverside Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle: Da Nang to Hoi An 00:45 Hr(s)\n- Plane 01:00 Hr(s)\n\nIncluded Activities:\n- Củ Chi Cycling \n- Cu Chi Tunnels Guided Tour\n\n\n"},{"title":"Day 3: Hoi An (1B, 1L)","description":"Explore the villages around Hoi An by bike before enjoying a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project. Opt to relax on the beach, or visit the tailors in town.\n\nAccommodation:\n- Pho Hoi Riverside Resort (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Hoi An Cycling Excursion\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 4: Hoi An/Huế (1B)","description":"Drive the Hai Van Pass to the ancient capital of Hue.\n\nAccommodation:\n- Asia Hotel Hue (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 5: Huế/Hanoi (1B)","description":"Set out on bicycles to discover Hue, visiting the former Citadel and Tu Duc's tomb. After spending the day cycling, head back to town before taking an overnight train to Hanoi.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 14:00 - 15:00 Hr(s)\n\nIncluded Activities:\n- Hue Cycling Tour\n\n\n"},{"title":"Day 6: Hanoi/Mai Châu (1B, 1L, 1D)","description":"Upon arrival in Hanoi, drive out into the nearby hills. Reach Mai Chau in the late morning and then take a hike around the area to visit some of the Thai minority people who call this valley home. Enjoy a home-cooked meal and sleep in a dormitory-style long house in traditional style.\n\nAccommodation:\n- Mai Chau Homestay (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Private Vehicle: Hanoi to Mai Châu 03:00 - 04:00 Hr(s)\n\nIncluded Activities:\n- Mai Chau Hike\n- Mai Chau Homestay\n\n\n"},{"title":"Day 7: Mai Châu/Hanoi (1B)","description":"In the morning, transfer back to Hanoi. In the afternoon, cross the river and take a ride around the quieter suburbs surrounding Hanoi. Return to town to spend the evening exploring the Old Quarter. Opt to attend a famous water puppets' performance and sample some of Hanoi's amazing eating venues.\n\nInterested in local cuisine? Opt to pre-book the \"Hanoi Foodie Culture Tour\" activity on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- Minerva Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle: Mai Châu to Hanoi 03:00 - 04:00 Hr(s)\n\nIncluded Activities:\n- Hanoi Cycling Tour\n- Old Quarter Orientation Walk\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 8: Hanoi/Ha Long (1B, 1L, 1D)","description":"Thousands of islands rise dramatically from the waters of Halong Bay and, to further their beauty, intricate cave systems naturally exist throughout these limestone karst formations. Our sailing junk will visit some of the islands and caves. Enjoy an evening drink on the deck beneath the stars.\n\nThe evening's accommodation is a special experience – sleeping on a boat surrounded by high limestone karsts.\n\nAccommodation:\n- Halong Private Boat (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Private Vehicle: Hanoi to Ha Long 04:00 Hr(s)\n\nIncluded Activities:\n- Halong Bay Overnight Cruise\n- Halong Bay Kayak Excursion\n\n\n"},{"title":"Day 9: Ha Long/Hanoi (1B, 1L)","description":"In the morning, enjoy one last view of the magnificent limestone islands.\n\nHead back to dry land to embark on a private bus to Hanoi. In the afternoon, delve deeper into the site of Hanoi and opt to explore the exterior of the Ho Chi Minh Mausoleum and Hoa Lo Prison (Hanoi Hilton).\n\nAccommodation:\n- Minerva Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Shared Van 04:00 Hr(s)\n\n\n"},{"title":"Day 10: Hanoi (1B)","description":"Depart at any time.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]},{"name":"South & North Vietnam - 6 Days","duration":6,"travelStyle":["Discovery","Family","Custom","Group","Fully Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":699,"summary":"The best quality and unbeaten price for 06 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional\nStart in Ho Chi Minh City and finish in Hanoi\nChillout and shopping in Ho Chi Minh City - the biggest City in Vietnam\nCruise on Mekong River and visit Floating Markets\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nTaste wonderful Vietnamese local cuisines along the trip\nAnd more...\n","highlights":["Step back to times of war as you crawl through the Cu Chi Tunnels","Be entertained by the amazing Water Puppet Show in Hanoi","Discover enchanting caves on an overnight cruise of Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a155bf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a155bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_a857bf96.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_903427f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_f2f34eb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_0bebce13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_8ed92644.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_a62cad60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_ee26a90b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_458a6f24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_7657f158.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_1a5ec4c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a20f32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a25cd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a2a95d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d69a2fa66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6bad81fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6bae517c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6baec9f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6baf2830.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6bb0c54e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6bb13483.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6dfad6b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6dfb8edd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76085_5e02d6dfbe090.jpg"],"destinations":["Ho Chi Minh City","Vinh Long","Hanoi","Halong Bay"],"timeline":[{"title":"Arrival Ho Chi Minh City, Vietnam","description":"Today you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by Tour Guide & Car Driver at airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Mekong Delta - Cai Be floating market full day (B/L)","description":"Having breakfast at hotel until 7:30 am. Depart for Cai Be, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music. Take a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Check in hotel & overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City Tour - Cu Chi Tunnels - fly to Hanoi (B/L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. After Cu Chi Tunnels you will take flight to Hanoi by Vietnam Airlines. Arrive Hanoi in the evening. Transfer to hotel for check in. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay Cruise stay overnight on Board (B/L/D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise – Hanoi. (B/L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Take part in Water Puppet Show an hour. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group. Good bye & see you again!"}]}]