[{"name":"3 DAYS IMMERSE IN NATURAL THUNG NHAM BIRD PARK, TRANG AN AND CUC PHUONG NATIONAL PARK","duration":3,"travelStyle":["Wildlife & Nature Photography","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":399,"summary":"Ninh Binh, a magical place in northern Vietnam or “Ha Long Bay on land”, is a stunning landscape with charming river surrounded by limestone cliffs and vivid rice field. Let us take you to this not-to-be-missed gem in a 3 day trip through Ninh Binh Bird Park, Trang An, Cuc Phuong National Park and the Endangered Primate Rescue Center. We call this an indulgence for any nature lover.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170383_a6cde976.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170383_a6cde976.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170383_e1823a17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170383_0918f6e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170383_4b5604df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170383_b1a501b4.jpg"],"destinations":["Hanoi","Ninh Binh"],"timeline":[{"title":"DAY 1: HA NOI – THUNG NHAM BIRD PARK – TRANG AN","description":"Your tour starts early when you are picked up at the hotel and transferred to Trang An. Arrival at Thung Nham Bird Park, your tour starts: \n•\tVai Gioi Cavern located on a high mountain (the local name “Vai Gioi” means “Bowing to God”. You have to climb 439 stone steps to reach the cavern whose inner width is about 5000m2 with 3 dynamic floors containing beautiful shimmering stalactites.\n•\tYour next stop is “But Cave” (or “Buddah Cave or Fairy Cave”). The single waterway into the cave carries you into the pristine cave. Through the ray of light from flashlights, you can see shapes and appearance formed by stalactites.\n•\tAfter exploring the cave, you enjoy a boat ride to Bird's Garden to visit the natural habitat of nearly 40 species of birds\n•\tAfter lunch at a local restaurant, we take you to Trang An Eco tourism complex by a relaxing boat ride in a scenic landscape recognized by UNESCO as world heritage by its combination of cultural and natural value. Let yourself immerse in the beauty of the landscape and enjoy the natural scenery.\nYou are transferred to the hotel for check in after the tour. Have dinner at the hotel and free to explore Trang An in the evening."},{"title":"DAY 2: TRANG AN – CUC PHUONG NATIONAL PARK","description":"This day, you will explore Cuc Phuong National Park – the first national park of Vietnam.\nYou are picked up from the hotel and transferred to the national park, an area of 25,000 hectares of tropical forests with fresh and cool climate and rich flora, your exploit starts.\n•\tYour first stop is “Nguoi Xua Cave” (meaning “Cave of Prehistoric Man”) where you find the relics of residency of Vietnamese prehistoric people from 7,500 years ago buried in the depth of the pristine forest.\n•\tVisit the parashorea stellata tree more than thousand years old with 45m in height and, 5m in diameter. This special wonder of Mother Nature needs at least 20 adults with their arm length to fully embrace its trunk.\nYou will have lunch at a local restaurant before heading to Cuc Phuong Resort for check in.  \nIn the afternoon, you are free to walk and enjoy the scenery or relax at the hotel. Dinner is served at the restaurant"},{"title":"DAY 3: CUC PHUONG NATIONAL PARK – HA NOI","description":"Enjoy you breakfast at resort. This morning, you are to visit the Endangered Primate Rescue Center of Cuc Phuong National Park, a not for profit project first established in 1993 dedicated to the rescue, rehabilitation, breeding, research and conservation of Vietnams endangered and critically endangered primate species. Today the center is home to around 180 primates representing 15 species who are nurtured by 31 staff both from the local community and abroad. \nAfter visiting the center, you have lunch at a local restaurant and then transferred to Hanoi\nYour tour comes to an end when you arrive your hotel in Hanoi."}]},{"name":"TailorMade Vietnam: North to South Explorer","duration":9,"travelStyle":["Custom","Adventure","Private","Fully Guided","Holiday"],"oldPrice":0,"price":1459,"summary":"Sail through limestone karsts aboard a traditional junk boat and walk the streets of imperial capitals. From vibrant Hanoi, the natural beauty of Halong Bay, the atmospheric imperial capital of Hue, and the charms of Hoi An to the modern day life of Saigon, experience the energy of Vietnam in 10 jam-packed days.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150671_f49092ba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150671_f49092ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150671_1350385b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150671_4c060a39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150671_dabd36dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150671_10f83be4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150671_0e7102d9.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrive at any time. Your arrival transfer is included.\n\nAccommodation:\n- May De Ville Old Quarter Hotel (or similar).\n\nTransport:\n- Airport Transfer 01:00 - 01:00 Hr(s)\n\n\n"},{"title":"Day 2: Hanoi/Ha Long (1B, 1L, 1D)","description":"Drive to Bai Chay harbour, the jumping off point for Ha Long Bay where thousands of islands with intricate cave systems rise dramatically from the water. Sail past limestone karst mountains in a traditional junk boat and stop to visit some of the islands and caves. Transfer from boat to kayak for a guided water tour, giving you the chance to get even closer to the stunning natural surroundings. In the evening, devour a seafood dinner, then opt to enjoy a drink on deck under the stars.\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Shared Van 03:00 Hr(s)\n\nIncluded Activities:\n- Ha Long Bay Overnight Cruise Package - 1 night\n\n\n"},{"title":"Day 3: Ha Long/Hanoi (1B, 1L)","description":"Enjoy breakfast on board before a morning sail back to the port. Drive back to Hanoi and enjoy some free time in the city to explore.\n\nAccommodation:\n- May De Ville Old Quarter Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Shared Van 04:00 Hr(s)\n\n\n"},{"title":"Day 4: Hanoi/Huế (1B)","description":"Catch an early flight to Hue, once the imperial capital of Vietnam. Start the day with a guided tour of the Imperial Citadel, a visit to the tomb of one of Vietnam’s former emperors, and check out Tien Mu Pagoda.\n\nWhile in the city, try some local Hue specialties such as banh khoai (Hue savoury pancakes), and banh bot loc boc tom thit (thin rice paper filled with meat and shrimp). Wash it all down with a Hue beer.\n\nAccommodation:\n- Asia Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Airport Transfer 00:30 - 00:30 Hr(s)\n- Plane 01:15 - 01:15 Hr(s)\n\nIncluded Activities:\n- Huế Royal Tombs, Tien Mu Pagoda and Imperial Citadel Tour\n\n\n"},{"title":"Day 5: Huế/Hoi An (1B)","description":"Cross the Hai Van Pass (weather permitting), with fantastic views in all directions, before arriving to Hoi An in the afternoon. Upon arrival, take a guided city tour and get acquainted with this city's many options. There's plenty of time to explore all this charming town has to offer; opt for a cooking class, riverboat trip, bike ride, beach time, tailor visit, or My Son ruins.\n\nAccommodation:\n- Vinh Hung 2 City Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 - 04:00 Hr(s)\n\nIncluded Activities:\n- Hoi An Guided City Walking Tour\n\n\n"},{"title":"Day 6: Hoi An (1B, 1L)","description":"Dive into the Vietnamese culture and enjoy a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project. Enjoy free time in the afternoon. You could rent a bike or visit a tailor, the choice is all yours.\n\nAccommodation:\n- Vinh Hung 2 City Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Meal and Demonstration\n\n\n"},{"title":"Day 7: Hoi An/Ho Chi Minh City (1B)","description":"Drive to Da Nang for the flight to Ho Chi Minh City, once the capital of South Vietnam and the country’s commercial centre. Start exploring the small alleys and busy streets, keeping an eye out for lacquerware shops and delicious local food stalls.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Airport Transfer 01:00 - 01:00 Hr(s)\n- Plane 01:00 - 01:00 Hr(s)\n\n\n"},{"title":"Day 8: Ho Chi Minh City (1B)","description":"Enjoy a guided tour of the Cu Chi Tunnels and learn more about the Vietnam War. Use free time in the afternoon to explore sprawling Ho Chi Minh City. Opt to visit the Thien Hau and Giac Vien pagodas and stroll through the immense Ben Thanh Market. Also well worth a visit are the Reunification Palace (the residence of South Vietnam presidents before 1975), the city's Chinese quarter of Cholon, and the War Remnants Museum.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cu Chi Tunnels Guided Tour\n\n\n"},{"title":"Day 9: Ho Chi Minh City (1B)","description":"Depart at any time.\n\nMeals Included:\n- Breakfast\n\n\n"}]},{"name":"Vietnam Discovery 22 days & 21 nights","duration":22,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1290,"summary":"Start in Ho Chi Minh and end in Ho Chi Minh City, too! With Vietnam Discovery tour, you have a 23 day tour package taking you from the Northern  of Viet Nam Hanoi, Sapa, Ha Long Bay; and then fly to the Central of Vietnam Hue, Hoi An, Da Nang; enjoy beaches of Viet Nam Nha Trang, Mui Ne; discovery Da Lat highland city with cool weather; to the Southern of Viet Nam Ho Chi Minh City, Mekong Delta River . Vietnam Discovery 23 days includes ground transportation, accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/172551_fde1d018.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/172551_fde1d018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_ef049fc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_6014fbb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_ca3312f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_bcfeab39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_cdc44a2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_4f24bd40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_977cc7ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_d6c7285d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_ed264e29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_a890ac73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_4fe9d0fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_7b794f11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_794656ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_941e7088.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_82de2c68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_ac8fc415.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_1ce44153.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_ae74fa3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_3e0add67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_5ede7b01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_419dc07e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_d858398a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172551_872f9e49.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An","Dalat","Mui Ne","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Ha Noi Arrive (No meal)","description":"Hanoi welcome: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited. You will be warmly welcomed by our tour guide at the airport and transferred to your hotel in the city center of Hanoi. \nFree time and easy\nOvernight in Ha Noi"},{"title":"Day 2: Ha Noi- Sapa- Cat Cat village (meals B/ L/ D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\nOvernight in Sapa \n"},{"title":"Day 3: Sapa- Y Linh Ho- Lao Chai- Ta Van village- Ha Noi (meals B/ L)","description":"8:00 – Have breakfast at the hotel.\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. \nOvernight in Ha Noi.\n"},{"title":"Day 4: Ha Noi- Ha Long Bay- (Meals B/ L/ D)","description":"8:30     Pick-up at hotels if located in the Hanoi Old Quarter or Hanoi Opera house by shuttle bus departure to Ha Long Bay with stopovers for  refreshing en route.\n11:30 Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12:30 Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30 Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16:00  Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18:00 Come back to cruise later to enjoy sun set party on sundeck\n19:00 Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20:00 Join the fishing excursion or singing karaoke, have a drink or dancing at the bar, .Overnight on board.\n"},{"title":"Day 5: Ha Long Bay- bus to go back Ha Noi (meals B/ L)","description":"06.00 Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00  Your breakfast will be ready in quite bay.\n08:00 Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08:30 Start doing kayaking paddle explore by your own way around the bay\n10:00  Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10:30  You will have short cooking class fresh Vietnamese spring roll.\n11:00 Lunch is serve onboard\n12:00 Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17:00 Go back to  Ha Noi\nOvernight in  Ha Noi\n"},{"title":"Day 6: Ha Noi city tour- fly to Hue (meals B/ L)","description":"In the morning: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conicat Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nIn the afternoon: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue\n"},{"title":"Day 7: Hue city full day tour (meals B/ L)","description":"In the morning: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conicat Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nIn the afternoon: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue\n"},{"title":"Day 8: Hue- bus to Hoi An (meals B)","description":"The bus picks up at 8:00- 8:30 AM\nArrive Hoi an at 14:00- 14:30 PM. \nGroup bus will stop 4 places, time for each of place 10- 40 mins:\nThanh Toan Bridge 15- 20 mins. No Entrance fee\nLang Co beach 15-20 mins. No Entrance fee\nHai Van Pass 15-20 mins. No Entrance fee\nMarble Mountain 30- 45 mins. Entrance fee by yourself (40,000 vnd/ person/ one time (around US$2)\nArrive Hoi An 14:00- 14:30 PM, drop off Tran Hung Dao str-Hoi An ( 5-7 mins by walking to hotel).\nYou will be check in hotel and free time to discover Hoi An Old Town with Phuc Kien Temple, Tan Ky Ancient House, Phung Hung Ancient house, Japanese Bridge and cultural showroom in Hoi An\nOvernight in Hoi An"},{"title":"Day 9: My Son Holyland tour- drive to Da Nang (meal B/ L)","description":"7:30 am: Our minivan picks you up at your hotel. Spend 2 hours to enjoy and discover the beauty of Ancient buildings of the Champa Kingdom. Those relics were made by red bricks which still surprises those who are curious about architectural art.\nHave chance to enjoy traditional music performed by Champa girls in their colorful uniforms.\nLeave My Son for Cao Lau boat station. Take a boat trip on Thu Bon River. Experience the lifestyle of local people and enjoy fresh air.\nHave lunch on the boat before stopping at Kim Bong Carpentry Village – The traditional country village.\n2:30 pm: The boat trip finishes at Bach Dang Boat station.\nFinish tour, go back to hotel. The driver transfers to Da Nang. Free and  easy.\nOvernight in Da Nang.\n"},{"title":"Day 10: Da Nang- Ba Na hills- Golden Bridge (meals B/ L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n08:45 am: Arrive Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness.\nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion.\n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam.\nThen, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films.\nBack to Danang by car around 04:00 pm. Drop-off at hotel.\nOvernight in Da Nang.\n"},{"title":"Day 11: Da Nang- flight to Nha Trang (meal B)","description":"In the morning, free time for having breakfast, sunbathing and discover Da Nang city.\nCheck out and the driver takes you to the airport for your flight to Nha Trang\nSuggest flight: 13:45 DAD Da Nang - 14:45 CXR Nha Trang\nArrive Nha Trang, free time to discover the city\nOvernight in Nha Trang"},{"title":"Day 12: Nha Trang- 4 island tour (meals B/ L)","description":"After having breakfast at your hotel, shuttle bus and tour guide will pick up at your hotel.\n08h30 – 9h00 : Pick up tourists at the hotel and transfer Cau Da pier\n09h10                   : Depart for the exciting boat trip\n9h30 – 10h30  : At The Aquarium\n\tVisiting Tri Nguyen Aquarium. Watching the marine creatures and  the multi-coloured fishes\n\tShopping at the Souvenir Shop\n11h00 – 13h45   : At Mun and  Mot Island\n\tSwimming, snorkling to see the diversities of corals and  fishes\n\tHaving lunch with Vietnamese dishes on board\n\tJoining the entertainment programe: dancing, singing, playing the guitare\n\tCheering up a cup of wine with your friends on “ Floating bar”\n14h00 – 16h00: At Tranh Beach \n\tRelaxing . Guests can join in some sport games like: jetski, kayak, parascending…( your own expense)\n\tEnjoying the seasonal fruits\n16h30  :  At Cau da pier\n\tCar pick up and transfer back hotel\nOvernight in Nha Trang\n"},{"title":"Day 13: Nha Trang- bus to Da Lat (meal B)","description":"This day, take a bus from Nha Trang to Da Lat, the distance is around 150km and you will spend 4 hours on the bus. \nOvernight in Da Lat.\n"},{"title":"Day 14: Da Lat free and easy (meal B)","description":"Free and easy to discover Da Lat city with many famous places: Bao Dai Summer Palace, Domaine De Marie Church,  Linh Son Pagoda, Valley of Love, Lang Biang mountain, Da Lat flower Park, Crazy hous…\nOvernight in Da Lat.\n"},{"title":"Day 15: Da Lat- take a flight to Ho Chi Minh (meal B)","description":"Have a breakfast at your hotel.\nFree and easy until departure time, the driver transfers to the airport for flight to Ho Chi Minh.\nOvernight in Ho Chi Minh"},{"title":"Day 16: Ho Chi Minh city-Cu Chi tunnels full day (meals B/ L)","description":"Time: start 8.00 – return 19.00\nItinerary:\nWe start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war. \nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish. \nReturn to Saigon at 19:00PM\nOvernight in Ho Chi Minh\n\n"},{"title":"Day 17: Ho Chi Minh- bus to Mui Ne (meal B)","description":"Have a breakfast at your hotel and find to bus office (5 mins by walking from hotel).\nBus departs at 8:00 AM.\nArrive Mui Ne 12:00 and free time at beach,\nMeals: Lunch and Dinner by yourself\nOvernight in Mui Ne"},{"title":"Day 18: Mui Ne free time (meal B)","description":"Breakfast at your hotel\nFree ans easy your time at beach.\nOvernight in Mui Ne"},{"title":"Day 19: Mui Ne- bus to go back Ho CHi Minh (meal: B)","description":"Free and easy until check out time 12:00, the bus picks up at 14:00 to go back Ho Chi Minh.\nArrive Ho Chi Minh at 18:00 PM and then walking to hotel ( 5-7 mins by walking).\nOvernight in Ho Chi Minh"},{"title":"Day 20: Ho Chi Minh- My Tho- Ben Tre- Can Tho (meals B/ L)","description":"Start from Ho Chi Minh City and depart for My Tho. After visiting Vinh Trang Pagoda, take a boat ride along the river viewing the stilt houses and the fruit plantations along the river bank. Proceed to Tortoise island and have lunch in the local restaurant. Enjoy a boat ride under the shadow of the water coconut trees to visit a family business which epitomizes the idyllic rural lifestyle. Then enjoy the seasonal delicious fruits & honey tea while listening to the  traditional music. Take a rowboat ride along the creeks. After taking a delightful walk through the fruit plantation and village, proceed to Can Tho. \nHave dinner (own expense) and overnight at your proposed hotel in Can Tho."},{"title":"Day 21: Cai Rang Floating market- back to Ho Chi Minh (meals B/ L)","description":"Take an early morning boat trip to visit the Cai Rang Floating Market, a wholesale market of fruit and vegetable at its busiest time of the day. Keep cruising through the small channel system and visit a rice noodle making village. \nBreak for lunch. \nIn the afternoon, return to Ho Chi Minh City.\nOvernight in Ho Chi Minh."},{"title":"Day 22: Ho Chi Minh departure (meal B)","description":"Have a breakfast at your hotel. Free time until departure time, the driver takes you to the airport for your flight.\nEnd of services!"}]},{"name":"Hanoi - Halong bay - Bai Dinh Trang An - Hanoi","duration":4,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":259,"summary":"VIETNAM PURE TRAVEL WITH 4DAYS 3NIGHTS TOUR\nHANOI-HALONG BAY -BAI DINH TRANG AN - HANOI \nOverview: \n•\tDay 1\t\tHanoI -Arrival streetfood tour\t\t\t\n•\tDay 2\t\tHanoi - Halong Bay - Overnight on Cruise\t\t\n•\tDay 3\t\tHalong Bay - Hanoi\t\t\n•\tDay 4\t\tBai Dinh -Trang An tour & Departure time \t","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140626_a6dfbc06.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140626_a6dfbc06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_7a262d34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_593c2a7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_3a8daf8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_c45c52e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_7394704d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_deed2319.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_4ec7766f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_434b865e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_1ef24007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140626_575107ff.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi arrival & Street-food tour","description":"Fly to Hanoi. Upon arrival, our driver will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in. \nAt 17h00 our tour guide will come to your hotel to pick you up for the street food tour.\n Overnight in Hanoi.\nMeals: Dinner\nAccommodation: Hotel in Hanoi\n"},{"title":"Day 2: Halong bay 1 day trip - Wonder bay Cruise","description":"07:30 – 8:00: You will be met by our hospitable guide and chauffeur with modern minibus at your hotel in Hanoi Old Quarter experiencing 175 km road trip to Halong City (3,5 hours) with a short break en-route.\n\n12:00: Arriving Tuan Chau Harbor, welcome aboard & safety briefing\n\n12:15: A gourmet lunch is served in the single-seating restaurant while WONDER BAY CRUISES is taking you on an odyssey journey wends among remote archipelagoes via crowd avoidance route and opens up views of one stupendous seascapes after another, passing uninhabited islets and outcrops including Stone Dog, Thumb, Duck, Incense Burner, and Cock Fighting.\n\n14:30: Exploring Ba Hang (Three Cave), there are options to choose either kayaking or taking a bamboo boat rowed by local people, gently glide through water tunnels into secluded sea lagoons.\n\n15.30: Walk up Limestone Mountain to visit Thien Cung Grotto with incredible stalactites and stalagmites.\n\n16.30: Returning aboard for Afternoon Tea.\n\n17.00: Disembark, bus ride back Hanoi. Short break on the way.\n\n21:00: Drop at your hotel doorstep (if your hotel located in Hanoi Old Quarter).\n\nAccommodation: Hotel in Hanoi\nMeals: Breakfast/ Lunch"},{"title":"Day 3: Bai Dinh - Trang An 1 day trip","description":"07: 30 - Our guide will meet you at your hotel/stay and start  100km modern bus-journey through verdant landscape of country side. Short-break en route.\n\n10:30 - Arrive Glimmering Bai Dinh pagoda complexes, the largest pagoda, not only in Vietnam but also in Southeast of Asia. Scenically set on the foot hill of  Dinh Mountain surrounded by amazing views of the exquisite river valley  below and dotted and the limestone karsts dotted around which will take your breath away. \n\nThis pagoda complexes stunningly  boast a array of the most massive and magnificent architecture of Vietnamese tradition refined ever built that it take a full day to explore all. So you will visit some of the highlights that owned the national:\n\n         500 stone statues of “La Han” (Arhats)\n         2 huge bronze bells, one weighs 27 tons, other weighs 36 tones\n         Three bronze statues of Tam The (50 tons each)\nWith sacred atmospheres and intriguing Buddhism story which presented by Go Asia Travel’s insider guide, you cannot fail to enchant.\n\nThe visit ends with a walk-up the summit mountain to see the 100 tones statue of Buddha Sakyamuni made of bronze and enjoy the panoramic view of picturesque landscape dotted with limestone mountains.\n\n12:30 – Enjoy a fabulous buffet lunch in a Vietnamese restaurant with some special dishes such as goat meat, pork storage vessel….\n\n13:30 -Leave for the Trang An Grottoes, an out-standing natural beauty of majestic limestone massif at 20 square kilometer rise dramatically out from rice paddy fields.\n\nDeep into the linked chains of towering mountain are pristine places of mystical valleys, numerous fresh water ponds, and jungle.\n\nEmbark on a traditional sampan gently roweddown the exquisite river through numerous  caves: Hang Toi ( Dack )  cave, 320 meter long, Sang  (light) cave, 90 meter long, and Hang Nau Ruou (Cooking wine) cave, 250 meter long…  Every passages bring new surprise of mystery hidden inside isolated valleys of tranquility that likely transformed to the other world and time. The fauna and flora is rich and a scene of a goat jumping from one cliff to the other is a common sight.\n\n15:30 – Leisure cycling on rural roads alongside the extensive canal network and through small villages with back drop of a maze of limestone mountains.\n\n16:30 - Take the returns shuttle bus to Hanoi.\n\n19:00 – Drop off at your hotel/ accommodation's door steps in Hanoi Old Quarter.\n\nAccommodation: Hotel in Hanoi\nMeals: Breakfast/ Lunch"},{"title":"Day 4: Hanoi departure","description":"Breakfast at the hotel then free and easy. \nWait until our driver come and pick you to the airport \nTrip ends.\n"}]},{"name":"Vietnam Highlight Tour with some biking - 21 Days","duration":21,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":3175,"summary":"Ho Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95472_6770d4dd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95472_6770d4dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_2cb85dd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_578a6003.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_d96e5097.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_272965f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_9185844a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_65f3e5ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_32055561.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_7b78a809.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_2f27c0b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_134dfcd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_6a75b7c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_0e6941b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_95a3e119.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_2f6006dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_23b653bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5d52c080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_cb354312.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_8e918adc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5e0075c51117d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5e0075c520425.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5e0075c526e75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5e0075c52db49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95472_5e0075c534f8f.jpg"],"destinations":["Ho Chi Minh City","Dalat","Hoi An","Hue","Hanoi","Sapa","Lao Cai","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City, Vietnam","description":"You arrive Tan Son Nhat (Saigon) International Airport at anytime. Transfer from Airport to Ho Chi Minh City at any time then transfer to hotel in Ho Chi Minh City for check in. Free for leisure. Overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 2: Full day Sightseeing in Ho Chi Minh City & Cu Chi Tunnels. (B, L)","description":"This morning enjoy a city tour that includes the Reunification Hall, formerly known as the Presidential Palace. It was towards this modern building that Communist tanks rolled on the morning of April 30, 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. The tour also includes the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda, Chinatown and Binh Tay Market – the central market for the city and one of the liveliest areas. Next we visit the Cu Chi Tunnels, the incredible network of tunnels that once stretched for 210 miles. This underground complex was built by guerilla fighters beginning in 1940 and construction continued throughout the Vietnam War. We return to our hotel where the evening is free.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 3: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 4: Leave Ho Chi Minh City - Da Lat - City of Love (B, L)","description":"This morning after breakfast at hotel then transfer to Tan Son Nhat International Airport to take flight for Da Lat City. Upon arrive in Da Lat airport pick up and transfer to Da Lat City - known as the City of Eternal Spring by plane. Late in the afternoon you will be able to take a short walk to get a feel for this delightful city. In the evening you will head out to one of the fine restaurants in town. Overnight in Dalat.\nMonet Garden Hotel or similar"},{"title":"Day 5: Dalat sightseeing full day including biking (B, L)","description":"Today you will take a tour of Da Lat and the surrounding areas. We will visit Bao Dai Palace . From here you visit the rather bizarre and very aptly named Crazy House, a brightly painted concrete house which winds itself around trees, mimicking their shapes. It now functions as a guesthouse. Next visit is Truc Lam Thien Vien and Pagoda. This afternoon, for those interested can take the short train ride on the Cremaillere railway to the village of Tri Mat. In the evening, you will enjoy fine cuisine at a local restaurant. Overnight in Dalat.\nMonet Garden Hotel or similar"},{"title":"Day 6: Leave Da Lat City to Nha Trang Beach City (B)","description":"Free for leisure in the morning until transfer to Nha Trang Beach City – one of the most beautiful Beaches in over the World. Arrive Nha Trang Beach City in the afternoon. Check in hotel & overnight in Nha Trang City.\nRegalia Hotel Nha Trang or similar "},{"title":"Day 7. Nha Trang Sightseeing (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nRegalia Hotel Nha Trang or similar "},{"title":"Day 8. Nha Trang (B)","description":"Today is a free day at leisure in Nha Trang for relaxing and unwinding at the resort overlooking beautiful Bay. Snorkel or dive among the coral reefs in crystal blue waters, hike nature trails, cool off in your private plunge pool, indulge in spa treatments or just relax on the white sand beach and admire the unspoiled mountain and sea views. Overnight in Nha Trang.\nRegalia Hotel Nha Trang or similar "},{"title":"Day 9: Leave Nha Trang to Danang & Sightseeing in Hoi An. (B, L)","description":"Leave Nha Trang City in the early morning. Fly to Danang Airport. Pick up & transfer to Hoi An Ancient Town. Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thun Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 10: My Son Sanctuary half day biking Tour & free go shopping (B, L)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch. In afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 11: Hoi An - Heaven of Shopping Place in Vietnam free biking to shopping (B)","description":"Having breakfast at hotel. Enjoy the time in one of the best shopping places in Asia! You will walk around the ancient town with friendly & nice smile of local people! Stay overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 12: To Danang/City Sightseeing - Hue, Old Imperial City. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble – and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Arrive Hue City, check in hotel & overnight in Hue City.\nCherish Hotel Hue or similar."},{"title":"Day 13: Full day sightseeing in Hue the Old Imperial City. (B, L)","description":"Having breakfast at hotel then taking full day to discover Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nCherish Hotel Hue or similar."},{"title":"Day 14: Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Tr Overnight in Hue City.\nCherish Hotel Hue or similar."},{"title":"Day 15: Leave Hue City for Hanoi (B)","description":"Having breakfast at hotel & free for leisure, sightseeing in the morning! Check out hotel & transfer to airport for flight to Hanoi. Arrive Hanoi in the afternoon, transfer to hotel, check in. Free for sightseeing in Hanoi. Overnight in Hanoi!\nPomihoa Hotel Hanoi or similar"},{"title":"Day 16: Hanoi Sightseeing full day - night train to Sapa (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Dinner time then transfer to Railway Station. Take night train to Sapa. Overnight on the train.\nDeluxe Express Train (4 Berths Cabin sharing, Private Bed, not Private Cabin)"},{"title":"Day 17: Sapa arrival - trekking to Villages (B, L)","description":"Arrive Lao Cai Railway Station at 6:00am. Pick up to Sapa town for check in. Having breakfast and start trekking down to Lao Chai village to visit the Black H’mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town.\nBamboo Sapa Hotel or similar"},{"title":"Day 18: Lao Cai - Bac Ha Sunday Market - Night train back Hanoi (B, L)","description":"After breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most wonderful and colorful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, horses… are all on sales. This is a golden opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H’mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Overnight on the train.\nDeluxe Express Train (4 Berths Cabin sharing, Private Bed, not Private Cabin)"},{"title":"Day 19: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Arrive Hanoi Railway Station at 5:30am. Pick up & transfer to hotel for short rest & breakfast until 8:30am. You`ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Day 20: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 21: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home at anytime. We will drive you until airport for you to catch your International Flight! The unforgettable Vietnam Package Tour with Indochina Legend Travel will be finished at Airport! Good bye & see you in the next times!\nAirport transfer included!"}]},{"name":"Vietnam Heritage by Bicycle","duration":7,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","In-depth Cultural"],"oldPrice":0,"price":1400,"summary":"With a history over 4,000 years old, our heritage bicycle tour fuses the beauty of Vietnam’s central landscape with a glimpse into its rich, evocative past. Concentrated to just 250 km, our journey envelops the area surrounding the Hai Van Pass in central Vietnam. At Hue, the former Imperial capital of the Nguyen Dynasty, step into the past to enjoy manicured gardens and the sprawling complex of stunning palace buildings. Then our bicycle tour through Vietnam continues on down the coastal road to My Son, built by the kings of Champa between the 4th and 14th centuries, now the site of the most extensive Cham remains.","highlights":["Discover the rich heritage of the Ngu Yen Dynasty","Enjoy the views as you cycle through the countryside","Stop for a panoramic view from the top of Hai Van Pass","Visit the ruins of My Son - once Champa's greatest city"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/43146_11943e19.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/43146_11943e19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_a32c94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_96bfc8ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_e339ac8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_4fd2415c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_c4457a68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_95875b1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_53842ab2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_412f7739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_8e821b9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_f1c197f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_31cbfbb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_6c6293da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_24f7f42b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_66abd799.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_41430fe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/43146_8a02a2fd.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Day 1","description":"We meet in the UNESCO World Heritage site of Hue and are immediately introduced to the Nguyen Dynasty during our tour of the Imperial Citadel, modeled after China’s Forbidden City."},{"title":"Day 2","description":"We explore by boat and bicycle the rich heritage left behind by the emperors of the Ngu Yen Dynasty. We cruise on the Perfume River to the seven-storey Thien Mu Pagoda then cycle to Ming Mang and Khai Dinh mausoleums."},{"title":"Day 3","description":"We cycle the countryside on a mix of footpaths and quiet country lanes to the traditional village of Phuoc Tich, where many homes are more than 200 years old."},{"title":"Day 4","description":"We cycle along the coast south to Lang Co Beach, passing colourful graveyards and fishing villages. The afternoon is free to enjoy the resort and beach."},{"title":"Day 5","description":"Ride and tackle a gradual 550-m climb with many switchbacks to the top of Hai Van Pass for a panoramic view. Then it's downhill from here to Danang, with a stop to visit Danang Beach  before reaching our destination of Hoi An."},{"title":"Day 6","description":"Small village roads will lead us back in time to the ruins of the ancient centre of the Cham civilisation, My Son. Built from the 4th to the 14th centuries, this was once Champa's greatest city, but much was destroyed by American bombs."},{"title":"Day 7","description":"Our cycling adventure comes to an end today. We celebrate our success with one last breakfast together."}]}]