[{"name":"Vietnam Aqua Life - Cruising To Halong Bay/ Mekong Delta","duration":12,"travelStyle":["River Cruise","Family","Group","Fully Guided","Holiday"],"oldPrice":2257,"price":1219,"summary":"This tour is unlike the others that give you the opportunity to travel from the North to the South of Vietnam on cruise. Sailing among the the Dragon in Halong Bay - one of the Nature World's Wonder and enjoying the breathtaking view from the cabin deck. Then head to the Central and immerse yourself in the charming beauty of Hoi An ancient town which sits peacefully by the bank of Thu Bon River. And finally, boating to see the lush of Mekong Delta,known to be the \" rice basket\" of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142611_275695d3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142611_275695d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_48a1c9f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_47c727c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_d69c5df5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_ca92c64c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_9cafe0a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_52691807.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_7e4b9150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_f3b02c48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_4b7fba7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_73d01b49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_deb529ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_e61d3d88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_0da66afc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_6fed677d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_7ee03bea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142611_f654180e.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Cai Rang","Chau Doc","Ho Chi Minh City"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you on the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. Remaining part of the day is at leisure. So, enjoy as all of you want to.   \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day by yourself and return to the hotel for a relaxing sleep.  "},{"title":"DISCOVER THE LIFESTYLE OF VIETNAMESE COUNTRYSIDE (B/L)","description":"You will be picked up form hotel at 07:30 and transferred to Ba Vi.\n08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive your Mr Duoc’s house with a welcome drink\n10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place that to enjoy beautiful scenery of the village. This Tea Plantation is play important for providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea.\nMr Duoc is a veteran in Vietnam War and the owner of a large tea farm. He also is an expert on handling the raw tea leaves and he will introduce you how to make a good green tea before selling.\nYou will have great time listening to the host’s stories and his life in Vietnam war, besides, enjoying great tea with green lentils or lotus seeds that made by his family\n11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you have great time to enjoy lunch with food you made.\n13:45 – After lunch, you have time to walk (or bicycle) around the village to explore local culture and you will visit the local workshops. You will learn how to make tofu, unshell the rice and may be see the workshop of local hammerer who is working there for 70 years and makes and fixes all the farming tools in the village.\n15:00 – You have a cycling tour for 1 hour will through beautiful rice fields and villages. You can find out daily life of local people and interact with them.\nMr Chau is the next host, who will welcome you with fresh mint lemon juice, which all ingredients freshly picked from his own garden. Besides that, have soak your foot in warm water with herbs following the traditional recipes of Muong ethnic minority. This will give your feet relaxing time after cycling sessions around the village.\nYour afternoon will end with a boat trip about 30 minutes down the Da River on which you can enjoy the breathtaking landscapes and explore the local life along the riverside.\nThis is great time say goodbye host family to drive back to Ha Noi center. End your tour at the hotel around 18:30"},{"title":"CRUISING TO THE LAGENDARY HALONG BAY (B/L/D)","description":"07h30: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break.\n12h00: Embark at Ha Long wharf – Break and photography time\n12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n13h30: Have lunch while cruising to Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n15h30: Drop anchor at Cong Do for an hour Kayak to exploring Cap La and Tra San then return to cruise for your leisure or join ssunbathing, enjoy swimming in the crystal clear water. Join cooking class on boat. playing chess, taking.Relax and spend a romantic night on cruise.photos…\n19h00: Vietnamese style set dinner is served on board.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nStay overnight on boat."},{"title":"DISCOVER CAPLA - VUNG HA BY KAYAKING (B/L/D)","description":"07h30: Have breakfast, coffee and tea is served.\n08h30: Have slightly breakfast while cruising to discover more about Bai Tu Long bay and go in to Vung Ha.\n09h00: Drop anchor at Vung Ha discovering Vung Ha geological park through kayak to see panorama view of Baitulong bay with thousands of islets around and is there you can stay on private beach for relax, take sunbathing and swimming at Vung Ha Beach.\n12h30: Have lunch on boat in a romantic area of Baitulong bay\n13h30: You will come to discovering Be Ong Dau area by kayaking. You will discover a huge lake surrounded by mountains. Take sunbathing and swimming at Be Ong Dau Beach.\n15h00: Kayak back to the Boat start cruising back to Cong Do for stay overnight\n19h00: Vietnamese style set dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nRelax and spend a romantic night on Cruises"},{"title":"GET OFF THE BEATEN PATH IN HALONG BAY ( B/L) - FLY TO HOI AN","description":"07h30: Have breakfast and enjoy sunrise on the bay.\n09h00: Visit Vung Vieng floating village by small bamboo boat for an hour or Kayak in to the village then return to cruise for your leisure or join Sunbathing, playing chess, taking.\nRelax and spend a romantic night on cruise.photos…when our cruise continues to take you from\n10h00: Check out and enjoy a fantastic cruise on the bay\n10h30: Have lunch while cruising back through Ha Long Bay to the pier\n11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n12h00: Return from Ha Long to Hanoi.\n14h00: Stopover on the way for a refreshment break.\n16h00: Arrive in Hanoi. \nOur driver will pick you up to the airport, then you take a flight to Hoi An\nOvernight in Hoi An "},{"title":"STEP BACK IN TIME (B)","description":"Enjoy your relaxing time in Hoi An"},{"title":"LEISURE TIME IN HOI AN LANTERN TOWN (B)","description":"Have leisure time on your own. Hoi An is just few km to An Bang or Cua Dai beaches. A long coastline that’s relatively unspoiled by development, making it a popular option for soaking up the sun and enjoying an array of seaside activities."},{"title":"TRAVEL TO THE PEARL OF THE ORIENT (B)","description":"Have some leisure time then transfer to Da Nang take a flight to Ho Chi Minh.\n(Meals: breakfast, lunch)"},{"title":"DISCOVER THE MIGHTY MEKONG DELTA (B/L/D)","description":"In the morning we pick you up at your hotel in Saigon and take you to Can Tho or Cai Be. You board your wooden river cruise vessel around noon. After a refreshing welcome drink we show you our on-board facilities and your cosy cabin. As lunch is served, the boat starts cruising.  Sit back and watch the fantastic scenery and the daily life of the Mekong people.\nIn the afternoon you can disembark for a guided leisurely stroll through a village and the surrounding fruit orchards or rice fields. Meet the friendly locals and taste the local produce and fruits.\nGet back on board and enjoy a drink at the bar or relax on deck as the sun sets over the magnificent water landscape of the Mekong river. The cruise boat will anchor for the night. The day ends with a delicious on-board dinner. You stay overnight on board your floating hotel in the Mekong Delta.\n"},{"title":"EXPERIENCE THE FLOATING MARKET (B/L/D)","description":"Wake up well rested to the sound of the river and get ready for another exciting day of sightseeing in the Mekong Delta. At 6.30h the cruise vessel sets off for a sunrise cruise. Watch the locals go about their daily work drying exotic fruits and building ships on the wooden yards while enjoying an early breakfast.\nAfter breakfast, we will board a sampan boat to Cai Rang floating market, the region’s busiest and most lively markets. On even dates, you will explore the small channels of the mekong delta around Cai Be with a small sampan or by foot. Marvel at the sheer abundance of exotic fruits and vegetables. We will pull up to the boats for talking and bargaining with the merchants. We will also visit some of the local candy and cake making factories or boat through the green water landscape to see local houses, verdant orchards and ship-building yards.\nLater in the morning your can boat through the green water landscape on a little rowing sampan to see local houses, verdant orchards and ship-building yards. Alternatively you can discover the nearby town by foot or explore the small side canals of the Mekong river on a bicycle.\nThe cruise boat then resumes its journey as lunch is served. In the afternoon there will be another side trip to one of the exotic villages along the way.\n"},{"title":"EXPLORE THE LOCALS LIFE IN MEKONG DELTA (B/L)","description":"After breakfast and an early start through the glorious morning atmosphere on the Mekong river. In Can Tho we will visit the floating market of Cai Rang. In Cai Be will will explore the delta by foot or with a small sampan. Be sure not to miss the great photo opportunities for authentic snapshots of the Mekong people and their life.\nTake another sampan side trip right into the lush rural landscape, the fertile fields, the exuberant green. Then it’s time to pack up and return to the pier from which we started.\nThe Mekong Delta cruise boat tour ends at around 11.00 — 11.30h on the pier. On even dates, you will have lunch at the Mekong Rest Stop. On odd dates, lunch is served in Vinh Long City."},{"title":"TIME TO SAY GOODBYE - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"Halong Bay Cruise & Cat Ba Island - 3 Days","duration":3,"travelStyle":["Ocean Cruise","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":218,"summary":"\n\tDiscover Halong Bay and Cat Ba Island with a 3-day itinerary that includes a boat cruise in the World Heritage area plus an overnight stay in town. Stop for a swim at Soi Sim Island and visit Sung Sot Cave (Amazing Cave); take a boat tour to nearby Lan Ha Bay; ride a bike to a local village; look for wildlife at Monkey Island; and enjoy free time in Cat Ba. Choose from activities such as kayaking, cooking, karaoke or squid fishing. Select a superior or deluxe cabin.\n\n\tHighlights\n\n\t\n\t\t3-day Halong Bay and Cat Ba Island cruise from Hanoi\n\t\n\t\tStop at Soi Sim, visit Sung Sot Cave, and explore Lan Ha Bay\n\t\n\t\tEnjoy a welcome drink plus morning tea, coffee and cake\n\t\n\t\tFull meals provided on board\n\t\n\t\tStay in a superior ensuite cabin or upgrade to deluxe accommodations \n\t\n\t\tSpend one night at a 3-star hotel in Cat Ba Town\n\t\n\t\tIncludes round-trip hotel transport by air-conditioned coach\n\n","highlights":["Discover Halong Bay, Lan Ha Bay and Cat Ba Island","Relax on an overnight cruise in the UNESCO Halong Bay","Stop for a swim at Soi Sim Island and visit Sung Sot Cave","Ride a bike to a local village and search for wildlife"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2c5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118710_5e4499f9be2e0.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"Day 1: Hanoi - Halong Bay (L,D)","description":"7:45am to 8:15am: Pick you up at your hotel (in Hanoi Old Quarters) and depart to Ha long Bay. Rest stop for 20 minutes en-route.\n12pm to 12:30pm: Arrive at Ha Long City port and board cruise by a tender. Enjoy a welcome drink while captain delivers cruise briefing. Savor lunch on board while cruising through Ha Long symbols Stone Dog Islet and Trong Mai Islet. Stop at Soi Sim island for one hour for swimming, sun-bathing or getting a panoramic view on the island's peak.\n3:30pm: Visit Sung Sot Cave (the cave of Surprise) with millions of surprising stalactites and stalagmites. Then, drop anchor in a calm water area, relax on the sundeck at sunset, taste some local wine and fruits. After that, join in a \"cooking session\" on board with our chef making some special dishes with suggested recipe. 7pm: Have dinner on board and enjoy karaoke or squid fishing in the evening. Overnight in your cabin suite on the cruise in the middle of Halong Bay."},{"title":"Day 2: Lan Ha Bay – Monkey Island – Cat Ba Town (B,L,D)","description":"7am: Start your day with complimentary tea or coffee, then enjoy breakfast on board.\n9am: Visit a pearl farm village. See the pearl products and understand the process of pearl making in Ha Long. Then transfer to smaller day-boat to explore Day and Night Cave and Lan Ha Bay, guided kayaking, swimming, a pristine natural cave lapped by the turquoise water. \nLunch will be served on smaller boat. \n2:30pm: Arrive at Monkey Island. See wild monkeys and the endangered white-headed langur.\n3:30pm: Arrive at Beo Harbor. Travel to Cat Ba town by bus.\n7pm: Have dinner in your hotel's restaurant and then enjoy your free time at night to discover Cat Ba town. Overnight at the 3-star/4-star Hotel "},{"title":"Day 3: Cat Ba– Halong Bay - Hanoi (B,L)","description":"7:30am: Have breakfast in your hotel. Enjoy your morning in Cat Ba town. Take advantage of the beautiful morning landscape, a prefect photo opportunity.\n8am: Check out of your hotel. The bus will take you to to the harbor where you can board the transfer boat to re-join the cruise.\n9:30am: Relax on sundeck while sailing back to the harbor. 11:30am: Leave the cruise. Have a short break and take a bus drive to a local restaurant for lunch.\n1:30pm: Leave Ha Long bay and return to Hanoi. Enjoy a short break on your return trip.\n5:30pm: Get dropped off at your hotel. Tour ends."}]},{"name":"Twelve Day Highlight Vietnam from North Down To South","duration":12,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":829,"summary":" Vietnam Real Tour would like to bring you the highlights of Vietnam from Hanoi old quarter – where you can see the real local life, plenty local street foods; Breathtaking landscape in Halong Bay – World Natural Heritage; Stunning terrace rice fields in mountainous Sapa, seeing and experiencing the local minority; Rowing boat trip in Tam Coc – Halong Bay on Land; Beautiful lantern Hoi An town, learning how to plant the rice and riding Buffalo with local Farmer; Taking photo at the Cai Be floating market on Mekong river…Booking the tour with the accoomodation, meals and transportation included.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114268_e315ea8d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114268_e315ea8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_e43612c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_256210bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_8847a363.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_9e7e10b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_8a521768.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_06e5d990.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_f025cde4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_c0e5df4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_7d2e055d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_ce4087fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_d854824b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_2b6beb22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_ca0f727f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_dc81af27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_cb6cb50f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_927fd848.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_eec79ff1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_a7d6b56a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_d83857ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_e28495bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_c257dcbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_86cd9f89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114268_39a54cef.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Sapa","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival – Airport pick up – Hotel check in (Meal: No)","description":"Welcome you to Vietnam. Our driver will pick you up at Noi Bai airport and transfer you to the hotel in Hanoi old quarter.\nEnjoy welcome drink and check in the hotel.\nFree time to visit Hanoi old quarter to see the local life, taste the local street foods…\nHotel check-in time: 13:00\nOvernight at hotel in Hanoi\nInclusion: Private airport pick-up; Hotel in Hanoi"},{"title":"Day 2: Hanoi - Ninh Binh – Hoa Lu – Tam Coc – Cycling 1 Day (Meal:B,L)","description":" \n8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong River. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local village to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Buffet Lunch); Rowing boat trip; Cycling time; Complimentary water; Hotel in Hanoi"},{"title":"Day 3: Hanoi – Halong Bay – Overnight on Cruise (Meals: B, L, D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay by bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sun-bathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting Sung Sot cave (Amazing cave) – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch, Dinner); Welcome drink, Sung Sot cave (Amazing cave); Titov island (Hiking, swimming, sun-bathing); Sunset Party (Free fruit & a glass of wine); Cooking Demonstration; Complimentary water"},{"title":"Day 4: Halong Bay – Kayaking – Hanoi ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor\n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch); Kayaking; Tai Chi lesson; Complimentary water"},{"title":"Day 5: Hanoi – Sapa – Ylinh Ho – Lao Chai – Ta Van village (Meals:B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n12km trekking through the terrace fields from Sapa town to homestay.\n6:30 - 7:00 am: Shuttle bus will pick you up at your hotel and transfer you to the sleeper bus. Depart to Sapa with short break-time on the half way for relaxing, stretching the legs.\n12:30-13:00: Our local tour guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house.\nInclusion: Sleeper bus Hanoi – Sapa; Local English speaking tour guide; All entrance fees, Meals: Breakfast, Lunch, Dinner; Local home-stay; Complimentary water in bus; Trekking time; Cooking with host"},{"title":"Day 6: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":"You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tell your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields.\nGet back to Sapa town by shuttle bus.\nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:30: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi Old Quarter.\nOvernight at hotel in Hanoi\nInclusion: Sleeper bus Sapa – Hanoi; English speaking tour guide; All entrance fees; Meals( Breakfast, Lunch); Trekking time; Shuttle bus in Hanoi"},{"title":"Day 7: Hanoi free time – Flight to Da Nang – Hoi An (Meals: B)","description":" \nToday, you are free to visit Hanoi old quarter by your own: Ho Chi Minh complex, Temple of Literature, Hoan Kiem Lake, Ngoc Son temple…\nUntil the time driver transfer you to Noi Bai airport for flight to Da Nang.\nDriver will pick you up at Da Nang airport and transfer you to Hoi An. Hotel check-in in Hoi An.\nOvernight at hotel in Hoi An\nInclusion: Airport transfer in Hanoi; Airport pick-up in Da Nang; Flight ticket with 20kg hand check; Hotel in Hoi An"},{"title":"Day 8: Famring & Fishing Trip (Meal:B,L)","description":"09:00-09:30 AM: Tour guide meet you at your hotel, cycle to a local farming village travelling along picturesque country roads, you have a chance to capture some amazing pictures with the farmers on the field, fishpond and the buffalo, you can also try to riding the water buffalo if you love it.\nKeep riding to local home. Here, you will be welcome local water \"En water\". Then, the farmer will take you to the boat station, boarding across the coconut-palm flanked waterways far from the traffic the motor scooters, and the noises the city to learn and try how to use the local traditional fishing techniques using round and cast nets and paddle the Vietnamese bamboo basket boats. \nAfter that, you will be shared the daily work in the rural by local farmers, you will join in the activities of the farmers – collecting seaweed fertilizer, sowing, raking, watering and picking. \nLeaving the garden, you will back to the farmer's home and enjoy foot massage with the local herbal treatment.\nAfter lunch, take a cycling back to you hotel.\n13:30-14:00: Arrive your hotel. You get the free time to walk around exploring the beauty of Hoi An old town.\nOvernight at hotel in Hoi An.\nInclusion: Mini-van for hotel pick up and drop off only in Hoi An; English Speaking guide; Bicycles; Helmet; Boat cruise plus Vietnamese bamboo basket boats; Enjoy Basket boat dancing performance; Origami teaching such as bird, grasshopper, flower and etc; Light traditional local rice dishes at local farmer house; Lunch on boat cooked by Captain Cook; Many, many photo opportunities"},{"title":"Day 9: My Son sanctuary 1 Day (Meal: B, L)","description":" \n08:00 - 08h30: Our bus and tour guide will pick you up at your hotel/stay in Hoi An. Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village, alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n09h45:Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4thto 15thcentury.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area, your guide will explain the history of the religious site which served as a burial place for the Cham monarch centuries ago.\n12h00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village.\n15h30: The boat trip will finish at Nguyen Hoang dock in the old town. You will be free to explore the old town or return to your hotel by your own means.\nOvernight at hotel in Hoi An.\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch); Boat trip; Complimentary water; Hotel in Hoi An"},{"title":"Day 10: Hoi An – Da Nang airport – Ho Chi Minh city (Meals:B)","description":" \nHoi An old town is a lovely place to relax and find out the traditional custom and architecture. Leisurely time walking around the town, taking photo of old house with Chinese and Japanese combination; Tasting a nice coffee on river side…All will be very memorable.\nDriver will pick you up at the hotel and transfer you to Da Nang airport for flight to HCM city.\nReaching Tan Son Nhat airport in HCM city, meeting driver at the airport and going to the hotel in HCM city.\nOvernight at hotel in HCM city.\nInclusion: Meal (Breakfast); Private airport transfer and pick up; Flight ticket Da Nang – HCM city with 20kg hand check; Hotel in HCM city"},{"title":"Day 11: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in HCM city\nInclusion: Transportation; English speaking tour guide; Boat trip; All entrance fees; Hotel in HCM city"},{"title":"Day 12: HCM city – Flight out (Meal:B)","description":"Taking your leisurely time to visit HCM city by your own with destinations as: Ben Thanh Market, China town…Tasting and feeling the local foods, daily life…until the time to transfer you to Tan Son Nhat airport for your flight out. Trip ends.\nNote: \n- If you are Solo traveller, you will stay at Share Dorm Room at the hotstel during your vacation.\n- This is group joining, there is a different group each trip during your vacation.\nInclusion: Private airport transfer; Meal (Breakfast)\nWho should participate? - This tour is suited for all, including children as well.\nPrice structure: - Price quoted is based on per person basis. \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!\nIf you want to extend the trip, or add any more night in any city, or start from the South, please advise!"}]},{"name":"Truly Vietnam - 14 Days","duration":14,"travelStyle":["Sightseeing","Family","Group","Fully Guided","Holiday"],"oldPrice":859,"price":739,"summary":"Explore the vibrant and fascinating country of Vietnam, with stop overs in 3 top tourism centers: Hanoi, Hoi An, Ho Chi Minh City.Take an overnight boat cruise through the spectacular Ha Long Bay with plenty of fun activities onboard and onshore, including cooking classes, squid fishing and kayaking. Discover colorful ethnic people in Sapa trip. If you love trekking, this is your right place.Travel and explore lovely Hoi An Town in your special way: by bikeFeel history come alive as you explore the My Son Holy Land and the Cu Chi Tunnel.Discover the beautiful Mekong Delta and experience local daily life by joining a day tour to the Cai Be Floating Market.Transport , transfers and most of your meals are taken care of for you, and your tour guide is always on hand to help. Your tour allows you plenty of free time to explore Vietnam at your leisure.All hotels are highly recommended by tourists on Tripadvisor and guidebook.","highlights":["Explore the vibrant and fascinating country of Vietnam","Enjoy an overnight boat cruise through Ha Long Bay","Feel history come alive at the My Son Holy Land"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/94081_c499fcb0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/94081_c499fcb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_7a1b30d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_8a6b850d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_dff2cab8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_63b09396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_3345b90a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_fcf9f919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_2cb01cc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_c0600d46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_4db733bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_5c2efdfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_62cff309.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_c82db269.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_986255ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_74d0f334.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_4223ea57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_e68672e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_8e6d4ba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_5d928b3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_48ab6666.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_b60db121.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_fd7664a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_adf2fa78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/94081_03ef8c7c.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Cat Cat Village","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 01 Airport pick up – Check in Hotel in Hanoi (Meals: No)","description":"Pick up at the airport then transfer to hotel in Hanoi. Check in hotel and free time to see Hanoi City. Overnight in Hanoi.\nNote: Check in time after 12:30 P.M"},{"title":"Day 02 Hanoi- Halong bay – Overnight on cruises (Meals: B, L, D)","description":"08h00 – 08h30: Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay. \n12h30 – 13h00: Embark on cruise followed by a short cruise briefing.\n13h30 – 14h30: Savor a delectable lunch on cruises among the limestone islands.\n15h00 – 16h00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16h00 – 17h00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17h00 – 17h30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17h30 – 19h00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19h00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around. Overnight on board. "},{"title":"Day 03 Halong Bay - Hanoi - Check in hotel in Hanoi (Meals: B, L )","description":"06h30 – 07h15: Start your day with Tai Chi exercises or a photo hunt. \n07h30 – 08h30: Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n09h00 – 10h00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10h15: Return to the boat. Freshen up and check out of your cabin.\n10h15 – 11h00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11h00 – 12h15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12h15 – 12h30: Disembark V’Spirit Classic.\n12h30 – 13h00: Transfer back to Hanoi."},{"title":"Day 04Hanoi – Sapa by bus with a short trek to Cat Cat village (Meals: B,L)","description":"6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costumes of H’mong, Dzao, Tay ethnic People.\nWelcome drink and itinerary briefing\nEnjoy the lunch with local Vietnamese dishes, check-in procedures\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. We recommend good local restaurants for your dinner on your own, overnight in hotel with night activities."},{"title":"Day 05 Sapa – Hanoi by bus with a long trek Y Linh Ho - Lao Chai - Ta Van (Meals: B/L)","description":"7.00 – 8.00: Have breakfast at hotel, check out the room and prepare light pack for trekking. (Big luggage keep in hotel store).\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n12.30 - 13.30: Have lunch in the hotel.\n13.30 - 14.45: Relax and leisure on your own, have shower in the public bathroom in the hotel if you want.\n14.45 - 15.00: Meet all group members at hotel to get ready for Hanoi.\n15.00: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: Check in hotel in Hanoi"},{"title":"Day 06 Hanoi Free day – Train station transfer- Night train to Da Nang (Meals: B )","description":"Today, you are free to visit Hanoi Old Quarter, see the water puppet show until transfer to Hanoi Train Station for solf – Sleeping train to Da nang. Time you need to spend on the train is around 13 hours. On the train you can view our beautiful country along the coastal line. You also stay overnight on the train and reach Danang train station at around 10.30 am."},{"title":"Day 07 Da Nang pick up - Check in hotel in Hoi An town (Meals: No)","description":"Train arrive on the next day. We will pick up and transfer to Hoi An Ancient town. Check in hotel in the ancient town and relaxing."},{"title":"Day 08 Hoi An - My Son tour (Meals: B,L)","description":"7:30 – 8:00: The bus and tour guide pick you up at your hotel 8:30 : Leaving Hoi An for My Son HolyLand. \n9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide.\n12.00: Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river.\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!."},{"title":"Day 09 Hoi An Free day (Meals: B,","description":"You are free to discover the ancient town. "},{"title":"Day 10 Hoi An - Airport transfer - Flight to HCMC- Pick up- check in Hotel (Meals: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City."},{"title":"Day 11 HCMC - Mekong delta - Cai Be Floating Market - Vinh Long tour (Meals: B, L )","description":"Floating MarketYou are picked up at hotel between 7:30AM to 8:00AM and start a full day to explore the Mekong Delta. For those with just a short time, this trip provides an overview of this typical Vietnam. On the way you can see the green paddy fields stretching towards the horizon (3 hours drive).\nAfter arrival in Cai Be, we will on board for an exploration of lush vegetations of Mekong Delta and the lively floating market buyers bargaining. Next a rowing boat rides on the maze of shady canals to arrive at a local orchard to visit the daily activities the handicraft villages of local people. Break time for lunch at the orchard fruit garden. From here, you will have a pleasant time riding bicycles to the villages, sightseeing or relaxing on the hammock.\nAfter lunch, take a boat along the Mekong River to Vinh Long - a center of tropical fruit; stop in for a short visit to Vinh Long market. Go across My Thuan suspension bridge and drop by Mekong Rest Stop before going back to Saigon."},{"title":"Day 12 HCMC - Cu Chi Tunnel Tour (Meals: B, L )","description":"Cu Chi Tunnel08:30  Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60 km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220 km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffaloes swimming in the rivers alongside the road. Visitors will find it hard to imagine the destruction, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n12:00  Have lunch in a local restaurant\n13:00  Back to Ho Chi Minh City\n14:00  Arrive in your hotel in Ho Chi Minh City."},{"title":"Day 13 HCMC Free day (Meals: B )","description":"You are free after a long trip from North to South of Vietnam, if you need a tour organized please email Go Asia Travel"},{"title":"Day 14 HCMC - Airport transfer - end the trip (Meals: B )","description":"This day you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends."}]},{"name":"Vietnam Highlight 10 days","duration":10,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":910,"summary":"Vietnam Highlight 10 days is great  ideal for the first-time visitor to Vietnam, taking in all of the main highlights. Starting in the north, visit the colonial capital, Hanoi, before you head out to Halong Bay to stay aboard a traditional Junk. A driving from amazing scenery of Hue through the lush agriculture and stunning coastal vistas of provincial Vietnam & chill out in Hoi An as you indulge in Vietnam’s coolest spots before discover Cu Chi tunnel & Mekong delta with coconut palms, sugar plantations &... Get it a try, you will love our country. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/133259_9f44e762.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/133259_9f44e762.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_c117ce29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_86f84d4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_527da0c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_231a6011.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_38a0c6a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_b7fd1a6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_e43eb21a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133259_3c53d4af.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"HANOI ARRIVAL","description":"Arrive at Noi Bai International Airport, you are welcome by our guide and transfer city centrer, then you will be dropped at hotel for check in. Hanoi or “River-bound City” as its name literally means is Vietnam’s capital with a thousand-year-old history dating back to 1010. The city’s fascinating beauty which is characterized by unique cultural relics, ancient streets of antique houses, elegant French colonial buildings, tree-lined boulevards and romantic lakes has made it one of the most charming cities of Asia. You are transferred to hotel in Hanoi for check in. You are free and leisure for shopping or exploree Hanoi by night. Dinner is served by your own.\n "},{"title":"HANOI CITY TOUR","description":"Start Hanoi city tour, with a visit to the Ho Chi Minh Complex. Visit Ba Dinh Square and Ho Chi Minh Mausoleum from outside. See the simple cottage where Uncle Ho lived and worked and visit the near  by  the Governor’s Residence, a fine sample of Hanoi’s French architecture, followed by a stop at the One Pillar Pagoda to hear the legend of its construction. Continue to the Temple of Literature, built in 1070 and dedicated to Confucius, for a quick escape from the busy streets.\nAfter lunch, transfer to Bat Trang Village - a famous Vietnamese Traditional Pottery Village, 15km from Hanoi. It was found 500 years ago, producing handicrafts with a unique style in special characteristics; design; coloration; sculpture... The history includes many years of research into forms, models, decorations. Enjoy the tour for your own experience about Bat Trang pottery. Back Hanoi central and visit Ngoc Son temple and Hoan Kiem Lake. Return back to the center of the City and enjoy 01-hour cyclo tour around the Old Quarter of Hanoi."},{"title":"HANOI - HALONG BAY/ OVERNIGHT ON CRUISE","description":"Morning pickup at 8:00 AM from your hotel for transfer to Halong Bay, which is about 160 km or 3.5-hour drive away. The transfer is approximately 3 hours. You will see some rural areas of the Red River Delta with plenty of chances to take photos of Vietnamese farmers working in paddy fields and you may stop on the way to admire the local scenery. \nArrive in Halong City at 11:30 AM and check in aboard the booked junk when your journey across Halong Bay starts. Halong Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage sites whose formation dates back 500 million years, consists of around 2,000 karst islands and islets scattered over an area of 1,553 km2.\nAfter lunch, take a short trek to a nearby summit for a panoramic view of the bay dotted with golden sails, go swimming on a quiet beach or sunbath on the sundeck. Later in the afternoon, you will visit an interesting fishing village with an opportunity to interact with local people who have been living in the bay for almost three generations. An optional kayaking trip is available weather permitting. Back onboard enjoy a lavish dinner and enjoy the bay view at sunset. Spend a night on board."},{"title":"HALONG BAY - HANOI - DA NANG - HOI AN / EVENING FLIGHT","description":"Wake up with Tai Chi exercises on the sundeck and continue cruising the Bay. Enjoy breakfast buffet in the restaurant, then visit the limestone grotto. Enjoy lunch on board and disembark in Halong City around 12.00 noon and private transfer to Hanoi airport. Say goodbye to the crew then transfer to Hanoi, move to Noi Bai airport for domestic flight to Da Nang. \nUpon arrival in Da Nang, local guide welcome you and transfer to selected hotel in Hoi An. "},{"title":"HOI AN CITY TOUR - HUE / 2,5 DRIVING","description":"Morning, meet our guide at your hotel and transfer out for a full day city tour to discover the charm of Hoi An as a renowned World Heritage Site. Once a bustling maritime commercial port of Asia between 15th and 19th centuries, Hoi An is now a peaceful town of exceptionally well-preserved architecture, lifestyles and traditions. The town exemplifies a fascinating fusion of cultures between Vietnam and the outside world including China, Japan, Thailand and the Philippines. Highlights for sightseeing include the town’s iconic 400-year-old Covered Bridge with a small temple attached to one side as a prominent example of Japanese architecture, the Museum of Trade Ceramics which is an elegant Vietnamese style wooden house built in 1858 showcasing antique ceramic artifacts, the 200-year-old Tan Ky House typifying an ancient Chinese merchant residence, the Ong Temple built in 1653 by Chinese settlers to worship Guan Yu, an ancient Chinese general whose character stands for loyalty, bravery and justice and the local market vibrant with colors and activities. Have lunch at restaurant and free at your leisure for shopping.\n15.00: depart to Hue via the Hai Van Pass (Ocean Cloud Pass). Enjoy a stunning headland-and-bay panoramic view from high above the pass, which for miles hugs the mountainside along the shoreline and overlooking the Pacific Ocean. Arrive in Hue in late afternoon, check in hotel."},{"title":"HUE CITY TOUR","description":"Morning, our guide meets you at the hotel and everyone begins a sightseeing tour around Hue city. Begin with Hue Citadel, a well-known UNESCO-recognized World Heritage Site, which is a 520 ha fortress-like grand complex built in the early 1800s which features three enclosures separated by heavy ramparts namely Kinh Thanh H ue (Civic City) as the outer, Hoang Thanh (Royal City) as the middle and Tu Cam Thanh (Forbidden City) as the inner. Move on to Khai Dinh Tomb, the burial site of Khai Dinh, Vietnam’s second-to-last king, which is the most elaborate compared to other kings’ tombs. The tomb shows a vivid European influence in architecture despite its Asian style.\n  \n Afternoon, start sightseeing again with a boat cruise along the Perfume River for sightseeing and visiting two prominent historical landmarks namely Minh Mang Tomb, where Minh Mang, the 2nd Emperor of the Nguyen dynasty was buried, and Thien Mu Pagoda, a Buddhist monastery still in use with its origin dating back to 1601.  Dinner is served by your own.\n "},{"title":"HUE - HO CHI MINH CITY - HALF DAY TOUR / MORNING FLIGHT","description":"Morning, check out your hotel and 7.30 am you will be transferred to Airport in Hue for flight to Ho Chi Minh City. \nArrive in Ho Chi Minh City, you are welcome by our local tour guide and transfer to restaurant for lunch.\nAfternoon, take a city tour to visit the Saigon Notre-Dame Basilica, a neo-Roman cathedral built by the colonial French with materials entirely imported from Marseilles, the Saigon Old Central Post Office, which was designed and constructed in the early 20th Century by the famous French architect Gustave Eiffel, Cho Lon area or the city’s China Town and the Jade Emperor Temple (Phuoc Hai), a rare Taoist structure in Vietnam built by the Cantonese community in the area in 1909. \n "},{"title":"CU CHI TUNNEL - HALF DAY CITY TOUR","description":"Morning, our tour guide meets you at the hotel and transfer to visit the Cu Chi Tunnels. The underground tunnel network is in Cu Chi district, 75 km North west of downtown Ho Chi Minh City, which were once a major underground hideout and resistance base of Viet Cong forces during the two wars against the French and later on Americans. The tunnels, entirely hand-dug, formed a highly intricate labyrinth-like network of interlinked multilevel passageways at times stretched as far as the Cambodian border and totaling over 120 km in length. Its complexity is beyond imagination containing meeting rooms, kitchens, wells, clinics, schools, depots, trenches and emergency exits all aimed for guerrilla warfare. The tunnels were deep and strong enough to withstand destructive bombings and self-contained enough to outlast prolonged sieges. Lunch at a local restaurant\n \nAfternoon, get back to Ho Chi Minh City and take the city sightseeing tour that includes the War Remnants Museum, which features a comprehensive collection of the machinery, weapons, photos, and documentation of Vietnam War with the both the French and Americans; former Presidential Palace and Ben Thanh market. Have dinner at restaurant. Drop you off at hotelcU"},{"title":"FULL DAY MEKONG DELTA ( MY THO )","description":"Morning, get on our private air-conditioned car to travel to the Mekong Delta, the world’s largest delta and Vietnam's largest rice bowl. On arrival in My Tho City, capital of Tieng Giang Provine, embark on a boat and navigate through intricate canals while observing the local daily life up close as well as the landscape of waterways and lush islands. Land on the Unicorn Island and enjoy wandering through verdant orchards, tasting fresh fruits and listening to some Southern style traditional music. \n Move on to the second delta province, Ben Tre, where you will watch local villagers make coconut candy in a rural workshop, walk around briefly and leisurely sit on a horse-pulled carriage to experience the local life. Cruising to some bee-keeping households to taste fresh homegrown honey and honey tea. Go back Ho Chi Minh City and drop you at hotel, free at your leisure in the evening. "},{"title":"HO CHI MINH DEPARTURE","description":"Have breakfast at hotel. You are free until time  our guide and driver meet you at hotel lobby and transfer to Tan Son Nhat Airport in Ho Chi Minh City for international flight. End trips.\n "}]},{"name":"Da Nang - Hue Imperial City - Golden Bridge - Hoi An 5 Days 4 Nights Package Tour.","duration":5,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":273,"summary":"Highlights :\n\n   \tVisit Dragon Bridge.\n   \tVisit Marble Moutain\n   \tVisit Hoi An Ancient Town\n   \tVisit Golden Bridge – Bana Hill\n   \tTake Cable car up to the mountain\n   \tBoat trip along the Perfume River.\n   \tCruise Trip along Han river at night.\n   \tVisit Hue Imperial City, Visit Hai Van Pass\n   \tVisit Linh Ung Pagoda, Son Tra Peninsuala\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8da.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca8fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca900.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197422_5e820480ca901.jpg"],"destinations":["Hoi An","Hue"],"timeline":[{"title":"DA NANG ARRIVAL (-/-/-)","description":"You will be met by Luco Travel’s tour guide and driver at Da Nang International Airport and transfer to Da Nang City Centre, where you will check in hotel. Free & Easy or you may like this option as below:\nOption: Diner On Han River Cruise.\nAt 18:00, pick up at the lobby, take you to Han River Cruise, followed by a boat trip along Han River to enjoy views the city at night.\nYou also can visit Dragon Bridge in Da Nang, which is the longest bridge in Vietnam, offering a dazzling display of lights, fire, and water that no first-time visitor to Da Nang should miss out on. Measuring at 666 metres in length, it is located in Da Nang City and constructed in the shape of a golden dragon.\nBack to hotel.\nOvernight in Da Nang, arranged by Luco Travel – Vietnam Tour Operator."},{"title":"DA NANG CITY TOUR - MARBLE MOUTAIN - HOI AN ANCIENT TOWN. (B/L/-)","description":"After breakfast at the hotel, our guide will pick you up and we will begin city tour in Da Nang, passing by Thuan Phuoc Bridge to visit Son Tra peninsula, so-called Monkey Mountain. We will tour around the peninsula to enjoy scenes of the whole city. We will visit Linh Ung Pagoda and swim at My Khe beach - classified as one of the most attractive beaches on the earth. \nAfter that depart to Hoi An Ancient Town.\n  \nOn the way, stop to visit Marble Mountain and Non Nuoc Stone Carving Village, where the local skillful sculptors create many marble products which are exported to many countries worldwide. Climb up to visit the Marble Mountains by the stone stairs and enjoy the panoramic view of the nearby countryside and visit Huyen Khong Cave.\n\nArrive Hoi An Town and enjoy lunch at the local restaurant.\n \nAfterwards, we will start a walking tour of Hoi An Ancient Town for featured sights of the town such as the central market, former merchants’ houses, the 400 year-old Japanese Covered Bridge, a Chinese communal hall and Hoi An Museum.\nBack to hotel. Free & Easy.\nOvernight in Da Nang, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"DA NANG - BA NA HILL - GOLDEN BRIDGE TOUR. (B/L/-)","description":"After breakfast at the hotel, our guide and diver will pick up at your hotel to visit Ba Na Hills - King Mountain, also known as the second DaLat/ Sapa in Central Vietnam. The beautiful weather here is always cool.\nYou will admire the heights by riding the most modern cable car system in Southeast Asia. You will visit Dream Stream Cable Car Station and after finishing the first cable car, you will visit a French wine cellar and Linh Ung Pagoda ( the old one ). You will see the panorama of Danang City.\n  \nAfterward, you will visit and play games at the Fantasy Park. Followed by a buffet lunch at Ba Na Hill Restaurant.\nWe will then explore King Peak, which sits at an altitude 1.487m. You can see panoramic views of the Hana Hills and Quang Nam - Da Nang on high. On the top of the mountain, you will see Linh Tu Pagoda, which has a special temple construction.\nYou will then visit Golden Bridge one of the famous bridges in Vietnam and Asia, before heading back to the hotel to relax.\nOvernight in Da Nang, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"DA NANG - HUE IMPERIAL CITY - HAI VAN PASS. (B/L/-)","description":"After breakfast at the hotel, our guide and diver will pick up your group at the lobby, drive toward Hue with stops to visit to Hai Van Pass. You will enjoy an amazing view for photos on top of the mountain.\nAfter arriving at Hue, you will visit a conical hat, an incense making village and then visit to one of the Nguyen King’s mausoleum which was built amongst stunning natural settings, at strict Fengshui principles and in line with the Royal Citadel. \nAfterward, you will enjoy a lunch with local food at the restaurant.\n  \nAfter lunch. We will explore the Imperial Citadel and Forbidden City which reflects pomps and ceremonies of dynastic rulers of the Nguyen Dynasty from 1802 to 1945. \nYou will enjoy a savory vegetarian feast in a pagoda and later, board a dragon boat for a cruise along the Perfume River and visit the city’s symbol, the Thien Mu Pagoda. \nYour driver will then take you back to Da Nang, where you will have.\nFree & Easy.\nOvernight in Da Nang, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"DA NANG DEPARTURE. (B/-/-)","description":"Today is departure day. Enjoy some free time for last minute purchases or simply relax before your transfer to the airport for your onward flight . Then, home sweet home."}]},{"name":"15 Days Highlight Vietnam from Ho Chi Minh city up to Hoi An and Hanoi","duration":15,"travelStyle":["Discovery","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":839,"summary":"Welcome to Vietnam! We would like treating you by all the MUST SEE attractions in Vietnam from South, Central up to North. From the floating life on Mekong Delta, impressive architecture in Hoi An historical in Hue, stunning view in Halong Bay to panorama sightseeing in Tam Coc. Please let’s contact us and offer yourself the lovely vacation.\nTaking photo of Floating Market in Mekong River\nBiking in Mekong Delta to visit the local lives\nExploring the culture of Cham Pa Kingdom in Hoi An\nUnderstanding the Vietnamese history in Hue\nKayaking in World Natural Heritage – Halong Bay\nRowing boat rip with local rower to visit the beauty of “Halong Bay on Land” – Tam Coc\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/118953_04999180.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/118953_04999180.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_93d9cadd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_4f1691ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_15fe857e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_d79366ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_0aca4659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_d27c3faa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_042a37d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_e774c6d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_1b179593.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_56c5cb65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_475af4c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_1433cc7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_08a89c30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_902032bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_09ebb0fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_76f0c6d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_125e8463.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_8615aaa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_91c6e3b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_3f04fc94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_458b1906.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_c85eb629.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118953_ef4e4e3a.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hue","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Ho Chi Minh arrival – Airport pick up – Hotel check in (Meal:No)","description":"Welcome to Ho Chi Minh city, Vietnam. You are in the biggest city in our country with several strange things offering you exploring. \nDriver picks you up at Tan Son Nhat airport and transfer you the hotel in the center. Taking your own leisurely time visiting the local Vietnamese lives.\nOvernight at hotel in HCM city.\nNote: Hotel check-in time: 13:00\n"},{"title":"Day 2: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in Ho Chi Minh city.\n"},{"title":"Day 3: Sai Gon free and easy (Meal:B)","description":"Today, as a nice chance to discover the biggest city in Vietnam by your own. Tasting the local foods, very tasty local Coffee, experiencing the local lives in Ben Thanh Market…,\nOptional: Cu Chi war tunnel day trip, Ho Chi Minh city tour, Local street food tour\nOvernight at hotel in HCM city"},{"title":"Day 4: HCM city – Flight to Da Nang - Hoi An (Meal:B)","description":"After Breakfast, please spend your own time to viewing the local and shopping souvenir for your family, until the time driver picks you up at your hotel and transfer you to Tan Son Nhat airport for your flight to Da Nang city.\nYour driver in Da Nang welcome you at Da Nang airport and transfer you to the hotel in Hoi An. On the way to Hoi An, it is as a lovely time to see how beautiful Vietnam is. Check in Hoi An old town. You may cannot imagine before that such a lovely Hoi An town! Colorful lanterns along each street, old houses were built in 17th Century, mixed culture of Chinese, Japanese and Vietnamese. You’ll feel the peace of mind.\nOvernight at hotel in Hoi An.\n"},{"title":"Day 5: Hoi An – My Son Sanctuary Full Day (Meal:B,L)","description":"7:30 – 8:00 am: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide. \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon river. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip! \nOvernight at hotel in Hoi An"},{"title":"Day 6: Hoi An free time (Meal:B)","description":"Hoi An on foot is one of the best way exploring the history, culture and local things. You also can do biking by your own visiting street by street with several temple and pagodas, tailor made costume, lantern handmade, or tasting a Coffee cup on the Thu Bon riverside.\nOptional: Rice Planting and Fishing Trip, Rowing Basket boat and Buffalo Riding, Hue city Tour\nOvernight at hotel in Hoi An\n"},{"title":"Day 7: Hoi An – Exploring Hai Van Giant Pass – Hue City (Meal:B)","description":"After Breakfast, driver pick you up and transfer you to Hoi An. Hai Van Giant Pass where you stop on the way to see the most giant Pass in Vietnam is most famous and very beautiful spot in the Center to see. Driving on the pass which separates the Sea and Mountain with the stunning and breathtaking view which offers you an unforgettable memory.\nArriving Hue city – ancient capital of Vietnam, you are leisurely to explore the history of Vietnam with Royal palace, King tombs…\nOvernight at hotel in Hue city."},{"title":"Day 8: Hue city - Imperial Palace Full Day (Meal:B,L)","description":"7:45 – 8:30: Our tour guide and driver will pick you up at your hotel and depart Hue city tour.\nTake a visit:\n-\tDragon boat trip to Thien Mu pagoda - The oldest pagoda in Hue city.\n-\tImperial Citadel by car – The home of Vietnam's last royal dynasty - the Nguyen Dynasty.\n-\tHue Royal Antiques Museum - A collection of ornaments from the Nguyen Dynasty.\n-\tDong Ba Market to see the daily life of local people.\n-\tTaking the boat trip on Perfume River to see the local life along the river.\nEnjoy Lunch at local restaurant. \nAfter Lunch time, continue to visit:\n-\tKhai Dinh King’s Tomb - a blend of Western and Eastern architecture.\n-\tMinh Mang King’s Tomb, one is impressed by the majesty and symmetry of the architectural constructions.\n-\tConical hat making village, incense stick making village\n16:00 – 16:30:  Back to your hotel.\nOvernight at hotel in Hue.\n"},{"title":"Day 9: Hue – Train to Hanoi city (Meal:B)","description":"Today, you have the free day to visit Hue city, tasting the famous Bun Bo Hue (Beef Rice noodle), experiencing by foot the local life style, until the time driver pick up and transfer you to Hue train station for train to Hanoi city.\nTrain takes about 12  hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight on train."},{"title":"Day 10: Hanoi arrival - Train station pick-up - Hotel check-in (Meal:No)","description":"Welcome to Hanoi city – capital of Vietnam. Driver picks you up and take you to the hotel in Hanoi old quarter. \nKnown as the most interesting place in Hanoi city, the old quarter with the ancient house, traditional architecture, colorful lives, several street foods… a lovely place you can see the real Vietnam is.\nOvernight at hotel in Hanoi.\n"},{"title":"Day 11: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)","description":"8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise\n"},{"title":"Day 12: Halong Bay – Kayaking – Hanoi ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\n"},{"title":"Day 13: Hanoi free time (Meal:No)","description":"You could wake up early to see the quiet Hanoian lives around Hoan Kiem Lake – most important and beautiful lake in Hanoi city. A visit of foot in the old 36 streets quarter is one of the best way to explore Hanoi by your own. Meeting the street vendor, view the tiny chair on the street side where local people are drinking the coffee or green tea, the strange electric cable on the street, very excited traffic in the old town…every images will be deeply in your mind about Hanoi city – a peaceful and lovely point.\nOptional: Hanoi street food walking tour, Perfume Pagoda tour, Water Puppet Show\nOvernight at hotel in Hanoi.\n"},{"title":"Day 14: Ninh Binh – Hoa Lu – Tam Coc 1 Day Tour (Meal:B,L)","description":"8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong River. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter. Trip ends.\nOvernight at hotel in Hanoi.\n"},{"title":"Day 15: Hanoi Departure (Meal:B)","description":"Today, you are free to visit Hanoi Old Quarter with long history and culture, shopping the souvenir for family until the transfer to Noi Bai airport for your flight out. \nIf you did not want to leave, please let us know to extend your trip with more stunning natural landscape, such as Sapa breathtaking terrace rice fields, Mai Chau rural mountain, Ba Be Lake – Ban Gioc giant waterfall…\nNote: This is group joining, there is a different group each trip during your vacation.\nWho should participate? - This tour is suited for all, including children as well.\nPrice structure: - Price quoted is based on per person basis. \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!"}]},{"name":"14 Days Vietnam Beach Holiday","duration":14,"travelStyle":["Beach","Group","Partially Guided","Relaxing","Holiday"],"oldPrice":0,"price":1099,"summary":"Unearth the culture, diversity and beauty of Vietnam with a fantastic 14-day Vietnam tour with Phu Quoc island beach getaway. Known as Vietnam’s ‘Pearl Island’, Phu Quoc is an idyllic paradise, home to lush rainforests, azure blue seas and white sandy beaches. Leave the hustle and bustle behind and embark on an unforgettable trip to this breathtaking tropical paradise. Travel through rich farm land from Hanoi to arrive at the World Heritage site of Halong Bay. Cruise through the emerald waters to admire the thousands of limestone islands that pepper this magnificent bay. Soak up the sun and some Vietnamese culture on Phu Quoc Island, where white sands and tropical waters entice beachgoers from all over the globe. At your leisure time, can do Snorkeling, scuba diving and fishing which are the most popular water sports here. Check out the early-morning Duong Dong Market for an authentic local experience.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138561_cb51f33f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138561_cb51f33f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_7b1448a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_63071fb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_140dea47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_c427dc22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_b254168f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_cf98c6b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_84cc5dd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_f194716d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_b503724a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_e5d7f28d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_3f7e9de1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_543d9203.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_23f36501.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_c6263c61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_54e8f325.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_07adb1de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_dbaffbad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_bb36cc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_c77100c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138561_61251a4b.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta","Phu Quoc Island"],"timeline":[{"title":"Check in Hotel in Hanoi and Free and easy (Meals: No)","description":"Our driver will pick you up from the airport or train station to the hotel. Then you will have time for discovering by yourselves the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\nOptional Activities ( Not Included)\nHanoi Foodie Tour on foot (Traditional food tour and Old Quarter Sightseeing): https://swallowtravel.com/tour/hanoi-lovers-foodie-private-tour-ct500.html\nMy Village Show (Vietnamese Bamboo Circus with live traditional music ): https://swallowtravel.com/tour/my-village-show-ct504.html\nNight 1: Overnight at the hotel in Hanoi"},{"title":"Hanoi - Halong cruise (B,L,D)","description":"Have breakfast at your hotel.\n\n7.45-8.30: Pick-up at the hotel then travel to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours) with a short break on the way. The bay is dotted with sandy coves, grottoes and 1,600 limestone islands, which have been formed over millennia by wind and water erosion.\n\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30 Do kayaking through the magnificent landscape with Limestone Mountains, visit Titov Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay. After kayaking, you will be back to Lavender Cruises and join sunset party.\n\nThe cruise passes by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\nJoining our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities:\nJoin squid fishing on boat with our crews, playing card, karaoke or laze yourself with our happy-hour drinks at the bar. To end the day, spend a peaceful night aboard the boat beneath the night sky.\n\nNight 2: Overnight on Lavender Elegance Cruise/ Renea Cruise"},{"title":"Halong Bay – Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck.\n\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n\n08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n\n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n\n16:30: Arrive in Hanoi. End of the trip!\n\nNight 3: Overnight at the hotel in Hanoi"},{"title":"Hanoi – Night train to Danang (B)","description":"You will have breakfast at the hotel then have free time to explore Hanoi city till our driver picks you up then leaving to Hanoi railway station. You will catch a night train to Danang city.\nNote: There are 4-soft berth per tourist cabin with A/C. You may share it with other passengers. It takes around 16 hours from Hanoi to Danang. Please contact us if you want to upgrade to the private train cabin or internal flight from Hanoi to Danang city.\nNight 4: Overnight on the train"},{"title":"Hoi An arrival - Free and easy (Meals: No)","description":"12:35 Arrive in Danang train station. Pick up from train station to the hotel in Hoi An. Then enjoy the leisure time to explore Hoian by yourself. This is one of the loveliest towns in Vietnam, a small port that has traditionally been home to a thriving merchant community of foreign traders, influenced over the years by Europe, China, Vietnam and Japan. There are lively markets and quaint narrow streets lined with old buildings that have been converted into tailors, cafes and boutiques.\n\nNight 5: Overnight in Hotel in Hoi An"},{"title":"Hoi An: Tra Que cooking class and foot massage tour / My son holy land tour – Thu Bon river (B,L)","description":"You can choose one of the tours as below:\nOption 1: Tra Que cooking class and foot massage private tour\nTra Que vegetable village is located 3km north of the Old Town of Hoian. Thanks to the rich soil and unique source of underground water, the village has long been known for growing many kinds of vegetables such as basil, mint, lettuce, and coriander, etc. with which the traditional dishes of Hoian like “Quang” noodle, “Tam Huu” roll, “Banh xeo” Pancake, and fresh spring roll have gained their reputation throughout the country. Interestingly, Tra Que is named after the sweet-scented vegetables that spice up the everyday meals of the local people. Spending a day of living, working, and cooking with the local people in the Tra Que vegetable village will be a chance for you not only to discover the daily life of farmers but to become a real chef.\n8:00  Local guide pick up at the hotel, then you will go bicycle to Hoi An’s colourful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients you will use in the cooking lesson later. \n9:00 Ride pass small roads, rice padddy fields, take pictures of water buffalos, cow or farmers on daily working at their fields and fish – ponds. Explore many beautiful views of VietNam country side meet many warm-hearted local people. They will pass through the bendy small narrow roads in the village to one of the typical local houses and then how they are living, and farmer teach you how you plan the beansprouts. \n10:00  Take a rest with special welcome drink. You will be taken around the herbs garden where local farmers work on their field using organic methods from 300 years ago.Then you will enjoy foot massage with local herbs ( lemongrass, basil thai….) \n10:30  We will give you foot massage with some local herbs. \n11:00 Learn the traditional ways of preparing and cooking Vietnamese food.( Made some  flowers and animals by vegetables for decoration). After the lesson, enjoy what you have cooked. \n13:30 Return to the hotel. Trip ends\nOption 2: My son holy land tour-boat trip on Thu Bon river\n8:00 – 8:30: We will pick  you  up  at  your  hotel \n8:30: Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village  alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n9:45: Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4th to 15th century.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area  your guide will explain the history of the religious site which served as a burial place for the Cham monarchs centuries ago.\n12:00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river.  Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village. You will have a soft lunch (Quang-style noodle with pork and shrimp) served on boat.\n15:30: The boat trip will finish at Nguyen Hoang dock in the old town and back to your hotel.\nNight 6: Overnight in Hotel in Hoi An"},{"title":"Hoi An – Free day (B)","description":"You will have breakfast at the hotel. Today you have a free day to relax, go shopping or take a free bicycle to look around Hoian ancient town and the surrounding countryside. Many people like to just wander around and soak up the ambience of the town, perhaps visiting a couple of the old traditional Chinese mansions. Others shop till they drop, spend time at the tailors or head out to the beach outside town, which has glorious white sand.\nOptional Activities (not include):\nBa Na Hill – Golden Bridge Day Tour: https://swallowtravel.com/tour/bana-hill-golden-bridge-day-tour-with-buffet-lunch-ct489.html\nHue City Full Day Tour from Hoian: https://swallowtravel.com/tour/hue-city-from-hoian-with-small-group-ct492.html\n\nNight 7: Overnight in Hotel in Hoi An"},{"title":"Hoi An – Fly to Ho Chi Minh City (B)","description":"After breakfast at your hotel and you are free till get pick up to the airport. Today you will have a flight to Ho ChiMinh city and stay overnight at the most touristic area of Ho Chi Minh City.\n\nNight 8: Overnight in Hotel in Ho Chi Minh"},{"title":"Ho Chi Minh - Mekong delta deluxe full day tour (B,L)","description":"A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit.\n\n7:45-8:30: Our tour guide and driver will pick you up at your hotel and then start leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\n\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, enjoy the folk song music which performed by the local people. Visit the fruit plantation.\nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop.\n\nHave lunch at local restaurant. Break time.\n\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t joint the cycling trip.\n\n17:30: Drop off at your hotel. Trip ends.\n\nNight 9: Overnight in Hotel in Ho Chi Minh"},{"title":"Ho Chi Minh- Cu Chi tunnel deluxe half day tour (B/Light Lunch)","description":"7:45-8:30: Our tour guide and driver will pick you up at your hotel and then start driving to Cu Chi which located 70 km from the Ho Chi Minh City Center to the Northwest.  Cu Chi was known as the “area of steel” in the war time, and the tunnel systems were over 200km, which was considered the unbreakable underground village in the Vietnam-American war. It is legendary for its network of tunnels and is a popular destination for both Vietnamese and foreign visitors.\nThe trip to Cu Chi will take approximately one and a half hours bus driving.\n\nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun.\n\n13:00: Return to Ho Chi Minh city. Have lunch at the restaurant\n\n14:30: Get transferred back to your hotel. Trip ends.\n\nNight 10: Overnight in Hotel in Ho Chi Minh"},{"title":"Ho Chi Minh – take flight to Phu Quoc island (B)","description":"Have breakfast at the hotel then free and easy until our driver comes and picks you up to the airport to take flight to Phu Quoc island for relaxing time at beach resort or chilling out next to the pool for few days before flying home.\nNight 11: Overnight at hotel in Phu Quoc"},{"title":"Phu Quoc relaxing day (B)","description":"Have breakfast at the hotel then enjoy beach relaxing in Phu Quoc. Else you can consider to join some interesting daily tours with us. Please refer to this link for your reference: https://swallowtravel.com/tours/phu-quoc-day-tours-c460\nNight 12: Overnight at hotel in Phu Quoc"},{"title":"Phu Quoc relaxing day (B)","description":"Have breakfast at the hotel then enjoy beach relaxing in Phu Quoc. Else you can consider joining some interesting daily tours with us.\n\nNight 13: Overnight at hotel in Phu Quoc"},{"title":"Phu Quoc departure (B)","description":"Have breakfast at the hotel until get picked up to the airport to take flight home. Trip ends. \nDon’t hesitate to contact us if you need us to arrange internal flight to Hanoi or Ho Chi Minh to catch connecting flight back home or extend your stay at Phu Quoc island or visiting other places in Vietnam, Cambodia, Laos, Thailand and Myanmar."}]},{"name":"Vietnam Honeymoon Vacation","duration":14,"travelStyle":["Romantic","Honeymoon","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1250,"summary":"For a tropical country with nearly 3,500km of a coastal line stretching over 17 degrees of latitude, as well as over 3,000 islands and islets, the sky is the limit when it comes to a bonafide paradise for sun-worshipping honeymooners. However, there is more to this slender country than just a simple beach escape. This 14-day multi-center Vietnam honeymoon package is crafted to cater to your every whim while not compromising the romance.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/169795_891a0182.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/169795_891a0182.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_daeb3be8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_5525918b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_19ac594b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_b3f0b12e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_fba91942.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_7e9d8ce5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_a36bbfb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_af546a7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_d8505945.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169795_4a78cf29.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Day 1: Hanoi - Arrival","description":"Meal: NA – Accommodation: Hotel in Hanoi.\nYour guide will welcome you at the airport beside the baggage-claim area, and then take you to the pre-booked hotel. The rest of the day is at your leisure."},{"title":"Day 2: Hanoi City Tour","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Hanoi.\nPay a visit to Ho Chi Minh Mausoleum in the center of monumental Ba Dinh Square, where the embalmed body of Vietnam communist leader in the 20th century, Ho Chi Minh, is preserved. Your exploration is followed by a visit to the Presidential Palace and Ho Chi Minh’s stilt house in the garden at the back, as well as the neighboring diminutive One Pillar Pagoda – a symbol of Hanoi. A little further southwest is the tranquil Temple of Literature – the first university in Vietnam, inviting quiet contemplation. You have until noon to explore West Lake, 15km in circumference, covering a sizable part of Hanoi and offering colorful Vietnamese life filters with aesthetic temples scattered here and there such as Tran Quoc Pagoda and Quan Thanh Temple, fishermen casting their fish rods and nets, as well as Western-oriented cafes and bars.\nReturn the Old Quarter right at the heart of Hanoi and take a rickshaw ride to admire its signature tree-lined boulevards, saffron yellow French colonial villas and civic architecture landmarks. You will also pass by Hoan Kiem Lake, framed by winsome flame trees, along the way. At the end of the day, enjoy an authentic Water Puppet Show, the proudest and most intricate traditional folk art of the country."},{"title":"Day 3: Hanoi - Ha Long Bay","description":"Meal: Breakfast, Lunch, Dinner – Accommodation: On Cruise\nWhat better way to decompress the intense stress pent up over months of wedding planning and the big day itself than an indulgent overnight stay in one the New 7 Wonders of Nature? The astounding Halong Bay, dripping in natural beauty, is next on your Vietnam honeymoon agenda. After breakfast, you will set out on a 3-4 hour drive to the pier and embark on your amazing Halong Bay cruise around noon. As you cruise the waters of the UNESCO world heritage site, marvel at the grotesque limestone outcrops piercing through the emerald sea’s surface, such as Dinh Huong and Ga Choi Islands. Seize this chance to swim in the calm water or kayak around this ethereal seascape. Go back to the ship and watch the crepuscular rays fade into a riveting abyss of orange as it sails to a peaceful body of water for an overnight stay on board."},{"title":"Day 4: Ha Long - Hanoi - Flight to Da Nang","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Hanoi.\nKickstart your day with an early Tai Chi Session on the sundeck and you will be rewarded with an unparalleled visual glory of the sun revealing itself from behind the watery horizon. After breakfast, you will visit an enigmatic limestone grotto and then go back to the ship for a final glimpse of Ha Long Bay as you cruise back to the dock. Check out as the ship arrives at the harbor by noon and drive back to Hanoi for your flight to Danang. On your arrival, you will be transferred to hotel. Check in to your room and spend the night in the tranquil old town of Hoi An."},{"title":"Day 5: Hoi An - My Son Sanctuary","description":"Meals: Breakfast – Accommodation: Hotel in Hoi An.\nYou can never go wrong adding a cultural break to your Vietnam honeymoon agenda. After all, part of the excitement as newlyweds is learning new things together for the first time. In the morning, you will go back in time and visit My Son Sanctuary, also known as “the Angkor Wat of Vietnam” – a cultural heritage recognized by UNESCO in 1999. The majestic capital of the once-thriving Champa Kingdom with multiple Hindu temples devoted to the god Shiva, unfortunately, is now a cluster of ruins due to age and bombing, standing as a witness to the glorious bygone era."},{"title":"Day 6: Hoi An Free","description":"Meals: Breakfast – Accommodation: Hotel in Hoi An.\nToday you are free for lazing around the beach, strolling in the town, or engaging in any activity that tickles your fancy."},{"title":"Day 7: Hoi An - Hue","description":"Meals: Breakfast, lunch- Accommodation: Hotel in Hue\nThis morning, you will be transferred to Hue – the former capital city of Vietnam and one of its seven UNESCO World Heritage Sites, via the Han Van Pass. You will stop enroute to pay a visit to the Marble Mountain – famous for delicate stone sculptures and crafts, and arrive in Hue in the afternoon. After checking in to your hotel, spend the rest of the day on your own arrangement."},{"title":"Day 8: Hue - Ho Chi Minh City","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Ho Chi Minh City\nToday, our guide will take you to Minh Mang Tomb, located around 12 km to the south of Hue City center. Embark on a scenic boat trip on a Royal Dragon Boat to the historic seven-storey Thien Mu Pagoda dating back to the 17th century serenely perched on Ha Khe Hill, overlooking the shimmering waves of the Perfume River dreamily winding its way through the ancient capital. The picturesque combination of the Perfume River and Thien Mu Pagoda has been immortalized in poetry and silk paintings for centuries.\nTake in the poetic cityscape of Hue and let the hidden charm of Hue, manifested itself in the Imperial Citadel and the famed Forbidden City, transports you to a Vietnam of yore. The lively Dong Ba Market provides rich pickings for shoppers so you might want to consider doing some shopping before the guide sends you to the airport to board your next flight to Ho Chi Minh City. Upon arrival, you will be picked up and sent to your pre-booked hotel."},{"title":"Day 9: Ho Chi Minh city – Cai Be Floating Market (Mekong Delta)","description":"Meal: Breakfast, Lunch, Dinner – Accommodation: on Cruise\nYou will arrive in Cai Be at noon then be welcomed with a drink and introduced to the ship and crew. Check in to your cabin then have lunch and some rest while sailing along the Tien Giang River towards Cho Lach.\nAs you zigzag through the sand and rice barges in Cho Lach Canal, take in the sight of fruit drying factories and wooden-ship building yards unfurled along the way.\nDrop by a village on the banks of the Mang Thit River to get a feel of local life and absorb the local residents’ hospitality in its truest form. You will also have a chance to visit the nearby orchard and rice fields before heading back. Chill out with a drink on the deck and watch the reddish-orange hue of the sky deepens as dusk creeps over the horizon. Dinner will be served by the crew as the Bassac cruises the waters of the Mang Thit River. The Bassac will be anchored just downstream from the little Tra On Floating Market, and will stay there for the night."},{"title":"Day 10: Can Tho – Saigon","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Saigon\nBreakfast will be ready from as early as 6:30 am as the cruise sails downstream towards Can Tho.\nCheck out as you arrive at Cai Rang Floating Market. You will then be transferred onto a local boat to visit the floating market, the nearby arroyos, as well as the gardens before returning to the Ninh Kieu Pier.\nThe mid-morning arrival in Can Tho marks the end of on-shore services."},{"title":"Day 11: Saigon – Flight to Phu Quoc Island","description":"Meals: Breakfast, Dinner – Accommodation: Phu Quoc hotel\nA simple sun, sea, and sand Vietnam honeymoon – with a harmonious combination of cutting-edge amenities, natural beauty, and an overflowing sense of romance – is a must when it comes to unwinding and celebrating your nuptial. You are free in the morning until the check out time, and then get transferred to the airport for your flight to Phu Quoc. A candle lit romantic dinner  for 2 with a bottle of sparkling wine is a perfect way to revel in each other’s company and the joy of martial bliss."},{"title":"Day 12 – Day 13: Phu Quoc Free at Novotel Phu Quoc Resort (5 star)","description":"Meals: Breakfast – Accommodation: Phu Quoc hotel\nThese two days are at your leisure to discover the beautiful island, relaxing, snorkeling, diving, or just idling the day away – whatever that tickles your fancy."},{"title":"Day 13: Phu Quoc Free","description":"Meals: Breakfast – Accommodation: Phu Quoc hotel\nFree at your leisure to discover the beautiful island, relaxing, snorkeling, diving, or just idling the day away – whatever that tickles your fancy."},{"title":"Day 14: Depart from Ho Chi Minh City","description":"Meals: NA – Accommodation: N/A\nToday is the last day of your Vietnam honeymoon. You will flight back to Ho Chi Minh City for your departure flight, hearts filled with sweet and life-enriching memories to be remembered for the years to come."}]},{"name":"Natural Vietnam - 10 Days","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":625,"summary":"Vietnam is considered a poor developing country after hundred year in the war. But Mother Nature gave Vietnamese a lot priceless gift. Our country is filled with natural beauty. Spectacular mountainous area, amazing limestone in Halong Bay, biggest cave in the world … are all the must go places in Vietnam. Within 10 day you have chance to discover all the best natural site in Vietnam as well as our unique culture. Let’s join us …","highlights":["Be amazed by the locals at the Cai Be Floating market","Embark on a cruise to the mystical Phong Nha Caves","Savour Vietnamese cuisine at the Hanoi food markets"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/102164_fd1eb769.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/102164_fd1eb769.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_65ab55b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_b54b4f68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_372742fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_c958d677.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_f1aca803.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_115ab050.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_1bad3c55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_d777118c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_803b2dff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102164_0a79d09e.jpg"],"destinations":["Hanoi","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi - airport pick up - Check in hotel (Meal: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself."},{"title":"Day 2: Hanoi - Halong Bay day tour (Meal: B,L)","description":"08:00- 08:30 AM: Picking up from hotel/stay and depart for Halong Bay \n10:30 Soft break on the way to stretch the legs\n12:15 Arriving in Ha long bay harbor \n12:30 Boarding cruise with welcome drink \n13:00 Safety briefing \n13:15 Lunch with Vietnamese cuisine & seafood\n14:00 Stop at Ba Hang cave for kayaking or rowing bamboo boat or relaxing \n15:00 Visiting Thien Cung cave (the cave of the heavenly palace - famous for its stalagmites and stalactites, the cave has only opened to the public since 1998 )\n16:30 Disembarking to get on shuttle bus \n18:00 Stopover to stretch your legs \n20:30 Saying goodbye to you at your hotel."},{"title":"Day 3: Hanoi – Street food tour – Overnight train to Quang Binh (Meal: B,L)","description":"At 11.00, our tour guide will welcome you at your hotel lobby, then start walking around 4Km in old quarter \"36 old streets\" to visit some famous and specialized- food families or stalls/ local restaurants, shops where they run their business everyday, certainly you will watch and taste around 6- 8 particular dishes, we can customize vegetarian or special food too.\nSpecial thing that tour guide would like to introduce some popular authentic food in lovely mini restaurants (not luxury restaurants) where you feel comfortable to sit down and enjoy some favorite dishes and nice drinks too.\nIt's interesting to hear from tour guide about the history of the old quarter in Hanoi, it is thousand years old and today retains much of the old flavor that made the area special in earlier times, each street was the exclusive domain of one trade (guilds) so there are whole streets of blacksmiths, silver shops, paper shops, headstone makers and more. Originally there were just 36 old streets in the old quarter but today there are more than 50 streets.\nIt is very difficult to find some local food stalls and mini restaurants on your own in hidden alleys and sidewalks, certainly the best way to make it easy is joining with Go Asia Travel, taking part in this special tour to learn about Vietnamese cuisine, culture, people and language.\nAfter all. Food on Foot Tour will give you an unique experience to try the foods of the local Hanoi people, we ensure the food is handled hygienically and provide a comfortable venue for the tastings. The benefit also goes back to the vendors or restaurants/ families as we buy directly from them.\nAt 14.30 our tour guide say goodbye to you, and will help you order taxi or show you direction back your hotel. You are free in Hanoi till our driver come to pick you up for the overnight train to Quang Binh."},{"title":"Day 4: Quang Binh – Phong Nha cave 1 day tour - Hue (Meal: B,L)","description":"Arrive in Quang Binh, our driver will pick you up then transfer you to the hotel for a rest and you could have breakfast there.\n10.30 - 11.00 AM Pick you up at your hotel and leave for Phong Nha in Quang Binh Province. Take a boat cruise on the Son River to visit Phong Nha Cave with its grottos (Bi Ky, Cung Dinh, Tien... and Tien Son).\nHave Lunch at local restaurant.\nAfter lunch get on the bus return to Hue\nArrive in Hue at about 07:00 PM."},{"title":"Day 5: Hue city tour (Meal: B,L)","description":"07.45 - 8.30 AM, We will pick up you at your hotel & transfer to Visit 04 famous sites: Minh Mang Tomb, Khai Dinh Tomb, Tu Duc Tomb, Conical Hat Making Incense Making Village.\nAfter having lunch, visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank\nAfter you visit Thien Mu Pagoda, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\nThe tour ends at 16.30 "},{"title":"Day 6: Hue – Bus to Hoi An (Meal: B)","description":"8.00 AM Our driver will pick you up at the hotel for a transfer to Hoi An. The van makes stops for sight-seeing at the following locations: Marble Mountains, Hai Van Pass, Lang Co Beach."},{"title":"Day 7: My Son tour (Meal: B,L)","description":"7:45 – 8:30: The bus and tour guide pick you up at your hotel \n8:30 : Leaving Hoi An for My Son HolyLand.\n9:30: Arriving in My Son – the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of ancient buildings at of the Champa Kingdom with our tour guide.\n12.00: Leaving My Son for Cau Lau boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!"},{"title":"Day 8: Check out – fly to Ho Chi Minh – check in hotel (Meal: B)","description":"Today you are free in Hoi An Town till our driver come to pick you up for the transfer to Da Nang for the flight to Ho Chi Minh city. \nArrive in Ho Chi Minh, our driver would pick you up then transfer you to the hotel. You are free in the city today"},{"title":"Day 9: Mekong Delta tour (Meal: B,L)","description":"7:30 – 8:00 Picking up from hotel\nStarting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30Start the motorized boat to visit the Cai Be Floating market, experience how people\nexchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn. \nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature. \nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City. 18:30 Arrive in your hotel."},{"title":"Day 10: Check out – Pick up to airport – Departure (Meal: B)","description":"Today you are free until our driver come to pick you up and transfer you to the airport for your flight. "}]}]