[{"name":"Vietnam - South to North - 10 days (Free 01 local SIM Card with data + Free 2 Tickets of Water Puppet Show)","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":539,"summary":"Discover Vietnam from Ho Chi Minh city to Hanoi in 10 - day tour package. \nRoute: Ho Chi Minh City - Hoi An - Hanoi- Halong Bay - Hanoi\nYou’ll discover the hustle and bustlecrazy Ho Chi Minh city (formly named Saigon), experience the water life in Melong Delta, discover the underground network tunnels during the war, biking along the acient town  to explore the city of lantern Hoi An, soak up fascinating local culture, learn to cook delicious Vietnamese food, relax on beautiful beaches, party the night away, immerse the beauty of capital Hanoi, experience the stunning Ha Long Bay, go kayaking,and much more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197660_5e886092961f9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197660_5e886092961f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e886092961fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296200.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296201.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296203.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296204.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296206.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296207.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e88609296209.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e8860929620a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197660_5e8860929620c.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Ho Chi Minh Arrival","description":"We'll pick you up from the airport and take you to the Hotel in District 1, Ho Chi Minh city. You'll then have plenty of time to recover from your flight, chill out.\n\nOvernight in Hotel in Ho Chi Minh (Meal: No)"},{"title":"Mekong Delta","description":"Today, do the day trip to Mekong Delta.  You will be picked up at your hotel in the morning. We’ll explore the incredibly lush green beauty of the Mekong Delta by boat, learn first-hand how the locals live, visit local villages and experience daily life on the Mekong. \nThen We return Ho Chi Minh city. Stay overnight at hotel. \nMeals (B- L)\n\n\n"},{"title":"Cu Chi Tunnels","description":"Today we’ll explore Cu Chi Tunnels. A fascinating network of underground tunnels used as supply routes, hideouts and living quarters by guerrilla fighters during the Vietnam War. We’ll arrive back to Ho Chi Minh City in the afternoon.\n\nOvernight at hotel. Meals ( B- L)"},{"title":"Fly to Hoi An","description":"Check out at hotel then take a 1-hour flight to Danang. Here, you 'll be picked up and transferred to Hoi An by private car. Check in hotel. Rest of the day is leisure and free time. \n\nOvernight at hotel in Hoian center. Meal (B)"},{"title":"My Son Sanctuary","description":"After breakfast at hotel, We' ll start the day tour to My Son - the ancient citadel of Champa's Kindom in the 4th century. My Son is recognized World Cultural Heritage.\n\nToday,  We'll have 2 hours to discover the site by walking throughout the landscape, learning histories of the huge religious complex with over 70 towers and temples of different architectures as welll as enjoy the traditional performances of Champa People.\nThen, We 'll visit local house to learn how to make rice-paper, you will enjoy your own hand-making product later on.\nBefore getting back hotel, we take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery \n\nOvernight at hotel (Meals: B-L)"},{"title":"Hoi An - Night train to Hanoi","description":"Free day for you. Cycling to beaches or cycling along the ancient town. Try cofee and local food or do clothes tailored in Hoi An. \nIn the evening, be transferred to Danang Railway Station to catch the night train to Hanoi (16 hours journey, you will see the best scenery along way)\n\nOvernight on train - you 'll stay in 4-berth soft cabin. Meal (B)"},{"title":"Arrive Hanoi","description":"Arrive Hanoi in the mid day then check in hotel. Rest of your time is relaxing and free exploring the Old town of .  \nGet Free tickets for evening Water puppet show at Thang Long Water Puppet Theatre \nOvernight at hotel in Hanoi. Meal (No)"},{"title":"Halong Bay","description":"This day is the most amazing day. We’ll depart for  2 Day / 1 Night Boat trip to the stunning World Natural Wonder of Ha Long Bay. We’ll cruise on beautiful emerald green waters on our traditional Vietnamese ‘junk’ boat through towering limestone islands topped with rainforest. We’ll do Cave exoloring, Kayaking, Cooking class on boat then spend the night on the boat.\n\nMeals (B- L- D)"},{"title":"Halong Bay - Back Hanoi","description":"See more of Halong Bay, do more activites in 2nd day. Cruising back to Habour to go back Hanoi.\nReturn Hanoi around 16.00 pm\n\nStay overnight at hotel in Hanoi. Meals (B- L)\n"},{"title":"Hanoi Departure","description":"Your adventure comes to an end. You can either check out and flight back home, stay on longer in Vietnam or continue your travels. \n\nGoodbye"}]},{"name":"Classis Sai Gon 6 Days 5 Nights","duration":6,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":257,"summary":"Asia Focus Travel provide 6 days 5 nights start and end in Ho Chi Minh City! With the adventure tour Sai Gon Highlights 6 days 5 nights, you have a 6 day tour package taking you through Ho Chi Minh City, Vietnam and 3 other destinations in Vietnam. Sai Gon Highlights 6 days 5 nights includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193652_5e450e93d7781.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193652_5e450e93d7781.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193652_5e43cc4a13c1b.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Chau Doc"],"timeline":[{"title":"Ho Chi Minh Arrival (No Meal)","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking\ninto the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious\ncentre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the\nteeming metropolis are the timeless traditions and beauty of an ancient culture\nOvernight in Sai Gon"},{"title":"Ho Chi Minh City tour and Cu Chi Tunnel (B,L)","description":"Breakfast at your hotel\nPick up: 7:30 to 8:15\nCome back: 18:30\nthe morning trip to visit Independence Palace, also known at the Reunification palace, was built on\nthe sight of the former Norodom palace. The Independence palace is a widely known landmark of\nHo Chi Minh City and was designed by the architect Ngo Viet Thu. Continue seeing the beautiful\nstructures from the French Colonial times such as the Notre Dame Cathedral, the historic Central\nPost Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast\ndisplay of the both the Indochina wars.\nHave lunch at local restaurant.\nDepart for Cu Chi tunnel, the trip will take approximately one and a half hours bus driving. Upon\narrival, before exploring the tunnels, you will have some short introduction followed by introductory\nvideo about how the tunnels were constructed and how the people survived in the harsh conditions\nof the war time. Then, spend your time to explore the remaining area and tunnel systems which\nincluded the special constructed living areas with kitchens, bedrooms side by side with other martial\nfacilities like storage, weapons factories, field hospitals, and command centers helping whoever lives\ninside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and\ndangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special\ntea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun.\nReturn to Saigon\nOvernight in Sai Gon "},{"title":"Ho Chi Minh City – My Tho – Ben Tre – Can Tho (meals incl:B,L/D)","description":"8.00am: Pick up at your hotel in HCMC ( To be advised ). Depart for My Tho .Take a boat ride along the river , view the stilt houses and the fruit plantation along the river bank. Proceed to Tortoise island for lunch . Then a boat ride to An Khanh – a less touristy attraction in Ben Tre and enjoy cruising on a hand-rowed sampan under the shade of water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through the fruit plantations and villages. Proceed to Can Tho and check in on arrival.  \nOption: stay at home stay in Can Tho Transfer by motor boat to a small village in Cai Rang district. Check into your riverside cottage. In the afternoon, go cycling or trekking around the village to experience the rural lifestyle of the Mekong Delta people. Join a family as they prepare dinner, then share the meal with them. Enjoy an evening of traditional folk music with your neighbors. Overnight in your riverside cottage\n"},{"title":"Can Tho – Cai Rang Floating market – Chau Doc – Tra Su Sanctuary (meals incl: B/L)","description":"After breakfast, take a boat trip to explore the picturesque tributaries of the Lower Mekong River (Bassac River), then visit the Cai Rang floating market, which are the best in the region. You will probably have tried Vietnamese vermicelli soup, so now go and see how it is made. Then wander around the village and talk with the local people. Learn how to cross a “monkey bridge” which is built from a single bamboo.\nLunch at the local restaurant . \nProceed to Chau Doc .Take the boat trip through the floating village and visit the fish farm to see how the Mekong Delta people raise fish from their floating houses. Visit the Cham minority in their traditional weaving village . Summit of the Sam Mountain, admire the beautiful landscape around the Vietnamese-Cambodian border. Visit the carved pagoda. Continue the tour to visit Tra Su , getting to the wild birds Sanctuary , cruising smoothly with small boats to discover the arrays of splendid canals deep into the forest.\n"},{"title":"Chau Doc - Sai Gon (Meal included: B,L)","description":"Following breakfast in the early morning, go for a short walk before pick-up at the river bank. Journey to the fish farms and floating village of the Cham community, before taking the bus to back Ho Chi Minh City. \nOvernight in Sai Gon "},{"title":"Sai Gon Departure (Meal included: B)","description":"Breakfast at hotel then fee and easy until the driver pick you up at your hotel transfer to Tan Son\nNhat airport for departure flight. End of trip!"}]},{"name":"7 Days in Southern Vietnam","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":745,"summary":"Exploring the dynamic heart of Vietnam - Ho Chi Minh City as known as Saigon. Enjoying the boat trip on Mekong River to see the colorful floating markets and discover the lifestyle of Mekong people","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09790da.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09790da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b099e39b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09a4231.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09aa221.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09b037e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09bb18d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189181_5df44b09b5c09.jpg"],"destinations":["Ho Chi Minh City","Vinh Long"],"timeline":[{"title":"WELCOME TO HO CHI MINH CITY","description":"Upon arriving at Tan Son Nhat airport, you will be transferred to your hotel downtown. As the largest of Vietnam's cities, the hustle and bustle of life co-exists with 300 years of timeless traditions and the beauty of a mixed colonial-orient culture. The remainder of the day is free for you to relax. Overnight in Hochiminh city"},{"title":"HO CHI MINH CITY FREE DAY (B)","description":"There is a free time to relax or explore Hochiminh city on your own way.\nOvernight in Hochiminh city\n"},{"title":"HO CHI MINH - CU CHI TUNNEL – CITY TOUR (B)","description":"After breakfast, depart for Cu Chi tunnels.\nArriving at Cu Chi tunnels (Ben Dinh) and proceeding to an underground hut to watch a short video and presentation about Cu Chi tunnels before having a real hand-on experience of what it took to live in the tunnels. Afterward, test tasting the steamed tapioca root which is the main staple food in Cu Chi during the war. For those interested, there is an opportunity to fire off an AK47 or MK16 with real ammunitions at the nearby shooting range. Leaving Cu Chi tunnels at noon and returning back to HCM city for lunch at own expense.\nAfternoon, visiting War Remnants Museum - originally opened in September 1975; it displays old military equipment and other related items from Vietnam War. Afterward, continuing seeing the Reunification Palace, formerly known as the Presidential Palace. The place symbolizes the end of Vietnam War when a North Vietnamese army tank went through its gates. Then taking a short stroll to see Notre Dame Cathedral and General Post Office, they are the beautiful examples of architecture from the French colonial period.\nBack to hotel for leisure and overnight.\n"},{"title":"HO CHI MINH FREE DAY (B)","description":"There is a free time to relax or explore Hochiminh city on your own way.\nOvernight in Hochiminh"},{"title":"HO CHI MINH –CAI BE – VINH LONG – HO CHI MINH (B, L)","description":"Today you'll have a full day excursion to Mekong Delta. You will depart for Cai Be (3h) around 8am. Enjoy the green paddy fields stretching towards the horizon. When you arrive in Cai Be, you’ll board a motorized boat that takes you to the floating market, a sight that you’ll see no where else in the world. Next, your row boat will zigzag through a maze of shadow canals to arrive at a great orchard where you can freely taste many of the amous tropical fruits of Vietnam and watch locals’ as they complete their daily chores. Then we’ll see how coconut candy, crispy rice cake and ceramics are made here (served free with premium hot tea.) After this, you will roam through a village by bike to check out several rural shops or you can relax in a hammock for a short rest. Then you will head back to Hochiminh for a good night’s sleep"},{"title":"HO CHI MINH FREE DAY (B)","description":"There is a free time to relax or explore Hochiminh city on your own way.\nOvernight in Hochiminh"},{"title":"HO CHI MINH DEPARTURE","description":"There is a free time to relax or further explore Hochiminh. The tour ends after your transfer to Tan San Nhat Airport for departure."}]},{"name":"Northern Vietnam Hanoi - Ninh Binh - Halong short group tour 5 days","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":275,"summary":"Start and end in Hanoi! With the sightseeing for the Highlight of  Northern Vietnam - 5 Days, you have a 5 day tour package taking you through Hanoi, Ninh Binh and Ha Long Bay for a 5 Days includes accommodation as well as an expert guide, meals, transport and more.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f716c4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f716c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f7d658.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f7ecfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f805f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f81c6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f83353.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158928_5e34ff1f8493b.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Arrival Hanoi -Private Car","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag.   You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.  After enjoying the first day yourself and return to the hotel for a relaxing sleep.\nMeal: None\n"},{"title":"Hoa Lu Ancient citadel - Tam Coc Nature Boat Trip full day (B/L)","description":"7:45-8:30 AM: Picked up by our tour guide at your hotel at The Old Quarter, then depart for Ninh Binh city towards to the South of Hanoi. Have a short-break en route.\n10:30 AM: Arrive in Hoa Lu, visit Hoa Lu - The Acient Capital and the remaining two temples dedicated to King Dinh & King Le.\n11:30 AM: Go back to the bus, and then from here drive to Tam Coc grottoes (16km from Hoa Lu). \n12:00 AM: Arrive Tam Coc wharf.\n12:15 AM: Have a lavish buffet lunch at a local restaurant.\n01:30 PM: Take an exciting sampan boat ride in Tam Coc grottoes (Halong on land).\n03:30 PM: Proceed a cycling along country lane to enjoy the beautiful scenery of lush paddy fields and discover real countryside of Vietnam.\n04:30 PM: Get on the shuttle bus to come back Hanoi.\n07:00 PM: Arrive in Hanoi, go back to our hotel in The Old Quarter. Day Trip ends.\n\n"},{"title":"Hanoi - Halong Bay Shared Cruise And Bus (B/L/D)","description":"•\t07h45: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n•\t10h00: Stopover on the way for a refreshment break.\n•\t12h00: Embark at Ha Long wharf – Break and photography time\n•\t12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n•\t13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n•\t15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n•\t19h00: Vietnamese style set dinner is served on board.\n•\t21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat.\n•\tMeal: Breakfast, Lunch and Dinner\n"},{"title":"Halong Bay - Hanoi (B/L)","description":"•\t07h30: Have breakfast and enjoy sunrise on the bay.\n•\t09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n•\t10h30: Have lunch while cruising back through Ha Long Bay to the pier\n•\t11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n•\t12h00: Return from Ha Long to Hanoi.\n•\t14h00: Stopover on the way for a refreshment break.\n•\t16h00: Arrive in Hanoi. End of the trip.Activities\n•\tSwimming\n•\tKayaking\n•\tCooking demonstration\n•\tSquid fishing\n•\tExcursions to caves, grottos, beaches & fishing village\nWhat to bring \n•\tSun block, Camera + Film, Insect repellent, Original Passport, hat, Swimming clothes and Sun glasses\n\nMeal: Breakfast, Lunch.\n"},{"title":"Hanoi Departure (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Vietnam Compact Tour 6 Days 5 Nights (From Ho Chi Minh City to Hanoi)","duration":6,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":505,"summary":"Vietnam compact tour 6 days 5 nights is highlight of Vietnam included Ho Chi Minh city and Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f6e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc4695f7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193210_5e3bcc6b4ee6a.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay"],"timeline":[{"title":"Ho Chi Minh Arrival (No Meal)","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. \nOvernight in Saigon."},{"title":"Sai Gon - Cai Be Floating market (B,L)","description":"Breakfast take away.\nPick up: 6:30 to 6:45\nCome back: 17:30 to 18:00\nPick up at your hotel in Ho Chi Minh City. Depart for Cai Be by car/van via Trung Luong Express\nHighway. On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the\nlocals trading fruit and many other commodities on board their vessels. Visit a small family business\nto see how coconut candy and crispy rice popcorn are made. Then wander into the small villages\nand visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk\nmusic.\nKeep cruising to experience the charms of the Upper Mekong Delta, where you can immerse\nyourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese\ndishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax in the\nhammocks to get back your energy.\nCycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn\nmore about the local daily life in the Mekong delta. Take a boat ride back to Cai Be and meet your\nbus for the trip back to Ho Chi Minh City.\nOvernight in Sai Gon "},{"title":"Sai Gon - Cu Chi tunnel - Flight to Hanoi (B,L)","description":"Breakfast at your hotel. \nPick up at your hotel and depart to Cu Chi will take approximately one and a half hours bus driving. \nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon at 12:30 \nFree time until to my driver will pick you up at your hotel transfer to Tan San Nhat airport take flight to Hanoi \nWelcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight at hotel in Ha Noi\n\n"},{"title":"Hanoi - Ha Long – Sung Sot cave- Titop island (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on cruise \n"},{"title":"Day 5: Ha Long Bay - Hanoi (Breakfast, Lunch)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi, drop you off at the hotel, Check in hotel\nOvernight in Hanoi "},{"title":"Hanoi City tour Half Day - Departure (B,L)","description":"07:40 - 8:30 Meet your tour guide .\nOPTION 1: TUESDAY, THURSDAY, SATURDAY, SUNDAY) and Monday, Wed and Frid we will give you another option to suitable with your flight \nStart the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nArrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\n"}]}]