[{"name":"Hanoi Tour plus Overnight on Margaret Cruises 5*","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"Spread over 4 decks with 25 spacious cabins\nBrand- New and luxury 5 star boat\nHi-end services by well-trained staffs\nSpend 1 Night on Luxury Margaret Cruises\nIncluded 3 Nights in Quoc Hoa Premier Hotel 4*","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161337_b8e90ec8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161337_b8e90ec8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_8348c880.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_08e6d717.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_17801b92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_3ee47250.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_89e517d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161337_715f6c5f.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Margaret Cruises Halong Bay","description":"7: 30 - 8: 00 Pick up at your hotels in Hanoi Old Quarter\n10: 00 - 10: 30 Stopover at Hai Duong province for refreshment about 20 – 30 minutes\n11: 30 Arrive at Tuan Chau harbor\n12: 00 - 12: 30 Transfer to Margaret Cruises. Check in your cabin\n13: 30 Enjoy a nice buffet lunch at our restaurant while the cruise goes ahead to Halong Bay\n15: 00 Continue to explore Halong Bay. Only 1 option will be chosen depending on the weather conditions and seasons:\nOption 1: Visit Titop Island for swimming and trekking\nOption 2: Visit Pearl Farm Village\nAfter that, visit Luon cave area by kayaking\n17: 15 Enjoy Sun Set party with Juices, Tea, Coffee and fruits on Margaret Sky Bar.\nOption: Massage service available.\n17: 45 join cooking demonstration: How to make Vietnamese spring rolls - traditional Vietnamese food.\n19: 00 Enjoy set-menu dinner (unique blend of Asian and European food)\n20: 30 join the Squid Fishing activity. Free time on the boat."},{"title":"Day 3: Margaret Cruises - Hanoi","description":"6: 30 Practice Tai Chi class. Tea and coffee are served.\n7: 30 Light breakfast served\n8: 30 Visit Sung Sot cave\n10: 00 Check - out time\n10: 30 Enjoy buffet brunch\n11: 30 Disembark to Tuan Chau Wharf\n12: 15 - 16: 30 Return to Ha Noi. End of the trip"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"5 Day Small Group Hanoi and Halong Bay Tour Package","duration":5,"travelStyle":["In-depth Cultural","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":699,"summary":"Explorer the beautiful capital of Vietnam, Hanoi and the world-famous Halong Bay on this 5-day tour package.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/97667_97510008.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/97667_97510008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_34a35e6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_37d84b13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_3ff30065.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_5aaa0085.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_f2b59a77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_7acb44e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_17d2c165.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_34e6abbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_a3292fd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97667_f110cfc8.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Customer will be pick up at the airport with the private car to send to the Hotel in Hanoi by 1 hour driving.","description":"Taking a rest then after that talk a short walk around and enjoy the Water Puppet show in the early evening time"},{"title":"Day 2: Enjoy breakfast at the hotel.","description":"Getting transferred around \n08.00 – 08.30 AM by private tour guide & driver for 3.5 hours to Halong Bay. Arrive to Halong \n12.00 – 12.30 PM Welcomed by crew members & having cruise briefing while enjoying your welcome drink then checking in to the room\nAt 01.00 – 01. 30 PM Have lunch while cruising in the magnificent Halong Long Bay.\n03.30 – 04.30 PM Kayak among the hidden areas of the bay, around the Luon Cave area. \n16h30 Back to the cruise then around \n04.30 – 05.30 PM Cruising to Soi Sim island. Go swimming and relaxing at the beach of Soi Sim or climb up to the top of the island for a panorama view of Halong Bay. \n05.30 PM Return to the main boat for a shower. Relax or snap photos as the sun starts to set.\n7.00 PM Dinner is served. Socialize with other guests, fish for squid, or just laze around. Overnight on board."},{"title":"Day 3: 06.30 – 07.00 AM start your day with Tai Chi exercises or a photo hunt","description":"07.00 – 08.30 AM have breakfast on board. \n08.30 AM Transfer to a Day Boat for a cruise to Lan Ha Bay. \n08.30 AM – 12.00 PM .Explore the Light and Dark Cave by kayak. Swimming and relaxing at the beaches \n12.00 – 02.00 PM Return to the day boat. Enjoy a barbecue lunch on board. Kayaking more to explore Lan Ha Bay or just leisure at the beaches. \n02.00 – 02. 30 PM. Visit a floating Pearl Farm and learn the technique for making high quality pearls.\nIf the weather permits, we continue along to Three Peach Beach for swimming.\n02.30 – 04.00 PM Cruise back to the main boat 07.00 PM Enjoy dinner and overnight on board"},{"title":"Day 4: 06.30 – 07.00 AM Join Tai Chi exercises or a photo hunt.","description":"07.30 – 08.30 AM Have breakfast at sunrise. \n08.30 – 09.30 AM. Explore the amazing Sung Sot Cave – the nicest cave in Halong Bay. \n09h30. Return to the boat then fleshing up and checking out of the cabin. \n09.30 – 10.30 AM continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more. \n10h30 – 11h30 while heading back to the harbor, watch the cooking demonstration before enjoying a traditional Vietnamese lunch. \n12.00 – 12.30 PM Transfer back to your hotel in Hanoi city center. \n04.30 – 05.00 PM. Recheck in to the hotel again take a short rest to join the Hanoi Food Tour around \n7.30 PM to enjoy the most special Hanoi street cuisine. "},{"title":"Day 5: In the morning, have breakfast at the hotel and then free at leisure until transfer to Hanoi airport. End of services","description":"Other Tours"}]},{"name":"NORTH & SOUTH OF VIETNAM 7 DAYS","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1207,"summary":"Route: Hanoi - City Tour - Halong Bay Day Cruise – Hochiminh – Cuchi Tunnels – Mekong Delta\n(Vinhlong) – Ho Chi Minh","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/173383_8b9befe2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/173383_8b9befe2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_2a51ad7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_c28e19be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_eea7205f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_0d4e86e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_95183f08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_5f2fad71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_f9a99494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_c5dbe043.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_f3080241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173383_12874a50.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HANOI ARRIVAL","description":"Arrive at Noi Bai International Airport, you will be welcomed by our local guide and transfer to\ncity center. Arrive Hanoi, check-in the hotel and enjoy your free time.\nYour visa should be pre-arranged, or be sure that your visa-on-arrival letter is in your carry-on\nluggage. Please go to custom desk as your first point of entry into the country and present these\ndocuments for visa upon arrival.\n\nOvernight at hotel in Hanoi."},{"title":"HANOI FULL DAY CITY (B/L)","description":"The city tour begins with a visit to the Ho Chi Minh Complex which features the life of Ho Chi Minh, the nation’s founder. At the complex, visit the Ho Chi Minh Mausoleum, where the nation’s founder’s body is preserved (closed on Monday, Friday and through October - November), the colonial Presidential Palace, originally the French Governor Office and a fine example of French architecture in Hanoi, and the rural style Ho Chi Minh’s house on stilts where Ho Chi Minh lived and worked. Stop by one of Hanoi’s icons, the One Pillar Pagoda, built in the 11th Century in dedication to Bodhisattva Avalokiteshvara or Buddha of Compassion and reminiscent of a lotus blossom rising from a pond. \n\nContinue to the Temple of Literature, known as the first university of Vietnam built in 1070 by the Ly Dynasty to honor Confucius, sages and outstanding Vietnamese scholars. Afternoon, continue the tour to one of the following museums of choice namely the Museum of Fine Arts, the National Museum of Vietnamese History, the Museum of Revolution, the Museum of Military History or the Museum of Ethnology. Next, head for Hoan Kiem Lake, the center point of Hanoi whose name “The Return Sword Lake” originated from a legend of a sacred sword and home to a rare endangered giant turtle species and visit Ngoc Son Temple on the lake. Take a one-hour cycle tour of the Old Quarter of Hanoi with its ancient streets representing traditional trades from the past. Finish the tour at the Thang Long Opera Theatre with a traditional Vietnamese water puppet show. \n\nOvernight at hotel in Hanoi."},{"title":"HANOI - HALONG OVERNIGHT ON JUNK (B/L/D)","description":"After breakfast, transfer to Ha Long Bay, which is about 160 km or 2.5-hour drive away. The transfer is approximately 3 hours. You will see some rural areas of the Red River Delta with plenty of chances to take photos of Vietnamese farmers working in paddy fields and you may stop on the way to admire the local scenery. Arrive in Ha Long City at 11:30 AM and check in aboard the booked junk right after the welcome drink is served. Start cruising while having lunch on board and enjoy the mighty bay view. Ha Long Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage\nsites whose formation dates back 500 million years, consists of around 2,000 karst islands and\nislets scattered over an area of 1,553 km2. After lunch, take a short trek to a nearby summit for a panoramic view of the bay dotted with golden sails, go swimming on a quiet beach or sunbath on the sundeck. Later in the afternoon, you will visit an interesting fishing village with an opportunity to interact with local people who have been living in the bay for almost three generations. An optional kayaking trip is available weather permitting. Back onboard enjoy a lavish dinner and enjoy the bay view at sunset. \n\nOvernight on board."},{"title":"HALONG - HANOI - HOCHIMINH (BRUNCH)","description":"DOMESTIC FLIGHT TICKET HAN – SGN IS INCLUDED\n\nIn the morning, refresh your body and mind with a Tai Chi exercise on the sundeck at the break\nof dawn. Have tea and coffee onboard and continue exploring Ha Long Bay sailing across its 2000 islets and visiting some of its major highlights. Normally, check out at 09:30, have a buffet brunch while cruising back to shore. Disembark at 11:00 AM to transfer to Hanoi capital.\n\nFree at leisure until meet our guide then transfer to airport for flight to Ho Chi Minh. Flight time is approximately 2 hours Arrival Tan Son Nhat Airport, you are transferred to town by private car & guide. The transfer from airport to hotel is approximately 30 minutes. Check in & relax. \nOvernight at hotel in Hochiminh."},{"title":"HOCHIMINH FULL DAY - CUCHI TUNNELS (B/D)","description":"Morning, meet your guide and transfer about 75 km North-west of downtown Ho Chi Minh City.\nDiscover the famous Cu Chi Tunnels, which were once a major underground hideout and resistance base of Viet Cong forces during the two wars against the French and the Americans. The tunnels, entirely hand-dug, formed a highly intricate network of interlinked multilevel passageways at times stretched as far as the Cambodian border and totaling over 120 km in length. Its complexity was beyond imagination containing meeting rooms, kitchens, wells, clinics, schools, depots, trenches and emergency exits all aimed for guerrilla warfare. The tunnels were deep and strong enough to withstand destructive bombings and self-contained enough to outlast prolonged sieges. Return to the city at noon time for a rest.\nAfternoon, tour in the city starting with Saigon Notre-Dame, a neo-Roman cathedral built over 130 years ago by the colonial French with materials entirely imported from Marseilles and stained-glass windows from Chartres. Next, visit Sai Gon Post Office, a fine colonial building which was designed and built in the early 20th Century by the famous French architect Gustave Eiffel. Move on to Cho Lon or the city’s China Town where you will visit the Jade Emperor Temple (Phuoc Hai), a rare Taoist structure in Vietnam built in 1909 in dedication to the Lord of Heaven. It’s filled with smoky incense and fantastic carved figurines and still buzzing with worshipers, many lounging in the front gardens. Overnight at hotel in Hochiminh."},{"title":"HOCHIMINH - MEKONG DELTA (VINH LONG) (B/L)","description":"Today, meet with your hotel to transfer about 136 km to Vinh Long, a riverside town in the vast Mekong Delta, the world’s largest delta. Embark a boat cruise to lively Cai Be floating market where sellers and buyers bargain and exchange goods from their boats. Proceed through a fascinating maze of shady canals to Hoa Binh Phuoc Island. Beautiful landscape of zigzag canals, lush vegetation, peaceful villages and activities of rural life will make you a delightful sight. There on the island, visit some local farmers’ homes, interact with warm-hearted hosts and learn about their trades of bonsai gardening, tile and ceramic production and rice paper and coconut candy making. After tour, we transfer back to Ho Chi Minh. Overnight at hotel in Hochiminh. "},{"title":"HOCHIMINH DEPARTURE (B)","description":"Meet our guide & driver at the hotel lobby then transfer to Ho Chi Minh airport for flight\ndeparture!"}]},{"name":"6 DAYS IN CENTRAL VIET NAM","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":765,"summary":"Visit the heart of Vietnam with 6 day tour Danang – Hoi An – Hue. Experience many other colors of feeling-tones: a romantic Hoi An, an ancient Hue, and a dynamic Danang City. But all of them is peaceful, tranquil, and full of hospitality.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b94.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3b9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196204_5e68ab44b3ba0.jpg"],"destinations":["Hue","Phong Nha-Kẻ Bàng National Park","Hoi An"],"timeline":[{"title":"Da Nang Airport – Hue City (No meal)","description":"Welcome to Vietnam! \nWarmly welcome by our driver and transfer privately by a comfortable car to the hotel in Hue.\nCheck in and relax at the hotel in Hue.\n"},{"title":"Hue City Tour (B,L)","description":"In the morning, our guide and car will pick you up at your hotel and drive to visit the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945, then to Hue Museum of Royal Fine Arts and Thien Mu Pagoda. \nHave a delicious lunch at local restaurant.\nIn the afternoon, you are to visit Royal Tomb of Emperor Minh Mang, Emperor Khai Dinh Mausoleum and Dong Ba Market. \nReturn to the hotel at the end of the day. Overnight in Hue."},{"title":"Ke Bang National Park – Phong Nha Cave (B,L)","description":"In the morning, you are picked up at your hotel in Hue and leave for Phong Nha Cave passing the beautiful landscape and attractions of Hue on the way, such as DMZ of Quang Tri, The Macnamara Line, 17 Parallel, Macnamara Line, McNamara Line. \nHave lunch at local restaurant.\nOnce being in Phong Nha Cave, you have the option of cruising along Son River by boat to visit Phong Nha Cave with its beautiful grottos of Bi Ky Cave, Cung Dinh Cave and Tien Cave. \nReturn to Hue at about 19:00. Overnight in Hue "},{"title":"Hue – Hoian town – Hoi an walking tour (B,L)","description":"After having breakfast at the hotel, you are picked up at hotel for a transfer to Hoi An town by private car. At arrival, take a visit to Hoi An Market and explore its tiny alleys with colourful boutiques. Taste some delicious local street food if you feel like it then make your way to the hotel. Overnight in Hoi An "},{"title":"Hoi An - Tra Que Cooking Class Tour (B,L)","description":"Today, you join the most amazing cooking experience with other tourists.\nThe tour starts by our guide meeting you at your hotel’s lobby and together you will ride bicycle to Hoi An’s colorful central market where you have the opportunity to buy and bargain like locals, interact with local sellers and learn about the ingredients to be used in the cooking lesson later. Once all ingredients are bought, you cycle to Tra Que vegetable village where your cooking class is waiting. At Tra Que, take a sip of tea/drink as a welcome before walking through vegetable gardens where local farmers work on their fields using traditional methods of hundreds of years ago without any electrical machinery. Let your foot relaxed and enjoy a foot herbal massage.\nNow, it’s time to have your hands on with cooking for lunch. Go to the restaurant & work together with the chef. With the instructions of the chef, you will learn the traditional ways of preparing and cooking Vietnamese food while making your own tasty dishes. After the lesson, enjoy the food that you have cooked. \nAfterward, you are taken back to your hotel in Hoi an. Overnight in Hoi An"},{"title":"Hoi an - Da Nang Airport – depart (B)","description":"Breakfast at the hotel. You are picked up and transferred to Da Nang Airport for your returning flight."}]},{"name":"Hanoi Tour plus Halong Genesis Regal Cruise 5*","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"01 Night on Luxury 5* Genesis Legal Cruise in Halong Bay\n04 Nights in Quoc Hoa Premier Hotel in Hanoi\nFree Round-trip airport pick up and transfer by Private Car\nOptional Day excursions around Hanoi and Ninh Binh\nEnglish speaking Tourguide included","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161304_ff0d56ed.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161304_ff0d56ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_9775a7ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_c3621297.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_94c5b4a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_0c54054c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_c2c4cba7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_69783381.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_7a24fe42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_85572014.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_219c8256.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_1ad783b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_93a9ccec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_e826cf95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161304_d2eb6805.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ninh Binh"],"timeline":[{"title":"Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Hotel Viet View which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Hanoi - Genesis Legal Cruise 5*","description":"09.00 - 09.30 Pick Up - Starting the journey, Genesis Tour guide will pick you up at the hotel lobby in Ha Noi as scheduled.\nIf not using our limousine shuttle, we will greet you at Genesis guest station, Got pier, Cat Hai district, Hai Phong city.\n09.30-11.30 On road - Moving on expressway 5B, tourist will be introduced about the culture, live…of Vietnamese by our Tour guide.\n11.30 - 12.00 Check in and set sailing Genesis team will welcome you at lounge and register for your trip.\nYou will embark Genesis Regal Cruise in the warmly greeting of the team who will accompany you guys in the trip.\nReceive the room key, check in and take a rest at your reserved room before lunch, while Regal Cruise set sailing.\n12.40 Lunch time - relax Back to the Tonkin restaurant, you enjoy set menu lunch with delicious food and drinks. Regal Cruise slowly glides between the numerous small islands and the sea-green color of the bay. After that, it would be relax and leisure.\n14:10 – 15.10 Visit a floating house Tour guides and tender will take you to visit a floating house on the bay. The local host will welcome you as home-guests, visitors will be exchanged with the owner, to understand the information about culture, history ... of the fishing village on Halong Bay - Lan Ha Bay. Guests enjoy traditional dried fish and traditional wine offered by the local host.\n15:10 - 16:00 Relax and Sightseeing Return to Regal Cruise, visitors continue the journey to explore the other hidden beauty of Halong Bay – Lan Ha Bay. You can choose to sip coctails on the sundeck or relaxing in the cabin with an extra-large view to the small green islets.\n16:00 Kayaking – Sampan boat in Dark – Light cave Reaching Dark- Light area of 3 underwater caves.\nIn this activity, visitors have two choices, either by themselves creating separate roads for exploring by kayaking or sit on boats that rowed by the local people to soak in the peaceful atmosphere.\nGuests have about 1 hour here to have the opportunity to admire closest to nature of wonder.\n17.00 Swimming - relax Regal Cruise will move to safe anchorage. Visitors can choose to swim in emerald water or going on sundeck to enjoy the magnificence of the bay where were voted as one of the top 20 beautiful sunset in Asia by CNN.\n18.00 Sunset hunting- Sunset Party Especially, visitors do not forget to join the sunset party on the open sundeck area of the ship. In the rhythm of the music, boldly add the party atmosphere of the trip. Do not miss the special offer Happy hours - buy one get one free to enjoy the memorable moments in the trip.\nMoreover, Regal Chef will guide you how to make one of the 50 best dishes in the world, voted by CNN – “Nem” – Deep Fried Spring Rolls in Vietnam.\n19.30 Dinner on board Guests will enjoy the delicate dinner in the warm and cozy ambience. The freshly cooked seafood dishes, mixed by Vietnamese and Western styles, promise to bring guests an unforgettable dinner on this memorable trip.\n21:00 Relax on board A free time for some activities such as: films; playing chess, reading books, listening to music, trying your luck with squid fishing, tea culture learning, or enjoy the starlight of night sky in the bay on sundeck.\n22:00 Sleeping Cruise goes to overnight point at the quietest part of the wonders. Finishing the first day with a good night’s sleep."},{"title":"Genesis Legal Cruise - Hanoi","description":"06.30 Tai Chi wake up to new days are practiced out on the sundeck. This is also the moment visitors can pick up the dawn on the bay.\n07.30 A light and nutritious breakfast served at the restaurant will help you enjoy the last day on the bay, which is always full of energy.\n08.30 Visit karst cave on Cat Ba National Park Regal Cruise move to Gia Luan wharf, a path for tourists to visit Cat Ba National Park. After leaving the boat, the van will take visitors down the asphalt road through the forest, the stop point is a typical karst cave which were formed from million years ago. Have chance to meet the red list Cat ba langur.\nYou will have an hour to discover this area with much of interesting information and stories about Cat ba island, Lan ha bay…\n9.30 - 10.30 Guests return to the boat, stay and check out procedures. Enjoying the scenery of the Bay and a delicious buffet brunch while cruising back to the harbor.\n11:45 Regal Cruise arrives in Got Pier. Guests will relax at the private lounge, preparing luggage and depart back to Hanoi.\n14.00 Return to Hanoi Hotel after moving quickly by the highway.\nFinishing your memorable journey with Regal Cruise"},{"title":"Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Kms).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Best Vietnam Package tour for 10 days South to North","duration":10,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1518,"summary":"Vietnam is a peaceful country with a lot of beautiful scenes. With the route for 10 days, Go Vietnam Travel can design a highlight Vietnam Package tour which makes you deeply understand the culture of this country and have a nice trip. All of the essence which call \" Vietnam soul\" will be collected in one of the best Vietnam tours. From the secret of Cu chi tunnel, the soft river of Mekong delta, delicious Vietnam cuisine to the grandeur of Halong Bay, ... all will be on this tour. Let start it. You will make your money to be valued.\n\n  Free visa letter approval/pax\n  Free one sim card/ group\n  Get all of the unique experience with cruise at Halong Bay,Farming, and fishing in Hoian, ...\n  Take a lot of unforgettable memories with delicious cuisine, most friendly staff in the world, picturesque scene, incomparable culture explore in Vietnam\n  Discover the most highlights of Vietnam\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f12fe63ab.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f12fe63ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f1300b020.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f1300dd35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f13011388.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f1301342f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191835_5e23f13015335.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Ho Chi Minh arrival ( no meal)","description":"Welcome up on arrival by Go Vietnam Travel’s tour guide and driver, we then transfer to hotel. Overnight in Saigon.\nMeal Plan: No"},{"title":"Ho Chi Minh City – Cu Chi Tunnel (B,L,-)","description":"Good morning Vietnam. This is the trully the first morning in Vietnam package tour.\n\nIn the morning:\nWe visit the Reunification Palace, the former Presidential Palace for the president of the South of Vietnam. After that, we will visit War Remnant Museum, where we can see countless artifacts, photographs and pictures documenting about the second Indochina war. Before our lunch, we stop at Notre Dame Cathedral and Central Post Office.\nLater afternoon:\nWe will leave Saigon for the Cu Chi tunnels. On our way there we will drive through pleasant countryside; rubber plantations and rice paddies. Before entering the tunnels, we will see a short introductory video showing how they were constructed, followed by an exploration of the maze of tunnels, some of which have been widened to allow tourist access. Also on display are various man traps and the remains of an American tank as well as numerous bomb craters made by 500lb bombs dropped by B52 bombers. After that, we transfer back to Saigon. Relax and overnight in Saigon.\nRemarks:\nUp on the seasonal weather so we can decide to visit Cu Chi Tunnel first or later after half day Saigon city tour. Raining season, visitors will be recommended to visit Cu Chi Tunnel in the morning and city tour in the afternoon, and via verse."},{"title":"Ho Chi Minh City – Mekong Delta (B,L)","description":"For the next step on our amazing Vietnam package tour, we start our tour little bit early today to have explore full of Cai Be floating market in Mekong Delta where is about 2,5 hour driving from Saigon. The boat will take us among the local barges full of fruits and farmers’ products. There are many opportunities of photo shoots in the one of the most beautiful floating markets in Mekong Delta. We then stop at local workshops to see the rice paste, coconut candy and pop rice, pop-corn are made. Later we take the rowing boat entering on the smaller canals where we can see the traditional houses made of wood and palm tree leaves, the local daily life…. After lunch at a local house, we take bikes along the village paths to see the farms, houses and the ancestral ways to pick up fruits in Mekong Delta.\n\nMidafternoon:\nwe cruise back to the city and our awaiting vehicle will take us to Saigon. Overnight in Saigon."},{"title":"Ho Chi Minh City – Fly to Danang, transfer to Hoi An – Walking tour (B,L)","description":"We take morning flight to Danang from Saigon today after breakfast at hotel. The local tour guide and driver welcome us at Danang airport then drive you along the coast highway to Hoi An ancient town. Later afternoon, we have a walking tour in Hoi An town – one of the World Culture Heritages of Vietnam. This quaint riverside town still boasts a wealth of century’s old traditional architecture. The influences of several Asian cultures can be seen in the old houses and waterside buildings. It is also famous as a place to be instantly created inexpensive tailored outfits. Overnight in Hoi An.\n\n"},{"title":"Hoi An – Farming and fishing Tour (B,L)","description":"One of the highlight on Vietnam Package tour for 10 days is joining Farming and fishing which we will do today.\n\nTra Que Village:\nThis morning, we can choose bus or bike to cycle to a local farming village to join daily work life of local farmers – hoeing and a soil, watering veggie at an organic herb garden, riding water buffalo in the field and enjoy the freshest air of the countryside beauty. After that, board the Hoi An Eco-tour boat and cruise to the mouth of the river where it meets the Cua Dai Sea.\nCoconut -palm:\nWe also learn and try our hand at local traditional fishing techniques using round and cast nets, learn to paddle the strange and unique Vietnamese bamboo basket boats. Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides. Have a relaxed fun with catching beautiful purple crabs on bamboo basket boat. After visit a local water coconut palm village, we take a walk around the village and have some tea and snack with local talks…\n\nBack on-board our Hoi An Eco-tour boat, enjoy our lunch and cold beer or soft drink on boat, then back to hotel for our luggage packing."},{"title":"Hoian – Cooking class - Fly to Hanoi (B,L)","description":"Cooking class: \nWe join the special cooking class with local market shopping all ingredients for our lesson. Then boat to Vy’s Market restaurant where we can see, smell, hear, taste, touch and interact with many different food making processes. We can try samples from over 10 different food counters including banh my, dumplings, pickles, weird….Then start 2,5-hour cooking lesson with the chef and enjoy all the food that we cooked before. The gift after the lesson is a copy of the recipes and a Vietnamese cooking utensil to take home.\nTake a flight in this afternoon:\nReturn to hotel for leisure until transfer to airport for flying to Hanoi.\n\nWe take an afternoon flight to Hanoi. Welcome up on arrival and transfer to hotel. On the way, we may stop at the West Lake area to get nice sunset view on the largest lake of Hanoi, and enjoy Vietnamese coffee in the coffee shop on the lake bank. After checking in, we have our dinner at fine restaurant in town. Overnight in Hanoi."},{"title":"Hanoi food tasting & city tour (B,L)","description":"Hanoi city in the morning:\nHave breakfast at hotel. We explore Hanoi city with the first destination of Ho Chi Minh Mausoleum, the Ba Dinh square, Ho Chi Minh Museum, One Pillar Pagoda, the Presidential Palace and the Temple of Literature.\nWe visit the Museum of Ethnology, which is widely acknowledged as the best in the country and has an extensive display dedicated to Vietnam’s 54 Ethnic minority peoples\nHanoi street food tour in the afternoon:\nWe walk down to Pho restaurant for our light breakfast. Walking down to the Hang Be street for visiting the local market, we are guided all the ingredients as well as inhabit of local people here. After the street market, we continue our trip along different streets, try to taste many kinds of local food such as oil-fried pastry, tofu, egg coffee, Rice pancake, pillow cake, sweet soup, stuff pancake with pork, draught beer…\nIn the later afternoon:\nWe take one-hour cyclo around the Old Quarter, known as the 36 streets. The last activity today is to enjoy the unique Water Puppet show. Overnight in Hanoi."},{"title":"Hanoi – Halong Bay (overnight on deluxe junk cruise) (B,L,D)","description":"Transfer to Halong:\n8:00 AM, we transfer to Ha Long Bay. Halong Bay has been recognized by UNESCO as the World Natural Heritage thanks to its universal values of landscape, geology and geomorphology, respectively in 1994 and 2000 and is one of the most beautiful bays in the world.\nLunch on boat:\n12:00: On arrival in Halong, we will embark on Oasis Bay Cruise followed by a short cruise briefing. We will then savor a delectable lunch while Oasis Bay Cruise among the limestone islands.\n\nSung Sot Cave:\nThen we explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay before continue cruising to Titov Island for swimming and relaxing at the beach or climb up to the Top of the island for a panorama view of Halong Bay.\nIn the late afternoon, we return to the main boat and continue cruising to the quiet area where we enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set. After dinner, free time for socializing with other guests, take part in board games, fish for squid, or just laze around.\n\nOvernight on Oasis Bay cruise or similar "},{"title":"Halong Bay – Hanoi (B,L)","description":"Tai Chi class- Breakfast:\nOn the day dawn, you can enjoy fresh air of the bay and start the day with Tai Chi class in the early morning. Have breakfast on board, prepare the energy for kayaking among the hidden areas of the bay, around the Man’s Head Islet area.\nBa Hang Fishing Village:\nAt around 10.15 AM, we return to the boat, freshen up and check out of your cabin while our cruise continue passing Ba Hang Fishing Village, Dog Islet and more. While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch. Disembark at around noon and find your car is waiting and take us back to Hanoi."},{"title":"Departure Hanoi (B)","description":"Departure airport: Noi Bai International airport\nFree at leisure for last minute shopping before transferring back to the airport for our flight to home\nVietnam Package tour for 10 days ends. Thank you for choosing Go Vietnam Travel’ services."}]}]