[{"name":"South to North Vietnam - 10 Days","duration":10,"travelStyle":["Sightseeing","Group","Fully Guided","Holiday"],"oldPrice":0,"price":620,"summary":"Vietnam tour 10 days 9 nights from South to the North included flight. Destination covers Ho Chi Minh city (Sai Gon), Mekong delta, Cu Chi Tunnel, Hanoi, Halong bay, Da Nang, Hoi An. All of hotel we select is top ranking on Tripadvisor and guarantee satisfaction ! Let’s book and enjoy your holiday","highlights":["Weave through the limestone islands of Ha Long Bay","Be amazed by exquisite temples and enchanting ruins","Delve into culture, meet the locals and learn traditions"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117774_ef40696a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117774_ef40696a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_d27893e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_d5f48744.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_fedff742.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_38c224d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_ce0ddaa4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_1cd9c70a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_8e146d89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_f3591043.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_45cc77b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_4a1fefe5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_ce062445.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_31767429.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117774_82c2973c.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: HCM - airport pick up - Check in hotel (Meal: No)","description":"Pick up the airport and then transfer you to the hotel.  After that you are free to visit HCM City by yourself.     "},{"title":"Day 2: Mekong Delta tour (Meal: B,L)","description":"7:30 – 8:00 Picking up from hotel\nStarting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30\tStart the motorized boat to visit the Cai Be Floating market, experience how people\nexchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn. \nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature. \nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30\tArrive in your hotel.\n"},{"title":"Day 3: Cu Chi tunnel tour – Overnight train to Da Nang (Meal: B,L)","description":"8:00 - 8:30 Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was” A Free Target Zone “. The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n13:00\tHave lunch in a local restaurant\n14:00\tBack to Ho Chi Minh City then you are free in Hanoi till our driver come to pick you up for the transfer to the train station. \nThe train journey will take around 16 hours. On the train you can view the beautiful countryside and coastline. Stay overnight on the train and arrive at the Da Nang train station at the next morning\n"},{"title":"Day 4: Arrive in Da Nang – Transfer to Hotel (Meal: No)","description":"Arrive in Da Nang, our driver would pick you up then transfer you to Hoi An. Check in the hotel and then you are free in the town."},{"title":"Day 5: Da Nang – Marble mountain tour – Transfer to Hoi An (Meal: B,L)","description":"9:00 – 9:30 am: Pick up at the hotel, departure for Marble Mountains.\n9:30 – 11:30: You will discover many caves and marvel at their varied beauty and uses at Marble Mountains. Get souvenirs on your visit to a traditional marble carving village.\n11:30 – 12:30: Leaving Marble Mountains for Monkey Mountain. During your time at Monkey Mountain, you will learn about its history and after that, be able to take some photos\n12:30 – 13:30: Leaving Monkey Mountain for lunch at a local’s home.\n14:00: Your driver will drop you off at the hotel in Hoi An. After that, you are free in the town\nNote: Please check-out in the morning cause we will drop you off in Hoi An after the tour\n"},{"title":"Day 6: Hoi An free day (Meal: B)","description":"Today you are free in Hoi An"},{"title":"Day 7: Check out – fly to Hanoi – check in hotel (Meal: B)","description":"Today you are free in Hoi An Town till our driver come to pick you up for the transfer to Da Nang for the flight to Hanoi city. Arrive in Hanoi our driver would pick you up then transfer you to the hotel. You are free in the city today"},{"title":"Day 8: Hanoi – Halong Bay – Overnight on the Cruise (Meal: B,L,D)","description":"08.00 – 08.30:\tPick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12.30 – 13.00:\tEmbark on Classic Cruise followed by a short cruise briefing.\n13.30 – 14.30:\tSavor a delectable lunch as V’Spirit Classic cruises among the limestone islands.\n15.00 – 16.00:\tExplore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16.00 – 17.00:\tKayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10.15:\tReturn to the boat.\n17.00 – 17.30:\tReturn to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17.30 – 19.00:\tEnjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19.00:\tDinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board.\n"},{"title":"Day 9: Halong Bay – Hanoi – Check in hotel in Hanoi (Meal: B,L)","description":"06.30 – 07.15:\tStart your day with Tai Chi exercises or a photo hunt.\n07.30 – 08.30:\tHave breakfast on board and enjoy the peaceful morning of Halong Bay.\n09.00 – 10.00:\tCruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay. Freshen up and check out of your cabin.\n10.15 – 11.00:\tContinue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11.00 – 12.15:\tWhile heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12.15 – 12.30:\tDisembark V’Spirit Classic.\n12.30 – 13.00:\tTransfer back to Hanoi.\nTrip finishes at around 17.00.\n"},{"title":"Day 10: Check out – Pick up to airport – Departure (Meal: B)","description":"Today you are free until our driver come to pick you up and transfer you to the airport for your flight. "}]},{"name":"Vietnam Vacation from North to South via Hanoi, Hoi An, Hue, Saigon, Mekong Delta, Phong Nha cave","duration":15,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2310,"summary":"This 15-day Vietnam Vacation Tour from Hanoi to Saigon takes you to hidden charms of Hanoi , Halong Bay … and nice coast with world heritages in Central then visit beauties of Mekong Delta.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170681_71a63e0b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170681_71a63e0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_2b6981f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_a9e9269d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_2a252a49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_d4dc5725.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_eab98754.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_1a78380e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_cfc1d3d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_ce702fa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_6bd54032.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_31cbd48f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_4fc70d1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_3ebd639c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_dbc8b54a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_0379527f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_e169044f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_1a0b1246.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_f0f76373.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_bb81f5be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_3c2eb58a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_461f805f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_cbfe3249.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_2a416284.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170681_e88662f3.jpg"],"destinations":["Hanoi","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: ARRIVAL – HANOI","description":"Upon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in. The rest of time, you’ll be free on your own.\nO/N in Hanoi."},{"title":"DAY 2: HANOI CITY TOUR (B/L/-)","description":"Today you’ll be on a full day tour to discover the most outstanding attractions of Hanoi. Beginning with a visit to Ho Chi Minh’s mausoleum. This imposing monument, dedicated to the father of modern Vietnam, was constructed from marble and granite and takes the form of a stylized lotus (closed Mondays and Fridays). Located nearby is Ho Chi Minh’s house on stilts and the One Pillar Pagoda, a symbol of Hanoi. Continue your tour with a visit to the Temple of Literature, or Van Mieu, a structure dedicated to Confucius. Constructed in 1070, the compound soon became the first Vietnam’s university.\nEnjoy your lunch at a rustic restaurant Cha Ca La Vong which was founded more than 100 years ago and was the first restaurant in the city to serve Cha Ca – grilled fish. This is undoubtedly good introduction of the local food and great place to fill up your empty stomach to get you ready for the afternoon excursion.\nAfter lunch, stroll down the streets and try café Trứng—egg coffee at Café Giang, 39 Nguyen Huu Huan Street, about a 10-minute walk from the restaurant.\nBoard a “cyclo”, the traditional bicycle rickshaws for a leisurely ride, which is a perfect chance for photo taking and slow-moving sightseeing. Disembark at the Thang Long Water Puppet Theater for a unique traditional art form and expression of cultural identity. The shows capture Vietnamese traditions; farming, tending buffaloes, and catching fish; entertainment, like swimming contests and lion dancing; and historical legends with traditional music. The one-hour show is a fun and insightful look into Vietnamese culture enjoyed by both adults and children.\nO/N in Ha Noi"},{"title":"DAY 3: HANOI – HALONG BAY – OVERNIGHT ON CRUISE (B/L/D)","description":"07:30     Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30    Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager.\n13:30    Great lunch is served while cruising passing by islets.\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises"},{"title":"DAY 4: HALONG BAY – SUNG SOT CAVE – HANOI – FLIGHT TO DONG HOI (NOT INCLUDED) (B/L)","description":"06:15    Tai Chi class on the Sun-Deck.\n07:15    Have light breakfast with Coffee, tea, and bakeries on board.\n07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45    Brunch is served.\nAfter brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina.\nOn the way, you’ll be transferred to Noi Bai Airport for a flight to Dong Hoi on VN123 (18:00 – 19:00).\nUpon landing at Dong Hoi airport, our local guide & driver will be welcoming then escorted to your hotel for a check-in.\nFree time to stroll around this charming beach city by night.\nO/N in Dong Hoi."},{"title":"DAY 5: DONG HOI – PHONG NHA CAVE – THIEN DUONG CAVE (B/L/-)","description":"After having breakfast, you’ll be picked up by our guide and driver to continue your cave discover tour at Phong Nha & Thien Duong caves which are the two most famous caves in Phong Nha Ke Bang National Park. It was listed in UNESCO’s World Heritage Sites in 2003 for its geological values. Both of them have created a special attraction for the “Kingdom of the caves”, Phong Nha Ke Bang National Park. Nowadays, there are a lot of tourists not only domestic but also international coming to visit and admire their beauty. If you are a person who likes exploring caves, Phong Nha is really an ideal place for you.\nUpon reaching Phong Nha wharf, we’re quickly getting on a boat trip to go up romantic Son river to explore splendid beauties of Phong Nha Cave that has been regarded by British Cave Research Association as the top cave in the world due to its 4 top records: the longest underground river, the highest and longest cave, broadest and most beautiful fine sand beaches inside the caves, the most spectacular stalagmites and stalactites. Once you reach at the entrance of cave, you will feel like you are entering in the mouth of mountain.\nAfter having lunch, we’ll keep on our journey to the Paradise Cave which is one of the most famous cave in Viet Nam. It has 31.4km length, with many beautiful stalactites and stalagmites. British Caving Association has been evaluated as the most beautiful and longest dry cave in Asia. It has been creating continuously by the nature over 350 million years. It was ranked at international level in terms of science and high aesthetics. It is waiting you to discover and enjoy.\nBy the end of the day, you’ll be lazing on the bank of river for cold beer.\nOvernight in Phong Nha."},{"title":"DAY 6: PHONG NHA – HIEN LUONG BRIDGE – BEN HAI RIVER – VINH MOC TUNNEL – TA CON AIRPORT – DAKRONG BRIDGE – KHE SANH (B/-/-)","description":"In this morning, after having breakfast, our tour guide and driver will pick you up at your hotel in Phong Nha to visit the DMZ (Demilitarized Zone).\nWe’ll keep on following along the highway 1A, en route our guide will provide you so many useful information relating to the history of war between Vietnam & US and our first stop would be at Hien Luong Bridge, Ben Hai River – which marked the former border between North and South Vietnam from 1954 to 1972. Next stop is to visit Vinh Moc tunnels – a network of tunnels built by villagers seeking shelter from bombings during the American War, this is the place where an entire village lived and fought for two and a half years. Later on, before having lunch (Your own account) at Dong Ha town, we’ll take a visit to the Mine Action Visitor Center where provides an excellent historical overview – in English and Vietnamese – with photographs of the 1972 destruction of Quang Tri Citadel and of people attempting to deactivate mines with bamboo sticks. A newer display details the tragic legacy of the defoliant Agent Orange.\nLeaving Dong Ha Town, we will go ahead to Khe Sanh town. On the way, we will stop to visit Dakrong Bridge which was rebuilt in 2001 and bears a marker hailing its importance as a conduit for the Ho Chi Minh Trail (NR 14). Then we move to Ta Con airport to see the things in nature of the fierce war, and how hard Quang Tri people fight against the enemy. And finally enter to Khe Sanh combat base – one of the most famous sieges of American Vietnamese War and was the site of a United State base that fell under attack in early 1968 before check in hotel in Khe Sanh.\nO/N in Khe Sanh."},{"title":"DAY 7: KHE SANH – HUE – HUE ANCIENT CITADEL (B/-/-)","description":"After breakfast at the hotel, we’ll continue driving along the West Truong Son road to Hue City and you will have chances to witness big changes of this region after the war ended and sometimes we can stop by nice places to meet the local hill tribes (Paco, Van Kieu) to understand more about their daily life as well as shoot nice photos with spectacular landscapes on the roadsides, we will arrive Hue after your lunch-on time and free by your own time.\nO/N in Hue City."},{"title":"DAY 8: HUE CITY TOUR (B/L/-)","description":"This morning, after breakfast at the hotel, our guide and driver welcome you at hotel and start day trip to explore Hue Imperial City. This morning, you will start your tour by making a dragon boat trip on Perfume River and enjoy the fresh atmosphere of Hue. Visit the famous Thien Mu Pagoda upon arrival at the dock to discover Buddhism in Hue. \nThen you will be transferred to visit the Imperial City (Citadel), the Royal Palace of Nguyen Dynasty. Explore the glory history and stunning architecture inside this complex. Next, you are free to go shopping at Dong Ba Market, you can also discover the interesting local life here while looking for souvenir for friends and family. Have lunch at the restaurant.\nAfternoon is the time for Nguyen Emperors’ Mausoleums. You will have chance to visit two of three most famous tombs. Visit Khai Dinh Mausoleum to admire the spectacular architecture which was influenced by Oriental and Western styles. Then visit Minh Mang Mausoleum and discover its traditional style with a peaceful atmosphere. Back to Hue city and end tour at your hotel.\nO/N in Hue City."},{"title":"DAY 9: HUE – DA NANG – HOI AN TOUR (B/-/-)","description":"Today, at 8:00am, our guide and driver welcome you at hotel in Hue and transfer you to leave Hue city for Hoian. You will be driven along National Highway No1 and see more of beautiful landscapes of rice fields, Cau Hai Lagoon, local villages. You will have chance to see Lang Co beach – one of the most beautiful beach in Asia to enjoy nice view.\nNext, you will see the spectacular view of Hai Van Pass through windy road to the summit. From here the panorama of Lang Co Beach, Da Nang city is under your eyes. It is the ideal spot to take wonderful photos of forest and mountains. Arrive Da Nang, you will discover Da Nang city including Cham Museum where shows the collection of Champa sculptures to learn more of Cham culture and then Marble Mountain which is well known as Five Mountains to visit and discover pagoda, cave and view of Da Nang city from the summit. You arrive in Hoian in the early afternoon around 2pm. Tour end at hotel.\nO/N in Hoi An."},{"title":"DAY 10: HOI AN SIGHTSEEING – MY SON TOUR (B/-/-)","description":"In the morning, you will have breakfast at the hotel and then make a visiting to My Son Sanctuary to explore the Ancient Champa Kingdom and its spectacular culture. Here is the chance for you to enjoy Apsara traditional music show. Then you will be back to visit Thanh Ha ceramic village. You have chance to try to make a product under the guidance of workshop owner, receive a little gift called To He before leaving. Take the boat on Thu Bon River back to Hoi An Ancient Town. Have lunch at restaurant.\nThis afternoon you will make a walking around old streets to discover the charm of Hoi An Ancient Town including Japanese Covered Bridge, Chinese Assembly Halls, Sa Huynh Museum, old houses and the local market… Hoi An is an ideal for shopping and making tailor with reasonable price.  Drop you off at your hotel in Hoi An and end tour.\nO/N in Hoi An."},{"title":"DAY 11: HOI AN – BA NA HILLS – DA NANG (B/-/-)","description":"You will leave Hoi An at 8:00 am and transfer to discover Ba Na Hill – 25 km to the south west of Da Nang City. To reach the summit, you will take a cable car from the foot with spectacular sceneries of forest, trees, and waterfall underground when you are on cable. On arrival you will visit Old French Villas, Nui Chua and conquer the mountain peak at the height of 1487 meters. You will take mountain climbing train to visit Flower Garden where has many kinds of beautiful flowers. Visit Linh Ung Pagoda and learn more about Buddhism and then Wine tunnel to see different wines are stored here for many years. You also have chance to admire the Golden Bridge which is new attraction at Ba Na. Have lunch at the restaurant.\nPm: You spend more time to enjoy at the hill or play game at Fantasy Park Amusement. Here, you can join many thrilling games and 4D movies (almost normal games and 4D Movie already included in your tour package but only some games which have reward & wax museum, you will pay the fee by yourself). After that you will take cable car back the foot mountain, the driver picks up and transfers you back Da Nang city.\nO/N in Da Nang."},{"title":"DAY 12: DA NANG – FLIGHT TO HCM CITY (NOT INCLUDED) (B/-/-)","description":"After having breakfast at hotel, you will be free to explore Danang City and check out hotel before transferred to Da Nang airport for a short flight to Ho Chi Minh on VN127 (13.00-14.30). On arrival you are met by our guide and transferred to hotel.\nO/N in Ho Chi Minh City."},{"title":"DAY 13: SAIGON PRIVATE CITY TOUR + CU CHI TUNNEL (B/-/-)","description":"This morning, you will join the trip to Cu Chi with approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time.\nThen, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. Break time for relax or time for those who want to try the real shooting gun. And then return to Saigon City.\nAn afternoon will acquaints us with some major sights of Ho Chi Minh. We drive past many lively streets on our way to the Reunification Palace. This mansion was the former residence of the President of South Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon post office is the end stop.\nO/N in Ho Chi Minh City."},{"title":"DAY 14: SAIGON – MEKONG – CAI BE FULL DAY GROUP TOUR (B/L)","description":"At 6.30 am, our guide and driver will welcome you at hotel in Ho Chi Minh City and transfer you to Cai Be. On the road, you will have chance to survey the beautiful rice field scenery along Trung Luong Express Highway. On arrival in Cai Be, you will set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then you continue to make biking tour into the small villages to visit the orchard and fruit plantation.\nKeep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Then you continue visiting a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc Village, the green pearl of Vinh Long Town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music.\nAfter lunch, you will take a delightful walk through the bonsai garden. Then our guide and driver will take you to come back and drop you off hotel in Ho Chi Minh City. \nOvernight in Ho Chi Minh City."},{"title":"DAY 15: SAI GON – DEPARTURE (B/-/-)","description":"There is a free time to relax or further explore Ho Chi Minh. The tour ends after your transfer to Tan San Nhat Airport for departure."}]},{"name":"15 Days Exploring Vietnam From North To South","duration":15,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":929,"summary":" We would bring you to the real local life in Vietnam with 15 Days Exploring through our country. From the North Vietnam down to South, you will see how beautiful Vietnam is. Not only relaxed holiday, but also you can visit a lovely country with hospitable people, stunning view and landscape, tasty and delicious foods…, all will bring you the best holiday with an unforgettable memory. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114262_96d7a49f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114262_96d7a49f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_f01383e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_dbe0345d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_dbcf6883.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_a6d9de1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_1d010e72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_54a29c69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_4b1c6bd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_58a3fb15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_9fd58d8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_fd5fe7ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_1bcf48a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_dbe547d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_21beda32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_118012ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_1e5801ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_ecfea758.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_90985f07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_6f4c0456.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_410764ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_177ca902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_fbdb3bdc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_09ac1357.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114262_37dad028.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang"],"timeline":[{"title":"Day 1: Hanoi arrival – Airport pick up – Hotel check in (Meal: No)","description":" \nWelcome you to Vietnam. Our driver will pick you up at Noi Bai airport and transfer you to the hotel in Hanoi old quarter.\nEnjoy welcome drink and check in the hotel.\nFree time to visit Hanoi old quarter to see the local life, taste the local street foods…\nOvernight at hotel in Hanoi\nInclusion: Private airport pick-up; Hotel in Hanoi"},{"title":"Day 2: Hanoi city tour (Meals:B,L)","description":"AM: 7:45 – 8:30: Free pick up at your hotel. Then visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West lake (One of the oldest pagodas in Vietnam).Then visit Bat Trang pottery village (applied on Mon, Wed & Fri).\nLunch at local restaurant.\nPM: After lunch proceed to visit the Ethnology Museum (apply on Sun, Tue, Thu & Sat), Temple of Literature ( Quoc Tu Giam ) - Vietnam’s first university, constructed in 1070 - it’s gardens and well-preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters, and the beauty of Ngoc Son temple. \n15:30: Drop off at the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch); Complimentary water; Hotel in Hanoi"},{"title":"Day 3: Hanoi – Halong Bay – Overnight on Cruise (Meals: B, L, D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sun-bathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting Sung Sot cave (Amazing cave) – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on board\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch, Dinner); Welcome drink, Sung Sot cave (Amazing cave); Titov island (Hiking, swimming, sun-bathing); Sunset Party (Free fruit & a glass of wine); Cooking Demonstration; Complimentary water"},{"title":"Day 4: Halong Bay – Kayaking – Hanoi (Meals: B, L)","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor\n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch); Kayaking; Tai Chi lesson; Complimentary water"},{"title":"Day 5: Hanoi – Hoa Lu – Tam Coc – Cycling 1 Day (Meal:B,L)","description":" \n8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2  Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful  and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Buffet Lunch); Rowing boat trip; Cycling time; Complimentary water; Hotel in Hanoi"},{"title":"Day 6: Hanoi free time – Night train to Hue city (Meal: B)","description":"Today, you have free day to explore Hanoi city by your own. Slowly to see the corner by corner, all are strange of you from the house, street, local life to traditional foods; where you can go shopping souvenir…\nUntil the transfer time, driver will pick you up and transfer you to the train station to going to Hue.\nTrain takes about 12  hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight in train.\nAttention: Please advise us if you prefer to fly!\nInclusion:  Meal ( Breakfast ),Private train transfer, Train ticket Hanoi – Hue with soft sleeping berth"},{"title":"Day 7: Hue arrival – Hotel check-in (Meal: No)","description":"Our driver will pick you up at Hue train station and transfer you to the hotel. Check in the hotel and have your own free tme to visit Hue city - historical capital in the past time. Hue is located in central Vietnam on the banks of Perfume River (Huong river), just a few miles inland from the East Sea. Hue is one of the main cultural, religious and educational centers of Vietnam. \nOvernight at hotel in Hue\nInclusion: Private Train station pick-up; Hotel in Hue"},{"title":"Day 8: Hue city - Imperial Palace Full Day (Meal: B,L)","description":"7:45 – 8:30: Our tour guide and driver will pick you up at Hue train station and depart Hue city tour.\nTake a visit:\n-\tDragon boat trip to Thien Mu pagoda - The oldest pagoda in Hue city.\n-\tImperial Citadel by car – The home of Vietnam's last royal dynasty - the Nguyen Dynasty.\n-\tHue Royal Antiques Museum - A collection of ornaments from the Nguyen Dynasty.\n-\tDong Ba Market to see the daily life of local people.\n-\tTaking the boat trip on Perfume River to see the local life along the river.\nEnjoy Lunch at local restaurant. \nAfter Lunch time, continue to visit:\n-\tKhai Dinh King’s Tomb - a blend of Western and Eastern architecture.\n-\tMinh Mang King’s Tomb, one is impressed by the majesty and symmetry of the architectural constructions.\n-\tConical hat making village, incense stick making village\n16:00 – 16:30:  Back to your hotel.\nOvernight at hotel in Hue.\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Lunch); Boat trip; Cycling; Complimentary water; Hotel in Hue\n"},{"title":"Day 9: Hue – Exploring Hai Van Giant Pass – Hoi An (Meal:B)","description":"08:30 am: Driver pick you up and transfer you to Hoi An. Hai Van Giant Pass where you stop on the way to see the most giant Pass in Vietnam is most famous and very beautiful spot in the Center to see.\nStop on Hai Van Pass for many beautiful photo with stunning and breathtaking landscape. Then keep going to Da Nang city to take overview while driving through Da Nang city, then going to Hoi An old town. Check in the hotel and have your own free time in Hoi An.\nOvernight at hotel in Hoi An.\nInclusion: Meal (Breakfast); Private car Hue- Hai Van Pass- Hoi An ( Please advise us if you prefer to go by motorbike); Hotel in Hoi An; Complimentary water\n"},{"title":"Day 10: Hoi An – My Son Sanctuary 1 Day (Meal: B, L)","description":"08:00 - 08h30: Our bus and tour guide will pick you up at your hotel/stay in Hoi An. Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village, alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n09h45:Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4thto 15thcentury.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area, your guide will explain the history of the religious site which served as a burial place for the Cham monarch centuries ago.\n12h00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village.\n15h30: The boat trip will finish at Nguyen Hoang dock in the old town. You will be free to explore the old town or return to your hotel by your own means.\nOvernight at hotel in Hoi An.\nInclusion: Transportation; All entrance fees; English speaking tour guide; Meals: (Breakfast, Lunch); Boat trip; Complimentary water; Hotel in Hoi An\n"},{"title":"Day 11: Farming & Fishing Trip (Meal:B,L)","description":"09:00-09:30 am: Picking you up at your hotel by mini- van, we will bring you over the countryside where bike are available to ride (If you don't know how to ride bicycles, please use our scooter \"XE OM\" services and you pay the extra 120,000 VND). You start the day by cycling to the local farmer in Cam Thanh Ecological village. Here you are greeted by a local host and then you join with them how to grow wet rice with their family.\nStarting farming work like plough and raking with buffalo, riding water buffalo, learning how to transplant rice, flooding farm, grinding rice, pounding rice.\nAfter then, tour guide and van will bring down to a local fishing village. You will be boarded on boat . Joining to go fishing with local fishermen at Phuoc Hai local fishing boat to experience local cast net CHAI. Continue to visit water coconut palm jungle, enjoying the basket boat and visiting the water coconut palm forest. Learn how to learn origami such as grasshoppers, flowers, rings, caps, bracelets toys made from water coconut leaves..., Having a fun to catch crab around the water coconut palm forest and after then boarding back boat, Captain Cook will cook for your lunch/dinner (morning time you will get lunch and afternoon time you will get dinner on boat) and cold beer or soft drink we will bring you back to your hotel.\n14:00: Arrive your hotel. You get the free time to walk around exploring the beauty of Hoi An old town.\nOvernight at hotel in Hoi An.\nInclusion: Mini-van for hotel pick up and drop off only in Hoi An; English Speaking guide; Bicycles; Helmet; Boat cruise plus Vietnamese bamboo basket boats; Enjoy Basket boat dancing performance; Origami teaching such as bird, grasshopper, flower and etc; Light traditional local rice dishes at local farmer house; Lunch on boat cooked by Captain Cook; Many, many photo opportunities; Complimentary water.\n"},{"title":"Day 12: Hoi An free time – Flight to Ho Chi Minh city (Meal: B)","description":"Hoi An old town is a lovely place to relax and find out the traditional custom and architecture. Leisurely time walking around the town, taking photo of old house with Chinese and Japanese combination; Tasting a nice coffee on river side…All will be very memorable.\nDriver will pick you up at the hotel and transfer you to Da Nang airport for flight to HCM city.\nReaching Tan Son Nhat airport in HCM city, meeting driver at the airport and going to the hotel in HCM city.\nOvernight at hotel in HCM city.\nInclusion: Meal (Breakfast); Private airport transfer and pick up in Da Nang and HCM city; Flight ticket Da Nang – HCM city with 20kg check luggage and 7kg hand luggage; Hotel in HCM city"},{"title":"Day 13: HCM – Cu Chi war tunnel haft day (Meal:B,L)","description":"08:00 - 08:30: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\nOn here you can try to Crawl through tunnels (do not apply for very fat people and very old people)\n12:00 Have lunch in a local restaurant\n13:00 Back to Ho Chi Minh City\n14:00 Arrive in your hotel in Ho Chi Minh City.\nOvernight at hotel in HCM city\nInclusion: Meal (Breakfast, Lunch); Transportation; All entrance fees; English speaking tour guide; Complimentary water; Hotel in HCM city\n"},{"title":"Day 14: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in HCM city\nInclusion: Transportation; English speaking tour guide; Boat trip; All entrance fees; Complimentary water; Hotel in HCM city\n"},{"title":"Day 15: HCM city – Flight out ( Meal: B)","description":"You have free time to visit HCM city by your own until the transfer to Tan Son Nhat airport for your flight out. Trip ends.\nInclusion: Meal (Breakfast); Private airport transfer\nNote: \n- If you are Solo traveller booking Share Room option, you will stay at Share Dorm Room at the hostel during your vacation.\n- This is group joining, there is a different group each trip during your vacation.\nWho should participate? - This tour is suited for all, including children as well. \nPrice structure: - Price quoted is based on per person basis.  \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! \nIf you want to extend the trip, adding more night in any city, or start from the South, please advise!"}]},{"name":"Vietnam Super Highlights - 15 Days Trip","duration":15,"travelStyle":["Sightseeing","Group","Fully Guided","Holiday"],"oldPrice":1789,"price":895,"summary":"\n  The best quality and unbeaten price for 15 Days Trip\n  100% Guaranteed Departure\n  NO hidden Cost, NO Optionals\n  Start in Hanoi and finish in Ho Chi Minh City\n  Visit Hanoi, stay in Boutique hotel inside the Old Quarter\n  Stay overnight on Boat in Halong Bay - World Heritage Site\n  Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n  Explore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\n  Chillout in Ho Chi Minh City - the biggest City of Vietnam\n  And more...\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187092_ca88b723.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187092_ca88b723.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_25fd2193.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_8fe30128.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_d91372b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_aa9223d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_3bb4f264.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_8266ef1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_48277c98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_c406d771.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_361157a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_161def01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_2c299081.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_251157a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_a7dc0a5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_091eed1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_d7e7330c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_75793e09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_a552adef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_84d420b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_92e69db9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_e019dc7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_1c90474d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_216e6c17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187092_c8e88054.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi City Tour full day (B, L)","description":"Depart at 8:00 am from your hotel by van. We will begin our day by visiting Uncle Ho, learning about his great life at the Ho Chi Minh Mausoleum, Presidential Palace, and his residential place. Next stop is the nearby Temple of Literature. The site of Vietnam´s first University, built in twelfth century, to teach Confucius’s theory to royals. Here we will also have a chance to see a traditional music performance. Lunch will be served at a local restaurant for a taste of authentic Hanoi Pho (noodle soup). In the afternoon, choose one from the numerous museums or temples around Hanoi (Museum of Ethnology, Women´s Museum, History Museum or Quan Thanh Temple). In the late afternoon walk around Hoan Kiem lake and Hanoi´s fascinating Old Quarter for some great fun, shopping, and street side traditional food, may be to try one “Hanoi bia”. This is your chance to be part of typical Hanoian style and its traditional Vietnamese culture. We finish our relaxing but informative day by attending a Water Puppet Show, a favorite experience for all visitors to Vietnam. Check in hotel and stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 3: Hanoi - Halong Bay with overnight on Cruise (B, L, D)","description":"At 9:00 am we will pick you up, by private mini-van/bus, at the hotel and begin our journey to Halong city. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the at port. Board your private boat, an authentic Chinese Junk, and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave”, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck. Stay overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 4: Halong Bay - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs, We stop to visit a floating fishing village and listen to some legendary stories of the fishermen’s daily life. Have lunch on boat while cruising back to the Halong city pier, return to Hanoi.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 - 21h00. Enjoy the unique traditional dance by Villagers\nOvernight in Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Danang City. Overnight on the Train (4 Berth Cabin sleeper)"},{"title":"Day 7: Arrive Danang - transfer to Hoi An","description":"Spend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30 am! Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. You`ll prepare the breakfast by yourself because the Train doesn`t serve breakfast.\nCheck in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An..\nPhu Thinh Resort 4* or similar"},{"title":"Day 8: Half day Tour to My Son Sanctuary (B)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch by your own around 1:00pm.\nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 9: Cycling Tra Que Village - Cooking Class (B, L)","description":"8:00am: Have breakfast at hotel. Our guide welcomes you at hotel in Hoi An and ride bicycle to Tra Que Vegetable Village far from Hoi An Ancient Town 3km. You ride through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. Arrive in Tra Que Vegetable Village; you can experience the living and working of local farmers at this organic vegetable and herb garden. Your learn how to prepare soil, grow vegetable, water to get fresh vegetables as you see at the garden from previous tourists. You have 15 minutes foot massaged by herb to fresh yourself. Here is the chance for you to join in cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods like Tam Huu Spring Roll, BanhXeo pancake… Have lunch at the family. And then ride bicycle back Hoi An Town or hotel Pm: This afternoon you have more free time to experience around the town to get some souvenir gifts or spend your time at Cua Dai beach - 4km from the ancient town.\nTrip ends at hotel around 3;30pm.\nFree to have your own dinner. Overnight in Hoi An Town.\nPhu Thinh Resort 4* or similar"},{"title":"Day 10: Hoi An Town free for leisure/shopping (B)","description":"Hoi An Ancient Town is considered as Shopping and Sightseeing Heavens so today you`ll spend your whole day to discover and go shopping in Hoi An Ancient Town.\nStay overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 11: Hoi An fly to Ho Chi Minh City (B)","description":"Today you are free in Hoi An until catch flight to  Ho Chi Minh City (Saigon). Picked up at airport upon arrival. Transfer to Saigon for check in. Overnight in Ho Chi Minh City formerly Saigon City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 12: Ho Chi Minh City full day Tour (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Trip ends at 5:00pm.\nStay overnight in Ho Chi Minh City\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 13: Cu Chi Tunnels - Cao Dai Temple full day (B, L)","description":"This morning you take a drive to Cao Dai Temple in Tay Ninh, near the Cambodian border, is home to the unique Cao Dai sect, whose patron saints include Joan of Arc, Victor Hugo and Winston Churchill to name a few. The religion is a hybrid of Buddhism, Taoism, Confucianism and Christianity. The Cao Dai Temple at Tay Ninh has been described as a Walt Disney fantasia of the East. The temple's exterior is decorated with multi-colored dragons of all shapes and sizes competing for space with a number of Buddhist symbols. Above the main entrance is the all-seeing holy eye, the symbol of the Cao Dai sect. The interior is just as engaging as statues of Jesus Christ, Buddha and the Hindu god, Brahma, stand side by side.\nThe trip to Tay Ninh is combined with a visit to the Cu Chi Tunnels. At its height, the tunnel system stretched over 250km. from Saigon to the Cambodian border and was three levels deep. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers and kitchens.\nToday the remaining tunnels have become a major tourist attraction giving the visitor a unique experience and a feel of what underground life during the US - Vietnam War.\nTour finishes at 6:00 pm at hotel.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 14: Mekong Delta - Cai Be floating Market full day (B, L)","description":"8:30 am. Depart for Cai Be Floating Market, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta.\nVisit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music.\nTake a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Check in hotel. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 15: Saigon - Concluded/ Departure home (B)","description":"Breakfast at your hotel, then transfer to Airport for your International flight to back home!\nEnd of services with great memories about Vietnam with us. Thank you so much and hope to see you again soon!"}]},{"name":"Highlights of Vietnam Tour - 14 days","duration":14,"travelStyle":["Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1260,"summary":"Explore Vietnam on an in-depth journey that takes you from North to South. Start with the colonial charm of Vietnam’s capital, Hanoi, then travel to the natural wonderland of Halong Bay and trek through Sapa’s terraced rice paddies and hill tribe villages. Visit the ancient capital Hue and bask on the beaches of Hoian. Explore the lush landscape of the Mekong Delta and the bright lights and urban bustle of Saigon. This tour takes you deep into our beautiful country, immersing you in our rich culture and elegant landscapes.\nThe entire tour is accompanied by experienced, local, English speaking guides.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153738_31b309c6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153738_31b309c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_ab552b4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_dd2916bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_78546484.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_9b22eaba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_8167e85b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_5534fa4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_8b52b52c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_24ada7d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_98c9ea01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_59ba8707.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_1da25acf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_8f8da498.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_999f3f52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_b3297cf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_9e35211a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_c57313c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_987ccf2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_dc91ac09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_ecb1b66f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_a83384b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_a3b377a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_46253249.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153738_04840d5b.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you.Meals: N/A. Accommodation: Hotel in Hanoi\n"},{"title":"DAY 2: HANOI - HALF DAY CITY TOUR","description":"Free in the morning.\nIn the afternoon, half day tour to visit Hanoi. We start with visit to President Ho Chi Minh's mausoleum (Outsite). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university. Meals: Breakfast. Accommodation: Hotel in Hanoi"},{"title":"DAY 3: HANOI - HOA LU - TAM COC","description":"8:00-8:20: Pick up at your hotel in Hanoi Old Quater the depart to Ninh Binh province. Have a break 20 minutes half way to relax and experience Vietnamese handicraft products.\n10:30: Visit Hoa Lu ancient capital of Vietnam between 968 and 1010. You have a chance to learn about Vietnamese history in the feudal system under Dinh, Le and Ly Dynasty.\n11:45: Have buffet lunch in the restaurant with a lot of local foods: goat meat, fried rice... Vegetarian foods is always available in the buffet lunch.\n13:00: Visit Tam Coc by 1.5 hour bamboo boat. During the boat trip, you will be surprised by the charming beauty here with paddy field, river, water, cloud, sky and stunning cave system. All make a masterpiece which Vietnamese people called \"Halong bay on land\"\n14:30: Cycling around the village to discover the life of local people with 45 mins.\n15:15: Get back to bus then leave for Mua Cave (Dancing Cave). Walk up almost 500 steps, you can reach to the top of Lying Dragon Mountain & amp; have an amazing panoramic view of Tam Coc from here.\n17:00: Drive to your hotel in Ninh for checkin. Meals: Breakfast/Lunch. Accommodation: Hotel in Ninh Binh"},{"title":"DAY 4: NINH BINH - HALONG BAY - NIGHT ON BOARD","description":"6:45 - 7:00 : Pick up at your hotel  in Ninh Binh by shuttle bus\n12:30 – 12:30 : Embark the cruise at Tuan Chau harbor. Enjoy welcome drink, cruise briefing & start cruising.\n13:00 – 15:30 : A stunning lunch is served while cruising into the Halong Bay with thousands of extraordinary shaped limestone islands considered as the heaven on the earth\n15:30 – 17:00 : Explore the area and be charmed by the outstanding masterpiece of the Mother Nature. Visit Mê Cung Cave – one of the most beautiful caves in Halong Bay. Climb up & see the panoramic view of the bay from above. Enjoy swimming in the crystal water of the peaceful Bay. \n17:00 – 19:00 : Return to the cruise the Sunset party and admire the best moment of the day when the sun starts to set. Or enjoy the massage treatment in your comfortable cabin. \n19:00 : Savor an amazing and dreamlike dinner in Fairy cave (or Drum cave) with extremely delicious food which is not only impressed by its incredible taste, but also by great fruit and vegetable carving performance. Socialize with new friends and crew members, enjoy squid fishing or leisurely relax on the top deck in the middle of the tranquil bay.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\nMeals: Breakfast/Lunch/Dinner. Accommodation: Night on board"},{"title":"DAY 5: HALONG BAY - HANOI - HOIAN","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.  Meals: Breakfast/Lunch. Accommodation: Hotel in Hoian"},{"title":"DAY 6: HOIAN FREE AND EASY DA","description":"Free and easy day for shopping and personal activities in Hoian ancient town\n Meals: Breakfast. Accommodation: Hotel in Hoian"},{"title":"DAY 7: HOIAN & COUNTRYSIDE CYCLING TOUR – 9KM","description":"Pickup at the hotel at 08:00. \nToday, you spend a day leisurely cycling though the scenic countryside of Vietnam, far from the traffic the motor scooters, and the noises the city. You will cross the islands on the Song Thu river delta using local transportation, including ferries and floating bridge.\nThis tour will take you to discover how wooden river boats Kim Bong Village wooden handicraft - Hoi An are made, learn the secret of weaving the colorful straw “Hoi An” sleeping mats Try the renowned Vietnamese basket boats . You will spend the day with first-hand contact with one of the rural inhabitant of the region, far from the usual tourist circuits.\nAt lunchtime you will be invited into the home of a local Vietnamese family for a traditional Vietnamese meal, and learn their customs and traditions. After you have relaxed for a while under the shade of a mango tree, you will Begin your return towards Hoi An, which will take about an hour.\nArrive Hoian at about 3pm. Meals: Breakfast/Lunch. Accommodation: Hotel in Hoian"},{"title":"DAY 8: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 9: HOIAN - FREE AND EASY DAY","description":"Free and easy day to relax and explore Hoian ancient town.\n Meals: Breakfast. Accommodation: Hotel in Hoian"},{"title":"DAY 10: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"Free in the morning. \n\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\nTrain schedule is subject to change depending on availability\nTrain journeys are part of a great local experience. The train take about 2.5 hours. Restrooms at either end of the carriages.\nMeals: Breakfast.Accommodation: Hotel in Hue"},{"title":"DAY 11: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel.\n\nToday, we will spend a full day touring Hue city. \n\nIn the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant. \n\nIn the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village.Then airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival. Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon\n"},{"title":"DAY 12: SAIGON - MEKONG CAI BE FLOATING MARKET","description":"6.30 AM: Depart for Cai Be by car/van via Trung Luong Express Highway, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. \n9.30 AM: On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Then wander into the small villages to visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk music.\n11.30 AM: Keep cruising to a series of small canals to experience the charms of the Upper Mekong Delta. Arrive in Tan Phong island, join to a cooking class. Enjoy your cooking experience and learn how to prepare special Vietnamese dishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax on the hammocks to get back your energy.\n14.00 PM: Cycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn more about the local daily life in the Mekong delta.\n15:00 PM: Take a boat ride back to CaiBe, meet thecar/van for the trip back to Hochiminh city.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon"},{"title":"DAY 13: SAIGON FREE AND EASY DAY","description":"Today, you are free and easy to explore Saigon.\n Meals: Breakfast. Accommodation: Hotel in Saigon"},{"title":"DAY 14: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast. Accommodation: N/A"}]},{"name":"Vietnam for Solo Travellers","duration":12,"travelStyle":["Discovery","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1254,"summary":"Route: Hanoi – Halong – Danang – Hoian – Saigon – Mekong delta - Saigon\nDuration: 12 days / 11nights\nFeatures: Once you travel by yourself in Vietnam, you may find that it is so easy to be alone here, carrying on a spontaneous journey, enjoy the place at most, contemplate nature, talk to the locals, and enjoy an exciting life the way it is without worries, as you will find everywhere the most friendly people as well as easiest guidelines to go on.\nExtension: Connecting with Yunnan, Nanning (China), Vientiane, Xieng Khoang, Savanakhet, Pakse (Laos), Phnompenh, Siem Reap (Cambodia) by convenient landway. \nItinerary:\nDay 1ARRIVAL IN HANOI, VISIT HANOI (D)\nDay 2 VISIT HANOI(B)\nDay 3 HANOI AT LEISURE(B)\nDay 4 HANOI - HALONG BAY(B/L/D)\nDay 5 HALONG BAY - HANOI(B)\nDay 6 HANOI – DANANG BY TRAIN(B)\nDay 7 DANANG – HOIAN(B/L)\nDay 8 HOIAN – MYSON(B/L)\nDay 9 HOIAN AT LEISURE(B)\nDay 10 HOIAN – DANANG – SAIGON – CU CHI(B)\nDay 11 SAIGON – BEN TRE – SAIGON(B)\nDay 12 SAIGON DEPARTURE \n","highlights":["Indulge yourself along the ancient lantern-lit streets of Hoi An town","Feel the metropolitan pulse of Saigon and experience its highlights","Glide through the Mekong Delta and marvel in the slow rhythm of life"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114711_1f8f1b94.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114711_1f8f1b94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_1eb9456e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_d879c340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_900a223f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_b2f4ba76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_1d1ff897.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_aa31e75f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_26d82f60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_f071df82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_fc2f9e3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_eeb35325.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_e717c997.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_bd9163a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_0993a57e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_ded98183.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_3ac6f352.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_5beae7a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_79508a9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_49807f22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_1864cfd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_651fa5a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_590323da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_b1f6f77f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114711_c0dc8642.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: ARRIVAL IN HANOI, VISIT HANOI (D)","description":" Welcome to Vietnam!\nUpon your arrival in Hanoi, you will be greeted by the tourguide and private car of THREELAND TRAVEL. Transfer to the city to check-in your hotel located at the city center. Afternoon visit the History Museum of Hanoi, Ngoc Son temple, the Sword Lake and Tran Quoc pagoda. (You can choose alternatively Army History Museum, “Hilton Hanoi” Museum, Women’s Museum, Quan Thanh Temple, Temple of Literature or pagodas depending on your interests). Dinner at Ngon Restaurant of Hanoi with your guide. Overnight in Hanoi.\nPlease note: Usual check-in time is 2pm.  Museums are often closed on Monday. Details to be advised by THREELAND TRAVEL."},{"title":"Day 2: VISIT HANOI (B)","description":" Morning at your leisure to relax and discover the city by your own. Afternoon continue to visit the city with stopover at Kim Lien pagoda, one of the most famous Buddhist temples in Hanoi, enjoy the landscape of the grand West Lake and the Ethnology Museum. Stroll around on foot with your tourguide in Hanoi Old Quarter, visit the ancient house on Ma May street and intermingle with the Hanoians in their extremely exciting routine life. Overnight in Hanoi. "},{"title":"DAY 3: HANOI AT LEISURE (B)","description":" At your leisure the whole day for your own discovery of Hanoi. (no services provided) "},{"title":"DAY 4: HANOI - HALONG BAY/ LAN HA BAY (B/L/D)","description":" You will be picked up in the morning to transfer to Halong Bay, the most famous natural wonder of Vietnam, by a shuttle bus. The road to Halong takes around 3h30’ passing by the Red River Delta and many craft towns where products of green bean cakes, traditional cakes, ceramics and other handicraft are made by skillful Northern people. Board your boat in Halong for a great sea cruise between thousands of islands and rocks in Halong, which have been short-listed to be the best natural wonders of the world and twice as the UNESCO World Heritage. Lunch and dinner of seafood will be served on board. Afternoon you can relax, have sunbath, go kayaking or discover a cave in Halong. Overnight on board on the sea. (tourguide on board included). "},{"title":"DAY 5: HALONG BAY/ LAN HA BAY - HANOI (B)","description":" Morning wake up with a taichi-quan or yoga exercises guided by the crew before having breakfast whilst your boat goes on between Halong islets. Return to the Wharf to be back to Hanoi by shuttle bus at midday. Arrive in the city around 3-4pm. Overnight in Hanoi. "},{"title":"DAY 6: HANOI – DANANG BY TRAIN (B)","description":" At your leisure till taking the Train to Danang in the Central Vietnam. Overnight on the train (ticket booked by THREELAND TRAVEL).\nPlease note! Usual check-out time is 12.00pm."},{"title":"DAY 7: DANANG – HOIAN (B, L)","description":" Welcomed in Danang Railway Station by the tourguide of THREELAND in Central Vietnam. Visit the most industrial city of the Central and taste Danang seafoods on a street stall. Visit Cham Museum to learn about the original culture of this land and prepare yourself for the upcoming visits to My Son Sanctuary and further. Transfer to Hoian. Intermingle with Hoian people by hanging around Hoian market by the Hoai river and visit Hoian famous points including old China trading houses, temples, and Hoian traditional houses mixed of Vietnamese, Japanese and Chinese styles. Overnight in Hoian. "},{"title":"DAY 8: HOIAN – MY SON (B, L)","description":"Morning going on to visit Hoian with your tourguide. After lunch with street foods of Hoian like caolau, mi Quang, transfer to My Son, the cradle of Cham Culture that once dominated the area. Back to Hoian late afternoon. Overnight Hoian.\nOptional tour: Visit Tra Que herb village in the Morning. "},{"title":"DAY 9: HOIAN AT LEISURE (B)","description":" There will be nothing better than a day at leisure in the ancient town of Hoian to refresh yourself and chill out your recent impression of your visits in vietnam. At leisure the whole day in Hoian. "},{"title":"DAY 10: HOIAN – DANANG – SAIGON – CU CHI (B)","description":" Transfer to Danang to take flight Danang – Saigon. Welcomed in Saigon and transfer to hotel to check-in. have a short city tour to the fascinating Binh Tay market, Thien hau pagoda and the District 1 with numerous colonial-styled charming houses and hectic atmosphere of the modern life. Enjoy Bach Dang ice-cream at one of the most popular ice-cream stalls in Saigon. Afternoon come to Cu Chi, the rare trace from the Vietnam War. You can try to crawl in Cu Chi Tunnel to imagine about the real life of the normal Vietnamese during the wartime. Back to Saigon in the afternoon. Overnight in Saigon. "},{"title":"DAY 11: SAIGON – BEN TRE – SAIGON (B)","description":" Morning transfer from Saigon to Ben Tre, a province nearby Saigon but full of the exciting life of the Mekong people. Being one of several mighties rivers in the world, the Mekong flows into Vietnam at its lowest part before coming to the Pacific and left behind a hectic life of “Mekong people”. Upon arriving, go between coconut lines by boat to reach some gardened houses where people run their family factories producing candy, feed honey bee or plant orchards. You can taste some wine or tea with honey right at the gardens here. Back to Saigon later afternoon. Overnight Saigon. "},{"title":"DAY 12: SAIGON DEPARTURE (B)","description":" At leisure in the rest of the day until transfer to the airport for your departing flight.\nEnd of services. "}]},{"name":"Highlight of Vietnam","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1995,"summary":"A vibrant metropolis, Saigon teems with energy, activity and motion. Everywhere you look, you see the convergence of traditional and modern life. Begin the trip into modern history with a tour of the Reunification Palace. Formerly the Independence Palace of the South Vietnamese president, this 60s style building was famously stormed by tanks on April 30, 1975 signifying the fall of South Vietnam. It has been preserved in its original state, and the original tanks remain on display near the entrance gates.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177174_222680a2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177174_222680a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177174_d80a79b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177174_6b60521e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177174_3cf02469.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177174_a4575345.jpg"],"destinations":["Ho Chi Minh City","Hue","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Saigon: Sightseeing in Saigon","description":"A vibrant metropolis, Saigon teems with energy, activity and motion. Everywhere you look, you see the convergence of traditional and modern life. Begin the trip into modern history with a tour of the Reunification Palace. Formerly the Independence Palace of the South Vietnamese president, this 60s style building was famously stormed by tanks on April 30, 1975 signifying the fall of South Vietnam. It has been preserved in its original state, and the original tanks remain on display near the entrance gates.\nAfterwards, drive to the historic centre to visit the Emperor of Jade Pagoda, one of Saigon's most interesting pagodas. Proceed to pay a quick visit to the neo-Romanesque Notre Dame Cathedral and the Central Post Office. Pass by the classic European-style landmarks such as the ornate City Hall (Hotel De Ville), the old Opera House (both may only be viewed from the outside). Finally, end up at the central Ben Thanh Market, where vendors display a vast array of goods and handicrafts, appealing to every taste - Overnight in Saigon"},{"title":"Day 2: Saigon: Excursion to Cu Chi Tunnels","description":"Saigon (Breakfast: Hotel )\nExcursion to Cu Chi Tunnels\nNever discovered by American forces, the Cu Chi Tunnels were an important Vietcong base during the American War. Stretching over 200 km, this incredible underground network, dug by hand out of hard laterite, connected command posts, hospitals, shelter and weapons factories. Today, walk through the area and learn about the day to day life of the Vietcong, bear witness to the cleverly disguised entrances and elaborate booby-traps, and even venture inside the tunnels, some of which have been modified to accommodate tourists.\nOld Saigon Walking Tour\nTake a walk through the city streets to unearth the secrets of Saigon. Set off from your hotel to a thriving local market to see how these bustling and vibrant markets play a major role in the daily lives of Vietnamese people. From here stroll through the colourful back alleyways lined with flower shops and breathe in the aromas of the freshly cut blooms. Pass through another street where mechanics specialise in restoring vintage Vespa scooters. Take in the scenes of local life as you wander these narrow lanes. Stop for a refreshing traditional iced coffee in a hidden cafe frequented by locals. The oldest coffee shop in Saigon, this old fashioned establishment has a colourful history stretching back over seven decades. Continue the walk through some other back lanes the go along to another famous street filled with shops selling locally-made guitars. Continue on foot through adjacent blocks with some old yet lively apartment compound and where one will encounter authentic life scenes of the urban working class. Walk toward an interesting museum which displays an amazing collection of more than 3,000 artifacts relating to the history of Vietnamese traditional medicine. After the visit, hop on the vehicle and drive back to your hotel - Overnight in Saigon"},{"title":"Day 3: Saigon: Pedal and Paddle in Ben Tre","description":"Pedal and Paddle in Ben Tre\nImmerse yourself fully in the local culture of the Mekong Delta with a day out to rustic Ben Tre. A journey of about two and a half hours will bring you to a peaceful area of lush orchards, green rice paddies and coconut fields. The fresh sweet coconut juice is said to be the best in the country. The industrious local residents have found many other uses for the humble coconut, including turning them into household items and cosmetics. Hop on a bike for a ride along the shady paths to visit the home of local antique collector, Uncle Six. This friendly older man will welcome you into his home from where he also sells his ceramics. If you're feeling fit, Uncle Six will even show you how to climb the coconut trees using just your bare hands. Continue your two-wheeled exploration along rural pathways that wind their way alongside dense vegetation and small tributaries of the Mekong. Board a rowing boat and cruise along the small canals under the shade of the coconut trees. Then change your mode of transport to a motorised boat. After a delicious lunch of local specialties cooked by the host, visit some local workshops to see how rice paper and sticky coconut sweets are made - Overnight in Saigon"},{"title":"Day 4: Saigon - Hue","description":"Transfer by air conditioned vehicle\nFlight from Saigon to Hue\nTransfer by air conditioned vehicle\nSightseeing in Hue\nHue served as the capital of Vietnam for more than 140 years. It houses ancient temples, imperial buildings and French-style edifices. It was established in the 17th century.\nVisit the Imperial Tombs of Tu Duc and Khai Dinh\nVenture into the countryside around Hue to the Imperial Tomb of Tu Duc. Tu Duc, the longest reigning Vietnamese emperor, designed and built this elegant tomb during his lifetime, using it as a retreat for meditation, reading and theatre performances. Take some time to soak in the tranquil atmosphere, wandering among the gracefully proportioned pavilions, courtyards and lotus ponds. Afterwards visit the Imperial Tomb of Khai Dinh, dramatically located on a hillside. The last of the monumental tombs of the Nguyen dynasty, completed in 1931, this tomb incorporates distinct European elements into traditional Vietnamese architecture.\nVisit the Imperial Citadel\nLocated in the heart of Hue is the Imperial Citadel, a vast complex built in the early 19th century and modelled after the Forbidden City of Peking. The original walls stretched for 10 km and were surrounded by a wide moat. Today, most of the buildings have been destroyed due to bombing during the Vietnam-American War, but the monuments that remain provide a fascinating glimpse into the court life of the Nguyen Dynasty. Approach the city past the striking Flag Tower, where a giant Vietnamese flag waves proudly overhead, to the imposing Ngo Mon Gate, the main entrance to the Imperial Enclosure. Enter into an area of spacious courtyards and serene lotus ponds, and visit Dien Tho Residence (Dien Tho palace) where the Queen mother lived, visit Thai Hoa Palace, the magnificently decorated reception hall, the Halls of the Mandarins, and the original Nine Dynastic Urns, among other sites, including a visit to the Hue Royal Antiquities Museum. - Overnight in Hue"},{"title":"Day 5: Hue Hoi An","description":"Hue - Hoi An (Breakfast: Hotel / Lunch: Tha Om Restaurant (Vinh Tu Garden House) )\nVisit Vinh Tu Garden House with talking to the owner and enjoy lunch\nKnown as one of the most unique and beautiful buildings which is still remained after a long time. Vinh Tu (Tha Om Garden House) is not only a place to explore the city's architectural heritage but a venue as well for Hue's finest dishes. The house itself is a sophisticated garden with lotus ponds and pavilion, complete with low and dipping roofs to create an unforgettable memory for every visitors of the traditional Hue residence harmonizing with an exceptional Vietnamese dinner within the house or in the gardens when the sun sets. Meet the Royal family and listen to their family's stories is a way to recall the great history of the last Vietnam Feudal Dynasty. Lunch will be served at the garden house, enjoy the food with the host.\nBy vehicle from Hue to Hoi An\nDrive south from Hue along scenic mountain roads with spectacular views over the coastline. Highlights along the way include the dramatic Hai Van Pass, the high dividing line between the climate zones of North and South Vietnam; Lang Co, a lovely stretch of beach curving outwards between a clear blue lagoon and the East Vietnam Sea; and the large coastal city of Danang - Overnight in Hoi An"},{"title":"Day 6: Hoi An","description":"Hoi An (Breakfast: Hotel )\nSightseeing in Hoi An with a boat trip on the Thu Bon River\nThe exquisitely preserved merchant town of Hoi An was declared a Unesco World Heritage Site in 1999. Its colourful shop houses and temples reflect a diverse heritage, dating back to the 16th and 17th century, when it was a major port for Western, Chinese and Japanese traders. Today it is a thriving centre of traditional crafts and a shoppers' paradise, best explored on foot. Wander through the cobbled streets, past low tile-roofed buildings, the bustling central market and the small harbour where colourfully painted boats are moored. The walking tour will include visits to a private house, where members of the same family have lived continuously for centuries in a traditional setting; to one of the family chapels built by prominent merchant or official families as centres for ancestor worship; and to a typical Chinese-style Pagoda or assembly hall. Finally, continue to the famous Japanese Covered Bridge, first constructed in 1593 by the Japanese community of Hoi An to link the town with the Chinese quarters across the stream. In the afternoon, board a local boat and cruise down the Thu Bon River, enjoying the unspoiled countryside and stopping to visit a pottery village and before returning to Hoi An harbour - Overnight in Hoi An"},{"title":"Day 7: Hoi An - Da Nang","description":"Hoi An - Danang - Hanoi (Breakfast: Hotel )\nBy vehicle from Hoi An to Danang airport\nFlight from Danang to Hanoi\nTransfer by air conditioned vehicle\nWalk the Rail Tracks of Hanoi\nStart the tour on the rails a few meters north Hanoi's main train station. Walk along the very narrow streets hosting the rails sometime not even a metre far from the entrance door of houses. Enjoy this original and photogenic scene walking along the street until 153 Phung Hung where you go back down to the road and follow the street's sidewalk. Walk past a funeral home where you will see a group of people mourning and wearing the traditional white fabric around the forehead, which is the local equivalent to the western tradition of wearing black clothes. Continue walking toward Long Bien train station. From Long Bien train station start to cross the bridge and stop half way to go down the stairs onto the urban island. Have a rest and visit the orchards. Continue crossing the bridge and meet with the car which will transfer you to Gia Lam train station. Take your train ticket and jump in to cross the bridge on the other way, riding with the locals in the hard seater wagon. On week days you will stop at Long Bien, and on Saturday and Sunday you will stop at Hanoi Station. Meet your driver after disembarking and transfer back to your hotel.\nVisit a Water Puppet Show\nSee a Water Puppet Show, a fantastic art form that originated in northern Vietnam, but is now best seen in Hanoi - Overnight in Hanoi"},{"title":"Day 8: Halong - Hanoi","description":"Halong - Hanoi (Breakfast: Hotel / Lunch: Meals incl. in itinerary (Vietnam) )\nTransfer by L'Azalee Cruise shuttle bus service to/from Halong * No local guide *\nExcursion by L'Azalee Classic boat through Halong Bay including lunch (SIC) * No local guide *\nAt Tuan Chau island, board L'Azalee Classic day cruise and begin cruising through the incredible limestone karsts of Halong Bay. After lunch, sail through Thumb Island, Incense Island and Ba Hang floating village. Finally, touch the majesty of Halong bay by visiting Thien Cung (Heaven) cave on a guided walking highlighting the incredible natural artwork inside. Back to cruise and to Tuan Chau islan - Overnight in Hanoi"},{"title":"Day 9: Hanoi","description":"Hanoi (Breakfast: Hotel / Dinner: Meals incl. in itinerary (Vietnam) )\nSightseeing in Hanoi\nAlthough it is the modern-day capital of Vietnam, Hanoi still retains the mystery and charm of past centuries.\nNarrow lanes and traditional shop houses invite an exciting exploration by walking, while it's many beautiful public spaces\nlakes, parks, tree-lined boulevards and monuments; give the city an air of elegance and harmony with nature unique among Asian capitals.\nVisit the Temple of Literature\nThe Temple of Literature has a peaceful series of walled courtyards and graceful gateways, and this monument is one of the best-preserved examples of traditional Vietnamese architecture. Founded in 1070 and dedicated to Confucius, this was also the site of Vietnam's first university. In one courtyard, giant stone tortoises bear stele on their backs, listing the accomplishments of graduating scholars.\nVisit the Ho Chi Minh Memorial Complex (Ho Chi Minh Mausoleum be viewed from the outside only)\nStart the exploration of the vast Ho Chi Minh Memorial Complex with a stroll past the Ho Chi Minh Mausoleum which contains the embalmed body of Ho Chi Minh (closed Mondays, Fridays, and from 15 June to 15 August). View the outside of the Presidential Palace and then walk through the park to the Ho Chi Minh Stilt House where Ho Chi Minh lived from 1958 until his final days in 1969. Preserved in the same condition as during his life, it may be viewed through the windows. Continue to the miniature 11th century One Pillar Pagoda which was rebuilt after being destroyed by the French in 1954.\nVisit the Museum of Ethnology\nThe Museum of Ethnology brings to life the astonishing ethnic diversity in Vietnam, with art and artefacts from the 54 different ethnic groups that inhabit the country. Inside the museum are detailed descriptions of minority groups, with examples of their traditional clothing and way of life. Outside are faithful reconstructions of traditional longhouses, cemeteries and other distinctive ethnic buildings.\nFoodies afoot in Hanoi\nEnjoy a taste of local Hanoian life as you explore a local market and some of the city's best street food stalls. Meet your guide at the bustling Hom market, one of the biggest and most popular markets in Hanoi. Wander through the narrow alleyways passing colourful stalls piled high with a vast array of fruit, vegetables, sweets and elaborate temple offerings. Take photos of the vibrant colours and breathe in the aromas of the tropical fruits. If you're feeling brave, venture to the exotic section to see kicking frogs, silkworms and wriggling eels. The entire market is alive with the buzz and excitement of the locals bartering and haggling for the freshest ingredients at the best prices. Your guide will take you to popular street food stalls where you can sample some of the city's signature dishes. Stop at a local coffee shop to taste this rich and flavourful drink then continue your culinary exploration with a stroll through the maze of bustling streets that make up the Old Quarter of Hanoi. Join the locals and pull up a plastic stool at a pavement stall to try Vietnamese snacks and a cup of iced tea, followed by a sweet dessert of fresh fruit and condensed milk. End the tour with a cold draught beer at a sidewalk stall popular with locals. - Overnight in Hanoi\n"},{"title":"Day 10: Hanoi","description":"Time at Leisure\n\n*\tHon Chen Temple festival will take place on Perfume river in Hue between March - April and August - September. Please check your traveling date with us in advance."}]},{"name":"Vietnam the Hidden Treasure of Pu Luong","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1118,"summary":"\n\tTraveling from North to South is the best direction to research the traditional culture and history of Vietnam before you reach its modern daily life. Let's join the tour to visit World Heritages sites of Vietnam and discover Pu Luong Nature Reserve - the homeland of Thai and Muong ethnic communities.\n","highlights":["Marvel at magnificent mountain ranges and stunning rice fields in Pu Luong","Trek through local working farm’s land and interact with the local people","Admire spectacular limestone karsts jutting out from paddy fields in Ninh Binh"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138901_59bd566d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138901_59bd566d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_94ee2156.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_c0db4921.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_58df0299.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_a37b97ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_906b8b58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_c8e0381c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_0196b256.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_8a6d252f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_6e267535.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_c5a1bd2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_784544d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_d320bca0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_c10ce157.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_d7f63be7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_4d1d2e16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_f91a1cb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_b5c26690.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_1d8e67ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_7e251e96.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_356d8f23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_33bf3020.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_048c69f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138901_d5c485fe.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"DAY1: HANOI ARRIVAL – CITY TOUR (-/-/D)","description":"Welcome to Hanoi – Vietnam!\nUpon arrival flight, the local driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to the center of Hanoi then check-in at hotel. \nOur tour guide will pick you at your hotel in the Old Quarter and then we get a Cyclo to Hoan Kiem Lake, one of the major scenic spots in the city and serves as a focal point for its public life to visit Ngoc Son temple and The Huc Bridge. And then we will stop at Hanoi Opera House, erected by the French colonial administration between 1901 and 1911. \nAfter that, on the way to Water puppet show, we will see Sofitel Legend Metropole Hanoi Hotel - A Grand Dame of Southeast Asia that welcomes guests to experience her colonial grandeur and timeless elegance. Located steps from the Opera House in Hanoï’s French Quarter, this legendary property bring guests into intimate contact with the opulence of another era. A stage art invented by the Vietnamese peasants hundred years ago, with nearly 20 stories of Vietnam traditions and daily scenes will be the last activity. Finally we will take a walk on the streets of the old quarter and enjoy the Vietnamese traditional food: Beef noodles. \nNight activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with life music, the young people of Hanoi and also foreign tourists. Hundreds of bars and pubs in the Old Quarter are also at your disposal. Or just simple spend your time at shopping malls or various boutique Shops.\nPlease note: Standard check in time is 14:00"},{"title":"DAY 2: HANOI – TAM COC – HOA LU - HANOI (B/L/-)","description":"A 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Overnight in Hanoi."},{"title":"DAY 3: HANOI – PU LUONG (B/L/-)","description":"Pick up and transfer from your hotel in Hanoi to Pu Luong retreat.\nIn the morning, you enter Pu Luong Nature Reserve by road via a breath taking mountain pass giving you a panoramic view of the whole valley. You arrive at your accommodation in time for a delicious lunch, followed by free time to explore the beautiful retreat, with its captivating panoramic views and tranquil setting.\nVietnamese set menu lunch at the retreat. \nIn the afternoon, you will be transferred to a suspension bridge over the Cham River, where you begin your walk in search of stunning water wheels. Get up close to each wheel and discover how water is moved from river to handmade bamboo aqueducts via simple constructions of all sizes.\nArriving at scenic Tan Lap Bridge, you disembark to be transferred back to Pu Luong Retreat.\nDinner at your own arrangement for more flexibility. Overnight in Pu Luong. "},{"title":"DAY 4: ENTHRALLING TREKKING ROUTES (B/L/-)","description":"Breakfast at the retreat. We start early in the morning to descend into the beautiful valley facing the Retreat where you walk around tumbling rice terraces. Trek through small paths shrouded in vegetation to slowly reveal a picturesque village sitting at the base of a towering mountain. Your camera will not be able to sit still!\nContinuing to the base of the valley, you weave between roads and farm land, villages and wild fields, ponds and rivers, mountains and open land. Savour the ever-changing scenery as you trek to a beautiful spot to enjoy a simple picnic lunch.\nAfter enjoying delicious food, you have your free afternoon to explore the refreshing water to the nearby river, before moving to pick up point to be transferred back to the Retreat.\nDinner at your own arrangement for more flexibility. Overnight in Pu Luong. "},{"title":"DAY 5: VILLAGE LIFE AND THE COMMUNITY – PU LUONG – HANOI (B/L/-)","description":"Breakfast at the retreat. \nYou have the chance to get close to village life and interact with locals living in the hills above the Retreat. Glimpse at daily life, walk around working farm land and rice fields, and learn about making rice wine and weaving colorful textiles. Then you will be transferred back to Puluong Retreat for lunch.\nCheck out the Lodge in the afternoon and transfer back to your hotel in Hanoi.  Overnight in Hanoi."},{"title":"DAY 6: HANOI - HALONG/LAN HA BAY - OVERNIGHT ON BOARD (B/L/D)","description":"From Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach islets to enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat near Titov Beach. \nPlease note! The program may be little varied upon the cruise you choose. "},{"title":"DAY 7: HALONG/ LAN HA BAY – HANOI – DANANG – HOI AN (B/L/-)","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf around 11.00. \nTake shuttle bus back to Hanoi. Our driver shall wait for you en route to continue the transfer to Noi Bai International Airport for a short flight to Danang. \nWelcome at the airport then transfer along the coast to reach Hoi An Ancient Town to check in.\nOvernight in Hoi An."},{"title":"DAY 8: HOI AN – HALF DAY CITY - HUE (B/-/-)","description":"After breakfast at hotel, you take interesting walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, enjoy the attractiveness of ancient houses Tan Ky & Phung Hung, as well as Japanese Bridge. Later we can stop at shrines or stroll into the market located by Thu Bon river, where you may find the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. After lunch at your own arrangement, you will be transferred on a shuttle bus from Hoi An to Hue. Upon arrival in Hue, check in to your hotel and overnight in Hue. "},{"title":"DAY 9: HUE - FULL DAY CITY (B/L/-)","description":"After breakfast, at around 7:30 - 8:00 AM, you will be picked up from hotel to take a full day to discover Hue: visit Emperor Minh Mang's Mausoleum, Emperor Khai Dinh's Mausoleum, Performing Programs of VO KINH VAN AN - Vietnam Traditional kungfu and Emperor Tu Duc’s Mausoleums. Stop on the way to see how conical hats and incense sticks are made. Lunch at a local restaurant. In the afternoon, visit Imperial capital during Nguyen Dynasty, Hue museum of Royal Fine Arts and the seven – storey Thien Mu Pagoda on the riverbank. Return by boat on the gentle Perfume River and do not miss the sunset on the river . Overnight in Hue."},{"title":"DAY 10: HUE - SAIGON - HALF DAY CITY (B/-/-)","description":"After breakfast, you will be transfer without guide to Hue Airport to board a midday flight to Saigon. Upon arrival in Saigon, you will be transfer to check-in your hotel. This afternoon, our guide will show you the most interesting sights that Saigon has to offer. Depart from your hotel to the Reunification Palace; this beautifully preserved palace was the residence of the President of the Republic of Vietnam. On April 30th 1975 the American War officially came to an end here. Go back in time in a visiting the War Remnants Museum where you can see countless artifacts, photographs and pictures documenting the second Indochina war. Afterward, we visit The Notre Dame Cathedral, which was built in 1880, and the Old Post Office, which was built sometime between 1886 and 1891. It is one of the best examples of classical French colonial architecture. Next is Jade Emperor Pagoda. This is an ancient temple, as the Chinese temple style with bright decorative motifs. Our last stop would be at a local Market where you can practice your bargaining skills while shopping for souvenirs. Discover local life and culture. You’ll find some of the friendliest, liveliest, most convivial people in the city in here. Return your hotel and overnight in Saigon."},{"title":"DAY 11: SAIGON – CU CHI TUNNELS – SAIGON (B/L/-)","description":"Morning visit Cu Chi Tunnels, one of the few remaining monuments to the Vietnam War. Beneath the ground lie 200 km of tunnels, dug by hand and inhabited by the forces of the Vietnamese guerillas during the conflict. At its peak, prior to the Tet Offensive in 1968, the tunnel complex was base to almost 10,000 troops. To this day, it remains one of the most impressive examples of how fierce the war used to be.  You even can try to crawl some dozens of m on the tunnel underground to have the real experience. Return to Saigon.\nAfternoon, your free time for shopping in the downtown where you can choose many lovely stuff at the very reasonable price. A few places to be mentioned to visit during your shopping is Ben Thanh Market – the center and typical market of Saigon; Saigon Square where is a few minutes walking from Ben Thanh Market; An Dong Plaza and its nearby Market; or Diamond Plaza if you are seeking the high qualified and brand name goods.  Overnight in Saigon."},{"title":"DAY 12: SAIGON – DEPARTURE (B/-/-)","description":"Breakfast at hotel. If your flight is in the  afternoon, you will have a half day more for the sightseeing and shopping before the departure till check out time and transfer to the airport for the departure flight back to your sweet home.  \nEnd of services!\nPlease note: Standard check out time is around 12.00."}]}]