[{"name":"3-day Mai Chau & Pu Luong Nature Reserve","duration":3,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":145,"summary":"\n\tMai Chau - Pu Luong 3 days Trekking - A three-day trip in the Mai Chau & Pu Luong area gives us that added amount of time to get up close and personal with the Thai people and the natural wonders of the area. Take your time to learn, and explore as you feel necessary.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/165788_0cf45c90.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/165788_0cf45c90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_33e3a9c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_98eeb45c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_b36e5923.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_9988fdad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_10e05dd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_28dda5f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_44fe6ac5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_fc6880e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_ba9840ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_6dd44cdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_c1a99210.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_c43dbb15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_1c9c846c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_921d919f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_231c72c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/165788_b2b1fca1.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"DAY 1: Hanoi – Mai Chau Valley (Lunch/Dinner)","description":"7:30 - 8:00AM : Pick up at your hotel in the Old Quarter in our comfortable van/bus\n10:00AM : Short break on the way\n11:30-12:30PM : Scenic photo stop of Mai Chau valley/arrive in Mai Chau\n12:30PM : Traditional lunch in our home(vegetarian available)\n14:30PM: Bicycle ride with your tour guide, see farmers working in fields, locals weaving  scarves and visit surrounding peaceful villages.\n17:00PM: Free time for cycling, walking, shopping\n19:00PM : Enjoy the dinner, you will have a chance to Enjoy traditional dishes prepared in the style of the native Thai  and watch the Thai’s traditional\nDance show and drink traditional wine “Ruou can”."},{"title":"DAY 2: MAI CHAU – PU LUONG NATURE RESERVE (Breakfast/Lunch/Dinner)","description":"7:30-8:30AM: Breakfast time\n8:30-10:30AM: Drive 35km to Pu Luong Nature Reserve, we will stop on the way to see chopsticks factories and take photos sometimes.\n10:30 – 12:30PM: Arrive to Pu Luong Nature reserve, we will take a short break for 10 minutes before the start to do trekking and explore the beautiful scenery of the mountains and stunning rice terraces\n12:30 – 15:30PM: Enjoy Lunch in the village and take a rest before we restart trekking then drive back to Mai Chau.\n19:00PM: Enjoy the dinner and take a comfortable sleep to recharge for the next activity the next morning.  "},{"title":"Day 3: Mai Chau - Explore Remote Rural Villages ( Breakfast/Lunch)","description":"07:30AM:Breakfast time\n08:30AM: Go with a local Thai tour guide, we will cycling for 2km before start the trek to visit more remote rural villages: Na Meo, Na Mo, and Xam Pa villages to see the rice terraces and understand more about their culture and customs\n12:00PM: Back to the homestay, check-out and go for lunch\n13:00PM: Free time for shopping and relaxing.\n15:30PM: Get on the van/bus to drive back to Hanoi."}]},{"name":"Subduing Fansipan - 3 Days","duration":3,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Group","Partially Guided","Holiday"],"oldPrice":0,"price":244,"summary":"Not suitable for child under 12 year old\nMinimum 2 people per booking.\nBooking at least 30 days in advance.\n","highlights":["Challenge yourself and conquer the highest peak in Indochina","Marvel at the spectacular views along your trek up Fansipan","Admire wondrous views above the clouds at the peak"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/63991_3d24260a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/63991_3d24260a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_520583ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_48ad2f0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_df1c3079.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_1b77677e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_f1a41380.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_536a638e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_bd38ee1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_1d098150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_31590197.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_3e16861a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_c63c6832.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_696e7036.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_8f5cde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_3d4831cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_2f464b89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_195b7f66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_e0ffda79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_3a8f5ced.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_40962795.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_1829a559.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63991_d8e2b73f.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Ha Noi - Tram Ton - Fansipan (L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide and take a scenic one-hour drive up to the hill station of Sapa. After lunch, a car will take you to Tram Ton, a part of the Hoang Lien Son Nature Reserve. Follow the bamboo forest and begin to conquer Fansipan, the tallest mountain in Indochina. After 3 hours of trekking, we will enjoy dinner and then continue through the forest. Camp overnight in a small tent. "},{"title":"Day 2: Fansipan – Sapa (B/L/D)","description":"Enjoy the early morning fresh air, have breakfast and continue to conquer the Fansipan peak, the highest mountain in Indochina, at 3,143 meters. Fansipan has about 2,024 floral varieties and 327 faunal species. The typography of Fansipan is various, and created by a narrow strip of land at the base on the east side of the mountain. There are a number of waterfalls lying around the foot of the Mount Fansipan like Cat Cat, Thac Bac (Silver Waterfall), Thac Lanh (Cold Waterfall), Thac Ham Rong (Dragon Jaw Waterfall) or on the way to conquer the peak like Thac Tinh Yeu (Love Waterfall). From the top of the mountain you can see the panoramic view of Sapa. Relax and have lunch before taking the trail down the mountain. A car will pick you up and take you back to Sapa. Overnight in Sapa. (BLD)"},{"title":"Day 3: End of the trip, full of experiences (B/-/-)","description":"Free day for shopping and discovering Sapa town. \nAs a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. It is interesting \nto buy some presents for your relatives and friends .\nCheck out, transferring to Sapa bus station back to Ha Noi. (B)\n"}]},{"name":"Trans - Vietnam Train Journey - 18 days","duration":18,"travelStyle":["Adventure","Group","Partially Guided","Train & Rail","Holiday"],"oldPrice":0,"price":1680,"summary":" Most of our traveling will be done aboard the Reunification Express train, a fascinating and unforgettable way to view the unfolding landscape of Vietnam. Hanoi, Sapa and Bac Ha market, Halong Bay with a romantic night on board, Hue Imperial citadel, Hoi An ancient town, Nha Trang Bay and Islands, Cu Chi Tunnels, Mekong Delta and Ho Chi Minh city","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153262_d7f8766c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153262_d7f8766c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_5ee30acf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_53d05028.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_2b77e044.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_30251f38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_12aefe82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_f5bb5412.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_5d01e36a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_b86e870f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_e6ac63d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_4c8d85eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_0f100080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_9804f7ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_f8f5edad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_1c8e225f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_af56b68c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_bd5517e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_0096fb72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_e5a00dad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_11d9f38a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_38f31e06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_8903ead3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_9f191b1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153262_21e18417.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI BY NIGHT - STREET FOOD","description":"Pickup at the airport upon arrival. Free to relax at your hotel till late afternoon for street food tour.\n18:00 - 21:00: Hanoi by Night, Street food tour.\nWe start our excellent street food walking tour at your hotel in old quarter of Hanoi along the perimeter of the market, dozens of street hawkers sell a staggering variety of produce from live seafood to exotic fruits and spices. Your expert English-speaking local guide will give you an insight into the intricacies and traditions of Vietnamese food culture including details on ingredients and historical backgrounds of popular northern dishes. We eat as we go, trying seasonal fruits and sampling a tasty French-inspired snack from a street cart.\nWalking through the maze of bustling streets that make up Hanoi’s Old Quarter, we tempt our tastebuds with the famed Hanoi dish Banh Cuon at a local eatery. Watch in awe as the skilled chefs demonstrate for you how this tasty dish is put together. Continuing into the atmospheric heart of the Old Quarter, we wander past street stalls and quiet residential lanes where you can observe local life that has changed little since Hanoi was founded over 1000 years ago. \nOur next two snack stops are at outdoor barbeque stalls. We sit down with the Hanoi locals and sample various meat, vegetable and bread specialties that are flame grilled over hot coals for extra flavour. It’s then time for dessert as we venture down a small alley to join in the local tradition of feasting on fresh fruit served in a cup and smothered with crushed iced and condensed milk – this speciality is one not to be missed!\nYour local guide will then take you to one of Hanoi’s best kept secrets, a hidden street food restaurant to taste top ten street foods in Hanoi is Banh My Hanoi, Vietnamese Rice Wine and famous Egg Coffee. This hard-to-find café is one of the few left in the narrow street inside the old quarter of Hanoi. Or, if coffee is not your style, a cold beer awaits!. At the end of the trip you are free to continue exploring the area or your guide will assist you with directions or a taxi back to your hotel.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you. Meals: Dinner. Accommodation: Hotel in Hanoi.\n"},{"title":"DAY 2: HANOI - CITY TOUR - NIGHT TRAIN TO SAPA - 9 HOURS","description":"Free in the morning. \n\nIn the afternoon, half day tour to visit Hanoi. We start with visit to President Ho Chi Minh's mausoleum (Outsite). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university.Finally, visit the Hoa Lo prison. Free time to relax till transfer to the station for night train to Sapa.\nNote*:\nLate checkout at the hotel is not included.Our tour guide will not accompany during the train trip\nTrain schedule is subject to change depending on availability.Private compartments on request at surcharge.Train journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages.\nMeals: Breakfast. Accommodation: Overnight Train to Sapa"},{"title":"DAY 3: Y LINH HO - LAO CHAI - TA VAN VILLAGES TREKKING","description":"a Pa is a quiet mountain town and home to a great diversity of ethnic minority peoples. Most of the ethnic minority people work their land on sloping terraces since the vast majority of the land is mountainous. Their staple foods are rice and corn. Rice, by its very nature of being a labour intensive crop, makes the daily fight for survival paramount. The unique climate in Sapa has a major influence on the ethnic minorities who live in the area. With sub-tropical summers, temperate winters and 160 days of mist annually, the influence on agricultural yields and health related issues are significant. \n05:30 ~ 06:00: Arrive at Lao Cai Train Station. Pick up at the train station and transfer to Sapa. Early check in upon arrival is possible upon room occupancy (Surcharge applicable). Breakfast and Relax for a while to get ready for our full day tour. \n9.30am: Meet up your local guide and start trekking for 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. A 2 km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. On the way, we would have chance to learn about the local agriculture producing customs and daily lifestyle. We have lunch at a local family, offering you a worth chance to learn about the local house architecture, which is full of their daily life styles and exclusive custom\nMeals: Breakfast/Lunch/Dinner. Accommodation: Homestay at Dzay Local House"},{"title":"DAY 4: TA VAN - GIANG TA CHAI - SU PAN - BAN HO","description":"After pancake made by your host family, we continue to discover Giang Ta Chai village, then Su Pan villages of the red Dzao minority. After picnic lunch, we keep on hiking to Ban Ho, the village lies within a beautiful valley, home to the Tay minority people who have their traditional house on stilts and we will spend the night here. \n Meals: Breakfast/Lunch/Dinner. Accommodation: Homestay at Tay Family\n"},{"title":"DAY 5: BAN HO - NAM TOONG - SAPA - HANOI BUS (5 HOURS)","description":"2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam. Enjoy swimming then go up to the mountain to visit a small hamlet of the Red Dzao people called Nam Toong, then get back to Ban Ho before get to Sapa by Car. Shower before bus ride back to Hanoi. Arrive Hanoi in in the evening.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Hanoi.\n"},{"title":"DAY 6: HANOI - HALONG BAY - NIGHT ON BOARD","description":"08h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break\n12h00: Arrive at Tuan Chau wharf – Break and photography time\n12h30: Board the Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the bay\n15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen.\n16h30: Enjoy kayaking or swimming (if the weather permits).\n17h00: Back on board and continue cruising.\n19h00: Dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\nMeals: Breakfast/Lunch/Dinner. Accommodation: Halong Bay Cruise"},{"title":"DAY 7: HALONG BAY - HANOI - HUE OVERNIGHT TRAIN JOURNEY - 12 HOURS","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm. Shower at small hotel before transferring to the station for overnight train to Hue.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\nMeals: Breakfast/Lunch. Accommodation: Overnight Train to Hue"},{"title":"DAY 8: HUE CITY TOUR","description":"Arrive Hue at 10am.\nToday, we will spend a full day touring Hue city. Our visiting sites includes Old Imperial City, Flag Tower, Thien Mu Pagoda, Royal Tombs of Minh Mang and Khai Dinh. The tour ends with your self exploration of Dong Ba bustling market then free for personal activities in Hue.\n Meals: Lunch. Accommodation: N/A"},{"title":"DAY 9: HUE - HOIAN SCENIC TRAIN JOURNEY - 3 HOURS","description":"Free in the morning.\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\n Meals: Breakfast\n Accommodation: Hotel in Hoian\n"},{"title":"DAY 10: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian\n"},{"title":"DAY 11: HOIAN - FREE DAY","description":"Free and easy day for shopping and swimming in Hoian.\n Meals: Breakfast\n Accommodation: Hotel in Hoian"},{"title":"DAY 12: HOIAN - NHA TRANG - 10 HOURS","description":"Today, we take day train from Hoian to Nha Trang to enjoy the scenic scenery on the way. Arrive Nha Trang in late afternoon. Pickup and transfer to the hotel.\n Meals: Breakfast\n Accommodation: Hotel in Nha Trang"},{"title":"DAY 13: NHA TRANG - FREE DAY","description":"Free and easy day for shopping and swimming at beautiful beach in Nha Trang.\n Meals: Breakfast\n Accommodation: Hotel in Nha Trang\n"},{"title":"DAY 14: NHA TRANG - SAIGON DAY TRAIN JOURNEY - 8 HOURS","description":"Free and easy till transfer to the station for the train to Saigon. Transfer to the hotel in Saigon upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 15: SAIGON CITY + CU CHI TUNNELS TOUR","description":"Pickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon.\n\n\nIn late afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon"},{"title":"DAY 16: SAIGON - MEKONG WITH HOMESTAY","description":"6.30 AM: Depart for Cai Be by car/van via Trung Luong Express Highway, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. \n9.30 AM: On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Then wander into the small villages to visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk music.\n11.30 AM: Keep cruising to a series of small canals to experience the charms of the Upper Mekong Delta. Arrive in Tan Phong island, join to a cooking class. Enjoy your cooking experience and learn how to prepare special Vietnamese dishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax on the hammocks to get back your energy.\n14.00 PM: Cycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn more about the local daily life in the Mekong delta.\n15.00 PM: Meet our local guide and transfer to the island for the overnight homestay experience with the local people. After meeting your home stay hosts, you're free to walk around the house and village to explore the countryside. You will prepare your own dinner (Vietnamese dishes) with help from your host. Overnight homestay with your hospitable island hosts.\n Meals: Breakfast/Lunch/Dinner. Accommodation: Night at homestay in Caibe"},{"title":"DAY 17: CAIBE - SAIGON","description":"After breakfast, you will be visiting Mr Ba Duc's ancient house. It's one of several houses preserved in harmonious combination of two architectural styles: Vietnamese and French, whose shape is unique to the colonial period.\nToday, you will also visit a rice husking mill to learn about the procedure for rice production. Mekong Delta is popular for its own unique charm. In Cai Be, a lot of materials are still hand-crafted, such as: \"Cham La\", the coconut leaves used to weave the roofs of homes. If you want to see how bricks are made, you'll see it here. After lunch at a restaurant serving local cuisine, you will taking back to HCMC by Van/Bus. Trip ends in Hochiminh city around 4:30 PM.\n Meals: Breakfast/Lunch. Accommodation: Hotel in Saigon"},{"title":"DAY 18: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Trekking in Mai Chau - Pu Luong 3 days 2 nights","duration":3,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":338,"summary":"Pu Luong Nature Reserve is an area of outstanding beauty, cultural interest and high biodiversity stretching from Mai Chau in the north-west to Cuc Phuong National Park in the south-east. The region is blessed with rich forests, limestone panoramas, magnificent rice terraces and breath-taking scenery. On this 3-day trek through Pu Luong Nature Reserve you can experience the everyday life and culture of Thai and Muong ethnic minorities and spend your nights with friendly locals.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/155810_fa3d4445.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/155810_fa3d4445.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_da965d89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_328a1093.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_1a9e6256.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_55538fc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_956c800d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_64bfab48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_d11d63e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_30a01a60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_37289322.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155810_fc172d3a.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi - Mai Chau - Pu Luong (L/D)","description":"Your guide will collect you at your hotel in Hanoi after breakfast and we’ll depart for Hoa Binh Province, which lies just 80km west of Hanoi. On the way we’ll make a stop at a local market before continuing towards Mai Chau Valley and stopping in the village of Pom Coong for a bit of rest and lunch in a typical Thai house built on stilts.\n\nAfter lunch, we’ll go for a hike through the Pu Luong Reserve, walking amidst rice fields and mountains, and crossing small villages where we’ll get to see the traditional daily life of the locals all around us in this natural paradise. You’ll get an even closer look at this when we have dinner and spend the night with a local family in one of the Thai stilt houses."},{"title":"Day 2: Trek To Kho Muong Village (B/L/D)","description":"On the second day we have an optional activity for those that don’t mind rising early. If you get up before sunrise, you can enjoy watching it ascend over the mountain tops, as local farmers hustle around doing their early morning activities. You can even join in for a little while to get a true taste for rural Vietnamese life.\n\nWhether you participate in this or not, you’ll enjoy breakfast made by the local Thai people you’re staying with, before starting the 5-6 hours of trekking we have planned for you. The first stretch is the hardest, containing some steep climbs and exciting river crossings, but you will be well rewarded as the next stretch is easier, and you’ll get to see absolutely stunning views of the valley and rice terraces, rainforests and streams within from your high vantage point.\n\nA picnic lunch will be served when you reach Hin Village, before continuing on to Hieu Village, considered by many to be the most aesthetically beautiful rural village in all of Vietnam.\n\nFinally we’ll reach Kho Muong village, where you can spend your time freely, either by strolling around the village and talking to locals, or relaxing in the eco homestay set up by FFI (Flora and Fauna International) in conjunction with the local communities. The total trekking you will have done to get here is around 12-15 kilometres.\n\nAt night you’ll have time to drink and socialize with the friendly locals amidst the tranquil ambiance of Kho Muong, before turning in for the night in a traditional Thai style stilt house."},{"title":"Day 3: Mai Chau - Hanoi (B/L/D)","description":"For your final day it’s time for another 3 hours of trekking, or around 5 to 7 kilometres. Starting with a nice easy stretch, giving you a chance to relax and connect with your surroundings, as well as warming you up for the challenges ahead.\n\nAfter a short rest in Ban Hieu Village, you’ll conquer some steep climbs and even more thrilling river crossings, before the valley opens up into fantastic views from your elevated position. Once you’ve spent enough time to enjoy these sights, we’ll move on to Pho Doan Village.\n\nHere we’ll take some more time to rest, before heading to the main road where your driver will be waiting to take you back to Hanoi. We’ll stop for lunch along the way, and you’ll arrive at your hotel in Hanoi in the late afternoon.\n \nTrekking route: Ban Hieu - Pho Doan ~ 5 - 7km. "}]},{"name":"Sapa - Bac Ha Market ( Departure only on Friday )","duration":3,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":165,"summary":"Located about 76 km from the train station, Bac Ha is a remote district of Lao Cai province. Bac Ha market which takes place every Sunday is famous for the originality and authenticity that the traders still preserve. One can reach Bac Ha market by booking a van or tour from Sapa, which is about 3 hours away.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156788_4b16d010.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156788_4b16d010.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_0d878375.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_1cee5191.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_8c4d3881.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_137b4c3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_9d182c5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_76c7a338.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_02d48f3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_76365f4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_d20847a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_5cc94cce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_1618699c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_2b79404a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156788_6772f62d.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Sapa – Y Linh Ho – Lao Chai – Ta Van - Sapa","description":"6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. A 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. Lunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. \n\nEnjoy the landscapes…on the way. Get back to Sapa by Car.\n\n- L, D\n\n- O/N at the hotel in Sapa"},{"title":"Day2: Cat Cat & Sin Chai","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 6 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a Car to return to Sapa.\n\n- B, L,D\n\n- O/N at the hotel in Sapa"},{"title":"Day 3: Bac Ha market (on Sunday only)","description":"Located at 110km from Sapa, Bac Ha mountain town is well-known by travelers with the most colorful market of the hill tribes in the North of Vietnam. This every-Sunday-market attended by at least 8 ethnic groups and last from 9:00 AM until 12:00 PM. It is also chance for tourists to discover the H’mong King’s palace (old building built by the French & Chinese).\n\nWe go for a light trek to visit Ban Pho, the village is home to flower H’mong minority. We are invited to enter several local houses to have some green tea, corn wine, listen to the host talking about their family, talk to them… and then enjoy landscapes on a roundabout way to Bac Ha for get back to Sapa to catch the bus back to Hanoi\n\n- B, L"}]},{"name":"Vietnam Discovery","duration":14,"travelStyle":["Discovery","Group","Fully Guided"],"oldPrice":0,"price":1679,"summary":"Travel from North to South and discover the culture and the traditions of Vietnam on this 14-day organized package including all the transfers between the hotels and the airports, transportation in a deluxe motor coach, internal flight, accommodation in 4 and 5* hotels, 23 meals included and rich, interesting visits with an English-speaking guide.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/144372_46e4165f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/144372_46e4165f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144372_6a53077c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144372_0501dce7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144372_2852d59e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144372_b888204a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144372_b983fd4e.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho","Cai Rang"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrival at the airport in Hanoi. You will be greeted by our local representatives after exiting the customs and transferred to your hotel. The rest of your day is free for you to relax or start your exploration of the night markets and bustling streets of Hanoi."},{"title":"Day 2: Hanoi","description":"After breakfast at the hotel, enjoy some free time to discover Hanoi at your own pace.\n\nDeparture in the late afternoon from your hotel to embark on a street food tour in the Old Quarter of Hanoi, where your expert English-speaking local guide will give you an insight into the intricacies and traditions of Vietnamese food culture, including details on ingredients and historical backgrounds of popular dishes. Walking through the maze of bustling streets that make up the Old Quarter, tempt your taste buds with famed Hanoi dishes at local eateries. Watch in awe as the skilled chefs demonstrate for you how the tasty dishes are prepared. Continuing into the heart of the Old Quarter, you will wander past street stalls and quiet residential lanes where you can observe local life that has hardly changed since the colonial era. At the end of the tour, you will be free to continue your exploration of the area. Your guide will assist you with directions or a taxi if you are willing to go back to your hotel. Overnight in Hanoi. (Breakfast-Dinner)"},{"title":"Day 3: Hanoi","description":"Breakfast at the hotel. In the morning, you will meet with your local guide in the lobby of your hotel for a full day city tour of Hanoi. You will start with the Ho Chi Minh Complex including the Mausoleum, his former stilt-house residence, the Presidential Palace and the nearby One Pillar Pagoda founded in 1049. This structure has become an important symbol for the people of Hanoi. Then you will continue toward the Temple of Literature, Vietnam’s first university founded in the 11th century. \n\nAfter your lunch included at a local restaurant, you will visit the Hoa Lo Prison Museum which housed Vietnamese revolutionaries and American prisoners of war during the Vietnam War. Afterward, you will enjoy a cyclo ride for about one hour, touring through the narrow, lively streets of the Old Quarter, heritage of the French colonial era in Hanoi. At the end of the day, you will see a traditional performance of the famous Vietnamese water puppets. Dinner at leisure and overnight in Hanoi. (Breakfast-Lunch)\n\n*Please note*\nThe Ho Chi Minh Mausoleum is closed all day on Mondays and Fridays, as well as from October 1st to November 30th (approx.) for annual conservation."},{"title":"Day 4: Hanoi - Halong Bay","description":"Following breakfast at the hotel, you will leave Hanoi for Halong Bay. En route, you will enjoy a refreshment break. Continuation toward Halong Bay where you will meet the crew upon arrival and boarding the traditional wooden junk. You will have some free time to relax in your cabin before enjoying lunch on board while the boat heads toward the secluded islands.\n\nIn the afternoon, you will visit an ancient limestone cave and go sea kayaking and swimming (if weather permits). You will return to the junk refreshed and invigorated, just in time to relax on the deck with a drink to watch the sunset. For your evening dinner on board, enjoy a meal prepared with local products and seafood. Overnight on board. (Breakfast-Lunch-Dinner)"},{"title":"Day 5: Halong Bay - Hanoi - Hue","description":"Enjoy the fullness of a sunrise and a morning swim (if weather permits) before taking breakfast on board. Then, you will visit one of the famous caves in the middle of the bay before cruising back to the main harbor for the transfer back to Hanoi. In the afternoon, at the time scheduled with your guide, you will be picked up at your hotel for your transfer to Hanoi Railway Station for the overnight train journey to Hue. Overnight on the train. (Breakfast-Lunch)"},{"title":"Day 6: Hue","description":"Upon arrival in Hue, you will be picked up at the train station and transferred to your hotel for breakfast. Today you will discover Hue, the former imperial capital of Vietnam from 1802 to 1945. You will start your city tour with the ancient walled citadel including the former Imperial Palace, where ruins of the city’s regal past can still be seen. Created in the 19th century, the Imperial City was modeled on the Forbidden City in Beijing and holds many palaces and temples inside its giant walls. You will then visit the Dong Ba market to learn about local products and specialties of Hue. You might do some great deals at the local Dong Ba market, especially if you are interested in a traditional Vietnamese conical hat.\n\nAfter lunch at a local restaurant, you will visit the majestic royal tombs of King Ming Mang, King Khai Dinh and King Tu Duc, some of the most magnificent mausoleums in Vietnam located along the Perfume River. Dinner free and overnight in Hue. (Breakfast-Lunch)"},{"title":"Day 7: Hue - Hoi An","description":"Following breakfast at the hotel, enjoy some free time to continue your exploration of Hue at your own pace.\n\nAfter lunch at leisure, you will drive southward to Hoi An via Danang. Upon arrival in Danang, you will visit the famous Marble Mountains, five marble and limestone hills named after the five elements of Nature. After your visit, transfer to your hotel in Hoi An. Dinner free and overnight in Hoi An. (Breakfast)"},{"title":"Day 8: Hoi An","description":"After breakfast, you will meet your guide in the lobby of your hotel to start your exploration of Hoi An. On this walking tour, your guide will show you a number of interesting places around the old town of Hoi An including: the old Japanese Covered Bridge dating back to 1593, the Phuc Kien Temple (Fukian Assembly Hall), a city museum and the colorful local market. You will walk along tiny streets with houses and buildings influenced by Chinese, Japanese, French and European architectures. After the walking tour, enjoy some free time to continue your exploration of Hoi An.\n\nHoi An is a unique destination in Vietnam and Southeast Asia. It's the only city in the country that has preserved this typical architecture of a trading port from the 15th to the 19th centuries. Stroll along the docks, wander around the local markets or have a silk dress or suit fitted with outstanding quality at an outrageously low price. You can easily explore the old town by foot. There is also a bevy of amazing restaurants, old houses, craft shops, and art galleries where local artists exhibit their works. If you are interested in a more relaxed afternoon, make your way to the beautiful Cua Dai beach, located just a few kilometers away from the bustling city. (Breakfast-Lunch)"},{"title":"Day 9: Hoi An","description":"Following breakfast at the hotel, enjoy some time free to continue your exploration of Hoi An and its surrounding or opt for an optional excursion ($) with your guide.\n\nAfter exploring the UNESCO World Heritage Site of Hoi An, you might want to visit the majestic temples at My Son, a complex of Hindu temples built by the Cham people between the 4th and the 14th centuries. You might also want to attend a cooking class at a riverside restaurant in Hoi An old town, or get up close and personal with dairy farming and fishing life. For early risers, why not capture the real Hoi An by joining a 4-hour photography tour led by a local expert? If you want to discover the underwater life, hop on a boat tour to Cu Lao Cham Island for a fun and relaxing day exploring exotic coral reefs. (Breakfast)"},{"title":"Day 10: Hoi An - Danang - Ho Chi Minh City (Formerly Saigon)","description":"Breakfast at the hotel and time at leisure in the morning to take a last walk to re visit a local market in Hoi An. At the time scheduled with your guide, you will be picked up at your hotel and transferred to the airport in Danang for your flight to Ho Chi Minh City. Upon your arrival in Ho Chi Minh City, you will be greeted by our local representatives and transferred to your hotel. The rest of the day is free for you to discover Ho Chi Minh City, the largest city and economic capital of Vietnam. Dinner free and overnight in Ho Chi Minh City. (Breakfast)"},{"title":"Day 11: Ho Chi Minh City - Cu Chi Tunnels","description":"After breakfast, you will leave the city toward the Cu Chi Tunnels where you will visit the amazing network of underground tunnels that was used during the Vietnam War by the Viet Cong. This huge construction was a habitation for villagers in the war. With 3 levels of depth, it was never discovered by the US troops during the Vietnam War despite its proximity to Ho Chi Minh City.\n\nAfter lunch included at a local restaurant, you will return to Ho Chi Minh City for an afternoon guided city tour. You will start with the visit of the War Remnants Museum, which contains exhibits related to the First Indochina War and the Vietnam War. Then, you will see the Reunification Palace which was the home and workplace of the President of South Vietnam during the Vietnam War. Continuation toward the city center where you will notice a lot of buildings dating back to the French colonial era such as the Notre-Dame Cathedral, the Old Post Office, the Municipal Theatre and the City Hall. After the visit, you will return to your hotel in Ho Chi Minh City. (Breakfast-Lunch)"},{"title":"Day 12: Ho Chi Minh City - Can Tho","description":"Following breakfast at the hotel, you will head south to visit the Cai Be floating market, cruising on the Mekong River among local barges full of fruits and vegetables. After that, your local guide will offer you the option to stop at local workshops where you will see how to make rice paper, coconut candy and pop-rice among other things. Later in the morning, a rowing boat will take you deeper into the countryside on smaller canals to enjoy the peacefulness of the Mekong Delta. You will also see traditional houses made of wood and palm tree leaves.\n\nAfter a tasty lunch included at a local restaurant, you will have some time to walk around and enjoy some fresh fruits while listening to traditional music. Your guide will also offer you the option to enjoy a leisurely bike ride along village paths to see local farms, real life in the countryside and observe the ancestral ways to pick up fruits in the Mekong Delta. The cruise will end at Vinh Long city where you will be transferred to Can Tho, in the heart of the Mekong Delta, for your overnight stay. (Breakfast-Lunch)"},{"title":"Day 13: Cai Tho - Cai Rang Floating Market - Ho Chi Minh City","description":"Breakfast at the hotel and departure for a boat cruise that will take you to the vibrant Cai Rang floating market. Here, you will experience a local type of market in which all purchasing activities take place on boats and ships of different sizes. Then, you will continue through a small canal to visit a fruit garden where your guide will show you around before having a plate of delicious fruits. After your return to Can Tho, you will have some time at leisure to observe rural life and the lush vegetation along the riverbanks. Check-out from your hotel and drive back to Ho Chi Minh City with lunch included en-route. The rest of the afternoon and the evening are free. Overnight in Ho Chi Minh City. (Breakfast-Lunch)"},{"title":"Day 14: Ho Chi Minh City","description":"After breakfast, greeting in the lobby of your hotel by our local representatives and transfer to the airport for your flight home or continue on your own arrangements. (Breakfast)\n\n-End of services-"}]}]