[{"name":"Idyll 14-day tour from South to North Vietnam","duration":14,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2091,"summary":"Take an adventure across the stunning countryside of Vietnam, and discover the magic of its cities on our 14-day tour from Ho Chi  Minh city. Take a cruise around Halong Bay, experience hectic Hanoi, the lush Mekong Delta, romantic Hoi An, Da Lat or beaches of Nha Trang and the bustling metropolis of Ho Chi Minh City. It’s not only the charm of the places that makes this adventure special but also the people you will meet along the way.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c72.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e4114b971670.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e4114d0d3f53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193378_5e41149762c8a.jpg"],"destinations":["Ho Chi Minh City","Dalat","Quy Nhon","Hoi An","Hue","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Ho Chi Minh City - Arrival (-)","description":"Arrive in Ho Chi Minh City and transfer to hotel, the rest of the day is at leisure.\nMeals on your own and overnight in Ho Chi Minh City."},{"title":"Cu Chi tunnel (B/L)","description":"We start with a morning tour of Ho Chi Minh City, which under the former name of Saigon was the capital of the French colony of Cochin-china and later of the independent republic of South Vietnam (1955-1975).\nWe’ll visit the Presidential Palace, now known as Reunification Palace after the final act of the war took place on its grounds. Then we visit some of the finest examples of colonial architecture with the Notre Dam Cathedral and the Old Saigon Post Office, before getting a taste of local culture at a lacquer ware factory and finally Thien Hau Pagoda, both in the city’s bustling Chinatown.\nIn the afternoon we make the trip to the infamous Cu Chi Tunnels, an incredible underground network constructed by Vietnamese resistance fighters during the long struggle for independence. We then return to Saigon for dinner on your own and an overnight stay."},{"title":"Mekong Delta Tour (B, L)","description":"\nWe set out for the Mekong by car and drive to My Tho, the capital of Tien Gang province. We then depart by boat for a cruise along the mighty Mekong before arriving in the village of Ben Tre. Here we’ll visit a coconut candy factory and take a 15 minute coach ride to visit a garden house where we’ll enjoy tea and fresh tropical fruits.\nNext we take a sampan boat through a water coconut forest before returning by boat to a local restaurant where you can taste the “Elephant’s ear fish” for lunch. In the afternoon we’ll take you back to Ho Chi Minh City for dinner on your own and an overnight stay."},{"title":"Ho Chi Minh City - Da Lat (B/L)","description":"\nAfter breakfast we take a picturesque drive through rubber and tea plantations en route to the cooler climate of Da Lat. Situated 300km from Ho Chi Minh City, Da Lat was established as a colonial hill station at the beginning of the 20th century. We’ll have lunch before doing some sightseeing, including sights like the former summer residence of Emperor Bao Dai, the old Railway Station, Xuan Huong Lake, the Central Market and Lam Ty Ni Pagoda. Then you’ll have dinner on your own and stay overnight in Da Lat."},{"title":"Da Lat - Nha Trang (B/L)","description":"\nAfter breakfast we set out for Nha Trang, one of Vietnam’s most important tourist hubs thanks to its beautiful beaches and clear ocean waters. On arrival we’ll transfer you to your hotel, and take you for an afternoon tour of the city including visits to the Po Nagar Cham Towers and the Long Son Pagoda. You’ll then have dinner on your own and stay overnight in Nha Trang."},{"title":"Nha Trang - Quy Nhon (B/L)","description":"\nWe start the day with a morning boat trip around Nha Trang Bay to visit some nearby islands and give you a chance to swim and snorkel in the clear warm waters. We then enjoy a seafood lunch before returning to shore and checking out of our hotel.\nThen it’s time for a scenic drive to Quy Nhon, which is about 230km long along National Road No.1. We’ll you off at the hotel and the rest of the day is yours to spend at your leisure."},{"title":"Quy Nhon - Hoi An (B)","description":"We’ll leave Quy Nhon after breakfast and continue further northwards to Hoi An, stopping to visit the My Lai Massacre Memorial and lunch in a local restaurant along the way. We’ll arrive in Hoi An in the afternoon, and take you for a walking tour of the ancient town centre, visiting former merchant’s houses, the 400 year old Japanese covered bridge and the colourful city market. Then you’ll have dinner on your own and stay overnight in Hoi An."},{"title":"Hoi An - Hue (B/L)","description":"The morning is free to spend shopping for souvenirs, exploring the town by foot or bicycle, or heading over to nearby Cua Dai Beach for some relaxation. After lunch we depart for Hue, the former Imperial capital of Vietnam. We’ll pass through Da Nang before climbing over the Pass of Ocean Clouds and descending back down to the wonderful fishing village of Lang Co.\nWe’ll arrive in Hue in the afternoon, and the rest of the day is free."},{"title":"Hue (B/L)","description":"\nWe’ll start our time in Hue with a boat trip along the Perfume River, visiting the best known religious sites of the city such as Thien Mu Pagoda and the Mausoleum of former emperor Minh Mang. Then, in the afternoon, we visit another mausoleum, this time housing the Emperor Khai Dinh, before rounding out with the crown jewel of Hue, the Imperial Citadel.\nThe evening is yours to spend at your leisure."},{"title":"Hue - Hanoi (B/L)","description":"After breakfast, say goodbye to the Imperial City as we transport you to the airport for your flight to Hanoi. On arrival we’ll take you to the hotel for check-in and lunch, before setting out on our tour.\nWe begin by visiting the Ho Chi Minh Mausoleum, the final resting place of Vietnam’s greatest national hero and founder, as well as his former personal residence, now a museum. Then we move on to One Pillar Pagoda, one of the most important pagodas in all of Vietnam, before continuing to the Temple of Literature, housing Vietnam’s oldest university.\nFinally we visit Hoan Kiem Lake, and Ngoc Son Temple, a charming little building located on an island in the lake. We then finish the day with a Water Puppet Show, a truly unique Vietnamese experience where masterful puppeteers guide their puppets across pools of water, retelling legends and myths from Vietnamese culture. The rest of the evening is free to spend as you wish."},{"title":"Hanoi - Halong Bay (B)","description":"\nAfter breakfast we set out for Ha Long Bay, perhaps Vietnam’s most famous attraction. We arrive at the pier around 12:30, where we’ll board and be served a delicious buffet lunch as we glide past spectacular karst formations.\nWe then make a stop at Tung Say, to visit a pearl farm. Here you’ll learn about the production of the pearls and you can even buy some jewellery if you’re so inclined.\nNext is Ti Top, where you’ll get to go for a swim (weather permitting) and if you can make the climb to the top, you’ll be rewarded with the best panoramic view of the bay found anywhere.\nThen it’s time for a BBQ dinner on the boat at 19:30, before spending the rest of the evening partaking in one of the many activities, like squid fishing, music performances, relaxing or playing cards with your fellow guests.\nOvernight on the boat."},{"title":"Halong Bay - Ninh Binh (B/L)","description":"\nEarly risers can enjoy a Tai Chi lesson at 6am, before breakfast set to a morning view of the bay. At around 8am we transfer by a small boat to Sung Sot Cave, one of the most spectacular caves in the whole bay. We then go back to the cruise as it winds its way back to port, docking at around noon when it’s time to say good bye to the crew.\nWe then take you by car to Ninh Binh, which takes roughly 5 hours, arriving in the late afternoon."},{"title":"Tam Coc - Hanoi (B/L)","description":"\nAfter breakfast we set out for a 2 hour sampan cruise to Linh Coc Hai Nham, passing beautiful landscapes along the way, as well as going through three gorgeous caves.\nWe then visit the ancient citadel of Hoa Lu, once the capital of Vietnam, before transferring to Hanoi and having the rest of the day free in the capital."},{"title":"Hanoi Departure (B)","description":"\nAt leisure until your transfer to Noi Bai Airport."}]},{"name":"Vietnam 15 Days Super Save (Hanoi, Sapa, Ha Long Bay, Hue, Hoi An, Sai Gon, Mekong Delta)","duration":15,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1199,"summary":"Asia Focus Travel prove 15 days  tour .You can manage your time enough to explore many new places and experience new culture of each region in the country. Leaving the bustle and hustle of your big city, you can enjoy the peaceful as well as beautiful Vietnam within 15 day tour in Vietnam. Your journey begins at the center Hanoi – the country’s capital with a lot of historic monuments. This is surely a different Hanoi which you can not see on TV or any magazine. Or do you like to enjoy natural beauty of Northern provinces? The landscape, food, and people in Lao Cai, or the cave in Halong Bay, etc. will be good choices for you. Then while heading to the South to experience the rural life on floating markets, all the best of Vietnam will be shown in front of your eyes. The designed Vietnam tour 15 days will bring you memorable experiences in the S-shaped country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5701c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5701c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81ae99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57020.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81ae9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57022.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81ae9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57023.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57025.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57026.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57027.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf57029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5702a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aea9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5702b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aeaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5702d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aeac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fbf5702e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194756_5e561fb81aeae.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Ha Noi Arrival - Street Food Tour (D)","description":"Xin Chào, Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.\n17:30 to 18:00 The tour guide will pick you up at your hotel to join with street food tour\nBest list of street food (chosen carefully), from 6-8 dishes among hundreds of cuisine list, including dishes and drinks. (*if you’re a vegetarian (no meat, no fish), it’ll be limited in the choice of food for you).\nOvernight in Ha Noi.\n"},{"title":"Hanoi - Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa (B,L,D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. Lunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Last trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan..\nOvernight in Sapa\n"},{"title":"Cat Cat and Shin Chai Village – Hanoi (B,L)","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 3 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a jeep to return to Sapa. Take a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. \n Overnight in Ha Noi\n"},{"title":"Hanoi - Ninh Binh - Hoa Lu - Tam Coc (B,L)","description":"07:45 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter. - Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs. - Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century.  - Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century.  12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby. - Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling, check in hotel in Ninh Binh\nOvernight in Ninh Binh \n"},{"title":"Ninh Binh - Ha Long Bay, overnight on cruise (B,L,D)","description":"Breakfast at the hotel, \n6:30 to 7:00 Am take the bus to Ha Long Bay\n11:30- 12:00 Embark on the Cruise followed by a short cruise briefing.\n13:00 Savor a delectable lunch as Ha Long cruises among the limestone islands.\n14:00- 16:00 Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay\n16:00- 17:00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17:00- 17:30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way\n17:30- 19:00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set\n19:00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around\nOvernight on Ha Long Cruise in the middle of Ha Long Bay\n"},{"title":"Ha Long Bay- Ha Noi by bus (B,L)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi\n17:00 Arrive Ha Noi, check in hotel \nOvernight in Ha Noi\n"},{"title":"Ha Noi city - flight to Hue ( B,L)","description":"8:00 tour guide picks up at your hotel and start the trip to visit Ha Noi city:\nVisit Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university.\n12:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\n In the afternoon, continue visiting:\nLeave for a legendary Hoan Kiem lake and Ngoc Son Temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians.\n16:00 Arrive back in your hotel and the driver transfer to the airport to take a flight to Hue\nArrive Hue and check in hotel\nOvernight in Hue\n"},{"title":"Hue city tour full day (B,L)","description":"In the morning: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conicat Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nIn the afternoon: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue\n"},{"title":"Hue - Hoi An (B)","description":"In the morning: Pick up guests at the hotel at 07:30 am by bus and drive to Hoi An.\nIn the afternoon : visiting Hoi An ancient town. Walk to the old town, buy entrance tickets and begin the tour. Start visiting the Phuc Kien Temple, Tan Ky Ancient House, Phung Hung Ancient house, Japanese Bridge and cultural showroom in Hoi An by yourself \nOvernight in Hoi An\n"},{"title":"Tra Que Village (B,L)","description":"At 8:00 a.m or 14:00 p.m: Our Guide will meet you at the hotel’s lobby and start the tour.\nWe will ride bicycle to Hoi An’s colorful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients to be used in the cooking lesson later. So make sure your camera is handy.\nWe continue to cycle to Tra Que vegetable village where we will have a cooking class\nAt Tra Que, we will have a welcome drink for rest. Then, we walk through the vegetable gardens where local farmers work on their fields, using the traditional methods of hundreds of years ago, no electrical machinery here.\nYou will relax with Foot herbal massage \nAfter foot massage, it’s time to cook lunch. We will go to the restaurant & work together with the chef.  With the instructions of the chef, we will learn the traditional ways of preparing and cooking Vietnamese food.\nAfter the lesson, enjoy what you have cooked.\nBack to your hotel in Hoi an\n"},{"title":"My Son Holy land tour- flight to Ho Chi Minh (B/ L)","description":"7:30 am: Our minivan picks you up at your hotel. Spend 2 hours to enjoy and discover the beauty of Ancient buildings of the Champa Kingdom. Those relics were made by red bricks which still surprises those who are curious about architectural art.\nHave chance to enjoy traditional music performed by Champa girls in their colorful uniforms.\nLeave My Son for Cao Lau boat station. Take a boat trip on Thu Bon River. Experience the lifestyle of local people and enjoy fresh air.\nHave lunch on the boat before stopping at Kim Bong Carpentry Village – The traditional country village.\n2:30 pm: The boat trip finishes at Bach Dang Boat station.\nFinish tour, the driver transfers to Da Nang airport and take a flight to Ho Chi Minh.\nArrive Ho Chi Minh, check in hotel.\nOvernight in Ho Chi Minh\n"},{"title":"Ho Chi Minh City - Cai Be Floating Market (B,L)","description":"Breakfast take away.\nPick up: 6:30 to 6:45 and Come back: 17:30 to 18:00\nPick up at your hotel in Ho Chi Minh City. Depart for Cai Be by car/van via Trung Luong Express\nHighway. On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the\nlocals trading fruit and many other commodities on board their vessels. Visit a small family business\nto see how coconut candy and crispy rice popcorn are made. Then wander into the small villages\nand visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk\nmusic.\nKeep cruising to experience the charms of the Upper Mekong Delta, where you can immerse\nyourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese\ndishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax in the\nhammocks to get back your energy.\nCycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn\nmore about the local daily life in the Mekong delta. Take a boat ride back to Cai Be and meet your\nbus for the trip back to Ho Chi Minh City.\nOvernight in Sai Gon \n"},{"title":"Ho Chi Minh city tour - Cu Chi Tunnel (B,L)","description":"Breakfast at your hotel\nPick up: 7:30 to 8:15 and Come back: 18:30\nthe morning trip to visit Independence Palace, also known at the Reunification palace, was built on the sight of the former Norodom palace. The Independence palace is a widely known landmark of\nHo Chi Minh City and was designed by the architect Ngo Viet Thu. Continue seeing the beautiful structures from the French Colonial times such as the Notre Dame Cathedral, the historic Central\nPost Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast display of the both the Indochina wars.\nHave lunch at local restaurant.\nDepart for Cu Chi tunnel, the trip will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory\nvideo about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun. Return to Saigon\nOvernight in Sai Gon \n"},{"title":"Sai Gon Fee and easy (B)","description":"Free and easy \n"},{"title":"Ho Chi Minh Departure (B)","description":"Breakfast at hotel then fee and easy until the driver pick you up at your hotel transfer to Tan Son\nNhat airport for departure flight. End of trip!\n"}]},{"name":"Panorama Vietnam itinerary 14days/13nights","duration":14,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2368,"summary":"This two-week tour starts in Hanoi and ends in Hochiminh (Saigon). Cycle around traditional farming villages, hike through national parks, explore grand architecture in Hoi An and Hue, and cruise around mesmerizing Halong Bay. Trekking  to discover Sapa minorities. These hikes are easy and medium level, it is also for children over 4 years and Experience the heart of the Mekong delta with its scenic floating markets. In this semi-aquatic world, you discover how life really is in around this majestic river.\nHitting all of Vietnam's highlights, you'll take in the very best this spectacular country has to offer.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143444_73ce3ddb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143444_73ce3ddb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_877147ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_203fbea0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_8034fca0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_06b55fa5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_a59db8f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_b809afd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_ec7cde91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_09869685.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_06e9d7c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_e2949405.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_a26be872.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143444_34a4c286.jpg"],"destinations":["Hanoi","Halong Bay","Lao Cai","Sapa","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1 : Arrival Hanoi (D)","description":"When arriving, welcome at the airport and transfer to your selected hotel.\n\n\nEarly in the evening, join a water puppet show, a distinct Vietnamese art in which a split-bamboo screen obscures puppets which stand in water and are manipulated using long poles hidden beneath the water.\n\n\nDinner at a local restaurant.\nOvernight in Hanoi. "},{"title":"Day 2 : Hanoi full day city tour (B/L)","description":"After breakfast, spend your day taking a tour around the capital and visiting such sites as\nthe Ho Chi Minh Mausoleum (outside),a large memorial in Hanoi, located in the centre of Ba Dinh Square, which is the place where Vietminh leader Ho Chi Minh read the Declaration of Independence on September 2, 1945. His former residence,stilt house of Ho Chi Minh, the founder of modern Vietnam, fondly known as “Uncle Ho”.\n\n\nOne Pillar Pagoda, the emperor Lý Thái Tông constructed the temple in gratitude for this in 1049 by erecting a pillar in the middle of a lotus pond, similar to the one he saw in the dream that he met the bodhisattva Avalokiteshvara, who handed him a baby son while seated on a lotus flower.\n\n\nTemple of Literature, Vietnam's first national university where offering ceremonies, study sessions and the strict exams of the Dai Viet took place. Built in 1070 at the time of King Lý Nhân Tông, it is one of several temples in Vietnam which are dedicated to Confucius, sages and scholars.\n\n\nLunch in a restaurant.\n\n\nIn the afternoon, continue to the Museum of Ethnology, which focuses on the 54 officially recognized ethnic groups in Vietnam.\n\n\nThen, you will enjoy a very interesting walking tour around the old quarter within 1,5 hours. Firstly the trip start from head of Cao Thang street where local people sell all traditional cooking spices of Vietnam such as onions, garlic, mushrooms, black mushrooms, peppers, lemongrass, ginger, galangal ...\n\n\n Then moving to Dong Xuan market, the biggest market in Hanoi, originally built by the French administration and surrounded by different streets, you will go through the market and turn right to Hang Ma street, the road is shimmered by decorating stuff , Chinese toys, the colorful lanterns, paper goods and in particular paper votive offerings.\n\n\nPassing by Luong Van Can, Lan Ong, you arrive Hang Buom street where located the oldest temple of Hanoi - Bach Ma Temple, you will take some rest to admire the temple before continue walking through Ta Hien, Dinh Liet street to the most peaceful small alley of Hanoi - Trung Yen. On the way you have chance to explore daily life of local people who live and sharing their life in the confined spaces.\n\n\n We continue to Hang Be street - used to be one of the best well-known outdoor markets in town dating from medieval, with famous food”Mam Tep Chung Thit”, some years ago, it was disintegrated. At the end of this road, there is a coffee shop named Cafe market, where we will invite you a cup of coffee or iced fruit smoothies.\n\n\nWe end of trip at Hoan Kiem Lake, in front of Water Puppet show theatre, from here you can continue your walking or back to your hotel.\nDiscover Hoan Kiem Lake, meaning \"Lake of the Returned Sword\" , where emperor Lê Lợi was boating on the lake when his magic sword, Heaven's Will, was grabbed by a turtle who quickly disappeared into the depths.\nTake a beautiful picture on the The Huc red bridge to Ngoc Son Temple.\n\n\nCome back to your hotel. Dinner on your own.\nOvernight in Hanoi. "},{"title":"Day 3: Hanoi – Halong bay (B/L/D)","description":"08.00 – 8:30: The Swan shutter bus will pick you up from your hotel and heading to Northeast of Vietnam\n\n\n12.30: Arrive at Swan office, transferred by tender to Swan Cruise.\n\n\n12.45: Enjoy welcome drink, be briefing about safety on boat and activities included then check in cabin.\n\n\n13.30: Delicious Vietnamese set menu while leisurely cruising to the core of Bai Tu Long Bay. \n\n\n15.00: Arrive to Cap La Island the beautiful area in Bai Tu Long bay. Enjoy kayaking through the karst and breathtaking nature, swimming and relaxing.\n\n\n17.30: Get back to the boat and enjoys Sunset party while our cruise sailing to the overnight anchorage. \n\n\n19.00: Sumptuous set-dinner onboard.\n\n\n20.30: Free time for joining Games, you may also try your luck with squid fishing. \n\n\nOvernight onboard with Swan Cruise. "},{"title":"Day 4: Halong bay – Hanoi/ Lao Cai ( B/L)– On Train","description":"06.30: Starting your day with Tai Chi on the Sundeck.\n\n\n07.00: Breakfast will be served in Western style and furthermore with Vietnamese traditional food \n\n\n08.00: Explore the Thien Canh Son. Guide will explain the history of Ha Long Bay, Bai Tu Long Bay and this Cave, made by Mother Nature\n\n\n09.30: Upon return to the boat you will have 30 minutes to freshen up and finish packing.   \nPlease remove all of your belongings from your cabin, you may leave heavy luggage outside of the cabin (staff will transfer directly to the pier). \n\n\n10.30: Vietnamese cooking demonstration on boat.\n\n\n11.00: Enjoy a traditional Vietnamese lunch.\n\n\n12.00: Disembark in Hon Gai pier\n\n\n12.30: Farewell Halong Bay then returns to Hanoi\n\n\n17.30: Drop off your hotel. Free time for relax, shopping or eating some thing by yourself \n\n\n19:30 -20:00: Our driver pick you up at your hotel then transfer to  railway station catch train to Lao cai/Sapa. Overnight on train. "},{"title":"Day 5: Lao Cai/Sapa – Lao Chai – Ta Van Village (B/L/D) –Trekking","description":"Arrive at Lao Cai railway station at about 6h00 then transfer to Sapa, which is home for more than 30 minority tribes (Black H’mong, Flower H’mong, Red Dzao) and of Vietnam’s highest peak - Fansipan Mount.\nHave breakfast in the hotel or restaurant (optional) before the trip starts.\nPrivate car  take you to Lao Chai village of the Black H’Mong tribe and trekking \n\n\nLunch en route.\n\n\nAfter lunch, continue to Ta Van village to visit the Dzay tribe, which is supposed to be the most beautiful one in the area and then stay at local house (total trekking at the average level: 11km - 5hours).\n\n\nDinner at the home-stay.Overnight in Ta Van village "},{"title":"Day 6: Ta Van – Sapa – Ma Tra – Sapa (B/L)","description":"After breakfast, come back to Sapa by a private car.\ntrekking to the Ma Tra village for the discovery of Black H’mong (trekking at the easy level: 4km - 2,5 hours).\n\n\nLunch at a local restaurant.\n\n\nDinner on your own. Explore Sapa at night and enjoy local street food by yourself.Overnight in Sapa."},{"title":"Day 7: Sapa – Fanxipan Peak with cable car– Hanoi by Public bus ( B/L)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery.\n\n\n9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos).\n\n\n11.00: Come back to Cable Car Station and return to Sapa town,\n\n\n12.30: Have lunch in the hotel\n\n\n13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi\n\n\n16.00: Get on bus to go back to Hanoi with two comfort breaks\n\n\n20.45: We say goodbye to you at your hotel.Overnight in Hanoi"},{"title":"Day 8: Hanoi – Hue (B/D) by plane","description":"Suggest flight: HAN-HUI ( 08:40 -09:55) by VN airline –Charge from $90/pax/ticket\n\n\nFollowing breakfast, you will be free until transfer to the airport for a flight to the ancient imperial capital of Hue.\nIn Hue, you will be picked up and transferred to your hotel.\n\n\nAfternoon. Enjoy 1 hour cyclo to visit hue city. Enjoy Dinner on Boat in River perfumer to see the Sunset. \n\n\nOvernight in Hue"},{"title":"Day 9: Hue –Thien Mu Pagoda –Thuy Bieu village –Emperor Minh Mang’s Tomb (B/L)","description":"After breakfast at hotel, pick up at your hotel, take a boat for a cruise on the gentle Huong River.\nVisit Thien Mu pagoda, built in 1601 on the order of the first Nguyen lords, Nguyen Hoang, who at that time was the governor of Hue.\n\n\nContinue to a quiet Thuy Bieu village – 6.5 km from the city centre – a laidback village famous for growing the Thanh Tra fruit (a kind of small pomelo), visit many garden houses, a unique feature of Hue countryside, and enjoy a nice walking and biking around the village.\n\n\nVisit an old communal house, pass by several ancient ancestral temples and communicate with local people.\nVisit an incense making family and discover the daily life of local people while they are working strenuously with joy and enthusiasm. You may also join their activities: gardening, talking and drinking tea with them. \nBack to Thuy Bieu restaurant, relax by steeping your foot in medicinal herb water – a traditional therapeutic practice and enjoy excellent massage by blind people.\n\n\nLunch at Thuy Bieu restaurant.\n\n\nIn the afternoon, discovery of Emperor Minh Mang’s tomb, ponds and gardens is known for its perfect harmony between architecture and its natural environment. It began to be built during his reign (1820-1841) and was completed only in 1843, two years after his death by his successor Thieu Tri.\n\n\nDinner on your own.\nOvernight in Hue."},{"title":"Day 10: Hue – Danang – Hoian (B/L)","description":"After breakfast, transfer to Da Nang through Hai Van Pass and through the picturesque fishing village of Lang Co.\n\n\nWhen arriving in Da Nang, visit the Cham Museum and Marble Mountain,  (Ngu Hanh Son) is about 8km southeast of Da Nang City. This is a cluster of five marble mountains lying close to the sea. That is why, it is dubbed Hon Non Nuoc, which means Mountain and Water in Vietnamese.\n\n\nContinue to the riverside town of Hoi An, an important trading port during the 17th and 18th centuries and officially listed as a World Heritage Site.\n\n\nLunch in a local restaurant.\n\n\nIn the afternoon, walk around Hoi An ancient town and exploring its treasures :\nQuan Cong temple – the brave and loyal Chinese General.\nPhuc Kien pagoda, This is the most well-known assembly hall in the ancient town.Fukjianese were Chinese traders who first came to Hoi An in great number, at least in the XVII century. That was the reason why all above mentioned gods were worshipped in this pagoda after the collapse of the old pagoda.\n\n\nThe Japanese Bridge, Hoi An’s signature landmark used widely as an emblem of the town. It was built by Japanese merchants in the 16the century\nTan Ky ancient house, the most popular of Hoi An’s old houses.\nHoi An port, the World Heritage listed by Unesco.\n\n\nDinner on your own.\nOvernight in Hoi An."},{"title":"Day 11 : Hoian – Danang – Hochiminh (B/L) by plane","description":"Suggest flight : DAD – SGN ( 8:50 -10:15) by Vietnam airline or Similar –Charge from $82/pax/ticket\n\n\nAfter an early breakfast, transfer to the airport for your morning flight to Ho Chi Minh, under the name Saigon, it was the capital of the French colony of Cochin-china and later of the independent republic of South Vietnam from 1955–75. On 2 July 1976, Saigon was officially renamed Ho Chi Minh City, name of Vietnamese communist revolutionary leader who was prime minister (1945–1955) and president (1945–1969) of the Democratic Republic of Vietnam (North Vietnam).\n\n\nWhen arriving in Ho Chi Minh, transfer to your selected hotel.\n\n\nIn the same morning, discover a busy Saigon, enjoy a tour in the Old Colonial Residential Quarte and visit:\nthe City’s old Hotel, a palace built by the French architect Paul Gardès of 1902-19081 in the center of Saigon in Indochina at the time.\n\n\nthe Opera House, inspired by the architecture of the Opera Garnier in Paris, which was built in 1900. The facade of the opera is a replica of the Petit Palais in Paris\nNotre-Dame Cathedral, The famous central Saigon Cathedral, built in 1877, is one of HCMC's architectural marvels, built with materials imported from France.\nPost Office signed by Gustave Eiffel.\n\n\nLunch in a restaurant.\n\n\nIn the afternoon, discover the Chinese quarter “Cho Lon” and its impressive Binh Tay market.\nEnd of the day with a visit to a lacquerware factory.\n\n\nDinner on your own.\nOvernight in Saigon."},{"title":"Day 12: Hochiminh city – My Tho – Mekong (B/L/D)","description":"In the morning, depart from Ho Chi Minh City and drive to My Tho, located in the heart of the Mekong  Delta.\nWhen arriving in My Tho, take a boat for a cruise on the Mekong River and its multiple canals to Ben Tre.\nVisit a coco candy factory where you can taste local specialties.\nTake a coach to visit a garden house and enjoy tea with honey and fresh tropical fruits.\n\n\nLunch in M.Hai’s house.\n\n\nIn the afternoon, walk around the Hai’s village.\n\n\nDinner and overnight in homestay."},{"title":"Day 13 : My Tho – Cai Be – Hochiminh city ( B/L)","description":"After breakfast, transfer to Cai Be, take a sampan to visit Cai Be floating market, “floating halls” where focus each day boats filled with fruits and vegetables.\n\n\nOn the way, lunch at Mekong Restop restaurant– a romantic place.\nArrive in Saigon late in the afternoon.\n\n\nDinner on your own.\nOvernight in Saigon."},{"title":"Day 14: Ho Chi Minh City – Depature (B)","description":"After breakfast, free time before your transfer to the airport . End of service."}]},{"name":"Vietnam Ecotourism, Bird Flying Sightseeing Tour - 12 Days","duration":12,"travelStyle":["Adventure","Family","Wildlife","Group","Partially Guided","Discovery","Hiking & Trekking","Holiday"],"oldPrice":0,"price":2250,"summary":"Vietnam is Asia home to one of the richest but most poorly known avifauna of any Southeast Asian country, with a number of endemic, near-endemic, and highly threatened species found there..","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146990_1fb9afb9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146990_1fb9afb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_a895bae9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_7d806ce1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_e2e7fe83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_ef49c038.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_54b24237.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_0af29158.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_d254041d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_4ebda56f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_29483534.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_5e3aee9c4a127.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_5e3aee9c4a12a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_5e3aee9c4a12d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146990_5e3aee9c4a12f.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Arrive in Hanoi - Vietnam Welcome Day.","description":"Pick up at Noi Bai airport and transfer to Hanoi City center. Welcome lunch at local restaurant. Check into hotel. Free stroll around to explore Hanoi's 1000 Years Old Quarter. Dinner on guest’s account. Overnight at hotel in Hanoi."},{"title":"Day 2: Hanoi - Cuc Phuong National Park (B/L/D)","description":"Morning drive to Cuc Phuong National Park 160km south of Hanoi. Visit the Park Museum, the Botanical Garden, the look out and the Endangered Primate Rescue Centre. Later in the afternoon we observe the birds gathering in the lush rain forest. Overnight at Guest House."},{"title":"Day 3: Cuc Phuong National Park– Bird flying Sightseeing (B/L/D)","description":"Rising this morning with the sounds of the forest all around us, we head out for a trek through the lush rainforest that makes up the park. The trek will take in stops at centuries old giant trees. Picnic lunch in the park before we reach out the Muong minority people at Bong village. Diner and overnight at local home stay of Muong people. During the 20 km journey, view the wide variety of preserved bird species in the park and enjoy the sights and sounds of the jungle. Overnight at Bungalow in Bong center."},{"title":"Day 4: Cuc Phuong National Park– Bird flying sightseeing – Hanoi (B/L/D)","description":"Spend another second day bird watching time. Start from the Bong Station, then follow a circular route viewing a variety of endangered bird species. The 6-km trail passes through a wood of giant trees, some of which are over 1000 years old. Return to Hanoi. Free. Overnight in Hanoi.  "},{"title":"Day 5: Hanoi – Ba Vi National Park - Hanoi (B/L)","description":"We depart Hanoi at 8: 00 for the one and a half-hour drive to Ba Vi National Park. We will have a three-hour hike through the jungle to visit Ba Vi’s wildlife. The trek will take us deep into the jungles, and we will stop for lunch at a ethnic minority village of the Muong people. After lunch we visit a temple dedicated to the God of the Jungle. There will be time to relax in these tranquil surroundings before starting our journey back to Hanoi for overnight."},{"title":"Day 6: Hanoi - Halong Bay (B/L/D)","description":"Private pick up at 8:30 am at the lobby of your hotel, you leave Hanoi arriving at the jetty around 12:30 pm. Welcome on board of luxury 5 star rated Junk and set sail through the bay while lunch is served. Passage into the magical bay, where thousands of sculpted limestone islands rise from the waves like dragons' teeth. After lunch, we cruise to the inside of magical landscape of Dinh Huong island, Ga Choi Island, Dog Island, Binh Phong mountain, Sung Sot Cave, Round over Titov Beach. Enjoy sunset on the top of the Titop Islet or you take a bamboo row boat to discover a water tunnels with many coral reefs in a scenic lagoon. Dinner is served onboard and then you will have free time to listen to wild natural sounds in Halong Bay, relax time"},{"title":"Day 7: Halong - Catba (B/L/D)","description":"Breakfast is served onboard. Afterwards, as the boat heads for the other side of the bay, you will have the opportunity of visiting Van Gia- Halong's largest floating village. \nWE will also visit Monkey Island, where you will see Halong Bay’s native primates, before arriving at Cat Ba Island for lunch. In the afternoon, you may spend your time trekking in Cat Ba National Park. Overnight at hotel in Cat Ba Island\n"},{"title":"Day 8: Catba – Halong – Ho Chi Minh City (B/L/D)","description":"After breakfast, we take a local sampan - wooden boat back to the Junk for our return to Halong City. En route there will be time to view more beautiful limestone islands- have your camera ready for some beautiful shots!  11: 30: Arrives at the dock for lunch in a restaurant before returning to Hanoi. Continue to the airport for flight to Ho Chi Minh city. Overnight in Ho Chi Minh city."},{"title":"Day 9: Ho Chi Minh City – Tram Chim (B/L/D)","description":"Morning: Pick you up at your hotel at 6: 30 am, we will transfer to Tram Chim National Park, on the way we will stop for breakfast, expected arrive about 10: 00 am. Check in, take a rest then lunch. Prepare to go trekking and bird watching."},{"title":"Day 10: Full Day Bird Watching (B/L/D)","description":"All day bird flying sightseeing tour, travel by boat along channels, visit Zone A4 to watch flock of Eastern Sarus Crane. Overnight at local accommodation."},{"title":"Day 11: Tram Chim – Ho Chi Minh City (B, L)","description":"Morning trek, then leaving the park at 13: 00, drive back to HCMC for overnight"},{"title":"Day 12: Departure (B)","description":"Free until transfer to the airport for Return flight, see you again. Thanks for enjoy LVP Travel DMC Group. Have a good time"}]},{"name":"Landscapes of Vietnam 15 days 14 nights","duration":15,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2705,"summary":"This is a perfect choice for you to explore our country as a land of diverse traditions and beautiful landscapes. This tour will take you from the stunning mountains to a dramatic karst peak-studded bay, through buzzing cities and along winding rivers. This definitely is an unmissable chance to discover key attractions of Vietnam and enjoy Vietnamese culture, custom, art, history, religion.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763d1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411eb4e6979.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411eb4e697b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411eb4e6977.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411eb4e697e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411eb4e697c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193383_5e411f99763ed.jpg"],"destinations":["Hanoi","Sapa","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Hanoi Arrival (-)","description":"Upon arrival at Noi Bai Airport, you will be welcomed by your guide and driver, then transferred to Hotel for check in. The remainder of the day is free for you to explore at your leisure. You will spend the night at your hotel in Hanoi."},{"title":"Hanoi City Tour - Sapa (B/L)","description":"\nYour tour will start with a visit to the Ho Chi Minh Complex including Ho Chi Minh Mausoleum, stilt house and the One Pillar Pagoda. After that, you will continue to the Temple of Literature – the first University of Vietnam constructed in the 17th century. The morning will end with a visit to the Vietnam Ethnology Museum to learn about the culture and ethnic groups of Vietnam. After lunch in a restaurant, you will take in the attractions of Hoan Kiem Lake and Ngoc Son Temple. You will enjoy a 1-hour cycle tour to explore the fascinating Old Quarter and its hundreds of speciality shops selling silk clothing, lacquerware, embroidered linens, furniture, bamboo, cooking utensils, ceremonial objects and more, followed by a Puppet Show. You will be taken to Hanoi Railway Station for the night train to Lao Cai."},{"title":"Trekking In Sapa (B/L)","description":"\nYou will arrive at Lao Cai Railway Station around 05:30 where you be welcomed and picked up by our guide and driver who will take you to Sapa. After having breakfast at a local restaurant, you will begin the trek down to Lao Chai village to visit the Black H'mong. The trek will take you through stunning mountains and past iconic scenes of tumbling rice paddies. After a picnic lunch on the way, you will continue through the valley to Ta Van Village to visit Dzay people, who are supposed to be some of the friendliest in this mountainous area. The next village is Giang Ta Chai which belongs to the Red Dzao tribe where you will see the amazing scenery. Tonight you will stay overnight in a local house of Dzay ethnic people."},{"title":"Sapa - Hanoi (B/L)","description":"After enjoying breakfast with your hosts, you will begin the trek from Giang Ta Chai to Su Pan taking in more incredible views along the way. This really is an unbeatable way to start the day, surrounded by wild and beautiful natural landscapes and clean, fresh air. In Su Pan, you will be able to meet the local people who belong to the Red Dao and Black Hmong ethnic groups. After having time to meet the local people and explore the village, you will begin the trek back to Sapa. This gives you one last chance to take in the breathtaking views of the mountain ranges and rice paddies before finishing the tour back in Sapa Town. In the late afternoon, you will be taken back to Lao Cai station to take the overnight train to Hanoi. You will be arriving in Hanoi at 05.30 the following morning."},{"title":"Hanoi - Ninh Binh (B/L)","description":"You will be welcomed by your guide and driver who will take you to a local restaurant to have some breakfast and relax. After that, a 90km drive south of Hanoi will lead you to Ninh Binh, the site of the first capital city of ancient Vietnam before Hanoi took its leading role in the 11th century. The area famed for its dramatic and invigorating scenery of large flat land punctuated by karst peaks, glassy rivers and caves. The discovery of Ninh Binh starts with a boat trip in Van Long where spectacular limestone karsts jut out from the green paddy fields reminding us of Guilin (China) and Halong Bay of Vietnam. The trip will continue with a visit to the site a 10th-century palace belonging to the king of Vietnam where you can walk amongst the wooden temples dedicated to the kings of the Dinh and Le Dynasties. Dinner and overnight at hotel in Ninh Binh."},{"title":"Ninh Binh - Halong Bay (B/L/D)","description":"After breakfast, you will travel to Halong Bay, one of the two earliest World Heritage Sites in Vietnam as designated by UNESCO in 1994. You will take a short break on the way and board your boat at noon. Enjoy a lunch of fresh seafood whilst floating amongst the breathtaking bay which is decorated with thousands of picturesque rocks, islets, beaches, and hollow islands. You can stop to visit some karst grottoes, go swimming or explore the beaches. Your day will end with enjoying the sunset over the sea and eating a delicious dinner on board the boat. You will stay overnight on the boat."},{"title":"Halong Bay - Hue (B/L)","description":"The South China sea, known to the Vietnamese as the Eastern Sea, affords some of the most miraculous sunrises as the day breaks over the majestic bay.\nOur boat will continue to cruise through the marvellous bay, where almost every islet has its own name, adopted because of its shape like Sail island, Fisherman’s Head Rock, Butterfly rock or Turtle islet etc. After another seafood lunch on board, you will return to Halong Wharf and where you will be driven to Noi Bai Airport for your flight to Hue. Upon arrival in Hue, you will be welcomed by your guide and driver and be taken to your hotel for check-in. You will stay overnight in Hue."},{"title":"Hue City (B/L)","description":"After having breakfast at your hotel, you will have full day city tour around Hue. Being recognised by UNESCO as the 1st Cultural World Heritage for Vietnam, Hue is famous for the old royal architectural works and the highly traditional Vietnamese lifestyle. You will discover the incredible scenes of ancient Vietnam from the Royal Citadel, Forbidden City, Hue Royal Museum and bustling Dong Ba market. After lunch in a garden house restaurant in the traditional Hue style, you will go on to Thien Mu Pagoda and visit the Tombs of King Minh Mang and Tu Duc – two of the best-preserved monuments of the Nguyen Emperors from the 19th and 20th centuries. You will have dinner at your own arrangement and stay overnight in Hue."},{"title":"Hue - Hoi An (B/L)","description":"Today, you will take in the incredible scenery as you journey south past the Hai Van Pass and Lang Co, over the Truong Son Mountain Range that juts into the South East Sea. Upon arrival in Da Nang, you will visit the Cham Museum, which features a fine collection of open air sandstone carvings. You will stop at My Khe Beach, made famous in the American TV series of the same name. The scenes soft white sands and fluffy clouds are contrasted by the vivid blue of the sea, and they stretch for many miles the coastline. Also, on the way, you will see the five stone peaks which make up The Marble Mountains - once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. You will arrive in Hoi An and check in to your hotel."},{"title":"Hoi An City Tour (B/L)","description":"\nEnjoy a full-day excursion to Hoi An, a major trading centre, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. The authenticity of the port has been well preserved. During the tour, you will visit a temple with partially gilded statues in the centre, a pagoda dedicated to sailors and fishermen, and a chapel with origins in the 1700s that reflect the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late in the afternoon, you will take a boat trip on the picturesque Thu Bon River to Kim Bing Village on Cam Kim Island to see the woodworkers and shipbuilding families. You will be returned to your haven on the world-famous Cua Dai Beach, where you can spend the evening at your leisure. You will stay overnight in Hoi An."},{"title":"Hoi An - Ho Chi Minh city (B/L)","description":"You can relax and have breakfast at your hotel until your driver collects you for your airport transfer. From here you will fly to Saigon. Upon arrival, you will be welcomed and picked up by your tour guide and driver. Your city tour will take in the eclectic and magnificent cityscape of Saigon. You will start at Reunification Palace where the Vietnam America war ended in 1975. Today the grand building is a museum and hall for official receptions. Near the Palace are the colonial-style Post Office and the Notre Dame Cathedral. Built between 1877 and 1883, they are two of the city’s major landmarks. Our visit will end in China Town, an area unique to Saigon, with Thien Hau Pagoda and Binh Tay Market. The evening is yours to explore the city and sample the local food. You will stay overnight in Saigon."},{"title":"Cu Chi Tunnel (B/L)","description":"\nIn the morning you will enjoy a half-day private excursion to the Cu Chi Tunnels. The tunnels consist of more than 200 kilometres of underground tunnels. This main axis system has many branches connecting to underground hideouts, shelters, and entrances to other tunnels. The network includes innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centres and kitchens. Today the remaining tunnels have become a major tourist attraction giving the visitor a unique experience and a feel of what underground life was like during the U.S. Vietnam War. You will have free time in the afternoon and stay overnight in Saigon."},{"title":"Mekong Delta - Ben Tre (B/L)","description":"\nThe part of the adventure takes you to the rivers of the mighty Mekong Delta. Enjoy a brief walk on an island, sampling delicious native fruits. Visit a bee farm and try some honey tea. Float along the rivers on a traditional sampan. Continue to Tan Thach commune to visit a family-run enterprise making coconut candies. After lunch on Turtle Island, you will hop aboard a boat to Phu Tuc Village where you will stay overnight. You can enjoy fishing and sightseeing during a late afternoon rowboat trip. You will visit a local family home to have a dinner and join in a performance of traditional rural music."},{"title":"Cai Be Floating Market (B/L)","description":"After breakfast, you will be driven through the rich, verdant countryside to Cai Be where you will take a boat trip to the colourful floating market. Visit some local cottage industries such as the coconut candy workshop, pop-rice, or rice paper. The cruise will continue on to An Binh Island to visit an ancient house. Here you will taste fresh tropical fruits and have lunch. Then, take a short row on a sampan back to the nursery garden of Mr Tam Ho. After, you will visit the brick & pottery kiln and then head back to Vinh Long Town. You will be driven back to HCMC where you can relax at your hotel."},{"title":"Ho Chi Minh City Departure (B)","description":"After discovering the diverse and beautiful landscapes of Vietnam, this marks the end of your trip. You can relax until it is time for your airport transfer. Your driver will collect you from your hotel and take you to the airport for your return flight."}]},{"name":"Heritage sites of Vietnam 12 days 11 nights","duration":12,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2638,"summary":"This trip is perfect for anyone who wants to visit the main highlights of Vietnam but whose time is limited. It gives you the chance to enjoy the scenic beauty of Vietnam and discover the most famous heritage sites. Having the chance to sample the delicious regional foods is an added bonus.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e7199.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e549daa525d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e719e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e4662c4e71b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e549daa525cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e549daa525cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193998_5e549daa525d2.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Hanoi Arrival","description":"Upon arrival at Noi Bai Airport, you will be welcomed by your guide and driver and taken to your hotel for check-in. The rest of the day is yours to discover the magic of the capital of Vietnam. You will stay overnight in Hanoi."},{"title":"Hanoi City Tour (B/L)","description":"The city tour will take in the highlights of the capital city. Start with a visit to the Ho Chi Minh Complex including Ho Chi Minh's Mausoleum, his stilt house and the One Pillar Pagoda. After that, you will visit the Temple of Literature – the first University of Vietnam which was constructed in the 17th century. The morning will finish at the Vietnam Ethnology Museum where you can discover the many ethnic groups that make up the Vietnamese population. After lunch in a restaurant, you will visit the famous Hoan Kiem Lake and Ngoc Son Temple, followed by a 1-hour cycling tour to explore the fascinating Old Quarter and its hundreds of speciality shops selling silk clothing, lacquer ware, embroidered linens, furniture, bamboo, cooking utensils, ceremonial objects and more. The evening will end with some traditional entertainment in the form of a water puppet show. You will stay overnight in Hanoi."},{"title":"Hanoi – Ninh Binh (B/L)","description":"A 90km drive south of Hanoi will lead you to Ninh Binh. As well as the impressive karst-studded scenery, the area is rich in history. Ninh Binh was once the site of the first capital city of ancient Vietnam before Hanoi took its leading role in the 11th century. The visit in Ninh Binh starts with a boat trip through the stunning Van Long Reserve where the river winds past spectacular limestone karsts and fertile green paddy fields. After the relaxing boat ride, you will discover the site which once housed the palace of King Dinh and King Le in the 10th century. Now you can walk amongst the wooden temples which have been dedicated to the kings, before driving to Ninh Binh town in the late afternoon, where you will stay overnight."},{"title":"Ninh Binh – Halong Bay (B/L/D)","description":"After breakfast, you will go to Halong Bay, an iconic and beautiful spot recognized as a World Heritage Site by UNESCO. Lunch consisting of fresh seafood will be served on board as you float around the stunning bay. The cruise will take in picturesque rocks and islets, beaches and hollow islands which rear out of the crystal blue waters. Whether you want to visit the karst grottoes, go swimming or relax on the soft white sand, Halong Bay won't fail to impress. Dinner will be served on the boat where you will also spend the night."},{"title":"Halong Bay – Hanoi – Hue (B/L)","description":"The early risers can enjoy watching the miraculous sunrise over the bay, the sun lighting up the karst peak islands and reflecting off the water. Today you will visit some of the many islands and islets, many named for likeness to other objects such as Sail Island, Fisherman’s Head Rock, Butterfly Rock and Turtle Islet. After another delicious seafood lunch, you will be taken back to dry land where you will drive to Hanoi Airport for your flight Hue. In Hue, you will be met by your driver and guide who will take you to your hotel for an overnight stay."},{"title":"Hue City (B/L)","description":"Today you will visit Hue which was once the political, cultural and religious capital of Vietnam. It’s famed for its unique ancient architecture which tells the story of the City's turbulent past. Hue was also the first site in Vietnam to be recognised by UNESCO as a World Heritage Site. The tour will take you to the Royal Citadel, Forbidden City, Hue Royal Museum and Dong Ba Market. After a traditional Hue style lunch, you will visit Thien Mu pagoda and the Tombs of King Minh Mang and Tu Duc, two extremely well-preserved tombs which paint a picture of the Vietnamese royalty of the past. After the tour, you will be free to have dinner at your own arrangement and enjoy the evening as you please. You will stay overnight in Hue"},{"title":"Hue – Hoi An (B/L)","description":"After breakfast and check-out from the hotel, you will depart from Hue, passing Da Nang with stops along the road to visit the Cham Museum and Marble Mountains, and enjoying the landscapes of Hai Van Pass (the “Ocean Cloudy Mountain Pass”) and Lang Co Beach before reaching Hoi An shortly after midday.\nDuring the afternoon you will discover the charm of Hoi An's ancient town. You will cross the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls and Trading Houses, Pagodas, and stroll around the market located by Thu Bon river. Hoi An has a unique charm with many artists seeing Hoi An as a magical old world of Oriental scenes and a source of inspiration. After the tour you will be free for the evening and you can have dinner by your own arrangement. You will stay overnight in Hoi An"},{"title":"Hoi An – Ho Chi Minh city (B/L)","description":"After breakfast at the hotel, you will be taken to the airport for your flight to Ho Chi Minh city. Ho Chi Minh city is one of the best-known cities in Vietnam, known for its dizzying pace and fusion of traditional and modern Vietnamese style. Upon arrival, you will be welcomed and picked up by our tour guide and driver. You will be taken on a tour of the iconic sights in Ho Chi Minh city starting with Reunification Palace, the witness of the fierce ending of the Vietnam War 1975.\nNext, you will experience the lasting influence of the French colonial era at the Post Office and the Notre Dame Cathedral which were built between 1877 and 1883. Our visit will end in China Town, a unique aspect of Saigon, where you will visit Thien Hau Pagoda whose dramatic architecture sits in a cloud of incense smoke and the lively Binh Tay Market. After the tour, you are free for the evening, and with plenty of delicious Ho Chi Minh city specialities to choose from you will have no problems finding something for dinner. You will stay overnight in Ho Chi Minh City."},{"title":"Cu Chi Tunnel (B/L)","description":"In the morning you will enjoy a half-day private excursion to the infamous Cu Chi tunnels which were used by the Viet Cong and played a pivotal role in winning the war. The tunnels consist of more than 200 kilometres of underground tunnels. This main axis system has many branches connecting to underground hideouts, shelters, and entrances to other tunnels. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centres and kitchens. This is your chance to experience the tunnels for yourself and get a feel of what underground life was like during the U.S. Vietnam War. You will have free time in the afternoon and stay overnight in Saigon"},{"title":"Ho Chi Minh city - Mekong Delta (B/L)","description":"Today you will head south to the green waterways of the Mekong Delta. You will visit My Tho and Ben Tre, the homeland of all things coconut and other family-run factories specialising in local products. You will also stop en route to visit Dong Tam Snake Farm and Vinh Trang pagoda.\nUpon arrival in My Tho, you will board a small boat and travel down the canals into gardens and rural houses, where a lot of families produce coconut candy, keep bees for honey, or plant fruit. You will be able to discover this unique culture as you visit some families and their small factories. You will stop for lunch en route and will have dinner and stay overnight in Can Tho."},{"title":"Can Tho – Ho Chi Minh city B/L)","description":"A highlight of any trip to the Mekong delta is visiting one of the floating markets. You will wake up early to catch the colourful and lively market in full swing either in Cai Rang or Phong Dien. Here you will see the local people of the Mekong who come to the markets each day, their boats laden with fruits, foodstuff and other consumer goods ready for trading and selling. You will visit some farms in Can Tho on the way back to Ho Chi Minh city. Once back in Ho Chi Minh city, you are free for the evening. You will have dinner at your own arrangement and stay overnight in Ho Chi Minh city"}]}]