[{"name":"Vietnam Discovery - 15 Days","duration":15,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1250,"summary":"We'll pick you up from the airport and take you to the Hotel in Hanoi. You'll then have plenty of time to recover from your flight, chill out and free time for your own plan.Start point\n Our driver will pick you up here, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c43e553afd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c43e553afd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd6787.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd678d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd6794.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8c417839f11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd6797.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd6798.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd679a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd679b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd679c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197764_5e8d4c8dd679d.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Can Tho","Chau Doc"],"timeline":[{"title":"Ha Noi Arrival","description":"We'll pick you up from the airport and take you to the Hotel in Hanoi. You'll then have plenty of time to recover from your flight, chill out and free time for your own plan."},{"title":"Ha Noi – Lang Son – Quang Uyen (B/L/D)","description":"Our tour guide will pick you up by car at your hotel in Hanoi old quarter  around 7:30-8:00am, transferring you to Lang Son. We will start by driving in the direction of the Chinese border for about 3 hours, before stopping at Chi Lang Pass - a 20-km-long gorge created from a narrow valley between two mountains.\n\nThis place occupies an important position in Vietnamese history, being the place of many victories against various Chinese invasions over the centuries and millennia, as far back as 981AD. As such it bears the reputation of Vietnam’s strongest citadel and bastion. Here you will have roughly an hour to walk around and explore the area around the Quy Mon Quan Gate, which translates as “The Gate of Monsters”, named for the many invasion forces that would spill through the pass over the course of history only to be beaten back by stalwart Vietnamese defenders.\n\nAfter lunch at a local restaurant in Dong Dang, you will continue your trip into the pass, stopping to visit Mother’s Temple and Dong Khe – an important historical site where The Battle of Dong Khe was fought during the First Indochina War. In fact, this was the very first battle of the Indochina Wars, and the fighting here took place through September and October 1950, ending in a resounding victory for the Viet Minh.\n\nIn the evening you will get to enjoy dinner and overnight rest in a local homestay owned and operated by a local Nung family.\n\nHighlights and activities: Chi Lang, Quy Mon Quan Gate, Dong Khe Battle Site, Ethnic Villages, and a 3-5km walk.\n"},{"title":"Cao Bang – Ban Gioc Watefall (B/L/D)","description":"After enjoying breakfast at the homestay, you will depart for Trung Khanh which lies right on the border with China. Here you will have another chance to meet and interact with the local Nung people living in the village of Phuoc Sen, a mountainous village famous for its traditional blacksmithing. The farming tools made here are an integral part of the lifestyle which is evident in the surrounding rice paddies and fields.\nNestled amongst these amazing landscapes is the breath-taking Ban Gioc Waterfall which spans over 300 meters, split half and half between Vietnam and China. You’ll get some time here to simply take in the amazing atmosphere surrounding the falls, which presents an excellent opportunity for some fantastic photography.\n\nOnce you’ve finished at the falls, it’s time to head over to Nguom Ngao Cave, for a very different, but no less impressive natural wonder. The cave stretches for 2,144 meters underground and is brimming with incredible stalactites and stalagmites.\n\nYou will then return to Cao Bang town and head down the “snake pass” to Ba Be Lake, where you will stay overnight in a homestay constructed in traditional Tay fashion and owned and operated by a local Tay family. Here you can relax and unwind from the day and enjoy a delicious and authentic home-cooked meal.\n\nHighlights and activities: Ban Gioc Waterfall, Nguom Ngao Cave, Ethnic Villages\n"},{"title":"Ba Be Lake – Ha Noi (B/L)","description":"After breakfast we’ll kick the final day of the tour of by boarding a boat and setting off onto the lake. It’s up to you how to spend your time on the boat, whether it’s relaxing and enjoying the views or going for a swim in the cool waters to refresh yourself. The views consist of stunning karst formations all around you covered with patches of wild vegetation and a rich wildlife.\nThe boat will then continue along the Nang River, giving you a chance to explore the caves of Puong Grotto where you can marvel at the stalactites and stalagmites created through river erosion, as well as observe the thousands-strong bat colony that lives here.\nNow that you’ve reached the end of your tour, you’ll be driven the roughly 230 kilometres back to Hanoi, with a stop at a tea plantation nestled among rolling hills. Once we arrive in Hanoi it is time to say farewell, having made lifelong memories and connections.\n\nHighlights and activities: Ba Be Lake, Puong Cave, Tay ethnic villages.\n"},{"title":"Bai Dinh Pagoda – Trang An Tour (B/L)","description":"Trang An Tourism Complex (located in the northern province of Ninh Binh) is one of the UNESCO’s World Heritage Committee lists. The eco-attraction which located in the East of Ninh Binh with an area of 2000 ha, divided into 5 main parts: special protection area (Hoa Lu Ancient Captial), the center, caves area, service and travel area, spiritual area – Bai Dinh pagoda. Bai Dinh pagoda is well known as one of the biggest Pagodas and has got the most statues in Vietnam.\nTrang An – Bai Dinh tour is one of the popular tours in the festival of the Vietnamese people after the Luna New Year holiday.\n8:00 – 8:30 AM: We pick up guests from hotels located in the Old Quarter. The drive to Ninh Binh will be approximately 2 hours.\n10:30 AM: Our tour guide will take you to Bai Dinh Pagoda, which has hundreds of Buddhist statues including the biggest statue of Buddha made in bronze standing 10 meters tall.\n12:30 PM: Time to take a break and have lunch at a local restaurant with Ninh Binh traditional dishes from goat meat.\n1:30 PM: We will continue the trip to Trang An. Upon on arrival, we will take the boat trip along Trang An river to enjoy the cave complex. The scenery of Trang An is a unique combination of deep turquoise river water between mountains, water caves and clear blue sky where you will not find anywhere else. The boat trip will range from 2 to 3 hours, rowed by local people.\n"},{"title":"Ha Noi - Hai Phong - Lan Ha Bay - Ha Long Bay (B/L/D)","description":"09h00: You will be pick up  from Hanoi Old Quarter to take the highway to Got Port, Haiphong where we arrive at around 11h30\n\n12h00: Transfer by tender to the MAYA CRUISE. On the way to the main boat, you will have a chance to see Cai Trap canal.\n\n12h15: We welcome our guests onboard the MAYA CRUISE and then check in, enjoy Welcome Drink, receive cruise briefing, safety instructions and check in. Start cruising and explore Lan Ha Bay & Ha Long Bay.\n\n12h40: MAYA CRUISE proceeds to Da Chong islet, where you can see a lighthouse built by the French over 100 years ago. Have lunch while passing via the islets. These amazing limestone karst formations rise up out of the sea in an impressive manner.\n15h00:  We progress to Tra Bầu area of Lan Hạ Bay- a separate part of Halong Bay. This is a quiet tourist paradise in Vietnam. You can try at kayaking or simply just enjoy a swim.\n17h30: Returning MAYA CRUISE, you can watch the magnificent sunset over the Gulf of Tonkin. Onboard you may join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. In the early evening the boat has its Happy Hour deal\n19h30: Dinner is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting\n\n21h30: Enjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board."},{"title":"Lan Ha Bay - Ha Noi (B/L) - Flight to Da Nang","description":"06h00: Tai Chi session on the sundeck; after which we serve light breakfast.\n\nUpon completing breakfast continue our journey and head out in bamboo boat to explore the bay in the area where the Toi Sang cave is situated.\n\n9h30:   Visit then return MAYA CRUISE for check-out procedures\n\n10h00: Whilst cruising back you can enjoy a delightful brunch\n\n11h35: We return to the quay side in the south of the bay, where our visitors disembark.\n\n12h10: We bid farewell at Got port, this is the end of the program.\n\n14h00: Back to your drop-off point in Hanoi. End of the trip\n\nWhen you back to Hanoi, you will have some time for rest or shopping before taking flight to Da Nang. Our driver will waiting and pick you up after you reached Da Nang airport."},{"title":"Ba Na Hill – Golden Bridge (B/L)","description":"07:30 am – 08:00 am: Our Minivan and a tour guide pick you up at hotel lobby. Reach Ba Na Hills via Cable Car \t\nSpend your time on the most modern Cable Car in Southeast Asia, then take The Climbing Train to visit the top of the mountain& further explore Le Jardin D’Amour (consists of 9 gardens), Debay Wine Cellar (old wineries) & Ling Ung Pagoda \nContinue  the 2nd Cable Car to visit  the French Village (enjoy Street Music, watch Art’s statue), Campanile, Nine Floor Goddess Shrine, Tombstone Temple, Linh Phong Monastery, Linh Chua LinhTu Temple & Tru Vu Tea Shop\nWatch Carnival Performance Show, Square Du Dome...\nChallenge the most popular adventure ride - Slide of Tube Car (free ride), \nLunch at Restaurant (Buffet) \nJoin in Fantasy Park with Walking in Fairy Forest, discover Dinosaur Park, play 5D wild west, enjoy 4D death race ride, watch 3D mega 360 degree, ride on Journey into the underground, enter Jurassic Park, challenge Freefall Tower and participate in adventure in Horror House and over 90 free games.\n15:00: return the Cable Car for leaving Ba Na Hills\nHighlight: Unique and unique design, unprecedented in Vietnam. The Golden bridge is built at a height of more than 1400 meters above sea level. With total length of about 150 meters, with 8 spans, the largest is 21.2 meters. The bridge is made of 3 meters wide, 5 cm thick wood, along the aisles are planted a lot of flowers Queen Green, above the railing is made of stainless steel gilt. \n16:45 – 18:00: Our Minivan brings you back to your hotel. Tour ends.\n"},{"title":"Cham island Sightseeing and Snorkling Tour (B/L)","description":"07h30-08h30: Pick up at hotel ( Hoi an city) to Cua Dai harbour.\n08h30: Relaxing in fresh cool wind , you will enjoy the beautiful landscape on a speed boat to Cham Island.\n09h00: Arriving at Lang Beach. Visiting the Marine Protected Area, The Boat Shelter, Hai Tang pagoda, Traditional fishing Village\n10h00: Swimming and snorkeling\n11h30: Staying at Bai Ong ecological zone or Bai Chong beach, swimming, taking time to enjoy a sea food lunch.\n14h00: Packing luggage for return trip to Hoi An\n14h30: Seeing you off at your hotel and finish your trip\n"},{"title":"Hue City Tour (B/L)","description":"07h30-08h15: Car and tour guide will pick up you at Da Nang and go to Hue city.On the way, you will visit Hai Van road tunnel - the longest tunnel in Southeast Asia and Lang Co Beach.\n10h30: You will visit the Khai Dinh tomb, the tomb had elements of eastern art mixed with western designs.\n12h00: Having lunch and rest at restaurant \n13h00: You will continue visiting Hue imperial city – the palace of 13 Nguyen Kings with Ngo Mon Gate, Library, Thai Hoa palace, Nine Dynastic Urns and visiting Thien Mu pagoda associated with culture and history of Hue.\nOvernight stay in Hue\n"},{"title":"Hue (B) – Flight to Ho Chi Minh","description":"Breakfast at hotel, free time for your own leisure then transfer to airport for flight to Ho Chi Minh.\nFree time and overnight stay in Ho Chi Minh"},{"title":"HCMC - My Tho - Ben Tre - Can Tho (B/L)","description":"Leave Ho Chi Minh city, enjoy the scenic journey along the way bordered by green rice fields. On arrival at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through the fruit plantations and villages. Proceed to Can Tho. Overnight in the hotel (family home-stay with dinner can be arranged on request). Free time to visit the bustling Can Tho market."},{"title":"Can Tho - Chau Doc - Tra Su Sanctuary (B/L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to Cai Rang floating markets (& Phong Dien is optional), which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to pass a \"Monkey bridge\" which is built by only one stem of bamboo. Visit the orchard garden. Stop for lunch. Proceed to Chau Doc, continue the tour to visit Tra Su, getting to the wild birds Sanctuary, cruising smoothly with small boats to discover the arrays of splendid canals deep into the forest, watching storks, cranes and other tropical birds. Back to the Town, hotel check in. Overnight in Chau Doc. \n"},{"title":"Chau Doc – Ho Chi Minh (B)","description":"After breakfast, take a nice boat trip through the floating village to visit a fish farm to see how the Mekong Delta people raise fish in their floating houses. Visit the Cham minority with their traditional weaving village, followed by a local Islamic Mosque. Then transfer back to HCM. Overnight stay at hotel"},{"title":"Departure (B)","description":"Breakfast at hotel, there are no activities today, free time till our driver come to pick you up to airport. End of trip\n\n"}]},{"name":"Authentic Vietnam Holiday For Family ( Halong Bay/ Hue/Mui Ne) 13 Days","duration":13,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1066,"summary":"In and around HanoiWelcome to Vietnam, upon arrival to Hanoi’s Noi Bai International Airport, you will be welcome by our representative holding a sign with your name and our company logo on it. Our representative will guide you through fast-track security and visa services. After obtaining your visa and collected your luggage, will lead the way to your awaiting guide and driver. You will be privately transferred to your luxury accommodations by our professional driver and an English-speaking guide. Stay right in the heart of the city next to the central Hoan Kiem lake, with the fascinating Old Quarter right at your fingertips, you can easily explore the city at your own pace.\n\nOvernight in HanoiStart point\n Noi Bai International Airport ( HAN), Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a5b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f116b9ea7a77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198920_5f1506bf45b6c.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Mui Ne","Ho Chi Minh City"],"timeline":[{"title":"HANOI ARRIVAL – VIP FAST TRACK MEET AND GREET","description":"Welcome to Vietnam, upon arrival to Hanoi’s Noi Bai International Airport, you will be welcome by our representative holding a sign with your name and our company logo on it. Our representative will guide you through fast-track security and visa services. After obtaining your visa and collected your luggage, will lead the way to your awaiting guide and driver. You will be privately transferred to your luxury accommodations by our professional driver and an English-speaking guide. Stay right in the heart of the city next to the central Hoan Kiem lake, with the fascinating Old Quarter right at your fingertips, you can easily explore the city at your own pace.\n\nOvernight in Hanoi"},{"title":"HANOI - BAVI ECO TOUR (B) - HANOI","description":"You will be picked up from the hotel at 07:30 and transferred to Ba Vi. You will visit 3 villages, at each village, the local host will show you Vietnamese countryside life. You will be welcomed by Mr. Duoc – a veteran, listen to his stories about his life during and after the Vietnam War. He also is an expert on handling the raw tea leaves and making it into the products to sell on the market Then you will visit a tea village with 30-years old tea trees. There besides walking and helping local people to harvest the tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage in the world. Then heading to Mrs. Chin’s house for a cooking lesson and have lunch within the garden. After lunch have some rest and your host will take you around her village and you will visit the local workshops. You will learn how to make tofu, unshell the rice and will see the workshop of local hammerer who is working there for 70 years. Cycling through the rice fields then you will arrive at the house of your next host Mr. Chau, have your feet soaking in warm water with herb leaves following the recipes of Muong ethnic minorities. Continue the boat trip along the Da river and viewing the stunning scenery and discover the life of local people alongside the river.\n\nDrive back to Hanoi in the evening, end your Bavi Eco Tour at the hotel around 18:30.\n\nOvernight in Hanoi."},{"title":"HA NOI – HA LONG BAY (B/L/D) - SHARING BUS - OVERNIGHT ON CRUISE","description":"n the morning, after breakfast at the hotel, you will be picked up to Halong Bay. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival to Halong, you will enjoy a cruise on the Bay and explore the limestone rocks and the karst grottoes.\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which there will be a trip to the famous limestone cave in Ha Long Bay, you’ll get to spend some time here, kayaking or swimming so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can optionally attend the activities taking part on the boat or just relax.\nOvernight on cruise."},{"title":"HA LONG BAY – HA NOI (B/L)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and back to your accommodation in Hanoi.\n\nThe rest is leisure time in Hanoi\n\nOvernight in Ha Noi."},{"title":"HA NOI – FLY TO HUE – FLIGHT INCLUDED (B)","description":"Have breakfast at the hotel and have a relaxing time before your driver transfers you to the airport. Take the flight to Hue - Ancient Capital of Vietnam and meet our guide who is waiting for you at the airport. You will be privately transferred to your luxury accommodations by our professional driver and an English-speaking guide.\n\nOvernight in Hue"},{"title":"HUE CULTURAL LENS KITES MAKING ARTISANRY BY BICYCLE (B)","description":"The imperial city of Hue is known for its beautiful kites, so why not spend your morning getting to know more about this traditional craft? Today’s tour will begin at 08:30 and we will learn about Hue’s rich culture and heritage from a local artisan.\n\nThis morning, we cycle 3 miles to meet your instructor, a local kite lover who is also a third-generation kite maker in Hue. To begin the day you'll take a tour of his house and hear about the history of kite flying in Vietnam, a form of once entertainment favored by the aristocracy and mandarins of the Nguyen Dynasty. Then step into his workshop where he uses the traditional methods to makes his òe-of - a - kind kites, then you'll get a chance to try painting your own. Kite painting requires a delicate hand, but with your instructor there to guide you, you're sure to produce a masterpiece. Wrap up this kite making Hue experience with a truly unique handmade souvenir - a reminder of Hue’s rich artistic heritage. Once you are finished learning about the local arts stop for a short break at a local cafe for a cup of delicious Vietnamese coffee before returning to your hotel by bicycle.\n\nOvernight in Hue"},{"title":"EXPLORE IMPERIAL CITADEL BY CYCLO H/D (B)","description":"Cyclo is one of the most typical vehicles that tourists often see when they travel to Vietnam. Hue cyclo tour was organized to bring you a new and interesting experience when sitting on this special vehicle and going through the city streets. Besides, this tour also helps you have a chance to explore the famous tourist destinations in Hue and watch the daily life of local people.\n\nToday’s tour will begin at 08:00. Move off the beaten track for a look at the imperial city’s hidden gems during this hue half-day tour. Climb into a cyclo for a ride through the ‘Old City’. The first few minutes will pass through the south of Huong River by Truong Tien bridge. Next, you'll visit the Imperial Citadel where the former kings of Vietnam's last feudal dynasty ruled from 1802 to 1945 visit the Royal Antiquities Museum, a gallery of antiques displaying a collection of bronze pottery, Chinaware, Phap Lam enamel, court robes, head-gear and personal belongings of former Vietnam Emperors. Admire the collection of ornaments from dynastic times. Then hop back in the cycle for a short ride to Dong Ba Market. Step inside and mingle with the locals while browsing the colorful stalls.\n\nAfter this, today's tour ends back at your hotel \n\nOvernight in Hue"},{"title":"HUE FLY TO HO CHI MINH CITY (B) FLIGHT INCLUDED","description":"Have breakfast at the hotel and have a relaxing time before your driver transfers you to the airport. Take the flight to Ho Chi Minh City and meet our guide who is waiting for you at the airport. You will be privately transferred to your luxury accommodations by our professional driver and an English-speaking guide.\n\nOvernight in Ho Chi Minh city"},{"title":"HO CHI MINH CITY – TRANSFER TO MUI NE (B) PRIVATE CAR – NO GUIDE","description":"Have a healthy breakfast at the hotel. Then your driver will meet you at the hotel and transfer you to resort to Mui Ne on a private vehicle. It's approximately 5 hours from Ho Chi Minh city to Mui Ne and there will be a convenient stop on the way.\n\nOvernight in Mui Ne"},{"title":"CHERISH YOUR TIME ON MUI NE BEACH (B)","description":"Immerse yourself in the fresh crystal-clear water of Mui Ne. This sun-kissed town is perfect for Vietnam family holidays with various choices of water activities, child-friendly hotels and restaurants, and over 300 days of sunshine per year. Enjoy leisure day at the bleached sandy beach and clear emerald water or exploring at your own pace. . Seeing what interests you.\n\nOvernight in Mui Ne"},{"title":"CHERISH YOUR TIME ON MUI NE BEACH (B)","description":"Enjoy leisure day at the bleached sandy beach and clear emerald water or exploring at your own pace.\nOvernight in Mui Ne"},{"title":"MUI NE – TRAVEL TO HO CHI MINH CITY (B) PRIVATE CAR – NO GUIDE","description":"Enjoy a healthy breakfast at the resort. After check-out, your driver will come to pick you up and transfer back to Ho Chi Minh city.\n\nOvernight in Ho Chi Minh city."},{"title":"HO CHI MINH CITY DEPARTURE (B)","description":"Relish a hearty breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends"}]},{"name":"12-Day Vietnam Flexible Package from South to North on open Buses (Tour can be customized to your preference)","duration":12,"travelStyle":["Adventure","Family","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":599,"summary":"The Complete Vietnam Tour starts in Ho Chi Minh city and ends in Hanoi is an Explorer tour that takes 12 days taking you from South to North and through other destinations in Vietnam. \n\nTravel around Vietnam on this flexible package allowing you to take your time and stay as long as you wish in each destination. Please note that the package can be customized to your preference.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/167510_60822765.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/167510_60822765.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_dfaf584d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_8c1b9ffe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_351aea7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_68d84344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_0debf964.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_a3670a07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_b0c0e79c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_600339a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_bbd083c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_490d4127.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_00bb94b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_d8261108.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_f9dbf0d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167510_38d313be.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Mui Ne","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: SAIGON ARRIVAL (NO MEALS)","description":"On arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You have free time for leisure\n Overnight in Saigon \n"},{"title":"Day 2: CU CHI TUNNELS AND MEKONG DELTA FULL DAY BY LIMOUSINE VAN (L)","description":"This tour is perfect for those who are interested in the history of the Vietnam War or are looking for a day trip not too far away from Ho Chi Minh city. The tour takes you to two important tourist sites: Cu Chi Tunnels and the Mekong Delta.\nCu Chi Tunnels, known as the “iron triangle” during the Vietnam war, are a network of underground tunnels that were used as a military base for resistance to US forces during the Vietnam War. Cu Chi itself was once known as the “dead land” that was destroyed by millions of bombs. But today, the land is still alive and combines legendary historical structures with the unique culture of the Vietnamese.\nMekong delta is known as “the rice bowl” of Vietnam, due to the seemingly endless fields of rice. In this water world, you will see houses and markets floating along the river. This is a fabulous destination for those who want to experience the humble beauty of the Mekong Delta, get closer to nature and meet the hospitable people of this region.\n\n7:30am: Our guide pick you up at your hotel to go to Cu Chi Tunnel for one and half hours by mini van.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\nAfternoon: We will depart from Cu Chi to My Tho city for two hours by car. On the way to My Tho, we stop at restaurant to have a lunch.\nUpon arrival to My Tho City, The boat take you to small canal, where is the place you totally escape from the busy town. The boat cruise in the coconut trees canal takes you to a coconut island in Ben Tre. We disembark and have a walk around the village. Stop at a local family to enjoy tropical fruit, taste honey tea, honey wine and listen to Vietnamese traditional music, performance by the villagers.\nContinue walking on the village’s road to coconut candy shop, learn how to make candy, show some handicraft made by coconut tree. Take a walk through village with two sides there are so many kind of fruits, flowers, trees, local houses, children in Mekong delta, take your time to have nice photos and enjoy nature scenery.\n17:00 – 17:30 going back Ho Chi Minh City..\n19:00 Tour ends \nOvernight in Saigon \n\n"},{"title":"Day 3 : SAIGON – MUINE BY BUS, THEN SUNSET TOUR (NO MEALS)","description":"At 6:30am please be at our bus office to take bus to Mui ne.\nWhen arrive Mui ne, our bus will drop you off at hostel then our driver will meet at hostel to do half day Sunset tour.\nOur driver will pick you up at your hotel then make a trip to Fishing village by Jeep. Mui Ne fishing village was located in the North end of Mui Ne Bay, you have chance to see a hundred of colorful fishing boats mooring on the water at the entrance of town. Further along into town is a small colorful market. You can buy some fresh seafood at there. Our next destination is red sand dune which is located closer to the sea. You will be explored the smooth red sand dune. It’s so fun to slide down by skateboard on immense sand dune. After that, we will continue to go the white sand dune. From the white dunes you’ll have a view of the large dune lake ringed by pine trees. It’s larger than red sand dune. You will be experienced the vast of sand dune by motorbike or jeep. When coming to white sand dune, you will meet Lotus Lake. Lotus Lake consists of 2 beautiful lakes located next to each other. Looking down from above, tourists will amaze the spectacular immense blue lagoon along with beautiful white sand shores endlessly stretching. The next location is fairy stream, this place become a dreamlike area in Mui Ne. One side of fairy stream is white and red sand mountain intermixing together, another side are rows of shading coconut palms, lines of trees with luxuriant leaves. In addition, the green lines of coconut palms will bring you to the world of pureness. Along the stream, you can view mountain and hill. The most beautiful scene of this place makes many visitor feel unforgettable and attraction\nOvernight in Mui ne\n"},{"title":"Day 4: MUINE – NHATRANG BY BUS AT 12:30PM (NO MEALS)","description":"Freetime to visit Muine by your leisure time then please be at our bus office  at 12:00pm to go to Nha Trang.\nArrive Nha Trang around 6pm, please go to hostel by yourself.\nFree time in the evening.\nOvernight in Nhatrang \n"},{"title":"Day 5: 4 ISLAND TOUR IN NHATRANG (L)","description":"9h00 :   Pick-up at the hotel and transfer to Cau Da pier.\n10h00 - 11h30:  At  Mun Island\n- Observe the structure of Salanganeisland.\n- Snorkelling to view coral reefs covered with multicolour fish.\n\n11h45- 13h45:  At  Mot Island\n-  Having lunch with dishes: fried salted shrimp, fried fish in sour and sweet sauce, sauteed cuttlefish, grilled rib, spring rolls, softly sauteed noodles…\n-  Entertainment program: singing songs & music.\n-  Enjoy cooktails at “ Floating Bar”\n14h – 15h30:  At  Con Se Tre Village\n-  Relax at Con Se Tre village.\n-  Seasonal fruit party.\n\n15h45 – 16h15: At  Mieu Island\nVisit Tri Nguyen Aquarium\n16h30:   Back to harbour and hotel \n\nAt 7:00pm Take night bus to Hoi An by sleeping bus. Please be at our bus office half an hour before departure time.\n\nOvernight on bus \n"},{"title":"Day 6: HOI AN ARRIVAL THEN HALF DAY LUXURY GROUP TOUR MY SON HOLYLAND (L)","description":"Arrive Hoi An, then take your way to hostel by yourself. \nOur tour guide will meet you at hostel around 8.00 – 8.30 and depart to My Son holy land - the world cultural heritage. \n10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on!\n12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air.\n13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends\nOvernight in Hoi An\n"},{"title":"Day 7: BUS HOI AN – HUE AT 1:45PM (NO MEALS)","description":"Having freetime to visit Hoian town by your leisure time. Then please be at bus office half an hour in advance to take bus to Hue city.\nOvernight in Hue y 7:  HOI AN – HUE BY BUS  "},{"title":"Day 8: 1 DAY PARADISE CAVE (L)","description":"6h00 Tour guide pick you up from your hotel in Hue and depart for Quang Binh. On the way, stop for sightseeing La Vang Church, where Virgin Maria appeared in 1798, and  Hien Luong Bridge, Ben Hai River (latitude 17 division from south to north of the country during 20 years from 1954 to 1973). \n11h30: Lunch at Phong Nha Restaurant\n12h15: continue to Paradise Cave to explore the glamor of Asia's longest dry and beautiful than the Phong Nha is inherently Natural Wonders of the World with the beautiful of nature given chemical.\nFrom the historic Ho Chi Minh Road (former Ho Chi Minh Trail), you veer off on a path through dense forest for about four kilometers, then you climb 519 rocky steps, and you’re in... heaven, well, Paradise.\nTour will back to Hue.\nOvernight in Hue\n"},{"title":"Day 9: HUE – HANOI BY BUS AT 5:30PM ( NO MEALS)","description":"Free time in the morning. Then please be at our bus office at 5:00pm to take bus to Hanoi city.\nOvernight on sleeping bus "},{"title":"Day 10: HANOI ARRIVALTHEN HALONG BAY 2DAYS 1NIGHT ON 3 STAR CRUISE ( L,D)","description":"Arrive Hanoi, stop at bus office then our tour guide will pick you up to do Halong bay tour around 7:45 – 8:15 please. \n\n(Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities)\n\n07.45 – 08.15 approx\n- Our guide will meet you at your hotel. The shuttle bus or private car pick up\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n- Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n- Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is served\n- Join us for a typical local lunch in the dining room or at the outdoor dining area. \n\nAfternoon\n-\tArrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n-\tHeading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n-\tHeading back toward the sleeping area\n\nEarly evening\n-\tSummit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n-\tAn authentic Vietnamese menu is served\n-\tAfter dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…\n"},{"title":"Day 11: HALONG BAY – HANOI (B,L)","description":"(Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\n Local breakfast is served\n\n08:00\n-\tMingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n-\tTake your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. \n\n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30\n\nOvernight in Hanoi \n"},{"title":"Day 12: HANOI DEPARTURE (NO MEALS)","description":"Have freetime to visit Hanoi by yourself until transfer time to Noi Bai airport as your departure time."}]},{"name":"Unforgotten Memories of Adventures Vacation 12 Days ( Sapa/ Y Tý/ Hue/ Ho Chi Minh City)","duration":12,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1267,"summary":"Let’s take a hale and hearty adventure to eccentric places. Upon your arrival to an astonishing Hanoi, relax before the journey to the striking beauty of Sapa by private comfortable car. Then, trek to the most intact minority ethnic villages, Ta Van, Giang Ta Chai. Next, chase the cloud in Y Ty village. You will witness the local market like a vividly colorful and lively picture where all ethnic groups nearby gather on a collection of traditional costumes. Experiences of hiking and trekking through traditional houses of Ha Nhi like gigantic mushrooms will last for a lifetime. Stunning landscape, ideal weather, clouds, mountains, rice field terrace, etc. harmonize to freshen up your soul. Fly to a mild Hue. An adventure lover never grabs an ordinary tour, but comes to an ancient village, Thuy Bieu, gracefully surrounded by many great views and sightseeings. Enjoy local and typical food, traditional houses, know how to make joss-paper, paper-painting, and take a biking tour, foot massage. Lastly, Ho Chi Minh will be uncovered by a unique way, Jeep car. Independence Palace, Museum of American War Crimes, Notre Dame Cathedral and the Old Post Office are the highlights that no one can miss out on. After 12-day of discovery, do not hesitate to tell the world that you have tasted one of the truly adventure tours ever.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a665b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a665b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6661.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6663.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6665.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6666.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6668.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6669.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a666b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a666c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a666e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a666f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6671.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6672.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198887_5eb23ee9a6674.jpg"],"destinations":["Hanoi","Sapa","Hue","Ho Chi Minh City"],"timeline":[{"title":"WELCOME TO VIETNAM – HA NOI ARRIVAL","description":"Your trip begins with the arrival in Ha Noi. Your driver and guide will meet you at the airport and transfer to your accommodation. Check into a hotel and have some rest after the flight.\n\nYou can take a walk around the neighborhood. Historic charm, architectural marvels, and products’ variety are splashed all over this area.\n\nOvernight in Ha Noi."},{"title":"HANOI – TRANSFER TO SAPA BY PRIVATE CAR (B)","description":"Enjoy your breakfast at your accommodation. Then our driver will take you to Sapa. It takes fews hours to arrive Sapa. During the journey, you will have the opportunity to enjoy the beautiful scenery on the both sides of this road.\n\nOvernight in Sapa"},{"title":"LAO CHAI – TAVAN – GIANG TA CHAI – SAPA (B/L)","description":"The day is devoted to a beautiful hike through the breathtaking scenery of Sa Pa valley. Start by road that descends in the wake of the street Cau May (6 km) En route, admire the rice terraces hidden behind mist of the morning, a truly awe-inspiring sight.\n\nFollow a small track and cross Muong Hoa River and pass well tended rice terraces on your way to the Black Hmong village of Lao Chai. Continuing through the colorful rice terraces you will reach the village of Ta Van Giay. As you continue your trek along the Muong Hoa River you will cross a small suspension bridge, roughly 2km from the settlement. Here you can discover a fascinating collection of rock carvings. These engravings depict some beautiful images of man, stilt houses and some beautiful decorative patterns. We lunch in a home in the village. After lunch the walk continues through a bamboo forest to Giang Ta Chai, a Red Dao ethnic minority village. After taking a rest nearby a waterfall to refresh, you start climbing uphill to a road where the car is ready for your journey back to Sapa."},{"title":"TRAVEL FROM SAPA TO Y TY VILLAGE (B/L/D)","description":"Have a breakfast at your hotel. Then leave early morning for Muong Hum typical market to avoid a crowd of tourist. You meet the ethnic groups from all regions around Muong Hum and it’s a meet at the end of the world. Lunch at local restaurant.\nDeparture for hiking in the village around the market Muong Hum for discovery of daily life and local occupations of difference ethnic minorities and populated in the beautiful regions.\nDinner and overnight in Y Ty."},{"title":"Y TY TREKKING (B/L/D)","description":"Breakfast at your accommodation.  Departure by private car to the village of Choang Thien where you start another day of hiking through the traditional houses of Ha Nhi to discover of daily activities.. Lunch at H’Mong family.\n\nAfternoon visit Ngai Thau village, home of H’Mong ethnic group and these hike are through the magnificent landscape: mountains, terraced rice fields, waterfall, ethnic village. Dinner at restaurant and overnight in Y Ty."},{"title":"Y TY VILLAGE – SAPA (B/L)","description":"This day will bring you back to Sapa town. On the way, you will visit Lao Chai village, home of Ha Nhi, through the terraced rice fields and typical house of Ha Nhi. Departure to Den Sang, Sang Ma Sao village for lunch. Then you transfer directly to Sapa.\n\nOvernight in Sapa"},{"title":"TRAVEL FROM SAPA TO HANOI BY PRIVATE CAR (B)","description":"Have a breakfast at your hotel. Enjoy your last day in Sapa. Afterward our driver will come to your accommodation and transfer you to Hanoi\n\nArrival in Hanoi. Check in hotel and leisure\n\nOvernight in Hanoi"},{"title":"HANOI – FLY TO HUE (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and get ready for the next flight to Hue.\n\nOvernight in Hue"},{"title":"HUE COUNTRYSIDE TOUR TO THUY BIEU VILLAGE (B/L)","description":"This morning you will be picked up and transferred to Toa Kham Wharf, starting the trip will be a visit of the Thien Mu pagoda - a historic temple, the symbol of Hue city before arriving in Thuy Bieu Village. After a welcome drink at the local house, you will ride the bike around the village to see the daily life of the local people, stop to visit an incense-making family,  joss-paper making family, a paper-painting family to see countryside painting of young local artists.\n\nAfter our village biking, you will be back to the local house to have foot massage before cooking your lunch under the instruction of our chief. Our local cook will help you cook some famous local foods such as Fig salad mixed shrimp and pork, Banh Ram It (a patty of super-crunchy deep-fried stick rice topped with stir-fried shrimp and pork), Banh Khoái (a pan-fried crepe that is typically stuffed with shrimp and pork). Lunch will be served with all Hue food before taking a rest and drive back to your hotel for free afternoon.\n\nOvernight in Hue"},{"title":"TRAVEL FROM HUE TO HO CHI MINH CITY (B)","description":"Have breakfast at the hotel and get ready for the trip to your next destination. Your driver will pick you up from the hotel lobby and transfer to the airport for your flight to Ho Chi Minh. Upon arrival, you will be transferred to your accommodation. The rest of the day is at your leisure.\n\nOvernight in Ho Chi Minh."},{"title":"HO CHI MINH CITY TOUR BY JEEP CAR (B)","description":"Have a breakfast at your hotel then Jeep pick you up at hotel and begin the city tour.\n\nFirst stop on your tour Jeep will take you go to visit the Independence Palace/ the Reunification Palace. The palace is symbolic of the end of the Vietnam War during the Fall of Saigon on April 30, 1975, when the North Vietnamese Army tank number 843 crashed through the gates of what was at the time the residence of the President of the Republic of Vietnam.\n\nNext, you will admire the Museum of American War Crimes/ the War Remnants Museum is the most popular museum of Ho Chi Minh City. It gathers a collection of the machinery, weapons, photos, and documentation of Vietnam’s wars.\n\nAfter the Museum, you will see Notre Dame Cathedral and the Old Post Office are the two of the best highlights of old Saigon architecture, and are located next to each other and right in the heart of Ho Chi Minh City.\n\nAnd then, Jeep will take you visit some famous road in Saigon as Dong Khoi street, Nguyen Hue street. Jeep go ahead to visit to Ben Thanh Market, a lively market in District 1, where your guide can help you barter for goods. And then, Jeep go to Bui Vien street and go back your hotel.\n\nOvernight in Ho Chi Minh City"},{"title":"HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home"}]},{"name":"Mekong delta and Phu Quoc island 12 days 11 nights","duration":12,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2950,"summary":"Discover the incredible beauty of southern Vietnam. This exciting tour takes you from the dynamic city of Ho Chi Minh to the green meandering rivers of the Mekong Delta and the blissful beaches of Phu Quoc Island. This twelve-day trip allows you to discover the Mekong delta in all its glory, exploring the local cultures and winding waterways, before ending your odyssey with a relaxing stay on Phu Quoc Island.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28a7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e46583bc28b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e549d2270998.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e549d227099a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e549d227099b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e549d227099d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193997_5e549d227099e.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Chau Doc","Phu Quoc Island"],"timeline":[{"title":"Ho Chi Minh Arrival (D)","description":"Upon arrival in Ho Chi Minh City, you will be met and greeted by your tour guide and taken to your hotel for check-in. Later, your guide will collect you for dinner in a local restaurant. You will spend the first night in Ho Chi Minh City."},{"title":"Ho Chi Minh city - Can Tho (B/L/D)","description":"You will meet your guide at your hotel in Ho Chi Minh city and drive through the Mekong Delta to the town of Vinh Long. Upon arrival, you’ll take a boat trip to visit a brick & pottery factory, a bonsai garden or an orchard. You will enjoy some Southern traditional music performed by the local people and a sumptuous Delta lunch, including the popular dish of elephant ear fish. You will then drive to the heart of Mekong Delta: Can Tho where you will stay overnight."},{"title":"Ho Chi Minh - Can Tho (B/L/D)","description":"After breakfast at your hotel, you will take a boat trip to join in the Cai Rang Floating Market. Here, each boat usually sells one particular item, whether it be pumpkins, pineapples or sugar cane, and in order that the customer knows where to shop, they hang that item from the highest part of the boat. The afternoon is free, so you may enjoy the most comfortable property in the Mekong Delta, Resort Can Tho, where you will spend the night."},{"title":"Can Tho - Chau Doc (B/L/D)","description":"Today, you will leave Can Tho and head for Chau Doc. This amazing journey takes 4 hours and the town is situated right on the Bassac River, close to the Cambodian border. You will stop to visit Bang Lang Bird Sanctuary, a village famed for its incense production and a crocodile farm on the way. In the afternoon, you will take a sampan, cruising to visit the floating fish farm and the Cham weaving village. Next is a trip up the Sam Mountain for a great sunset and a birds-eye view over the rice paddy fields, looking our over Cambodia. You will spend the night at a Hotel in Chau Doc."},{"title":"Chau Doc - Ha Tien (B/L/D)","description":"You’ll have time to enjoy a buffet breakfast at the restaurant, looking out over the river, before departing for Ha Tien which sits very near to the Cambodian border. This bustling and remote town is popular with domestic tourists but is yet to be discovered as a destination for foreign tourists. This little-known yet beautiful area is perfect for those wanting an authentic Vietnamese experience away from the tourist-centric areas. You can visit Hon Chong, a pagoda hidden in the grottoes and enjoy the beautiful sunset on the beach, before retiring for the evening in Ha Tien."},{"title":"Ha Tien - Cap Ca Mau (B/L/D)","description":"After breakfast at the hotel, you will visit Thach Dong Cave near the Vietnam/Cambodia border, Mui Nai Beach and a local fishing village. You will certainly want to stop and view the verdant paddy fields, orchards and tranquil villages on the way to Ca Mau. The main attractions here are the nearby swamps and forests, which can be easily explored by boat. Bird-watchers and aspiring botanists will be enthralled with the area for its stork-sighting opportunities and swamp ecology. You’ll then have dinner and an overnight stay in Ca Mau."},{"title":"Ca Mau - Dat Mui (B/L/D)","description":"In the morning, you will take a speedboat from Ca Mau to Dat Mui. Here, you can take souvenir photos at the country’s southernmost tip, which can annually expand as much as 80 to 100 meters due to soil deposits left behind by the receding water. You can then visit other national landmarks, a miniature model village and the Mui Ca Mau forest stations, which provide views from as high as 20 meters. In the afternoon, you will take a speedboat back to Nam Can and visit the Phan Ngoc Hien monument, before dinner and an overnight stay in Ca Mau."},{"title":"Ca Mau - Rach Gia - Phu Quoc (B)","description":"Rising early to the sounds of the Delta stirring into action you leave behind the green, tropical waterways and head to Phu Quoc Island. You will spend the next 4 nights relaxing on the island and exploring the many sandy white beaches. You will be greeted at the Duong Dong Airport on the island and transferred to your resort where you can check- in. The rest of the day is free and you will be able to unwind overnight in Phu Quoc."},{"title":"Free time at the resort (B)","description":"You will have these days to explore the island and enjoy the resort at your leisure."},{"title":"Free time at the resort (B)","description":"You will have these days to explore the island and enjoy the resort at your leisure."},{"title":"Free time at the resort (B)","description":"You will have these days to explore the island and enjoy the resort at your leisure."},{"title":"Ho Chi Minh city Departure (B)","description":"After 4 nights full of sunshine, relaxation, and delicious food, this will be your last morning on Phu Quoc. You will have free time until being transferred to Phu Quoc Airport for your domestic flight to Ho Chi Minh city and your onward flight to your final destination."}]},{"name":"VNA011 - 12days Highlight of Vietnam","duration":12,"travelStyle":["Sightseeing","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":865,"summary":"Starts/Ends: Hanoi/ Ho Chi Minh or Vice Versa\nTour Duration: 12 days 11 nights\nDates: No fixed departure dates. You may go whenever you wish.\nTour Type: Landscape and Nature, Cruise Holidays, and Historical\nActivity Level: Regular itinerary, moderate walking\nTour Customizable: Absolutely! (Tell us your specific requirements in the inquiry form)","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/109674_1523cbc7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/109674_1523cbc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_729beb61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_eba1ab5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_7522c9da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_a118abb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_71ddfed9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_7a009b51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_0d6dcabd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_1b17cb9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_8b1411ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109674_c044e82a.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"Day 01: Fly to Hanoi","description":"Fly to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel. The rest of the day is at leisure. Overnight in Hanoi.\n3* Gondola Hotel: Sup Room  \n4*: Tirant hotel: Deluxe Room  \n5*: Melia Hotel: Deluxe Room"},{"title":"Day 02: Hanoi City Tour (B/L)","description":"After breakfast, our guide will pick you up at hotel at 8.00 and start sightseeing today includes explore Vietnams charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanois key sites: the Ho Chi Minh Complex (Ho Chi Minhs Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake and one of the citys museums (a choice between the History Museum and the Ethnology Museum or Hoa Lo prison). End the days explorations with a cyclo tour through the Old Quarter or enjoy a traditional water puppet show."},{"title":"Day 03: Hanoi - Halong Bay - Overnight on Cruise (B/L/D)","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 - 8.20AM and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Overnight on board. \n3* Swan Cruise: Deluxe Cabin\n4*: Calypso Cruise: Deluxe Cabin \n5*: Signature Roya Cruise: Senior Suite"},{"title":"Day 04: Halong Bay - Hanoi - Night Train to Hue (B/L)","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi for overnight train to Hue. Overnight in a shared 4-berth cabin with A/C.  Private cabin is available at your request\n\n"},{"title":"Day 05: Hue Sightseeing (L)","description":"Upon arrival at Hue station, you will be welcomed by our driver & tour guide. Then, transfer to hotel to leave your luggage there and start for city tour Hue. Breakfast is not included for this day!\nYou will board the Dragon Boat for a cruise on the romantic Perfume River heading out for the countryside. Being the ancient capital, Hue is surrounded with ancient tombs of emperors past, and a visit to the most beautiful tombs will be on the itinerary for today. The charming Lady Pagoda (Thien Mu Pagoda) will be the first stop of the day. You will enjoy a great view on the Perfume River and surrounding area. Thien Mu Pagoda is considered the symbol of Hue, and of Buddhism in Vietnam. From here you will rejoin your car and visit King Minh Mang’s Tomb OR King Tu Duc’s Tomb. Enjoy lunch at a local restaurant before continuing to visit Hue Citadel and Dong Ba Market. Overnight in Hue. \n3* Serene Palace Hotel: Junior Room \n4*: Romance hotel: Deluxe Room \n5*: Imperial Hotel: Deluxe Room "},{"title":"Day 06: Hue - Transfer to Hoi An (B)","description":"After check out hotel, take the scenic route to Hoi An from Hue via Hai Van pass, on the way, our driver will stop at Lang Co Beach, Marble Mountain if you wish to take some incredible photos. Upon arrival Hoi An, check in hotel. The rest day is free at leisure and overnight in Hoi An. \n3* Calla Villa: Deluxe Room  \n4*: Vinh Hung Riverside: Superior Garden \n5*: Silk Sense River Resort: Sup Garden"},{"title":"Day 07: Hoi An - Cycling to Tra Que (B/Light lunch)","description":"09.00AM, Cycling into the countryside to the small farming community of Tra Que Vegetable Village. Here you can enjoy the lush green countryside and see the farmers at work, later learn to make Vietnamese spring roll and free on foot massage by herbs. Enjoy a free afternoon back in Hoi An, it is time for you to explore art and handicraft galleries, try on clothes tailor-made, relax at the riverside restaurants or take the short journey to the nearby beach. Overnight in Hoi An"},{"title":"Day 08: Hoi An - My Son (B)","description":"My Son Sanctuary, situated around 50km away from Hoi An, is another Cultural Heritage site recognized by UNESCO in 1999 with 32 epitaphs and 71 monuments. The unique Hindu sanctuary is the perfectly ideal destination for those who want to learn everything about the Champa Ancient Kingdom including the history, culture, and architecture.\nThis morning (afternoon), you will set out on a drive to the southwest of Hoi An to My Son Sanctuary for a My Son half day tour. This is where the Cham culture in Central Vietnam started in the 4th century, declined in the 13th century, and ceased to exist in the 15th century. The once capital of the Champa Kingdom dedicated to the worship of the god Shiva is now a cluster of partially ruined and heavily damaged Hindu temples, with only 20 left, due to age and bombing during the Vietnam War. This unique and majestic sanctuary stands as a witness to a glorious bygone era of the once-thriving Cham culture"},{"title":"Day 09: Hoi An - Da Nang - Fly to Ho Chi Minh (B)","description":"Free at leisure until transfer to airport for flight to Ho Chi Minh. Upon arrival Ho Chi Minh, you will be welcomed by our tour guide/ driver and transfer to hotel for check in. Free & easy in your own way. \n3* Gk Central Hotel: Superior Room  \n4* Grand Silverland: Pre DLX Garden \n5* Majestic Hotel: Colonial Deluxe"},{"title":"Day 10: Ho Chi Minh - Cu Chi Tunnel (B)","description":"Breakfast at hotel, meet our guide at 7.30 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City.\nHave a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there. \nAfter that, taste the typical boiled tapioca and hot tea before you come back to Saigon."},{"title":"Day 11: Ho Chi Minh - Mekong Delta (B/L)","description":"After breakfast, 6.30Am our guide and driver will pick you up to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends at Cai Be, then get on bus return to Ho Chi Minh. Overnight in Ho Chi Minh City.\n"},{"title":"Day 12: Ho Chi Minh departure (B)","description":"The morning is at leisure before boarding your flights home/ next destination"}]},{"name":"Northwest Vietnam Family Vacation to Halong, Sapa, Mai Chau, Son La, Dien Bien","duration":10,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1190,"summary":"These remote mountains of Northwest Vietnam are home to some of South-East Asia’s most rugged terrain, stunning scenery and colourful hill tribes. This 10-day Highlights of Vietnam Family Tour to Halong, Mai Chau, Dien Bien, Sapa, Son La from Hanoi brings you an opportunity to discover almost amazing landscapes in the North-West of Vietnam with jungles, high mountains, deep valleys, homestay in villages, great foods and typical cultures, traditions of the hill tribes …","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130055_c13da0ee.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130055_c13da0ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_5348e3fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_75074c8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_f42d81ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_94d48b4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_5c75d701.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_c2858ff0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_a8fedaad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_bbab2e03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_09890106.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_b5385724.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_e62e9c4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130055_18568089.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Mai Chau","Sapa"],"timeline":[{"title":"Day 1: ARRIVAL – HANOI SIGHTSEEING TOURS","description":"Arrive in Hanoi, the capital of the unified Vietnam. The city was founded in 1010 on the right bank of the Red River and was then known as ‘Thang Long’, roughly translated as “Soaring Dragon.” Hanoi is one of the most charming cities in South East Asia with its authentic street scenes, large shady avenues, numerous lakes, manicured gardens and well-preserved architecture. Transfer from Noi Bai airport to the city for check in the hotel.\nIf time permits, you’ll join us on the city sightseeing highlights. The tour includes a visit to the complex of memorials to Ho Chi Minh (visit outside), the Single Pillar Pagoda, the Temple of Literature and a rickshaw ride through the lively Old Quarter.\n\nOvernight in Hanoi."},{"title":"Day 2: HANOI FAMILY TOURS TO HA LONG BAY – OVERNIGHT ON CRUISE","description":"Early breakfast to be ready for the trip which departs at 07:45 am from your hotel. Today, you’ll journey east to Vietnam’s greatest natural wonder, Halong Bay where you’ll spend a full day and night onboard the Royal Heritage Junk cruising the bay’s 3000 magnificent limestone islets. The detailed itinerary comes out as follows:\n\n12h00: Arrive Halong Bay.\n\n12h30: Boarding Royal Heritage Cruise for departure. Welcome drink will be served\n\n13h00: Lunch is served while cruising through the Bai Tu Long Bay.\n\n15h15: Visit splendid Surprising Cave (Sung Sot Cave). This is one of the most beautiful grottoes in Halong\n Bay. You will feel surprised about imposing stalagmites, stalactites and many legend stories about that. \n16h15: Time for kayaking around Luon Cave area. You will have got around 45 minutes to explore Halong bay and some tunnel by yourself.\n\n17h00: Back to Royal Heritage Cruise and drop anchor in the calm water surrounded by beautiful islets for swimming.\n17h30: Enjoy the complimentary sunset party on the sundeck with green tea and fresh fruits. \n\n19h00: Dinner is served in the restaurant. \n\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. \n\nRelax and spend a romantic night on our Cruise"},{"title":"DAY 3: HA LONG FAMILY TOURS TO NINH BINH","description":"06h30: Rise up early with Tai Chi exercises or a photo hunt \n\n07h30: Have breakfast at sunrise\n\n08h30: Continue your cruise to Titov Island \n\n09h15: Continue cruising and exploring the Bay by a visit to Hoa Cuong fishing Village, Ba Hang fishing village, Ga Choi Island, Dinh Huong islet and more….\n\n10h00: Join Vietnamese Cooking Demonstration\n\n10h30: Enjoying a traditional Vietnamese lunch while cruising back through Halong Bay to the pier.\n\n11h30: Disembarkation. Time to say goodbye to the crew.\n\n12h00: Transfer to Ninh Binh City, famous for the nearby Karst scenery, the village of Tam Coc, Hoa Lu Ancient Capital.\n\nOvernight in Ninh Binh."},{"title":"Day 4: NINH BINH SIGHTSEEING TOURS – ADVENTURE TOURS TO MAI CHAU – HOMESTAY","description":"In the morning, board a small sampan for a spectacular 2-hour cruise through numerous waterways and beautiful rural landscape of limestone cliffs and rice paddies in the stunning ecotourism Trang An passing an amazing system from 8 to 10 caves. Trang An is where the Skull movie was filmed. Upon the embarkation, transfer to Hoa Lu, the ancient capital to visit the famous historic temples of King Le and King Dinh who founded and ruled the early dynasties.\n\nContinue to Van Lam village for lunch in a local restaurant. Transfer to Maichau, the beautiful gateway to the mountainous area of northern Vietnam. The scenic drive offers an excellent opportunity to observe rural Vietnam up-close. The valley of Mai Chau is inhabited by a community of the Thai minority group while the upper lands of Mai Chau are inhabited by the H’mong minority group.\nOn arrival at Mai Hich village, take a short break. Unlike the other well-known tourist destinations, Mai Hich is the newly discovered village, a harmonial combination between human being and the nature.\n\nIn the late afternoon if time permits, experience an exciting bamboo rafting to be immersed in gorgeous landscapes of jungles, the peaceful beauty of the countryside culture OR just walk around while interacting with the locals to learn how they live in this beautiful part of the world.\n\nHomestay at the local family."},{"title":"Day 5: MAI CHAU SIGHTSEEING FAMILY TOURS TO SON LA","description":"Breakfast at the home-stay before we embark on a beautiful drive up north to Son La. The road is in good condition and the scenery is stunning. Stop at Xa Linh, the gateway to Moc Chau highland, to be a guest of the Black H’mong who inhabited in the highest points of the country. The trip also breaks with lots of other photo opportunities when you pass by the Black Thai villages, green tea plantations and so. Lunch is served on a local restaurant.\n\nWe reach Son La in the afternoon. Check in the hotel for refreshment followed by a walking orientation around to be a part of the area.\n\nOvernight at the hotel in Son La "},{"title":"Day 6: SON LA FAMILY TRIPS TO DIEN BIEN PHU – SIGHTSEEING TOURS","description":"Today the drive is greater with more winding roads, longer passes, more colorful minority groups and more stunning scenery. Like yesterday, have interesting stops to visit villages and take photos. Lunch is in a local\n\na restaurant  along the way. The highlight of today ride could be the impressive pass of Pha Din, the longest pass in Vietnam  is approximately up to 32 km .Climbing and descending the slopes with their many bends and deep gorges is a really an unforgettable experience. We reach Dien Bien Phu in the afternoon. We go around to explore the town.\n\nOvernight in Dien Bien Phu (Hotel)"},{"title":"Day 7: DIEN BIEN PHU SIGHTSEEING TOURS TO TAM DUONG","description":"After breakfast we will drive along stunning gorges and Nam Na River. On the way we will have interesting stops to visit H’mong and Dzao villages. Lunch in Lai Chau. We would reach Tam Duong in late afternoon.\n\nOvernight in Tam Duong Town in hotel"},{"title":"Day 8: TAM DUONG FAMILY TOURS TO SAPA","description":"The drive today is the highlight of the whole trip. Climbing the highest pass in Vietnam, the Tram Ton Pas, 2.000- metter above sea level. Lunch in a local restaurant. We will reach Sapa in the noon time. Sapa is the former hill station for the French colonists hundred years ago. Today, Sapa is not only known as a home of many ethnicities, but also a paradise for trekking, its beautiful trekking routes, stunning terraces and the highest mountain in Indochina, the Mt. Fansipang. \nOvernight in Sapa\nNote: The weekend market (Sunday market) in Tam Duong is very interesting with lots of colorful ethnic minorities. If this day is Sunday the market will be included in the program and we would reach Sapa around 3pm."},{"title":"Day 9: SAPA EASY TREKKING TOURS TO VILLAGES – NIGHT TRAIN TO HANOI","description":"Breakfast in the hotel. We will drive downhill to Muong Hoa valley. Today we enjoy the most beautiful trek route in Vietnam. We will trek on dirt path through pine forest, terraces go to Lao chai, Ta Van village, stop to visit minority Hmong, Zay in villages, schools and have picnic lunch by river. In the afternoon we walk to the pick-up to meet the car, transfer back to Sapa. Free at leisure then transfer to Lao Cai for the night train back to Hanoi. Overnight on the train"},{"title":"Day 10: ARRIVAL IN HANOI – DEPARTURE","description":"Arrival in Hanoi early in the morning. Free until transfer you to the airport for your flight home. Trips end!"}]}]