[{"name":"8 Days Best Vietnam North to South Tour, Max 6 Guests","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":1699,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\nHighlights:\nStarting from a city tour Hanoi, our 8-day best Vietnam tour also features a cruise on Halong Bay with charming natural scenery and the monuments in Hoi An, Hue, and Saigon.  Besides, getting close to the lifestyle in Mekong Delta will leave you a lifetime experience. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b0ff.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b0ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b106.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b107.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b109.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b10a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198048_5e97f6e93b10c.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Arrival in Hanoi","description":"Upon your arrival at NoiBai International Airport, your guide will greet you on time at the airport exit. A private van will transfer you to the carefully selected hotel in downtown Hanoi. Our guide will escort you to explore the most-visited sightseeing spots: the Opera House, Old Quarter, Hoan Kiem Lake and Ngoc Son Temple in the afternoon. A traditional Water Puppet Show is waiting for your attendance next. The day concludes with a welcome dinner at one of the nicest restaurants in Hanoi.\n\nMeals: Dinner\nAccommodation: Hanoi La Siesta Hotel & Spa (4 Stars)  or similar "},{"title":"Hanoi - Halong","description":"We will begin the day with a visit to the solemn Ho Chi Minh Complex (including the Ho Chi Minh Mausoleum and stilt house) and the One Pillar Pagoda in the west of Ba Dihn Square. (One thing to note is that Ho Chi Minh's Mausoleum is closed every Monday and Friday & annual maintenance: Jul-Aug). Our guide will then take you to visit the Temple of Literature and the Fine Arts Museum. After having lunch, we will drive through the Red River Delta for about 3 hours to Halong city, which is 150 kilometers away. Stay overnight at your hotel in Halong.\nMeals: Breakfast, Lunch\nAccommodation: Novotel Ha Long Bay (4 stars) or similar "},{"title":"Halong Bay Cruise - Hanoi - Da Nang - Hoi An","description":"After having breakfast at the hotel, you will be guided to take a 4-hour cruise on Halong Bay to admire the charming natural scenery. En route, you will visit Dau Go Cave and Thien Cung Cave. Lunch is served on board. Afterwards, we will transfer you directly to Hanoi airport for your flight to Da Nang. An excellent local guide will wait for you at the airport. We will drive for about 50 minutes to the hotel in Hoi An.\nMeals: Breakfast, Lunch\nAccommodation: Little Beach A Boutique Hotel & Spa (4 stars) or similar"},{"title":"Hoi An (Walking Tour & Boat trip)","description":"Our guide will accompany you to walk around the matrix of twisting turning streets to visit the Chua Ong Pagoda, the Chinese Assembly Hall, the 200-year old Tan Ky ancestral house and the famous Japanese Bridge. After having a leisurely lunch, you will take a short boat trip to a nearby island village to be impressed by its handicraft ceramics. We will get back to the hotel in the late afternoon. Evening is free for you to relax on your own.\nMeals: Breakfast, Lunch\nAccommodation: Little Beach A Boutique Hotel & Spa (4 stars) or similar"},{"title":"Hoi An - Da Nang - Hue","description":"We will leave Hoi An for Hue this morning. En route, you will get stunning views of mountain scenery via the Hai Van Pass, which lies between Da Nang and Hui. It is also the dividing line between North and South Vietnam. Arrival in Hue, you will start a walking tour to the Imperial City (The Citadel), Hue Royal Palace, the Mausoleum of Tu Duc & Thien Mu Pagoda. Conclude your day at the bustling Dong Ba Market.\nMeals: Breakfast\nAccommodation: Moonlight Hotel (4 stars) or similar "},{"title":"Hue - Saigon (Ho Chi Minh City)","description":"After having breakfast, you will be escorted to PhuBai Airport to take your flight to Saigon. Our local guide will greet you at the airport and escort you to the hotel for two nights stay. Lunch is served at a decent restaurant. The afternoon is scheduled for a visit to the War Remnant Museum, the Reunification Palace, the neo-Romanesque Notre Dame Cathedral and the City's Centre Post Office. The last stop today is the Ben Thanh Market.\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar "},{"title":"Saigon - Ben Tre - Saigon","description":"Today you will spend a day away from the busy city and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong River. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where your car will take you to Saigon.\nMeals: Breakfast, Lunch\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar "},{"title":"Departure from Saigon","description":"Our guide and driver will escort you to the airport and see you off based on your outbound flight information. We bid you adieu!\n\nMeals: Breakfast\n\n"}]},{"name":"Vietnam Family Holiday - 15 days","duration":15,"travelStyle":["Discovery","Multi-sport","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1480,"summary":"A special Vietnam family tour to give a real experience of and insight into the life of Vietnamese people in the cities as well as in the rural areas. The tour highlights include hands-on practice in handicraft making, a night in the untouched Ha Long Bay aboard a wooden junk, exploring the ancient town and its surroundings on bike, and exploring the old charms of Saigon as well as the liveliness of this developing metropolis.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153719_d59e9efc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153719_d59e9efc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_a71caa04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_fbf08eb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_b8993d26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_68d09117.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_fdd4a8f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_ad38b450.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_6f6175e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_b157167e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_4b4f85a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_8eb3311c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_3d9edb07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_4e557c61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_48294eff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_c5974a51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_ba633d81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_e3ddc61b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_214fdd1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153719_fe5fc437.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you\n Meals: n/a. Accommodation: Hotel in Hanoi."},{"title":"DAY 2: HANOI - HALF DAY CITY TOUR & STREET FOOD","description":"Free in the morning.\nIn the afternoon, half day tour to visit Hanoi. We start with visit to President Ho Chi Minh's mausoleum (Outside). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university.\nBack to the Old Quarter, we will start street food walking tour.\n\nYour expert English-speaking local guide will give you an insight into the intricacies and traditions of Vietnamese food culture including details on ingredients and historical backgrounds of popular northern dishes. We eat as we go, trying seasonal fruits and sampling a tasty French-inspired snack from a street cart.\nWalking through the maze of bustling streets that make up Hanoi’s Old Quarter, we tempt our tastebuds with the famed Hanoi dish Banh Cuon at a local eatery. Watch in awe as the skilled chefs demonstrate for you how this tasty dish is put together. Continuing into the atmospheric heart of the Old Quarter, we wander past street stalls and quiet residential lanes where you can observe local life that has changed little since Hanoi was founded over 1000 years ago. \nOur next two snack stops are at outdoor barbeque stalls. We sit down with the Hanoi locals and sample various meat, vegetable and bread specialties that are flame grilled over hot coals for extra flavour. It’s then time for dessert as we venture down a small alley to join in the local tradition of feasting on fresh fruit served in a cup and smothered with crushed iced and condensed milk – this speciality is one not to be missed!\nYour local guide will then take you to one of Hanoi’s best kept secrets, a hidden street food restaurant to taste top ten street foods in Hanoi is Banh My Hanoi, Vietnamese Rice Wine and famous Egg Coffee. This hard-to-find café is one of the few left in the narrow street inside the old quarter of Hanoi. Or, if coffee is not your style, a cold beer awaits!. At the end of the trip you are free to continue exploring the area or your guide will assist you back to your hotel.\n Meals: Breakfast/Dinner. Accommodation: Sleep at the hotel in Hanoi"},{"title":"DAY 3: HANOI - FREE DAY","description":"Free and easy day for shopping and exploring Hanoi city.\n Meals: Breakfast. Accommodation: Sleep at the hotel in Hanoi."},{"title":"DAY 4: HANOI - HALONG BAY CRUISE","description":"07:45 – 08:15 : Pick up at your hotel near by the Old Quarter in Hanoi by shuttle bus\n12:30 – 12:30 : Embark the cruise at Tuan Chau harbor. Enjoy welcome drink, cruise briefing & start cruising.\n13:00 – 15:30 : A stunning lunch is served while cruising into the Halong Bay with thousands of extraordinary shaped limestone islands considered as the heaven on the earth\n15:30 – 17:00 : Explore the area and be charmed by the outstanding masterpiece of the Mother Nature. Visit Mê Cung Cave – one of the most beautiful caves in Halong Bay. Climb up & see the panoramic view of the bay from above. Enjoy swimming in the crystal water of the peaceful Bay. \n17:00 – 19:00 : Return to the cruise the Sunset party and admire the best moment of the day when the sun starts to set. Or enjoy the massage treatment in your comfortable cabin. \n19:00 : Savor an amazing and dreamlike dinner in Fairy cave (or Drum cave) with extremely delicious food which is not only impressed by its incredible taste, but also by great fruit and vegetable carving performance. Socialize with new friends and crew members, enjoy squid fishing or leisurely relax on the top deck in the middle of the tranquil bay. Overnight on Cruise.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner. Accommodation: Sleep on board"},{"title":"DAY 5: HALONG BAY FULL DAY KAYAKING ADVENTURE","description":"06.30 – 07.00 : Start your new day with a Tai Chi session or a photo hunt for the glamour sunrise in Halong Bay in the early morning.\n07.00 – 08.00 : Have breakfast in the peaceful bay while listening to the bird songs.\n08:00 – 10:00 : Transfer to a high quality day boat for a cruise to Thien Canh Son Cave, visit the cave to learn about the karst formation. Enjoy hiking to see the panorama view of the Bay from the cave’s entrance. \n10:00 – 12:00 : Start to down for a beautiful white-sand beach at the foot of Hon Co Island. Go kayaking though the isolated and off-the-beaten-track appeal of the Bay. Enjoy swimming in the blue water or leisurely lying down under the tropical sunshine for sunbathing.\n12:30 – 14:00 : Back to the boat for lunch. \n14:00 – 14:00 : More time for kayaking through the hidden lagoons and explore the biological diversity of the Bay. \n16:30 – 19:00 : Return to the cruise refreshing and stretching your selves on the top deck. Join in the Sunset party and see the beautiful pinky clouds reflecting on the water surface. Or enjoy the massage treatment in your comfortable cabin. \n19:00 : Savor our delicious dinner with incredible traditional Vietnamese food and amazing vegetable carving performance, while being well introduced the philosophies that lie behind each type of cuisine. Socialize with new friends and crew members, enjoy squid fishing or leisurely relax on the top deck in the middle of the tranquil bay.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch. Accommodation: Sleep on board"},{"title":"DAY 6: HALONG BAY - HANOI","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive the hotel at late afternoon. Free for personal activities.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner. Accommodation: Sleep on board."},{"title":"DAY 7: HANOI - HOIAN - HALF DAY CITY TOUR","description":"In the morning, free for personal activities.\n\nAfter lunch, airport transfer for flight to Hoian. Upon arrival, half day city tour to visit Hoian ancient town. We will visit a historic house, the Japanese Covered Bridge, a Chinese assembly hall.\n\nHoian was originally a Cham port town, but has been influenced down the centuries by a myriad of traders from various cultures. There is a distinctly Chinese appearance with pagodas and assembly halls scattered along the small streets. Hoian was once a bustling port in centuries gone by, before the river silted up. Coupled with low tiled houses, the town is one of the most delightful places to visit in Vietnam.\n Meals: Breakfast.  Accommodation: Sleep at the hotel in Hoian.\n"},{"title":"DAY 8: HOIAN - FREE DAY","description":"Free and easy day to relax, go shopping in Hoian\n Meals: Breakfast. Accommodation: Sleep at the hotel in Hoian."},{"title":"DAY 9: HOIAN - HALF DAY CYCLING TOUR","description":"Free in the morning.\n\n13:00: pickup at the hotel to start the cycling tour. This circuit begins with an hour boat ride on the Thu Bon river delta to arrive at Duy Vinh Island.\nFrom here, you will leave on cycle to discover the authentic Vietnam.\nYou will visit artisans, where you can see wooden boat still being made according to century-old tradition. During this tour, you will learn secret of making the colorful Vietnamese woven straw sleeping mats. You will observe the workers in the rice fields. And explore the sumptuous landscapes and meet wonderful people..\n Meals: Breakfast. Accommodation: Sleep at the hotel in Hoian."},{"title":"DAY 10: HOIAN - FREE DAY","description":"Free and easy day to relax, go shopping in Hoian.\n Meals: Breakfast. Accommodation: Sleep at the hotel in Hoian."},{"title":"DAY 11: HOIAN - SAIGON","description":"Free in the morning for personal activities till airport transfer for afternoon flight to Saigon.\nUpon arrival, half day city tour to visit Saigon. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\n Meals: Breakfast. Accommodation: Sleep at the hotel in Saigon."},{"title":"DAY 12: SAIGON MEKONG CRUISE","description":"8:00: Pickup at the hotel in Saigon to Can Tho or Cai Be. You board your comfortable wooden Mekong Eyes cruise vessel around noon. After a refreshing welcome drink we show you our on-board facilities and your cosy cabin. As lunch is served, the Mekong Eyes Cruise starts cruising. Sit back and watch the fantastic scenery and the daily life of the Mekong people.\nIn the afternoon you can disembark for a guided leisurely stroll through a village and the surrounding fruit orchards or rice fields. Meet the friendly locals and taste the local produce and fruits.\nGet back on board and enjoy a drink at the bar or relax on deck as the sun sets over the magnificent water landscape of the Mekong river. The Mekong Eyes Cruise will anchor for the night. The day ends with a delicious on-board dinner. You stay overnight on board your floating hotel in the Mekong Delta.\n Meals: Breakfast/Lunch/Dinner. Accommodation: Sleep on board"},{"title":"DAY 13: MEKONG - SAIGON","description":"Wake up well rested to the sound of the river and get ready for another exciting day of sightseeing in the Mekong Delta. At 6.30h the Mekong Eyes cruise vessel sets off for a sunrise cruise. Watch the locals go about their daily work drying exotic fruits and building ships on the wooden yards while enjoying an early breakfast.\nAfter breakfast, we will board a sampan boat to Cai Be or Cai Rang floating market, the region’s busiest and most lively markets. Marvel at the sheer abundance of exotic fruits, vegetables and skilfully handcrafted regional products. We will pull up to the boats for talking and bargaining with the merchants. We will also visit some of the local candy and cake making factories or boat through the green water landscape to see local houses, verdant orchards and ship-building yards.\n Meals: Breakfast. Accommodation: Sleep at the hotel in Saigon."},{"title":"DAY 14: SAIGON FREE DAY","description":"Free and easy for personal activities and shopping in Saigon.\n Meals: Breakfast. Accommodation: Sleep at the hotel in Saigon."},{"title":"DAY 15: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast. Accommodation: N/A"}]},{"name":"Simply Vietnam","duration":10,"travelStyle":["Discovery","Group","Fully Guided","Coach / Bus","Sightseeing","Holiday"],"oldPrice":0,"price":1250,"summary":"This short break encompasses the best of Vietnam in just 10 days. Using local transport and staying in simple hotels, we experience lush landscapes, discover harrowing history and sample incredible fresh food.   Hanoi - Wander through the bustling narrow streets of the Old Quarter.  Hoi An - Take a cookery course or try out traditional lantern making.  Mekong Delta - Meander along palm-lined canals and barter for exotic fruit. ","highlights":["Explore the bustling back alleys of old Saigon","Navigate the Mekong Delta by bike and boat","Fall in love with the grand temple complex of Angkor","Learn the art of cooking traditional Vietnamese cuisine"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124818_15e2207a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124818_15e2207a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_46019f90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_88b70261.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_4daf6fba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_50cccc5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_f196213d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_ade19a8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_aa8e3951.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_48247c9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_4acbc30f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_d141a980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_9e8baa50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_de9f8479.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_17382c0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_ee4a65de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_4052deb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_7aa52c6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_b424780a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_00e7d634.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_7d3d8d41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_1bcce593.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_341a3b7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_a2979e30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124818_41d6d5c1.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: Join trip in Ho Chi Minh City; afternoon orientation walk in Old Saigon","description":"Still commonly referred to by locals as 'Saigon', the city is the largest in Vietnam and the country's commercial hub. You will find an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit.\n \n For those arriving on time today our Leader plans to meet you in the hotel reception at 4pm for the welcome meeting and to take us on the walking tour.  The tour will take in some of the central sights of the city, including the Opera House (formerly South Vietnam National Assembly), Hotel de Ville, Notre Dame Cathedral and the impressive French style edifice that is the GPO building.\n \n If you would like to receive a complimentary airport transfer today, you will need to arrive into Tan Son Nhat International Airport (SGN), which is 30 to 40 minutes\\  from the hotel.\n \n Please note that if you wish to join the afternoon orientation walk today, you must arrive at the hotel by 1.30pm. If you are booking your own flights, we recommend giving yourself at least 30 minutes\\  to clear the airport. From the airport to the hotel is around 30 minutes\\  drive, so therefore the latest your flight can arrive is 1pm. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk.Start point\n Good Vibes Boutique Hotel, Hotel reception, 4A Thi Sách, Bến Nghé, Quận 1, Hồ Chí Minh 700000, Vietnam 14:00"},{"title":"Day 2: In Ho Chi Minh City; Optional visit to the Cu Chi Tunnels or a boat trip in the Mekong Delta","description":"No visit to Ho Chi Minh City would be complete without exploring something of its tragic recent history and the poignant reminders of what the Vietnamese refer to as the American War can still be seen amongst the buildings and artefacts of the old US Embassy, as well as the remarkable Reunification Palace and the emotive War Crimes Museum, which contains a fascinating, and at times chilling, reminder of the cost of the Vietnam War on the people themselves. Another option is to join an excursion out to the infamous Cu Chi Tunnels. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops and were a major part of the Tet Offensive. This area was the centre of intense fighting during the war, much of it falling prey to the incessant carpet bombing, napalm and defoliants utilised by the Americans in an attempt to dislodge the Viet Cong from their underground shelters. There is little evidence of any of that now and the landscape has returned to something of its pre-war beauty, but exploring the tunnels of Ben Dinh and Ben Binh gives some idea as to the conditions that the Vietnamese and their American adversaries had to endure. Be warned, the tunnels are low and narrow and can be claustrophobic. \n A full day's visit to the colourful Mekong Delta can also be organised, to witness locals barter for fresh produce at a floating market and to take a sampan through the small narrow waterways of the Delta."},{"title":"Day 3: Morning flight to Danang, drive to Hoi An and afternoon tour of the Old Town","description":"This morning we transfer to the airport for our short flight to Danang in Central Vietnam. On arrival in Danang we will continue our journey by charter bus to Hoi An. On our way we pass the popular beach resort of My Khe, better known as China Beach, an area that during the Vietnam War was popular with the American GIs on RnR. Given the early hour of our arrival at the hotel we might not be able to check-in so we plan to store our bags, have breakfast (not included) then embark on a walking tour of Hoi An. First colonized by the Portuguese in the 16th century, by the 17th and 18th centuries Hoi An had become one of the busiest international trading posts in southeast Asia and, even today, it still retains the engaging charm of a medieval port, with many of its old buildings superbly preserved. Highlights include the Phuc Kien Assembly Hall, a pagoda dedicated to the worship of Buddha originally built by the Vietnamese people in the 16th century and the 400 year old Japanese covered bridge. We end at the colourful riverside market, a perfect setting for exploring, the rest of the day is free to enjoy as you wish."},{"title":"Day 4: In Hoi An, free day to enjoy the Old Town, visit nearby beach or hire bicycles to explore surrounding countryside","description":"Today is free to wander through the historic heart of this World Heritage Site at your leisure. An early morning visit to the fish market presents a riot of noise and colour that is perfect for some great photo opportunities and some choice local interaction. You might also like to pay a visit to the Japanese Bridge, Hoi An's emblematic symbol, believed to have been constructed to quell the violent rumblings of a restless monster, or perhaps explore the traditional wooden houses and Chinese temples that line the streets. There are numerous tailors shops in Hoi An providing an incredibly cheap and quick service and almost all visitors have at least one item made before they depart. Hoi An is also a great place to hire a bicycle as the roads are relatively quiet. There's a good beach just a few kilometres from the town or alternatively why not set out to explore nearby villages. Cooking classes are yet another option available in this popular traveller's hangout."},{"title":"Day 5: Drive along the coast via Hai Van Pass to Hue; free afternoon","description":"This morning sees us heading along the coastal road towards the historic setting of Hué, crossing part of the Truong Son Mountains and travelling via the Hai Van (Sea Cloud) Pass. This stunningly scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and the journey should get us into the old imperial city around lunchtime, after which the rest of the day is free for personal exploration. Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hué is divided by the waters of the Perfume River, which separate the city's 19th century citadel from the suburbs that radiate from the eastern shore and, even today, its easy air of leisurely ambience makes it one of the most engaging cities in the country to explore."},{"title":"Day 6: In Hue, optional visit to the Imperial Palace and cruise along Perfume River. Catch an overnight train north","description":"With the better part of the day to enjoy the city, Hué offers a wealth of options to make the most of your time here. You could pay a visit to the iconic Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hué. Dedicated to the Manushi- Buddha, the existing temple was constructed in the middle years of the 19th century, under the auspices of the Emperor Thieu Tri, and within its confines you can find a number of superb Buddhist statues, as well as an enormous cast bell that weighs in at over 2000kg and is reputed to be audible over 10km away. Another alternative is to spend some time exploring the Old Citadel that dominates the left bank of the Perfumed River. Built by the Nguyen dynasty (Vietnam's ruling emperors from the early 1800s to1945), the Citadel has formal moats and impressive ramparts that were constructed to be an exact copy of the Forbidden City in Beijing. During the bloody conflicts of the Vietnam War, Hué was the site of some of the most destructive fighting of the Tet Offensive, most of the Inner City being totally destroyed during the month-long battle in 1968. The vast outer walls and the West Wing remain though and provide an eloquent reminder of the palace's former glory. Farther afield, amongst the forested landscapes of the Perfume Valley, you can find the Royal Tombs of the Nguyen kings, the unique mausoleums of the emperors that provide an ideal destination to explore by bicycle. Later this afternoon we will then head for the railway station to board the overnight train north to Hanoi, Vietnam's vibrant and historic capital."},{"title":"Day 7: Early morning arrival in Hanoi; drive to Halong Bay to cruise through the turquoise waters aboard a traditional junk boat","description":"Arriving in Hanoi in the early hours of this morning we disembark the train and transfer by road towards the Bay of Tonkin on Vietnam's northeast coast. Our destination is the breathtaking setting of Halong Bay one of Vietnam's, and indeed Southeast Asia's, most spectacular natural attractions, whose staggering beauty has seen it listed as one of the eight natural wonders of the world. A UNESCO World Heritage site, Halong Bay presents a quite extraordinary vista of hundreds of limestone islands (over 1600 at last count) that rise from the jade green waters of the bay like the scales of some great submerged dragon. Indeed Halong means 'where the dragon descends to the sea' and local legends tells of a time when this rugged landscape was created by the pounding tail of a mighty dragon as he ran from the mountains into the glittering waters of the bay below. On arrival we will board our junk and set sail, threading our way through a flotilla of boats, junks and wooden sampans as they ply their way across the gentle waters of the bay. The plan for today is to sail through this stunning seascape, stopping off to swim and visit some of the limestone caverns that pepper the landscape. Later this evening we disembark from our boat and transfer to our hotel in the Bay."},{"title":"Day 8: Return to Hanoi; orientation walk of Old Quarter","description":"Returning back to Hanoi your tour leader will then take those that wish on a short orientation tour of the city, wandering the streets of the city's Old Quarter, whose narrow streets are named after the various crafts and specialities of the city's artisans: Paper Street, Silk Street, Basket Street etc. This practice dates back to the 13th century, when the city's original 36 guilds established themselves here, adopting a street each to differentiate them from their neighbours. The maze of alleys and streets present a fascinating venue to explore on foot and the area is known for its interesting 'tube' houses, where the narrow frontages give way to long rooms that stretch back from streets, whose pavements are littered with food sellers tempting passers-by with all manner of noodles, snacks and stir-fried delights from shoulder panniers. Later today there may be a chance to witness a remarkable performance of traditional water puppetry, a practice that dates back to the 15th century and is deeply ingrained into the cultural lives of the peoples of the Red River Delta. Set on a flooded stage, the stories tell tales of legendary heroes and everyday life, with dragons and unicorns sharing the stage with ducks and frogs, and even fireworks and naval battles."},{"title":"Day 9: In Hanoi; free day with option to visit the French Quarter or Hoan Kiem Lake","description":"Architecturally styled like a French provincial town, with tree-lined boulevards and substantial low-built houses, Hanoi is a wonderfully nostalgic city to enjoy and amongst its more interesting sights are the charming One-Pillar Pagoda, the Temple of Literature and the Presidential Palace. Ho Chi Minh was a spartan-living and scholarly man, who chose not to live in the Presidential Palace itself, but instead preferred a simple teak 2-storied stilt-house specially built for him in the grounds. You can visit his museum and this austere mausoleum, said to resemble that of Lenin in Moscow, or perhaps taking another walk through the engaging streets of its Old Quarter. The city's French Quarter is a great place to explore by bicycle, its grandiose colonial architecture offering up a rich contrast to the more frenetic pace of the old city, whilst those looking to discover something more of the colonial wars might like to pay a visit to the Museum of Vietnamese Revolution or the Military History Museum."},{"title":"Day 10: Trip ends in Hanoi","description":"The trip ends after breakfast at our hotel in Hanoi.\n \n There are no activities planned today, so you are free to depart from Hanoi at any time. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you'll need to depart from Noi Bai International Airport (HAN), which is 45 minutes from the hotel.\n \n If you have time, you may wish to take another wander through the fascinating Old Quarter or stroll along the shore of Hoan Kiem Lake.End point\n Flower Hotel, Hotel reception, 55 Nguyễn Trường Tộ, Nguyễn Trung Trực, Ba Đình Nguyễn Trung Trực Ba Đình Hà Nội, Вьетнам, Nguyễn Trung Trực, Ba Đình, Hà Nội, Vietnam 09:00"}]},{"name":"Vietnamese Culinary Journey","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1487,"summary":"The founder of modern marketing Philip Kotler once said that “kitchen of the world” is a suitable image for Vietnam, with her bounty of good dishes. Diferent from other part of the world, Vietnamese food contains elements of the fine arts, science and the balance of the yin – yang. Let’s embark on our culinary journey and learn more about its’ taste. ","highlights":["Visit the imperial city of Hue and relax on a cruise of peaceful Perfume River","Stroll through riverside streets of Hoi An under the moonlight and lantern lights","Savor the great complex of flavors and contrasting textures of Vietnamese food"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132341_5614b6ce.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132341_5614b6ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_7311fbcb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_1a90ca43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_e4e5acd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_5440d672.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_322ffa74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_35d51224.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_b76e33c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_4097482d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_d7ec3b61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_7ec05cb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_40126c6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_8ed44c7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_06fd6820.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_e6eee73d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_eb71b422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_156aa31b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_509bef4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_08d6c390.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_f5f72bc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_fbdbe5f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_69349d4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_24fc8394.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132341_cda6609c.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL - CITY TOUR (-/-/-)","description":"Welcome to Vietnam!\nOur local tour guide will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to the centre of Hanoi to check-in hotel. It’s then your own time to relax after a long haul flight. \nIn the afternoon, we will have an overall view of the capital by a “cyclo” visit, which will start around the Old Quarter of Hanoi, stop at Ngoc Son Temple located on the Hoan Kiem Lake (the “Sword” Lake), and at Quan Thanh Taoist Temple. \nLate afternoon we will enjoy a unique fascinating show of Water Puppetry, a traditional stage art of Northern Vietnam.\nDinner is at your own arrangmetn for flexibility.  \nOvernight in Hanoi. \nPlease note:\n-\tHotel check in time is from 14.00"},{"title":"DAY 2: DUONG LAM VILLAGE - STREET FOOD TOUR WITH FOOD BLOGGER (B/L/-)","description":"Breakfast at hotel. \nToday, we will take time to visit Duong Lam Ancient village - about 65 km from Hanoi with about 1,200 historical years. The village is well-known for its surviving laterite brick houses, built three to four centuries ago. Visit Mia Pagoda (built in 15th century) and admire 287 statues of all sizes. Then take a walk on the village path to visit Mong Phu Temple (dedicated to national heroes) King Ngo Quyen Temple and King Phung Hung Temple. Visit the ancient houses producing local specialties, such as soft green-lentil cake and rice cake filled with brown onion (depending on the season), especiall learn about procedure of making \"Tuong\" - a salty paste made from fermented soybeans, which is popular in vegetarian meals, particularly those prepared and eaten by Vietnamese Buddhist monks.  \nLunch with local family in local style.\nTransfer back to your hotel in Hanoi. \nStep off the beaten track and go through the maze of Hanoi to seek real authentic food with food blogger, which, just by the look, can make your mouth water.\n•\tHanoi food tour will be uncompleted without slurping a bowl of Pho noodle soup, which is considered as Vietnam's unofficial national dish. \n•\tOn the way in old quarter, you will see many hawkers who sell fresh fruits. You will have time to take picture and taste some.\n•\tFollow Obama President's trip to eat Bun Cha (Grilled pork on rice noodle).\n•\tOur street food today end at a hidden café - one of Hanoi's best kept secrets and have a cup of egg coffee. Or if coffee is not your style, a cold beer await. \nBack your hotel. \nDinner is at your own arrangment for flexibility.  \nOvernight in Hanoi."},{"title":"HANOI - HALONG BAY/ LAN HA BAY - COOKING CLASS (B/L/D)","description":"If you wish to see how the Hanoi people rise and shine in the morning, wake up early and run to a lake close by your hotel, you can join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi quan, jogging, martial arts, classical dance and so on. \nAfter breakfast at the hotel, we will head to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006, and check-in our overnight boat. Enjoy a trip on Halong with stops to visit caves or to swim and enjoy the sunset on the sea. \nThis is the perfect time for you to enjoy a cocktail or two as the sun sets over the karst landscape. Foodies can partake in Vietnamese cooking demonstration before dinner, and guaranteed to whet the appetiteDinner with fresh seafood. \nOvernight onboard."},{"title":"HALONG BAY/ LAN HA BAY - HANOI - FLIGHT TO HUE (B/Br/-)","description":"Suggested flight: VN1545 HANHUI 18:00 19:10\nMorning wake up with a taichi-quan or yoga exercises guided by the crew before having breakfast whilst your boat goes on between Halong islets. Return to the Wharf to be back to Noi Bai Airport by bus at midday.  \nUpon arrival at the airport, welcomed by the local tour guide and transfer to the city center. \nBrunch on board. \nDinner is at your own arrangment for flexibility.  \nOvernight in Hue."},{"title":"DAY 5: HUE CITY TOUR - ROYAL DINNER (B/-/D)","description":"Being recognized by UNESCO as the 1st Cultural World Heritage for Vietnam, Hue is highlighted by the old royal architectural works and the most traditional Vietnamese lifestyle. We will discover the charm of the city from the Royal Citadel, Forbidden City, Hue Royal Museum and Dong Ba bustling market. \nLunch is at your own arrangement for flexibility. \nAfternoon, go on to Thien Mu pagoda and visit the Tombs of King Minh Mang – the best-reserved monuments of the Nguyen Emperors since early 19th and early 20th centuries.\nHave a Royal Dinner at Ancient Hue Restaurant - a typical entertainment under the Nguyen Dynasty will be re-created vividly at Ancient Hue restaurant. With this service, guests will have the chance to experience authentic cuisines of Hue’s royalty. Guests will come into an ancient environment with ancient costumes, Royal music and performances while enjoying the Royal dishes carefully prepared to the finest detail for a sumptuous dinner that is fit for royalty.\nOvernight in Hue."},{"title":"DAY 6: HUE - TAM GIANG LAGOON - HUE (B/L/-)","description":"Breakfast at hotel.  Transfer to the pier, take a boat to discover Tam Giang Lagoon, the most wonderful lagoon in Vietnam. Get experience daily life of local people, fishermen and enjoy spectacular view in Tam Giang Lagoon, relax and experience fresh air, peaceful atmosphere here. \nVisit Thai Duong Ha Village, being an accident fishing village that has hundreds of years in history. Then continue with fish market which is busy all day long. At the market, travelers will experience bustling life of fishermen and traders. From Tam Giang Lagoon, all types of fish, shrimps, crabs… will be brought to other markets in the whole areas around Hue province in Vietnam. Continue to visit Rú Chá-  a tiny islet (rú) on the Tam Giang Lagoon. Originally, Rú Chá was a mangrove forest before local people encroached on the land for farming, leaving the emerging part of the forest a 5ha islet. Lunch at local family in the very local Vietnamese style. \nDinner is at your own arrangment for flexibility.  \nOvernight in Hue. "},{"title":"DAY 7: HUE - HOI AN ANCIENT TOWN - HOI AN (B/-/-)","description":"Breakfast at hotel, on the way from Hue to Hoi An via the magnificent “Ocean Cloudy” Pass today, we can stop to visit the Lang Co Beach and Marble Mt., and contemplate wonderful seascape from the mountaintop halfway thru the Pass. Arrive at our hotel in Hoi An.\nIn the afternoon, together with our guide in Hoian, we’ll walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, visit ancient houses and Trading Houses, pagodas and stroll into the market located by Thu Bon river, where we may find out the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. \nLunch & Dinner is at your own arrangment for flexibility.  \nOvernight in Hoi An."},{"title":"DAY 8: HOI AN - TRA QUE VILLAGE - COOKING CLASS – SAIGON (B/L/-)","description":"Breakfast at hotel. Depart from your hotel and ride bicycle in 30 minutes to Tra Que herb village. Take a short stroll around the vegetable garden and listen to the history of the village. Then join gardening activities in preparing the land, fertilizing with seaweed, raking the ground, sowing, watering, picking vegetables... Enjoy foot soak before getting to preparing lunch with a local family. Join cooking with ‘Tam Huu’ spring roll, ‘Banh xeo’ - a local pancake of people in Viet Nam middle region ... After your morning excursions and lunch, you learn how to harvest and wrap the vegetables.\nLunch at local family with local style.\nBid farewell to your host family before heading straight to the airport for your onwards flight to Saigon.  \nUpon arrival, our local tour guide will be welcoming you at the airport; transfer to Saigon Centre to check-in hotel.\nDinner is at your own arrangment for flexibility. \nOvernight in Saigon."},{"title":"DAY 9: SAIGON CITY TOUR - DINNING IN THE DARK (B/-/D)","description":"Breakfast at hotel. We will visit War Crime Museum, telling the story of war from the Vietnamese perspective and exhibiting photographs, machinery, and weapons that depict the harsh realities of war. Continue Thien Hau Temple, one of the most important pagodas in the city, this richly decorated temple is dedicated to Thien Hau, the Goddess of the Sea and patron of sailors. She is said to travel over the oceans on a mat and ride the clouds to wherever she desires. Then move to China town, settled in the late 18th century, this labyrinthine section of Ho Chi Minh City bustles with restaurants, temples, exotic stores, and markets and cross Binh Tay market, the main marketplace in China Town, where a great deal of wholesale trading occurs. Experience the commotion of this integral part of the city's daily business (Till Binh Tay Market finish it’s renovation, alternative market will be advised on spot).\nLunch is on your own arrangement for more flexibility before starting our city tour in the afternoon. Our first stop will be Reunification Palace, the witness of the fierce Vietnam War ended in 1975. The grand building today is a Museum and Hall of official receptions. Nearby the Palace are the colonial-styled Post Office and the Notre Dame Cathedral, built between 1877 and 1883 and one of the city’s major landmarks.  \nDinning in the dark at The Noir  , it is more than just a meal. It is a sensory journey that will make you re-eveluate your perception of taste and smell. Be one of the first or try this one-of-a-kind dinning experience for a unique date or group outing Saigon. \nOvernight in Saigon. "},{"title":"DAY 10: SAIGON - CU CHI TUNNEL - AT LEISURE (B/-/-)","description":"After breakfast, head out of Saigon to visit Cu Chi Tunnels, 70 km northwest of Ho Chi Minh City. This network of tunnels, which stretched for over 200km, is one of the most famous and historical aspects of the Viet Nam War. Upon arrival, watch a short introductory documentary before follow our guide into the winding, underground network to explore the war memorial park. Discover the Cu Chi site, which includes weapon and booby-trap exhibitions, visit different underground bunkers featuring kitchens, meeting rooms, ammunition depots and hospitals… View authentic relics from the war such as camouflaged tunnel entrances and a bullet-riddled tank… \nHere, we have a chances to taste with salt boiled cassava beans – foods common in Cu Chi tunnels. Cassava and tapioca is boiled in Hoang Cam stove flues with underground pipes.\nAfter sightseeing, return to the city centre. At leisure in the rest of the day. \nLunch & Dinner is at your own arrangment for flexibility. \nOvernight in Saigon. "},{"title":"DAY 11: SAIGON - MEKONG DELTA – CAN THO (B/-/-)","description":"As we should reach the floating market in Cai Be as early as possible today, try your best to start in Ho Chi Minh at 07.00am and travel southwest for nearly 3 hours, passing the Mekong Delta, which makes Vietnam the 2ndWorld Rice Exporter, and reach Vinh Long province which is famous for tropical fruits in the Mekong Delta. Upon arrival at Cai Be, board our boat along the market to enjoy trading activities of the peasants of the Mekong Delta, who travel to the market in the boats full of fruits and farming products. Visit family factories and orchards and taste some juicy tropical fruits. Lunch in a charming old-styled house or in a garden house on an island between visits. \nContinue, we will have a small cooking setion with a local cake named “Bánh lá mít” – Smile of Mekong. It is a simple cake made from flour and wrapped in jackfruit leaves.\nLunch & Dinner is at your own arrangment for flexibility. \nOvernight in Can Tho. "},{"title":"DAY 12: MEKONG DELTA - SAIGON - DEPARTURE (B/-/-)","description":"Start from Ninh Kieu boat quay, where we cruise along the small and picturesque canels and stop to see the Cai Rang floating market (the nicest one with heaps of rowing boats). We stop to enjoy the beautiful scenery and the daily activities of the locals who lives along the Mekong canals. Walking through the village to visit a rice husking mill and a rice/noodle shop, where we observe how it is made. Then transfer to Tan Son Nhat airport for departure flight.\nLunch & Dinner is at your own arrangment for flexibility. \nEnd of services!\nPlease note!\n-\tHotel check out time is by 12.00"}]},{"name":"15 Days Majestic Vietnam - Heritage lines","duration":15,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":829,"summary":"Route: Hanoi → Halong Bay → Sapa → Hoi An → Hue → Ho Chi Minh → Cu Chi → Mekong Delta\n\nVietnam is a beautiful country in South East Asia. Lets travel with Vietnam Allure Travel to completely.  have unique experience from North Vietnam to South Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d76.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197636_5e8772b7c3d8b.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Hue","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi / Arrival","description":"Arrival in Hanoi. We welcome you at airport and transfer you to hotel. Rest of the day is your leisure time to explore the city on your own.\n\nOvernight at hotel (Meal: No)"},{"title":"Hanoi → Halong Bay","description":"07.45 – 08.15 approx\n– Our guide will meet you at your hotel. The shuttle bus pick up\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n– Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n– Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is served\n– Join us for a typical local lunch in the dining room or at the outdoor dining area.\n\nAfternoon\n– Arrive at Surprising Cave, explore the cave and find out how the cave was named a Surprising.\n– Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n– Heading back toward the sleeping area\n\nEarly evening\n– Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n– An authentic Vietnamese menu is served\n– After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…\n\nStay overnight on board. (Meals: B – L – D)"},{"title":"Halong Bay → Hanoi","description":"06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\nBreakfast is served\n\n08:00\n– Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n– Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n\n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00 \n\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nReturn at hotel around 16.30 pm. Recheck in at hotel. \n\nStay overnight at hotel in Hanoi (Meals: B- L)"},{"title":"Hanoi→ Sapa – Short trekking Cat Cat village","description":"At 7.00am, be picked up at your hotel and  transferred by bus to Sapa. Arriving Sapa around lunchtime, you’ll check in to your hotel.\n\nIn the afternoon, visit Cat Cat village (light trekking required), where you may wish to try the local apple wine or purchase a hand-woven blanket, and Sapa town.\n\nFree and easy in the evening time.\n\nOvernight at hotel in Sapa. (Meals: B- L- D)"},{"title":"Trekking Lao Chai village – Ta Van village → Back Hanoi","description":"After breakfast, start a 5 hour trek to visit Lao Chai – Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. Visit Sapa’s ancient rock formations with engraved images big and small, the unique patterns of the ancients, as well as admire the picturesque bridge to the clouds clear over the Muong Hoa stream.\nLunch at restaurant in the middle of village\nReturn to hotel in Sapa around 14.00pm.\n15.00 Good bye Sapa. You will be picked up at hotel and taken a bus journey to Hanoi.\nArrive at Hanoi around 21.30 pm, check in at hotel again.\nOvernight at hotel in Hanoi. Meals (B- L)."},{"title":"Hanoi → Fly Hoi An","description":"After breakfast at hotel, the rest of the day is spent at your leisure until our driver come and transfer you to airport.\n\nTake a 1- hour- flight to Danang. Be picked up airport and transferred to Hoian by private car.\n\nArrive Hoi An and check in. The rest of the day is spent at your leisure, discovering the beauty of  Hoi An.\n\nOvernight at hotel in Hoian (Meals: B)"},{"title":"Hoi An – My Son Sanctuary","description":"Have breakfast at hotel.\n\n08:00 Our guide picks you up at your hotel and depart to My Son Sanctuary – The World Cultural Heritage. \n\n09:00 Arriving in My Son – the Holly land surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. We will have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the traditional performances of Champa People.\n\n11:00: Get back to bus and move to a local house to learn how to make rice-paper, you will enjoy your own hand-making product later on.\n\n11:30: Back to the bus and have lunch at another local house, relax with cold herbal tea,  nice foods and fresh air.\n\n12:30: Take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of Vietnam named as Thu Bon River.\n\n13:30: Arrive at Hoi An, we will drop you at your hotel.\n\nOvernight at hotel in Hoi An (Meals: B-L)"},{"title":"Hoi An Free and Relaxing","description":"Spend this day to free relaxing. Do shopping, clothes tailor made and exploring the town, try delicious food and coffee.\n\nOvernight at hotel in Hoi An. ( Meals: B)"},{"title":"Hoi An → Coach to Hue (The Ancient Imperial)","description":"Our driver will pick you from Hotel to Hoi An by bus. it takes you around 4 hours, then, check in Hotel. Rest of the day is your leisure time.\n\nOvernight at hotel in Hue city. ( Meals: B)"},{"title":"Hue | city tour","description":"Pick up you at your hotel at around 8:00 and then take a full day to discover Hue:\nvisit Emperor Minh Mang Mausoleum and Emperor Khai Dinh Mausoleum. Stop on the way to see how conical hats and incense sticks are made. Lunch at a local restaurant.\n\nIn the afternoon, visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank. Return by boat on the gentle Perfume River\nTour will end 16:00. You will be transferred to your hotel by taxi.\n\nOvernight at hotel in Hue. (Meals: B-L)"},{"title":"Hue → Fly Ho Chi Minh City","description":"Enjoy breakfast at hotel. then wait for our driver transport to Hue airport.\n\nYou will  take flight to Ho Chi Minh city (formly Saigon). Arrive in Ho Chi Minh and check in hotel.\n\nThe rest of the day is spent at your leisure, discovering the most active city in Vietnam.\n\nOvernight at hotel in Ho Chi Minh city (Meals: B)"},{"title":"Mekong Delta","description":"07:30 – 7.50am: Our tour guide and driver will pick you up at your hotel and then start tour. Enjoy the scenic journey along the National Highway bordered by green rice fields.\n\nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank.\n\nProceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by locals.\n\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village.\n\nMeet the bus and return to HCMC.\n\nOvernight at hotel in HCMC (Meals: B-L)"},{"title":"Cu Chi tunnels","description":"Do a trip to the Cu Chi Tunnels. A fascinating network of underground tunnels used as supply routes, hideouts and living quarters by guerrilla fighters during the Vietnam War. We’ll arrive back to Ho Chi Minh City.\n\nStay overnight in hotel in Ho Chi Minh  city ( Meals included: B – L)"},{"title":"Ho Chi Minh city Free and Easy","description":"Spend your free time for shopping and sight seeing.\nOptional:  Ho Chi Minh city tour… (on request)\nOvernight at hotel (Meals: B)"},{"title":"Ho Chi Minh Departure | Tour Ends","description":"Say goodbye Vietnam. Trip ends. You can either check out and take an international flight home, stay on longer in Vietnam or continue your travels in other destinations in Asia.\n\n"}]}]