[{"name":"Amazing Vietnam Family Vacation - 14 Days","duration":14,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1150,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the Sightseeing tour Amazing Vietnam Family Vacation - 14 Days, you have a 14 days tour package taking you through Hanoi, Vietnam and 6 other destinations in Vietnam. Amazing Vietnam Family Vacation - 14 Days includes accommodation in a hotel as well as flights, an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197923_5e93da565bdf0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197923_5e93da565bdf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197923_5e9425ff7a408.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197923_5e9425ff7a40a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197923_5e9425ff7a40c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197923_5e9425ff7a40e.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Ha Noi Arrival","description":"We'll pick you up from the airport and take you to the Hotel in Hanoi. You'll then have plenty of time to recover from your flight, chill out and free time for your own plan."},{"title":"Ha Noi Street food tour (B/L) – Water puppet show","description":"In Hanoi the food is plentiful, it’s everywhere that you look and is an integral part of the livelihoods of many locals. More often than not, the street is the stage where much of what is food related in Hanoi takes place.\nHighlights:\nSample delicious Vietnamese cuisine just like the locals do - on the street Stroll through hidden alleyways and bustling markets of Hanoi’s charming old quarter Learn more about Hanoi’s unique food culture Try local specialties with influences from French and Chinese cuisine Take in a spectacular night view of Hoan Kiem lake from a secret cafe Fascinating cyclo tour to discover the 36 ancient Streets of Hanoi Old Quarter with its ancient buildings and temples, transparent lakes and old cultural features.\nInclusions: English speaking tour guide, all street food items as per itinerary ( 6 to 8 different street food vendors stops with 10 tastings ). Drink include : 01 bottle of water, a cup of local frest beer, rice wine, egg coffee and local dessert .\nExclusions: All other drinks, extra food portions, tips for local guide\nSchedule details:Duration: 03 hours by Walking ( 2,5 Km )\nAfter street food tour, you will have free time to see Hanoi old quarter then take the water puppet show. \n\n"},{"title":"Explore Bai Tu Long Bay – Thien Canh Sơn – Cap La (B/L/D)","description":"•  07h30: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n•  10h00: Stopover on the way for a refreshment break.\n•  12h00: Embark at Ha Long wharf – Break and photography time\n•  12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n•  13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n•  15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n•  19h00: Vietnamese style set dinner is served on board.\n•  21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat.\n"},{"title":"Vung Vieng floating village by Bamboo boat (B/L) - Flight to Da Nang","description":"•  07h30: Have breakfast and enjoy sunrise on the bay.\n•  09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n•  10h30: Have lunch while cruising back through Ha Long Bay to the pier\n•  11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n•  12h00: Return from Ha Long to Hanoi.\n•  14h00: Stopover on the way for a refreshment break.\n•  16h00: Arrive in Hanoi. End of the trip.\n"},{"title":"Ba Na Hill - Golden Bridge (B/L)","description":"07:30 am – 08:00 am: Our Minivan and a tour guide pick you up at hotel lobby. Reach Ba Na Hills via Cable Car \t\nSpend your time on the most modern Cable Car in Southeast Asia, then take The Climbing Train to visit the top of the mountain& further explore Le Jardin D’Amour (consists of 9 gardens), Debay Wine Cellar (old wineries) & Ling Ung Pagoda \nContinue  the 2nd Cable Car to visit  the French Village (enjoy Street Music, watch Art’s statue), Campanile, Nine Floor Goddess Shrine, Tombstone Temple, Linh Phong Monastery, Linh Chua LinhTu Temple & Tru Vu Tea Shop\nWatch Carnival Performance Show, Square Du Dome...\nChallenge the most popular adventure ride - Slide of Tube Car (free ride), \nLunch at Restaurant (Buffet) \nJoin in Fantasy Park with Walking in Fairy Forest, discover Dinosaur Park, play 5D wild west, enjoy 4D death race ride, watch 3D mega 360 degree, ride on Journey into the underground, enter Jurassic Park, challenge Freefall Tower and participate in adventure in Horror House and over 90 free games.\n15:00: return the Cable Car for leaving Ba Na Hills\nHighlight: Unique and unique design, unprecedented in Vietnam. The Golden bridge is built at a height of more than 1400 meters above sea level. With total length of about 150 meters, with 8 spans, the largest is 21.2 meters. The bridge is made of 3 meters wide, 5 cm thick wood, along the aisles are planted a lot of flowers Queen Green, above the railing is made of stainless steel gilt. \n16:45 – 18:00: Our Minivan brings you back to your hotel. Tour ends.\n"},{"title":"Cam Thanh Eco Water Coconut Village (B/L)","description":"09:00: Our guide pick up at your hotel lobby and transfer to Cam Thanh fishing village.\n09:30: Tranfer to Cam Thanh village by car or boat on the way, meet local fishermen and experience the daily life\n10:00 Take a bamboo basket boat on the Cam Thanh water coconut forest, have a brief introduction to the history there.\n11:00 Join local fisherman on the river and enjoy hands-on experience of round net and cast net fishing.\n+ Learn to paddle the unique Vietnamese bamboo basket boat and join in a basket boat race.\n+ Explore the now peaceful coconut waterways of a past war.\n+ Go catch the crabs, coconut mussel.\n+ Make funny tools from coconut leaf.\n+ Return fisherman house and welcome drink.\n+ Enjoy Luch \n13:00: Return to the hotel\n"},{"title":"Hoi An (B) - Da Nang - Flight to Nha Trang","description":"Breakfast at hotel, free time for your own leisure then transfer to airport for flight to Nha Trang.\nFree & Easy in Nha Trang"},{"title":"Nha Trang Free & Easy (B)","description":"Breakfast at hotel, free & easy in Nha Trang beach sides. "},{"title":"Nha Trang (B) - Flight to Ho Chi Minh","description":"Breakfast at hotel, free time for your own leisure then transfer to airport for flight to Ho Chi Minh.\nTransfer to hotel for check in. Overnight stay at hotel"},{"title":"Ho Chi Minh (B) - Bus to Mui Ne","description":"Breakfast at hotel, free time for your own leisure then transfer to Mui Ne by local bus. \nFree in Mui Ne\n\n\n\n\n"},{"title":"Mui Ne Sunset Sand Dunes Jeep Tour (B)","description":"1:30PM Driver will pick you up at your hotel/ resort by private jeep.\n\n2:00PM Visiting Fairy stream (Suoi Tien) where the small stream running through the middle of the red sand dunes. It is like a mini version of Red Canyon\n\n2:40PM Visiting Mui Ne fishing village, observing the daily lives of fishermen, catch is hauled to shore and fishing boats are lining up\n\n3:30PM Visiting White sand dunes. At the top of the sand dune, catching the first sunrise of the day. Other activities can be taken: riding quad bike over the white sand dunes and ostrich riding (at own expense), sliding down sand dunes’ slopes with sand boarding\n\n5:15PM Continue with your jeep to visit Red sand dunes, slopes are less steep than the White sand dunes, but great opportunity for taking photo as red colour of the sand is great contrast to background scenery and observing the spectacular sunset over the red sand dunes\n\n5:45PM After seeing the sunset at the red dunes, jeep bring you back to your hotel/resort. Tour end."},{"title":"Mui Ne (B) - Bus to Ho Chi Minh - Shopping time","description":"Breakfast at hotel, free time for your own leisure then transfer to Ho Chi Minh by bus. Then free time for shopping in Ho Chi Minh. Overnight stay at hotel"},{"title":"Ho Chi Minh City Tour - Cu Chi Tunnels (B/L)","description":"AM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum.\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon.\n"},{"title":"Departure (B)","description":"Today free time before transferring to airport. Tour ends!"}]},{"name":"The best of Vietnam tour 12 days","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1620,"summary":"Best of Vietnam 12 days tour is designed with the thorough filtration of highlight in Vietnam. Not too long, but this tour is enough for you to immerse to explore the Vietnam culture and get an unforgettable trip. With a variety of activities such as hiking, farming, cycling, cyclo, rowing,... a lot of clients were impressed by this tour.\n\n  Taste a lot of Vietnam delicious foods which are famous in the world\n  Immerse yourself in the ancient beauty of Hanoi Old Quater and Hoian Old Town\n  Visit one of the UNESCO World Heritage Site - Halong Bay\n  Explore the Vietnam culture by visiting historical construction in Hue\n  Have a chance to join a part of Vietnamese farmer in Farming and fishing tour at Hoian\n  Discover one of the secrets on generalship in the Vietnam war via the Cu Chi tunnel tour.\n  Free 01 welcome dinner on the first day\n  Free 01 sim card /group\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0dbb9c2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0dbb9c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0dd6f0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0dde1f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0de696e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0dee458.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0e0279d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/190894_5e143c0e138a2.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi arrival – Welcome Dinner (--)","description":"Welcome up on arrival by Go Vietnam Travel‘s guide and driver, then we transfer to the hotel.\nRelax in the rest of the day in town."},{"title":"Hanoi City Tour Full Day (B, L)","description":"In the morning:\nToday we will venture out to explore Hanoi. First up we will drive to the Ho Chi Minh complex where we will spend time at Ho Chi Minh’s mausoleum, his former stilt-house, the Presidential Palace, the Ho Chi Minh Museum and One Pillar Pagoda. Followings we visit the Temple of Literature, which originally built as a temple to Confucius.\nIn the afternoon:\nAfter lunch, we visit the Museum of Ethnology, which is widely acknowledged as the best in the country and has an extensive display dedicated to Vietnam’s 54 Ethnic minority peoples and the infamous Hoa Lo Prison Museum. Hoa Lo is also known as the ‘’Hanoi Hilton’’ and was where former US presidential candidate John McCain was incarcerated for over 5 years.\nLater this afternoon, enjoy 1-hour cyclo tour of the French inspired “old quarter”. We will be free for shopping in the old quarter ranges from markets through to designer boutique stores to amazing contemporary art galleries. After that, sit down to enjoy a performance of the city’s famous Water Puppets."},{"title":"Halong Bay, overnight on boat (B, L, D)","description":"08:00 – 08:30 Pick-up at hotel and start 3 hour-and-a-half drive to Halong International Cruise Port, check in Oriental Sails JSC’s private waiting hall – The OS Lounge.\n\n12:15 – 12:45 Embark on Oriental Sails by transfer boat. Listen to cruise briefing and receive room key.\n\n13:00 – 15:30 Savor a delectable lunch as Oriental Sails cruises further along the limestone islands of Bai Tu Long Bay, heading to Vung Vieng fishing village – one of the largest fishing villages in Halong Bay to see the life of local fishermen.\n\n– Option 1: Take a bamboo rowing boat trip around Vung Vieng Fishing Village\n\n– Option 2: Take kayak and go kayaking by yourself with help and instruction of tour guide around the Village.\n\n17:30 – 18:00 Return to Oriental Sails and have bath then relax as the sun starts to set.  Enjoy the Happy Hour at the bar and on the sun deck while cooking demonstration is organizing.\n\n19:00 – 19:30 Dinner is served. Socialize with other guests, night squid fishing or just laze around. Singing and dancing activities are available till 22h00.\n\n– Overnight on board at Cong Do Area"},{"title":"Halong Bay – Hanoi – Overnight in Hanoi (B, L)","description":"06:30 – 07:00 Start your day with Tai Chi exercise on the sundeck.\n07:00 – 09:00 Catch morning view of seascapes with a cup of tea or coffee, have breakfast while cruising toward Thien Canh Son Cave. Visit Thien Canh Son Cave – the medium size and less visited cave in Bai Tu Long Bay\n09:30 Check-out room. Luggage can be delivered to the reception area.\n09:30 – 11:00 Head back to the Harbor. Have early lunch on board. Disembark Oriental Sails at around 12h00.\n12:00 – 16:30 Transfer back to Hanoi and trip finishes at the hotel around 16h30"},{"title":"Hanoi – fly to Hue (B)","description":"Time will be free until our car arrives to take us to the airport to board the noon flight in Hue. On arrival, we will be met and driven to our hotel. We have free time in Hue.\n\nOvernight in Hue.\n\n"},{"title":"Hue River Cruise & Royal Tombs (B, L)","description":"In the morning:\nPick up at hotel at 8:30 AM, we will board the Dragon Boat on the romantic Perfume River heading out for the countryside. Being the ancient capital, Hue is surrounded with ancient tombs of emperors past, and a visit to the most beautiful tombs will be on the itinerary for today. The charming Lady Pagoda (Thien Mu Pagoda) will be the first stop of the day. We will enjoy a great view on the Perfume River and surrounding area. Thien Mu Pagoda is considered the symbol of Hue, and of Buddhism in Vietnam. From here, rejoin our van and go visit King Khai Dinh’s Tomb and King Tu Duc’s Tomb.\nIn the afternoon:\nWe visit the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945, after exploring the ruins of this wonderful monument. Then depart to the Hue Royal Fine Art Museum, which is housed within the former Dien Long An Royal Palace. We will finish our day with the local Dong Ba Market to see the daily life of local people.\n\nOvernight in Hue.\n"},{"title":"Hue – Danang – Hoi An – Afternoon walking tour (B, L)","description":"Today, we transfer from Hue to Hoi An via Danang. On the way, we visit the Marble Mountain – the five elements of the Universe (water, wood, air, fire and earth).\n\nArrival Hoi An, check in hotel. In the afternoon, meet up by local tour guide then we walk down to the downtown for our walking tour. We will start our walking tour around the ancient town to visit the Japanese Covered Bridge, the Pottery Museum, Tan Ky old house, the Cantonese congregation, the silk street of Hoi An, the temples and pagodas of Chinese appearance. Then back to our hotel.\n\nOvernight in Hoi An.\n"},{"title":"Hoi An Eco Tour – Afternoon free (B, L)","description":"Tra Que Village & farming , fishing:\nWe have an early start this morning as we head off to our Farming & Fishing Life Eco Tour. Starting at Tra Que Village, we will get a personal insight into the local farming communities. Set about joining the farmers in preparing their land for sowing, helping to fertilize the garden using seaweed from the local river and watering it in using huge tin cans strapped to our backs. Following this,  begin our leisurely cycling tour through the countryside witnessing local Vietnamese rural life first hand.\nBoat trip in coconut palm:\nLate morning we will board our Hoi An Eco-tour boat for a river cruise. Here meet and witness local fishermen working their craft, before enjoying a hands-on experience of traditional net fishing. Then transfer to a Vietnamese bamboo basket boat for a quick race and ride down a coconut palm lined waterway. Lunch today, is on board our boat, which is prepared using vegetables picked earlier at Tra Que Village.\nAfter lunch, we have some free time to wander around Hoi An town centre before heading back to the hotel. Overnight in Hoi An."},{"title":"Hoi An – Danang – Morning fly to Saigon – Cu Chi (B, L)","description":"Transfer to the airport:\nTime will be free until our guide pick up you and transfer to airport, then we take the flight to Saigon.\n\nCu Chi Tunnel:\nArrival Saigon, we have lunch and have afternoon tour to Cu Chi Tunnel. Cu Chi Tunnels is 50 km far from the city center. It’s located in Cu Chi district, Ho Chi Minh city. These are an immense network of connecting underground tunnels that were the location of military campaigns during American wars. This area is now a “should-not-be-missed” site for all visitors traveling to Vietnam. We will watch a short introduction video showing the foundation, activities… of Cu Chi tunnels and people lived here in the past then we will crawl all the safe parts of the tunnel system; enjoy some special cassava and tea  that served free in the tour.\nLater, we can go to the shooting range where we can try to fire real bullets: (costs US$3/bullet) or free for shopping at the souvenir shops.\n\nBack to Ho Chi Minh City and have free time in Ho Chi Minh."},{"title":"Ho Chi Minh City (B, L)","description":"This morning:\nWe visit all the highlights in Ho Chi Minh city such as the Reunification Palace, a palace of old President in South of Vietnam during the American war; the War Remnants Museum where is   poignant display of the futility of war; Notre Dame Cathedral and Old Post Office, the two sites that we can’t ignore when we visit the city.\nAfter lunch:\nTravel to the district 5 to visit Cho Lon (China town) and FITO Museum – the first and the most interesting museum on Vietnam traditional medicine. Then head back to the center to do shopping at famous Ben Thanh market, this bustling and well-organized market is very popular with tourists, primarily due to its central location. It has a wide selection of goods ranging from fake Nike shoes to beautiful silk Ao Dai.\n\nOur free evening activities should be: walking around at the night market in Ben Thanh market area; explore the highest building in Saigon, Bitexco…. Overnight in Saigon."},{"title":"Ho Chi Minh City – Mekong Delta – Cai Be - Vinh Long (B, L)","description":"Vinh Long market:\nPick up at hotel after breakfast, we transfer to Vinh Long. The program will start with a visit of Vinh Long market in the town. This is the best choice for us to take pictures of fish, shrimps, prawns, crabs, snakes, rice-field rats, tropical fruits, vegetable…\nAfter that, we will travel by boat to visit the brick kilns where we can see how the local people create beautiful potteries from clay. Then, come to visit the orchard & traditional house. We will enjoy some kinds of fruits and tea when listening to the traditional music at Ut Trinh home.\n\nMekong Delta:\nThe rowing boat takes us deeper into the countryside on smaller canals so we can enjoy the peaceful time. It is so interesting to see traditional houses made of wood and palm tree leaves and see some activities of the local farmers with an opportunity to make contacts with them and see how they catch fish or pick up fruits by ancestral ways in Mekong Delta..\nOne more thing to do in this trip is biking! It will be so amazing to bike on village paths to see the local farms, houses, bridge, real life… The cruise transfers us back to Vinhlong city where we take our own vehicle back to Ho Chi Minh City.\n\n"},{"title":"Ho Chi Minh City Departure (B)","description":"Time will be free until our car arrives at the hotel to take us to the airport in good time to board our departure flight. Trip ends.\n\n"}]},{"name":"Inspiring Vietnam in 14 Days","duration":14,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2490,"summary":"Let’s make a wonderful journey to cover the highlights of the country of hospitality attitude, rich cuisine and beautiful sightseeing. Set forth the tour with roaming freely around the heart of Vietnam history and culture – Hanoi. Then, go ahead to an off-beat Sapa to immerse the feeling of climate of four seasons in one day. After 2 days to explore the local, get back in a return night train before the further steps to charming destinations including World Heritage Site – Ha Long bay, and its “inland alternative”- Hoa Lu, Tam Coc, the city of lanterns – Hoi An Ancient town, elegant Hue city and vibrant Ho Chi Minh City. Your thirteen-day trip ends with the excursion in the amazing Mekong delta upon floating markets, sampan rides and fruit plantation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c700.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c700.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb2902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb2907.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb2909.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb290b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb290d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb290e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e3bf9afb2910.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c70e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c70f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c711.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c712.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c713.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191900_5e4faffb7c714.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"WELCOME TO VIETNAM – HANOI ARRIVAL","description":"Your trip begins with the arrival in Vietnam. Our driver will meet and greet you at the airport. You will be escorted to the hotel by private transportation. Check-in to the hotel and get over the jet lag. After enjoying the first day yourself and return to the hotel for a relaxing sleep."},{"title":"HANOI LEISURE DAY (B)","description":"Today you have free time to explore the city at your own pace.\n\nOvernight in Hanoi"},{"title":"HANOI – MAI HICH (B/D)","description":"Leave Hanoi at 8am and travel towards Mai Hich, Mai Chau. The peaceful town of Mai Hich is situated in a stunningly beautiful valley surrounded by verdant green mountains and is famed for its breathtaking scenery and friendly hill tribe peoples. Enjoying the tranquility of the paddy fields and interacting with the local people. Limestone peaks climb in the background and banks of green line the road, and you’ll take regular stops to admire the view across the lush valleys. Upon arrival in Mai Hich, you will meet and greeted by the village hosts at the local homestay.\n\nIn the afternoon, walking or cycling to discover the surrounding villages, and enjoy the beauty of surrounding nature, there's also the opportunity to help local farmers plant rice seeds into the fields. Or you can sample the rice wine produced in this region.\n\nOvernight in Mai Hich"},{"title":"MAI HICH LEISURE DAY (B/L/D)","description":"You start the easy hike along the Xia River and the primeval forests to Ban Buoc. Along the way, you will pass through Den, Ngo, Xum, Thai and Muong villages where a variety of minority groups with their own unique culture and languages are living. Return to Mai Hich by a pleasant bamboo raft ride along the Xia river crossing rice fields of corn and rice, observation of the daily life of local people. Back at the homestay, relax with a cold drink while watching the sun set over the peaceful mountains.\n\nOvernight in Mai Hich"},{"title":"MAI HICH – NINH BINH (B)","description":"Today is dedicated to exploring the villages and scenic countryside of provincial Vietnam. The journey from Mai Chau to Ninh Binh is fairly easy and leisurely-paced. You'll have plenty of opportunities to take some photos of the surrounding valleys, sugarcane farms and rice paddies that compose the landscape. Final stop for the day is the small town of Ninh Binh. The Ninh Binh province is famed for its spectacular limestone karst scenery, lush rice paddies and gently flowing waterways. Then you take a nice sampan ride in Van Long which will take you through the picturesque landscapes of the tormented mountains, planted in the middle of the rice fields.\n\nOvernight in Ninh Binh"},{"title":"NINH BINH – HALONG (B)","description":"Back on board our private car, enjoy some easier travel on the drive to Halong Bay – home for the next two nights. Factoring in some stop-offs along the way, the journey will take approximately 4 hours. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes.\n\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat.\n\nOvernight on cruise"},{"title":"HALONG BAY – HANOI – OVERNIGHT TRAIN TO HUE (B)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites or at the floating village. From here, you will sail back to the main harbor and return to Hanoi to take the night train to Hue.\n\nOvernight on train"},{"title":"HUE CITY TOUR (B)","description":"In the morning you will arrive in Hue. Your guide and driver will meet you at the station and you will start your Hue exploration.\n\nStart your trip with the exploring Imperial Citadel, the residence of the Nguyen Dynasty, which was Vietnam’s last royal dynasty. There you will visit The Royal Antiques Museum, one of the first museums in Vietnam. Many collections of ancient Hue and Royal antiques are displayed here: bronze wares, china, music instruments, royal attires and personal belongings of the Emperor family of Nguyen Dynasty. Then continue to Dong Ba market – the best place for cultural gifts and souvenirs.\n\nHave lunch at a local restaurant. In the afternoon you will visit the Emperors Tombs such as Emperor Khai Dinh (1885-1925) Tomb, famous for its beauty and unique architecture style, and Emperor Minh Mang (1791-1841) Tomb. On the way back to Hue you will have a stopover at the Conical Hat village to see how famous Vietnamese traditional hats Non-La are produced, and the Incense stick making village to observe how locals make sandalwood and cinnamon incenses. Then head back to your hotel in Hue.\n\nOvernight in Hue"},{"title":"HUE TRANSFER TO HOI AN (B)","description":"Have breakfast at the hotel and get ready for your transfer to Hoi An by private vehicle via magnificent Hai Van Pass. Also known as “The Cloudy Pass” this winding mountain road overlooks lush countryside, sandy beaches and the blue waters of the East Sea.\n\nUpon arrival in Hoi An, you will be transferred to your hotel. Rest of the day is at your leisure. \n\nOvernight in Hoi An"},{"title":"HOI AN LEISURE DAY (B)","description":"Today you will have free time explore Hoi An at your own pace, seeing what interests you. This ancient town is full of Japanese merchant houses and pagodas, temples and antique warehouses. Or just lounge about in a laid-back riverside café on the bank of the Thu Bon River.\n\nOvernight in Hoi An"},{"title":"HOI AN – HO CHI MINH CITY – CITY TOUR H/D (B)","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Hoi An to Ho Chi Minh City. Approximately flight time is one hour and 30 minutes. Upon your arrival, you will be transferred from the airport to your hotel in Ho Chi Minh City’s center.\n\nIn the afternoon, take a trip to visit Independence Palace, also known at the Reunification palace, was built on the sight of the former Norodom palace. The Independence palace is a widely known landmark of Ho Chi Minh City and was designed by the architect Ngo Viet Thu. Continue seeing the beautiful structures from the French Colonial times such as the Notre Dame Cathedral, the historic Central Post Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast display of the both the Indochina wars.\n\nOvernight in Ho Chi Minh City"},{"title":"HO CHI MINH CITY – BEN TRE – CAN THO (B/L)","description":"Pick up at your hotel in Ho Chi Minh city and start the trip to My Tho. Upon arrival, visit Vinh Trang pagoda which sated back to the late 19th century. Then boarding the sampan and cruising around four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands\n\nStop over at Unicorn Island, go walking in the village paths to contemplate orchards, enjoy tropical fruits, and Vietnamese folk music performed by the local people. Visit the fruit plantation. Be rowed in a small sampan through the Thoi Son canal and treat yourself to the beauty of the countryside, visit the family business & bee-keeping farm, enjoy honey tea and coconut candy workshop. Have lunch at the local restaurant. Break time.\n\nThe afternoon is time for cycling around the Tan Thach village, meeting the local people to experience their daily life in the Mekong delta. Relaxing on hammocks to enjoy the cool breeze is for those do not want to join the cycling trip. Proceed to Can Tho.\n\nOvernight in Can Tho"},{"title":"CAN THO – CAI RANG FLOATING VILLAGE – HO CHI MINH CITY (B/L)","description":"Have breakfast at the hotel/homestay in early morning. Take a leisure boat trip to explore the picturesque tributaries of the Lower Mekong River (Bassac River) then visit to Cai Rang floating market which is the liveliest one in the whole of region. Walking trip to visit the fruit plantation and local noodle factory. Visit Binh Thuy communal house and Munir Ansay Pagoda - a Khmer pagoda, renowned for its unique structure.\n\nHave lunch and return to Ho Chi Minh City.\n\nOvernight in Ho Chi Minh City"},{"title":"HO CHI MINH CITY DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Essence Vietnam tour from North to South 12 days","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1830,"summary":"If you have 12 days to visit Vietnam, let us guide your step. This essence Vietnam tour gives us a chance to explore all of the beauty culture and marvelous landscapes from North to South. You must be impressed by not only a bustling Vietnam but also an ancient country with lovely people. Each of your steps in Hanoi, Mai Chau, Pu Luong, Ninh Binh, Halong, Hoian, Ho Chi Minh will be an unforgettable memory of your life.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139b63c4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139b63c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139dca3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139de58a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139e00fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139e1ca5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139e37b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139e59ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139e75c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191839_5e240139eeac7.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi Arrival (no meal)","description":"Welcome up on arrival by Go Vietnam Travel‘s guide and driver, then we transfer to the hotel.\n\nOvernight in Hanoi."},{"title":"Hanoi – Mai Chau – Pu Luong (B/L/D)","description":"Today we ready to transfer to Mai Chau at 8 AM. The estimated transfer time is for 3 & a half hours to come to this place.\nAt 11:30, on arrival Mai Chau, we have lunch in a local restaurant. This is a really good time for you to explore the Vietnamese ethnic cuisine which is unique and delicious.\n13:00, we start our hiking tour in Mai Chau to go ahead for Chieu Cave.\nThe ascent to the Chieu Cave is almost entirely lined with concrete steps. There are more than 1,000 stars, but the climb up is not difficult.\nOnce at the top, there is a large cave entrance, 10 meters across, slightly covered by an impressive Xa Pung tree. Once inside the cool floors, the caves paths naturally split between the stalactite forest. One of the more impressive features is a “tree” that was made from water droplets dripping from the ceiling.\n16:00, we come back to the car and transfer to the Don Village of Pu Luong Nature Retreat.\n17:00, Arrival homestay for check-in and free time in Don Village\n\n"},{"title":"Pu Luong full day trekking (B/L/D)","description":"8:00AM: After breakfast, our driver will transfer us from Don Village to Bang Village. We start our trekking day from Bang Village to Kho Muong. The day begins with a beautiful hike through the tiers of splendid rice terraces, past several idyllic villages, verdant hillocks, lush farmlands and beautiful mountains. Kho Muong is located in a picturesque valley and home to the Muong people.\nGo through Nua Village with a scene like a masterpiece.\nOne the way, we stop off and have a picnic for lunch.\nWe return Ban Don and finish an amazing day.\nNote:\nIf you travel to Vietnam during the rain season (from May to October), we will have a chance to go to Huou Village to enjoy the marvelous scene in Huou waterfall. After trekking to Huou Village, then we will check-in and overnight in Huou Village.\nTonight we settle in with a Muong family in a traditional wooden house to experience their way of life.\n\nApprox: 8 km hike"},{"title":"Pu Luong – Ninh Binh – Mua Cave (B/L/-)","description":"Pu Luong – Ninh Binh transfer:\n8:00 AM: after breakfast, we say goodbye to Pu Luong and transfer to Ninh Binh. It takes about 3 hours to get Ninh Binh.\nVisit Hoa Lu:\nOn the way to Ninh Binh, we will visit Hoa Lu – the former capital of Vietnam under the Dinh and Le dynasty with two temples worshiping Dinh Tien Hoang King and Le Dai Hanh King. Dinh Tien Hoang had successfully defeated Ngo Dynasty and made Vietnam officially independent from any ruler. On his death in 980, General Le Hoan wisely married Dinh’s widow and established the Le Dynasty and enlarged the citadel.\n12:00: Have lunch in a local restaurant.\n13:00:  Check-in homestay in Tam Coc – Ninh Binh.\nHiking Mua Cave:\nAfer a short rest, we take a bike to go to Mua Cave. It is not far from your homestay.\nThe road to Mua cave was imitated as the Great wall of China. Since you end your climbing, on the top of Mua cave, every worry will go with the wind. Any tiring feeling will disappear, instead limitless and expanses of fat rice crops ( Tam Coc rice fields) appears magically in front of your eyes.\nWe come back to our hotel in Tam Coc.\n\nOvernight in Tam Coc homestay"},{"title":"Ninh Binh – Tam Coc – Thien Ha Cave (B/L/-)","description":"Rowing boat :\nAfter having breakfast in the homestay, we will take a pleasant boat rowing. The limestone caves area stretching along river which is known as “Halong Bay on the land” and enjoy the journey along the river with the peaceful scenery of special karst mountain surrounded with rice paddy and the sight of some ancient temples along the way.\nExplore Thien Ha Cave (Galaxy Grotto):\nStill on our boating route, we transfer to a surprising grotto which has another name is Galaxy Grotto. It seems that all the essence gather here to blow the soul into the beauty. At this time, in front of visitors a stream of light from the sky to open space and visitors’ eyes. It is truly a “Stone Castle “. The visitors are not out of surprise by the illusory realism of a world of stalactites. Especially in front of visitors a stream of light from the sky to open space and visitors’ eyes. It is a “Stone Castle “Life is a soul.\nNote: the time on rowing boat is about 3 hours."},{"title":"Ninh Binh – Ha Long (B/L/D)","description":"Transfer to Halong:\n8:00 AM, we transfer to Ha Long Bay. Halong Bay has been recognized by UNESCO as the World Natural Heritage thanks to its universal values of landscape, geology and geomorphology, respectively in 1994 and 2000 and is one of the most beautiful bays in the world.\nLunch on boat:\n12:00: On arrival in Halong, we will embark on Oasis Bay Cruise followed by a short cruise briefing. We will then savor a delectable lunch while Oasis Bay Cruise among the limestone islands.\n\nSung Sot Cave:\nThen we explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay before continue cruising to Titov Island for swimming and relaxing at the beach or climb up to the Top of the island for a panorama view of Halong Bay.\nIn the late afternoon, we return to the main boat and continue cruising to the quiet area where we enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set. After dinner, free time for socializing with other guests, take part in board games, fish for squid, or just laze around.\n\nOvernight on Oasis Bay cruise or similar \n\n"},{"title":"Ha Long – Hanoi – Fly to Danang - Hoian (B/L/-)","description":"Ta Chi class- Breakfast:\nOn the day dawn, you can enjoy fresh air of the bay and start the day with Tai Chi class in the early morning. Have breakfast on board, prepare the energy for kayaking among the hidden areas of the bay, around the Man’s Head Islet area.\nBa Hang Fishing Village:\nAt around 10.15 AM, we return to the boat, freshen up and check out of your cabin while our cruise continue passing Ba Hang Fishing Village, Dog Islet and more. While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch. Disembark at around noon and find your car is waiting and take us back to Hanoi.\nWe arrive in Hanoi around 2:30 PM- 3 PM, we will have free time until our driver pick you up to the airport to take the evening fly to Danang.\n\nOur guide and driver are willing to be at the Danang airport to transfer us to Hoian.\n\nOvernight in Hoian."},{"title":"Cooking class– Hoian walking tour ( B/L/-)","description":"Cooking class in the morning:\nAfer breakfast, we join the fantastic Cooking class at Red Bridge restaurant with first activity to visit Hoi An colorful market to experience the amazing sights, sounds and aromas of this busy market; and purchase some of the ingredients to be used in the cooking lesson later.\n\nLater, we board the Red Bridge boat for a leisurely cruise (25 minutes) along the Hoi An River to the Red Bridge Cooking School; explore the cooking school’s herb and vegetable garden before learning about some of Hoi An’s and Vietnam’s well-known dishes. The cooking lesson runs for about 2 hours – each dish is first demonstrated by the Red Bridge chef’s, before we prepare the same dish ourselves. Included in the class is a brief introduction to Vietnamese food carving (plate decoration). After the lesson, we sit down and eat exactly what we have cooked.\nHoian Walking tour in the afternoon:\nAfter a short rest, we will start our walking tour around the ancient town to visit the Japanese Covered Bridge, the Pottery Museum, Tan Ky old house, the Cantonese congregation, the silk street of Hoi An, the temples and pagodas of Chinese appearance.\nOvernight in Hoi An.\n\n"},{"title":"Farming & Fishing tour (B/L/-)","description":"This morning, we will cycle to a local farming village to join daily work life of local farmers – hoeing and a soil, watering veggie at an organic herb garden, riding water buffalo in the field and enjoy the freshest air of the countryside beauty. After that, board the Hoi An Eco-tour boat and cruise to the mouth of the river where it meets the Cua Dai Sea.\nWe also learn and try our hand at local traditional fishing techniques using round and cast nets, learn to paddle the strange and unique Vietnamese bamboo basket boats. Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides. Have a relaxed fun with catching beautiful purple crabs on bamboo basket boat. After visit a local water coconut palm village, we take a walk around the village and have some tea and snack with local talks…\n\nBack on-board our Hoi An Eco-tour boat, enjoy our lunch and cold beer or soft drink on boat, then back to resort.\n\nIn the afternoon, we are leisure at nice swimming pool at hotel after your fun day with Farming and Fishing Tour.\n\nOvernight in Hoian\n\n\n"},{"title":"Hoi An – Fly to Ho Chi Minh city – Cu Chi Tunnel (B)","description":"We transfer back to Danang airport to take a short domestic flight to Ho Chi Minh city this morning. After 1 hour flight, we are welcome by local tour guide and driver in Ho Chi Minh city then transfer to hotel.\n\nIn the afternoon:\nWe will leave Saigon for the Cu Chi tunnels, otherwise known as the “Iron Triangle” or “Iron Land”. On our way there we will drive through pleasant countryside; rubber plantations and rice paddies. Before entering the tunnels, we will see a short introductory video showing how they were constructed, followed by an exploration of the maze of tunnels, some of which have been widened to allow tourist access. Also on display are various mantraps and the remains of an American tank as well as numerous bomb craters made by 500lb bombs dropped by B52 bombers. After that we transfer back to Ho Chi Minh city.\nOvernight in Ho Chi Minh\n\n"},{"title":"Ho Chi Minh city – Mekong Delta - Ho Chi Minh (B)","description":"Meet us at the pier in front of Cuu Long Hotel in Vinh Long where your crew will be ready to welcome you aboard with cold towels and a refreshing drink while the Cai Be Princess Sampan sets off for its leisurely cruise on the busy waterways of the Mekong Delta.\n\nCrossing the Co Chien River, one of the original nine branches of the mighty Mekong in the Delta, enter the Dong Phu Canal. Cruise past the islands of An Binh and Binh Hoa Phuoc, famous for their fruit orchards. Observe from the comfort of your sampan life as it plays out on the riverbanks the people, the stunning landscapes while your attentive crew serves you tea and seasonal fruit.\nCai Be:\nWhen you arrive at the bustling trading town of Cai Be, you’ll notice much more boat traffic, from motorized canoes to barges laden with fruit, vegetables, consumer goods and other products. Continue towards Phu An Hamlet and stop in on local workshops to observe the traditional process of making coconut candy and puffed rice (the local equivalent of popcorn).\n\nHave lunch and back to Ho Chi Minh city:\nYour cruise ends at Le Longanier Restaurant. Lunch is served in this exquisite colonial-style villa set in a lush tropical garden by the river and surrounded by fruit trees, giving you a sense of privileged life during Indochinese times. After lunch (at around 2:30 pm), take a short walk along a small canal back to Ba Bon Bridge where your personal vehicle awaits to drive you to Ho Chi Minh City.\n\nOvernight in Ho Chi Minh.\n\n\n"},{"title":"Ho Chi Minh Departure (B/-/-)","description":"After your breakfast, we will start to move to airport. The guide say good bye to you.\n\nTour end.\n\nThank you for choosing Go Vietnam Travel’s services."}]},{"name":"From North To South With SAPA - HALONG BAY- HOI AN 14 days","duration":14,"travelStyle":["Adventure","Family","Private","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":996,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100386_48023c45.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100386_48023c45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_b2824a7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_02e15d04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_d138c1c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_b35e935f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_c8d1ab53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_5122939c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_d0d10c64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_522608e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_07bfaf81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_e035cefa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_2b64b91b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_73358cc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_3fc6e06e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_bdb579e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_8e8c4fb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_50d0459f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_a82536d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_7bcfcd4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_82df16f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_1aa16537.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_8b72b453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_40e4b534.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100386_197766a5.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: HA NOI ARRIVAL","description":"Meal is not included\nOn arrival Ha Noi capital, we will see at the airport have private transfer to center for check in hotel. You have free time for leisure."},{"title":"Day 2: HANOI - HALONG BAY (B,L,D)","description":"Meal included: Breakfast, Lunch, Dinner\n8.00 – 08.20 approx\n- Our guide will meet you at your hotel. The shuttle bus or private car pick up.\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n- You will have a chance to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n12 – 12.30 noon approx\n- Arriving Tuan Chau Marina. Welcome aboard the cruise. Meet the captain, crew and join us for welcome cocktail as we tell you about life onboard.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is prepared by our chef.\n- Join us for a relaxing lunch in the restaurant or on the outdoor dining area. Enjoy the stunning views of the Bay, its dramatic limestone islands as we sail through the calm waters.\nAfternoon\n- While we make our way to the amazing Van Gia fishing village, relax on the sundeck and watch the world go by or take an afternoon nap in your cabin. Middle afternoon arrive at Van Gia floating fishing village.\n- Drop anchor.\n- Our guide will give you some information and interesting facts about this fascinating village and its local community.\n- Disembark and you can choose which options when you visit the village by Kayak or local bamboo boat to visit the village. They will be your guides through their fishing village where you can meet the locals, see at first-hand what life is like living on the water, we are proud of our working partnership with, and support of this community.\n-    Our cruise will take you to the Soi Sim natural beach for swimming and snorkeling, you can enjoy our interesting games such as football, basketball. On the way cruising, you will enjoy with us the sunset party with fruits and wine as our complimentary\n- Back on board the cruise, we head towards the sleeping area.\nEarly evening\n- Take an opportunity to refresh and then join friends for a pre-dinner drink in the bar.\n- Dinner is served in the restaurant or outdoor dining area if the weather is permitted, which is a gastronomic delight. After dinner, unwind in the bar where there is a selection of books, magazines and board games or watch a movie on our plasma TV; join some of our team to go cuttle fishing at night. Accommodation and overnight on boat."},{"title":"Day 3: HA LONG - HANOI (B,L)","description":"Meal included: Breakfast, Lunch\n06:30 am\n- For the early risers join us for a Tai Chi session on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands.\n- Breakfast, coffee, tea served.\nAfter breakfast, we sail through the waters and pass by a number of caves and we drop anchor at Surprising (Sung Sot) Cave.\n- Disembark and visit Surprise Cave located on Bo Hon Island. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites\n09:30 Am: \nWe board the cruise again. Take time to refresh and relax before checking out. Bags can be left in the luggage store. You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n12 noon\nReturn to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus return to Hanoi. Overnight in Ha Noi."},{"title":"Day 4: SAPA TREKKING: LAOCHAI - TAVAN (10km trek)","description":"Meal included: Breakfast, Lunch, Dinner\n6:30 am : Our bus pick you up at the meeting point and depart to LaoCai, on the  highway running from Noi Bai - Lao Cai 245Km with less than 5 hours.                 \nYou have the opportunity to enjoy the beautiful scenery on the both sides of this road.                 \n12:00 : Arrival Sapa, Enjoy lunch at local restaurant then proceed to visit.                 \n13:00 pm: Car will take visitors started walking journey about 4hours to visit Lao Chai - Ta Van  and Giang Ta Chai, explore the life of ethnic minorities,                \nadmire the spectacular natural scenery  with the terraced rice fields. Visit Sapa ancient rock with engraved images big– small rocks,    admire the Bridge which made by clouds,                 \ncross the Muong Hoa  stream poetic. Then get back to Sapa. Overnight in  sapa.                "},{"title":"Day 5: SAPA – TREK TO CAT CAT VILLAGE (7km trek)","description":"Meal included: Breakfast, Lunch\n8:00am Driver and guide take you back Sapa to rejoin group together visit Cat Cat village.                \n9:00am Exploring Cat Cat – Shin chai village of H’mong – a colonial French discovered area and a renowned  resort to officials from the early twentieth century.                \nArriving to Cat Cat village, visitors will be visiting the  Hydropower station, the waterfall of Cat Cat village, as well as learning about the culture, customs and                 \nunique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.                \n12:00 : Pick up from Cat Cat village and back to Sapa town. Enjoy a meal at a local restaurant.  Free time to visit or shopping souvenir \n16:00: The bus take you back to Hanoi, stop at the bus stop, taxi yourself back to the hotel (5 minutes around). Overnight in Ha Noi."},{"title":"Day 6: HANOI – DA NANG BY SOTF SLEPPER TRAIN","description":"Meal included: Breakfast\nAfter breakfast at hotel, you have relax time and discover an old quarter in Ha Noi. Check out hotel at 12:00pm, continue have free time until afternoon for transfer to train station. Train start at 19:30 to Danang. Overnight on train with sotf sleeper train (4 berth/cabin)."},{"title":"Day 7: HOI AN ANCIENT TOWN","description":"Meal is not included\n11:25am arrive to Da nang train station, private car transfer to Hoi An town for half  an hour. After check in Hoi An hotel, free to visit ancient town, Japanese bridge, lantern road, Thu Bon river, use the offer bicycle to the beach…Overnight in Hoi An."},{"title":"Day 8: HOI AN - MY SON HOLY LAND","description":"Meal included: Breakfast, Lunch\n8:00: The  bus  and  tour  guide  pick  you  up  at  your  hotel  (in Hoi An  ancient  town  area).  8:30: Leaving Hoi An for My Son HolyLand.\n9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My  Son  was  chosen  as  a  religious  center,  built  in  the  late  4th  century  under  the  Cham’s  King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Spend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa  Kingdom with our tour guide.\n12.00: Tour finish. Overnight in Hoi An"},{"title":"Day 9: HOI AN COOKING CLASS","description":"Meal included: Breakfast, Lunch\nMeet our local tour guide at lobby hotel by bicycle or by car. Our guide, who also is the chef, takes you to visit Hoi An market to buy ingredients for the cooking class. You then to ride to Tra Que village (a short 15minute cycle away.)  You will be welcomed with a special local soft drink - “É” water or local tea. After your welcome, take a short walk around the vegetable garden to see local farmers at work.\nBegin to learn how to cook local delicacies including: Banh xeo, “tam huu” spring roll, “Tra Que” spring roll…\nAfter your cooking class, enjoy the foods cooked by yourself. By bicycle we return back to the hotel. This ends the tour.\nNoted: Tra que farmer Tours is an option to be chosen if you do not want to join Cooking class\nInclusive: Helping bicycle, local guide, course of cooking, foot massage, light meal, cold tissue, cold water. Overnight in Hoi An."},{"title":"Day 10: DANANG – SAI GON BY AIR PLANE","description":"Meal included: Breakfast\nAfter breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City.\n Overnight in Saigon."},{"title":"Day 11: MEKONG DELTA FLOATING MARKET","description":"Meal included: Breakfast, Lunch\n8: 00    Picking up from hotel/stay.\n08:15    Starting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30    Start the motorized boat to visit the Cai Be Floating market, experience how people exchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn.\nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature.\nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30    Arrive in your hotel."},{"title":"Day 12: CU CHI TUNNELS HALF DAY","description":"Meal included: Breakfast\n08:30    Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n12:00    Have lunch in a local restaurant\n13:00    Back to Ho Chi Minh City\n14:00    Arrive in your hotel in Ho Chi Minh City."},{"title":"Day 13: HO CHI MINH CITY HALF DAY","description":"Meal included: Breakfast, Lunch\nIn the morning, we start the trip by heading to China Town & visit Binh Tay Market, stopover at Thien Hau, a 150 year old Chinese Temple. Followed by the remarkable site of the War Remnants Museum. Lunch at a local restaurant ( enjoy Pho – Vietnamese noodle soup or Banh Xeo – Vietnamese pancake)"},{"title":"Day 14: HO CHI MINH CITY DEPARTURE / SEE YOU AGAIN","description":"Meal included: Breakfast\nAfter having breakfast at hotel, you have relaxing time in Ho Chi Minh city until transfer to the airport for the flight back home. See you again!"}]},{"name":"Stunning 13-Day Tour of Vietnam from North to South","duration":13,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":886,"summary":"Many tourists who fly into Vietnam for the first time are simply amazed as they don't quite know what to expect. Vietnam is a country has something for everyone. If you are a nature buff then, with either the country's beaches, mountains, tropical forests.\n\nIf you are a history and culture enthusiast, you will be fascinated by all the ruins and pagodas located around the country. Or if you hunger for the charms of a simple life, you will fall in love with the Vietnamese lifestyle including the hill-tribes and farmers of the north and the fishermen in the middle and southern regions of the country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187603_3bbff4c6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187603_3bbff4c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_ff134796.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_61d8c494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_82c1903a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_e849a9d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_c589f3c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_3574edfd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_952286ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_4b2fecdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_e43ae0f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_59aba625.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187603_8d0ca7cc.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Hue","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"Hanoi Arrival","description":"You are welcome at the airport and transferred to the hotel.\nCheck-in hotel and free time.\nOvernight in Hanoi"},{"title":"Hanoi city excursion (B, L)","description":"This full-day tour takes you around Hanoi's most interesting sights such as Ho Chi Minh’s Complex: Ho Chi Minh's Mausoleum and his House on Stilts, Presidential Palace and One Pillar Pagoda, the Temple of Literature, peaceful West Lake with lovers street Thanh Nien, the sedate Tran Quoc Pagoda. Have lunch in a local restaurant. In the afternoon, Visit Ngoc Son Temple and Hoan Kiem Lake.\nOvernight in Hanoi."},{"title":"Hanoi – Ha Long, overnight on board (B, L, D)","description":"Having breakfast at the hotel, check out the hotel.\n7.45\t: Our bus will pick you up at your hotel.\n12.30\t: Arrive in Halong City. Receive cruise briefing, check in cabins and begin your cruise.\n13.30\t:  Have lunch – delicious Vietnamese set menu\n15:00\t:  Keep cruising into the bay while admiring the fascinating rock formations in the bay. Make stop for the beach and kayaking or hoping on a bamboo sampan. Then return to the vessel for your leisure or join happy hours. \n18:00\t: Drop anchor in the calm water surrounded by islets. Happy Hour (sunset party).\n18:30\t: Vietnamese cooking demonstration on boat.\n19.15\t: A sumptuous dinner is served on board.\n21.00\t: Relax on your cabin or join on board activities: light music for dancing in the dining room (please book in advance with your tour guide), board games and playing cards are available. Passengers may also try their luck at squid fishing from the boat. \nOvernight on board."},{"title":"Amazing Cave – Hanoi (B, Brunch)","description":"06.15\t: Start your day with Tai Chi on the Sundeck while complimentary tea & coffee are served.\n07.00\t: Have breakfast\n08.00\t: Explore the Amazing Cave (Sung Sot Cave).\n08:15\t: Transferred by tender to Amazing Cave. Amazing Cave is a huge cave consisting of three chambers, which you reach via 90 steps. Among the stalactites of the first hall, scores of gnomes appear to be holding a meeting. The walls of the second chamber sparkle if bright light is shone on them.\n10.00\t: Upon return to the boat you will have time to freshen up and pack. Please remove all of your belongings from the cabin, you may leave heavy luggage outside of the cabin (staff will transfer directly to the pier).\n10:30\t: Enjoy a set menu lunch in the dining room. We will settle bills after lunch. Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11.45\t: Arrive at the Harbor. Transferred by tender to the pier.\nGo back to and overnight in Hanoi."},{"title":"Hanoi – Sapa by bus with a short trek to Cat Cat Village (B, L, D)","description":"6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costumes of H’mong, Dzao, Tay ethnic People.\n•\tWelcome drink and itinerary briefing\n•\tEnjoy the lunch with local Vietnamese dishes, check-in procedures\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. Have dinner and overnight in hotel with night activities."},{"title":"Sapa – Hanoi by bus with a long trek Y Linh Ho – Lao Chai – Ta Van (B, L)","description":"7.00 – 8.00: Have breakfast at hotel, check out the room and prepare light pack for trekking. (Big luggage keep in hotel store)\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village – home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n12.30 – 13.30: Have lunch in the hotel.\n13.30 – 14.45: Relax and leisure on your own, have shower in the public bathroom in the hotel if you want.\n14.45 – 15.00: Meet all group members at hotel to get ready for Hanoi.\n15.30: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: Drop at the hotel.\nOvernight in Hanoi."},{"title":"Fly to Da Nang – Drive to Hoi An (B)","description":"Having breakfast at the hotel, then free time before transfer to the airport to catch the flight to Da Nang.\nUpon arrival in Da Nang, you are welcome at the airport and transfer to Hoi An.\nCheck in hotel in Hoi An and free time to discover Hoi An Ancient Town on your own with interesting activities at night.\nOvernight in Hoi An."},{"title":"My Son Sanctuary (B, L)","description":"7:45 – 8:15:  Our guide picks you up at your hotel and depart to My Son Sanctuary - The World Cultural Heritage. \n9:30: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11:45: Get back to minivan and move to a local house to learn how to make rice paper, you will enjoy your own hand-making product later on!\n12:30: Back to the van and have lunch at another local house. relax with cold herbal tea, nice foods and fresh air.\n13:30 take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14:00: arrive in Hoi An, we will drop you off at your hotel.\nOvernight in Hoi An"},{"title":"Hue City Explore full day tour (B, L)","description":"07h30-08h15: Car and tour guide will pick up you at your hotel and go to Hue city. On the way, you will visit Hai Van road tunnel - the longest tunnel in Southeast Asia and Lang Co Beach.\n10h30: You will visit the Khai Dinh tomb, the tomb had elements of eastern art mixed with western designs.\n12h00: Having lunch and rest at restaurant\n13h00: You will continue visiting Hue imperial city – the palace of 13 Nguyen Kings with Ngo Mon Gate, Library, Thai Hoa palace, Nine Dynastic Urns and visiting Thien Mu pagoda associated with culture and history of Hue.\n15h30: Return Hoi An and drop at your hotel\nOvernight at hotel in Hoi An."},{"title":"Fly to Ho Chi Minh (B)","description":"Having breakfast at the hotel, then free time before transfer to the airport to catch the flight to Ho Chi Minh City.\nUpon arrival in Tan Son Nhat International Airport, you are welcome at the airport and transfer to Ho Chi Minh City.\nCheck in hotel and free time.\nOvernight in Ho Chi Minh City."},{"title":"Mekong Delta (B, L)","description":"Having breakfast at the hotel.\nYour tour begins hotel pickup in Ho Chi Minh City between 7:30 AM and 8:00 AM. Travel by Luxury minivan to My Tho, a city situated on the Mekong Delta. Take part in a variety of activities that will offer you the chance to get to know Vietnam. Hop aboard a horse-drawn cart and admire the coconut trees that dominate the landscape. Row down the canal in a small boat, then cycle down provincial roads to see the rice fields, pineapple plantations, orchards and small hamlets.\nRide a motorboat down the mighty Mekong River and see Dragon Island, Phoenix Island, and Turtle Island. Stop at the famous Unicorn Island and visit a local bee farm. Taste natural honey along with honey wine, rice wine, and banana wine. Walk through the village, then visit a coconut candy workshop and learn how to make coconut candies. Hop back on the motorboat and travel along lush green canals to a local restaurant where you’ll enjoy a Vietnamese lunch.\nVenture to another part of the island and enjoy tropical fruit as you listen to traditional South Vietnamese music. After this delicious snack, a boat will take you back to My Tho to visit the Vinh Trang Pagoda. Enjoy the convenience of hotel drop-off once the bus has returned you to Ho Chi Minh City.\nOvernight in Ho Chi Minh City."},{"title":"Cu Chi Tunnels (B)","description":"To begin the day, we will pick you up at the hotel. Then heading to Cu Chi tunnels – the hiding spots during war which are used by Viet Cong soldiers.\nArriving at the destination, a short introductory video showing how the tunnels were constructed and used by Viet Cong soldiers during Vietnam War will be given. Then we will spend time to explore the maze of tunnels with countless trap doors, storage facilities, weapons factories, field hospitals, command centers, kitchens, and more. Besides, we will enjoy the most popular food during war days at Cu Chi tunnels – the cassava.\nOvernight in Ho Chi Minh City."},{"title":"Ho Chi Minh City – Departure (B)","description":"Free time until transfer to the airport for your departure\nEnd of our services."}]}]