[{"name":"Halong Bay Cruise 3 days/2 nights","duration":3,"travelStyle":["Sailing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":285,"summary":"3 days enrich Vietnam culture onboard  while discovering the magical natural beauty in UNESCO World Heritage Site Halong Bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0b881d1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0b881d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0b9d47b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0ba3c60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0ba9240.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192580_5e33ed0bb062b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi - Halong Bay","description":"08:00 – 08:30, Pick up at your hotel, the bus will drive you three and half an hour to Halong Bay with short refreshment in the middle way"},{"title":"Halong Bay","description":"06:45 AM     Start your day with Taichi exercise and photo hunt"},{"title":"Halong Bay - Hanoi","description":"\n  06:45     Wake up early in the morning for Taichi exercise on the Sundeck\n  07:15     Coffee, tea and light breakfast pastries served in the dining room.\n  8:00     Visiting the Tunnel Cave by the rowing boat or the kayak ( Optional)\n  9:30     Upon return to the boat take time to freshen up and please check out of cabins. Leave your heavy luggage outside of the cabins\n  10:00     Take part in Fruit Carving Flower Class with our Master Chefs\n  11:00     Enjoy lunch Set Menu served in the dining room while enjoy the bay scenery as we approach the pier\n  12:20     Transfer by tender to the pier, relax inside our waiting lounge and waiting for return transportation.\n  You will arrive in Hanoi approximately at 16:30.\nEnd point\n Your accommodation, Hanoi, Vietnam "}]},{"name":"Mai Chau - Pu Luong Nature Reserve 3Days/2nights","duration":3,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":189,"summary":"\n\tHighlights:\n\n\tBicycle ride with your tour guide, see farmers working in fields, locals weaving scarves and visit surrounding peaceful villages.\n\n\tEnjoy the outdoor BBQ party at Mai Chau BBQ garden and watch the Thai’s traditional\n\n\tdance and drink traditional wine “ruou can”.\n\n\tTrekking in Pu Luong Nature Reserve to explore a stuning cave\n\n\tGo with a local Thai tour guide to visit more remote rural villages: Na Meo, Na Mo and Xam Pa villages to understand more about their culture and customs\n\n\t \n\n\t \n\n\t \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e07a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e07a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e07e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e081.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117660_5e43743e4e083.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"DAY 1: Hanoi – Mai Chau Valley (L,D)","description":"7:30-8:00 : Pickup at your hotel in the Old Quarter in our comfortable van/bus\n\n\n10:00 : Short break\n\n\n11:30-12:00 : Scenic photo stop of Mai Chau valley/arrive in Mai Chau\n\n\n12:15 : Traditional lunch in our home(vegetarian available)\n\n\n14:00-16:30 : Bicycle ride with your tour guide, see farmers working in fields, locals weaving\nscarves and visit surrounding peaceful villages.\n\n\n16:30-18:00 : Free time for cycling, walking, shopping\n\n\n18:00 : Enjoy the outdoor BBQ party at Mai Chau BBQ garden and watch the Thai’s traditional\ndance and drink traditional wine “ruou can”.\n\n\nOvernight in the homestay"},{"title":"DAY 2: Amazing day with motorbike to Pu Luong Nature Reserve (B,L,D)","description":"7:30-8:00 – Wakeup and eat breakfast\n\n\n8:30-10:30 – Drive / ride motorbikes 35km to Pu Luong Nature Reserve (motorbike drivers available).\n\n\n10:30 – 12:30 – Trekking in Pu Luong Nature Reserve to explore a stuning cave.\n\n\n13:00 – 15:00 – Enjoy Lunch in the village and enjoy the riding back to Mai Chau by taking another road\nthrough the beautiful rural villages.\n\n\n15:30 – Arrive in Mai Chau enjoy your free time with your motorbike to explore the Valley yourself.\n\n\n18:00 – Dinner and over night in your homestay"},{"title":"Day 3: Explore the more remote rural villages ( B,L)","description":"07:30 – Have breakfast at the homestay\n\n\n08:00 – Go with a local Thai tour guide to visit more remote rural villages: Na Meo, Na Mo and Xam Pa\nvillages to understand more about their culture and customs\n\n\n12:00 – Back to the homestay for lunch and check-out\n\n\n13:00 -15:00 – Free time for shopping and relaxing.\n\n\n15:30 – Get on the van/bus to drive back to Hanoi.\n\n\n19:00 – Arrive in Hanoi Old quater. Drop you off at your hotel.  End of tour."}]},{"name":"3-day Adventure to Mekong Delta","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":365,"summary":"The Mekong Delta, with its meandering waterways and flourishing daily life, is a place not to be missed. Riverbanks are laden with coconut palms, rice fields, orchards and stilted houses. The water is teeming with boats of all shapes and sizes and the Mekong comes alive as you navigate past fishing boats, cargo vessels and even floating houses.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186022_c2bb9236.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186022_c2bb9236.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_e4aa4bba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5ceb9216.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_36f2a251.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5d81f70a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_c25547a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_30449a67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_f02c4798.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_0ec6696b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_b2567c05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5dfb12471e4ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5e40fd1d7d1f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5e40fd1abb453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186022_5e40fd1d7d1f6.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Ben Tre"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Cai Be - Can Tho (L/D)","description":"From Ho Chi Minh City we drive to Cai Be where we board our boat to venture into the green, watery world of the Mekong Delta. River banks are laden with coconut palms, rice fields, orchards and stilted houses and the water is teeming with boats of all shapes and sizes.\nThe Mekong comes alive as we enjoy our boat trip past fishing boats, cargo vessels and even floating houses. We enjoy a delighful walk to explore around a local market, various cottage industries and fruit orchards. Afternoon finds us driving to Can Tho. Here, we spend the night in Ninh Kieu hotel."},{"title":"Day 2: Can Tho - Ben Tre (B/L/D)","description":"This morning we take an early boat trip to explore the vibrant floating market of Cai Rang then the fertile tributaries of the Mekong River. Next, we journey to Ben Tre province, home to lush fruit orchards, rivers and a former stronghold of Viet Cong during the Vietnam War. Here, we take a bicycling ride along the banks of Ham Luong River. Late in the afternoon, we settle in with a hospitable local family for cooking demonstrations. We make authentic Vietnamese food, such as succulent Coconut Cake, zesty dipping sauce, fresh Spring Rolls and other dishes.\nWe then enjoy the family’s gracious hospitality as they share dinner with us. The night is spent in their home to experience their way of life and to experience river life."},{"title":"Day 3: Ben Tre - Ho Chi Minh City (B/L)","description":"Our discovery of the delta's waterways and flourishing farms is to boat along the Ham Luong River, and take a bicycling ride across small villages and farmlands. Time is also spent taking a kayaking ride passing through mangroves, coconut and fruit orchards, stopping at our pleasure to savour the delta's succulent crops and bring us into contact with the local people.\nFollowing our delicious lunch in our host we board our vehicle for our return journey to Ho Chi Minh City, arriving there at around 5pm."}]},{"name":"Halong Bay & Cat Ba Island - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":385,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.","highlights":["Visit two of Vietnam’s most impressive sights on one wonderful trip","Cruise through the spectacular UNESCO World Heritage Halong Bay","Soak in the sun and swim in aqua waters on the captivating Cat Ba Island"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33774_51cbeb38.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33774_51cbeb38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_864f303d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_2b6ec981.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_ca9a974e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_4f142c63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_44134dd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_f53bf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_858ffc53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_7744befe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_c14ec3f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_ae065b00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_de5a5565.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_ac6ae9ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_b1238c55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_eeff6984.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_46af155a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_fdb9327a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33774_a3cb737e.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"Day 1: Ha Noi – Ha Long (-/L/D) by shuttle bus","description":"The shuttle bus will pick you up at the hotel and drive you through the scenic countryside to Ha Long Bay. The wondrous Ha Long Bay is truly one of Viet Nam’s most impressive sights. Heading out of town, we will embark by boat for an exploration of the legendary Ha Long Bay. This exciting five-hour cruise will provide a fantastic view of the picturesque scenery. Ha Long Bay is home to some 3000 limestone islands that rise out of the clear emerald water. The limestone karsts formations are littered with beaches, grottoes and beautiful caves. Along the way, we will anchor for a leisurely swim in a secluded cove and enjoy a visit to one of the many hidden grottoes beneath towering cliffs. Stay overnight on the cruise. "},{"title":"Day 2: Ha Long – Cat Ba (B/L/D)","description":"After breakfast, you may enjoy your morning with swimming or sunbathing. Then get on a ferry to Cat Ba Island and enjoy the photo opportunities along the way. Upon arrival at Gia Luan pier, you will be picked up by a bus to travel to Cat Ba National Park, where you can enjoy some soft hiking. Next we will travel to the center of Cat Ba city, to your hotel for check-in and relaxation. Enjoy some free time in Cat Ba or go swimming at Cat Co Beach. Have dinner at your hotel. "},{"title":"Day 3: Cat Ba – Hai Phong - Ha Noi (B/L/-)","description":"After breakfast at the hotel, enjoy a free morning exploring or relaxing. Have lunch at a local restaurant before getting on a hydrofoil to Hai Phong where the driver will pick you up and return you to Ha Noi. "}]},{"name":"Ha Noi 4 Days 3 Nights (Halong - Ninh Binh)","duration":4,"travelStyle":["Sightseeing","Adventure","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":195,"summary":"Hanoi, a city of lakes, shaded boulevards and verdant public parks - the capital of Vietnam and the city’s most interesting places for tourists are all relatively close to each other, which makes it easy to enjoy the best parts of the city on foot or by cyclo. You could probably explore the Ancient Quarter and visit all the places below in a single day.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140635_d8724d26.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140635_d8724d26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_e41aa0bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_453a4083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_5d1b9901.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_946cffcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_824b881e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_7076e74a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_568dc8a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140635_5e2f176c.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Ha Noi."},{"title":"Day 2: Hanoi - Ha Long Bay (Breakfast, Lunch)","description":"07:30 - 08:30 \tMeet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields to Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 \tBoard our cruise and start cruising among limestone islands and photograph of stunning landscapes of Halong.\n13:00 \tSavor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 \tStop at a fishing village to see local fish-men community and know more about their life. Cruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n15:00 \tVisit Thien Cung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n16:15 \tStop at the harbor again to catch the bus to Hanoi.\n20:00 \tArrive back in Hanoi. Tour ends."},{"title":"Day 3: Hanoi - Ninh Binh - Hoa Lu - Tam Coc (Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\n- Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\n- Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \n- Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\n- Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. Tour ends.\nCYCLING RIDE (optional)\nThose who love to explore real countryside images of Vietnam can proceed a cycling ride from Tam Coc to Bich Dong Pagoda (estimated time 40 minutes for 5km cycling 2 ways). You will be amazed at beautiful scenery of lush paddy fields"},{"title":"Day 4: Hanoi Departure","description":"07:45 - 08:30 Meet your tour guide at your suggested places around Hanoi Old Quarter. - Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.              - Visit Ho Chi Minh complex, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. - Visit Temple of Literature constructed in 1070 dedicating to Confucius, sages and scholars. It was also the first university of Viet Nam once.  12:30 Relax and have lunch at a local restaurant in Hanoi Old Quarter. - Explore daily life of traditional ceramics village of Bat Trang. Visit showrooms and see how they model the products.  - Arrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians.  The tour finish at 4:00 PM, free time to shopping until 9:30 PM my driver pick you up transfer to the airport."}]},{"name":"Discover the ancient cities of Hoi An & Hue 4 days 3 nights","duration":4,"travelStyle":["Historical","Group","Partially Guided","Holiday"],"oldPrice":0,"price":465,"summary":"This tour takes you to some of the most important historical sites in central Vietnam. You will start in Hoi An which was once the most influential trading port in South East Asia and has managed to preserve many fascinating buildings and temples from this era. You will also visit the beautiful Perfume River and the Imperial Citadel in Hue which once housed the Nguyen Dynasty who ruled over Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe6ff8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe6ff8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80f7197b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80f7197b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7000.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7002.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7003.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7005.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194183_5e4b80fbe7008.jpg"],"destinations":["Hoi An","Hue"],"timeline":[{"title":"Da Nang - Hoi An (L/D)","description":"\nOn arrival in Da Nang, our guide will pick you up and then we’ll visit the Cham Archaeological Museum which features an extremely rich collection of Cham artefacts, tracing the history of this lost civilization.\nThen we’ll have lunch at a local restaurant before we resume the journey to the port town of Hoi An, recognized as a World Heritage Site by UNESCO.\nWe’ll spend the afternoon exploring the Ancient Town of Hoi An and its surroundings. The best way to do this is by walking, and we’ll visit the famous Japanese Bridge, the Pottery Museum, Tan Ky old house, the Cantonese Congregation and many ornate Oriental temples and pagodas.\nYou will also visit Silk Street, followed by free time to explore the town on your own. Dinner and overnight stay at a three star hotel in Hoi An."},{"title":"Hoi An - Hue (B/L/D)","description":"\nToday we’ll take part in a cooking class, so we start the day at Hoi An’s colourful market to pick out the freshest ingredients for our class. After we’re done exploring the market, we board a boat for a leisurely cruise along the river, eventually arriving at the cooking school. On arrival you can spend some time exploring the school and its delightful gardens, before we take the class itself and learn how to make some classic Hoi An dishes. The class lasts about 1.5 hours, and then we set out by van to the old capital of Hue, visiting the Marble Mountains, Lang Co, and Hai Van Pass en-route. Overnight stay in a hotel in Hue."},{"title":"Hue City - Perfume River (B/L/D)","description":"\nThis morning you can take a cruise on the poetic Perfume River to visit Thien Mu pagoda, Hon Chen temple and the Mausoleum of Emperor Minh Mang. Following this, you will also visit the royal tombs Tu Duc.\nIn the evening, you will enjoy another boat trip as you take a dinner cruise complete with a performance of Hue folk songs. You will stay another night in a hotel in Hue."},{"title":"Imperial Citadel - Hue Departure (B/L)","description":"\nToday you will be immersed in the history of Hue as you explore the ruins of the Hue Imperial Citadel. It was from here that the Nguyen Dynasty ruled Vietnam between 1802 and 1945, and your tour guide will lead you through the complex explaining the historical context as you go. You will also have the chance to visit the Dong Ba Market, before checking-out of your hotel and leaving for either the Hue Railway Station or Phu Bai Airport."}]},{"name":"Quy Nhon & Ly son Island - 3 Days","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":452,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n\nEscape the hustle and bustle of big cities and tourist hubs to visit a couple of provinces where the pace of life is much less hectic. Experience lovely little Ly Son Island with its wild, rugged and unspoiled landscape and the pretty coastal town of Quy Nhon that features beautiful beaches, captivating countryside and interesting heritage sites.","highlights":["Head to provinces where the pace of life is much less hectic","Visit lovely little Islands with its wild, unspoiled landscapes","Stroll through coastal Quy Nhon and its interesting heritage sites"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/59448_7ec88e2c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/59448_7ec88e2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_7a72982b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_51237ae6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_a2676789.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_bd096db1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_6ffb9b8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_76f89401.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_cbbdaa6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_a9703d0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_48cbb664.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_84f39e98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59448_fc7be26d.jpg"],"destinations":["Hoi An","Quy Nhon"],"timeline":[{"title":"Day 1: Hoi An – Ly Son island (-/L/D)","description":"Departing Hoi An, head to Quang Ngai province. Ly Son Island can be reached by speed boat from Sa Ky fishing port. Have lunch before departing to Ly Son island. Arrive at Ly Son, check-in at the hotel, then explore Thoi Loi mountain. Looking down from the peak of the mountains, you can admire the spectacular colorful scene; one side is an immense field of green grass in the pan-shaped valley and other side is a rainbow spectrum of colors from the blue ocean, white sand and red basalt soil to the green garlic fields Ly Son is famed for. Enjoy a seafood dinner. Overnight at Ly Son."},{"title":"Day 2: Ly Son – Binh Dinh province – Quy Nhon (B/L/D)","description":"Wake up early and enjoy the beauty of sunrise. After breakfast, get on small boat to visit An Binh island (Ly Son little island). Relax and enjoy views of the mountains covered with green grass and charming garlic fields. Along the mountains are stunning beaches full of colorful rocks, pebbles and corals.\nHave lunch before getting a boat back to the main island. Check-out and back to the mainland.\nContinue to Binh Dinh Province. Have dinner at the local restaurant. Continue to Quy Nhon city. Check-in to the hotel on arrival. The laidback nightlife scene can also be visited for a taste of local Quy Nhon beer. Overnight at Quy Nhon."},{"title":"Day 3: Quy Nhon – Hoi An (B/L/-)","description":"Have breakfast at the hotel then visit two of Quy Nhon’s most interesting historical attractions; Binh Dinh Museum which features galleries that showcase items from ancient and modern history, from Cham sculptures, to the French Colonial Period and the wartime struggles of the Communist Party and Thap Doi Cham Towers, a unique twin tower built by the ancient Cham civilization, which is surprisingly intact after so many years. Have lunch before check-out, come back Hoi An.\n"}]},{"name":"3 Days Sapa - Coc Ly Market from Hanoi","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":270,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n\nVisit some of the best sights in Lao Cai on this three day tour, including; Sapa, colorful Coc Ly hilltribe market and fascinating hilltribe villages.","highlights":["Marvel at the mountains on a scenic boat ride of Chay River","Fall in love with the cultures and traditions of the local people","Discover hidden treasures around Sapa town’s placid streets"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/63992_cd8cf564.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/63992_cd8cf564.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_1ad3b0d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_17943f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_26b33bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_b4fc28d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_62f7eba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_fc4f1af7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_21fdb439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_336a0397.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_445e1439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_57ae0892.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_be80e3b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_adbf9b57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_595b44ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_aaecf730.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_e264ce06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63992_960d29eb.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Cai"],"timeline":[{"title":"Day 1: Sapa, picturesque landscapes and colorful hill tribes (-/L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide, we will start our long trek to discover the life of the minority people. The walk takes you from Lao Chai Village of the Black H'mong Minority to Ta Van Village of the Giay Minority with a stop at the local Catholic Church. Along the way, we will take in the different traditions, cultures and costumes of the Giay and Hmong peoples. Return to Sapa. Overnight in Sapa.\n"},{"title":"Day 2: Coc Ly colorful market (B/L/D)","description":"Enjoy breakfast before taking a scenic two-hour drive to Coc Ly Market. Coc Ly is also a famous cattle market where local farmers from villages in the region sell and by cows, horses, water buffaloes, pigs…, and there is a large ground just beside the main market place for this activity. The market is always crowded for the whole morning and over after lunch time. \nThe traditional beauty of the Hmong, Tay and Nung peoples will amaze you. Then, we will take a 1.5 hour-boat trip on Chay River to see the beautiful mountains that line both sides of the River. We will have lunch on the boat before visiting the Trung Do Village (Tay Ethnic). Arrive in Sapa in the afternoon. Overnight in Sapa. \n"},{"title":"Day 3: End of the trip, full of experiences (B/-/-)","description":"Free day for shopping and discovering Sapa town. \nAs a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. It is interesting \nto buy some presents for your relatives and friends. Check out, transferring to Sapa bus station back to Ha Noi.\n"}]}]