[{"name":"In Love with Vietnam - 7 Great Days","duration":7,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":498,"summary":"Welcom to Hanoi - the capital of Vietnam, get a feel of Hanoi's local culture while seeing the city's highlights and mingling with the locals by visiting some famous temples, pagoda, lakes,... Customers will have a great time to immerse in Hanoi Olf Quarter at night, walk through lots of local restaurant and enjoy street food tour with Vietnamese people.\nObserve stalactites in miraculous form inside Sung Sot Cave (Amazing Cave), one of the largest caverns in Halong Bay. Kayak around the scenic bay, go swimming at Ti Top Island, or even hike up for a panoramic view. You'll find plenty to do in this UNESCO World Heritage area, including cooking classes on board.\nFoot print in Sapa, one of the most famous destination in Vietnam with lots of ethinic group, enjoy freah food, meet local people, do trekking around villages and rice terraces,...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/152805_b61b2cf2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/152805_b61b2cf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_76c6b683.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_2e962db0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_a783f4d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_07f9bdd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_123d9068.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_bccc2738.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_e64c4c9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_96aa9df8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_3d7fe030.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_61c26c48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_5b01aa3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_7e798169.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_122dcb51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_a6bfa28e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_d5f838d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_b543956e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_3b218115.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_4193f117.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_c851bf33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_adae477e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_ac55cad1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_db702f3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152805_99eb9974.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi Arrival – Walking Old Quarter Street Food tour (Dinner)","description":"-\tOur private car would pick you up at Hanoi Internatinal Airport and drop you off at your hotel in the city center. \n-\tCheck in your hotel\n-\tParticipate in the Hanoi Walking Street Food tour by night to experience the Vietnamese local cuisine such as Bun Cha, Pho, Banh Cuon, Egg Coffee, Deserts,....\n-       Tour guide take you back to hotelm and take a rest\n-\tOvernight in Hanoi hotel"},{"title":"Day 2: Legendary Hanoi City full-day - Night train to Sapa (Breakfast, Lunch)","description":"Have breakfast at hotel & ready for the trip at lobby.\n7:45 – 8:30: Tour guide pick up at hotel\n08:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world\n10:15: Visit the Lacquer Paintings workshop – the biggest center in Ha Noi\n10:45: Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45: Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00: Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45: Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15: Tour finishes. It's time to enjoy dinner by yourself\n20:00: We pick you up and take you to Hanoi Railway Station and transfer to Sapa\n20:30: Check -in deluxe cabin and overnight on train to Sapa."},{"title":"Day 3: SaPa arrival – Trekking to Y Linh Ho – Lao Chai – Ta Van (Breakfast, Lunch, Dinner)","description":"5:30AM: Arrive in Lao Cai around, we will take 1 hour van ride uphill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces. Upon arrival Sapa town.\n7:00AM: We have breakfast at the hotel. And relax about 2 hour, you can take a shower.\n9.00 - 9.30: Begin a short walk of 5km along mountain trail to visit Y Linh Ho village which is inhabited by black Hmong tribe and completely secluded from tourists, especially you are able to embrace raw Sapa culture and community by coming into some native houses to discover their own culture and custom as well as study how the local tribe make handicraft from natural materials such as: hemp, indigo…ect. Continuing to walk down MuongHoaRiver where you can take a rest or swim before trekking uphill to Lao Chai village where your picnic lunch will be served. \n13.00: After lunch, you will visit the Day and Red Dzao tribes of Tavan village, which lies in the middle of MuongHoa valley where excellent panoramas of rice terraced fields. \n15h00 – 15h30: There you will have dinner and stay over night at local house.\nAccommodation: Homestay in Sapa with local people"},{"title":"Day 4: Ta Van – Giang Ta Chai – Su Pan – Sapa – Lao Cai ( Breakfast, Lunch, Dinner)","description":"8.00:You have breakfast at the home stay before trekking about 8km towards the Red Dzaovillage of Giang Ta Chai. On the way you will trek up and downhill then through bamboo forest before arriving at the waterfall, Rattan bridge and Stream where you have short rest to swim and picnic lunch. \n14h30 Continuing to walk uphill about 2km to HauThao village where we catch the car to return to Sapa. You are free to discover Sapa town and Market before having dinner then being transferred to Lao Cai train station to catch the night train to Hanoi.\nOvernight on train and get back Hanoi"},{"title":"Day 5: Hanoi Arrival - Halong Bay - Surprising Cave - Sunset Party - Cooking Class (Lunch, Dinner)","description":"5:00AM: Get back Hanoi Raiway Station. We will rent a small hotel where you can take a shower and take a rest before depart to Halong Bay. Please get a taxi to come there.\n8:00AM: Tour guide will pick you up at hotel and depart to Halong\n10:15: Arrive in Hai Duong province, and have 20-30 minute short break.\n12:00: Arrive to Tuan Chau Harbor\n12:20: Welcome to Cruise and Enjoy welcome to drink and get a brief introduction about cruise and safety guidelines.\nCheck- in your cabin with Air-Conditioning.\n12:30: Enjoy a special lunch with Vietnamese traditional dishes, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\nAfternoon Activities:\n15:00: Visiting Sung Sot Cave (Surprising cave). \n16:00: Our cruise will take you to the Titop Island, It is noted for having a viewpoint at its peak which affords splendid views all around Halong Bay or you can enjoy your swimming on romance sandy beach.\n17:15: Come back to Cruise then take a shower, Relax on sundeck, sunset watching in comfortable lounge chairs while drinking a cocktail or reading a book in the most magical moment.\n18:00: Enjoy welcome sunset party and Cooking class. How to make fresh noodle roll, you can enjoy product which you make it. \nEvening Relaxing:\n19:00: Enjoy your dinner when sitting by overlooking sea view window in the night romantic Bay. \n20:30: Playing some sports games like: Squid Fishing, Singing karaoke, or playing puzzle game.\nOvernight on boat: Clean air- conditioning room."},{"title":"Day 6: Halong Bay - Pearl Farm Visiting - Kayaking - Cruising back to Harbor – Hanoi (Breakfast, Lunch)","description":"6:00: Wake up in the early morning to see sunrise on sundeck.\n7:00: Morning view of bay landscape with a cup of tea of coffee. Have breakfast\n7:40: Start visiting Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.\n8:30: Do kayaking to explore Halong Bay\n10:00: Check-out and enjoy a fantastic cruise on the bay.\n10:45: Enjoy the lunch while Cruising back to Tuan Chau Harbour.\n12:00: Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise.\n12:30: Return to Hanoi by shuttle bus.\n14:30: Stopover in Hai Duong province for short break.\n16:30: Arrive in Hanoi and overnight at hotel"},{"title":"Day 7: Hanoi departure","description":"Enjoy your free time in Hanoi before departure time.\nIt's time to say goodbye and thanks for using our service!"}]},{"name":"Vietnam at a Glance – 10 Days","duration":10,"travelStyle":["Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":980,"summary":"This Vietnam vacation package takes us from Hanoi to Ho Chi Minh City (Saigon) within 10  days. The trip covers most of the main attractions in Vietnam including three world heritage sites in Vietnam. It covers from the stately Hanoi, the magnificent Halong Bay, the former capital city of Hue, the charming Hoi An ancient town, the bustle & hustle Ho Chi Minh City (Saigon), the waterway of Mekong Delta and the legendary Cu Chi Tunnel.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150571_7cae0bd7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150571_7cae0bd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_3212b887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_900074a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_e17d9420.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_d210f8a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_b6db747e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_b01b5f46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_83447220.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_13c09d1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_e72dff4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_a96fd3b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_6167afec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_32a6c802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_3efc6842.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150571_80074c66.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you"},{"title":"DAY 2: HANOI CITY TOUR","description":"Today, we will spend a full day to visit the city. We start with visit to President Ho Chi Minh's mausoleum and residence. We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university\nAfter lunch in a local restaurant, we go to the Museum of Ethnology, which is an excellent museum containing the ethnic costumes of the various minorities of Vietnam, as well as relics, tools and even full size replicas of their homes and buildings. Back to the hotel.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hanoi"},{"title":"DAY 3: HANOI - HALONG BAY - NIGHT ON BOARD","description":"8h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break\n12h00: Arrive at Tuan Chau wharf – Break and photography time\n12h30: Board the Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the bay\n15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen.\n16h30: Enjoy kayaking or swimming (if the weather permits).\n17h00: Back on board and continue cruising.\n19h00: Dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner\n Accommodation: Night on board"},{"title":"DAY 4: HALONG BAY - HANOI - FIGHT TO DANANG","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 5: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 6: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"Free in the morning.\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\nNote*: The train journey is part of a great local experience. Restrooms at either end of the carriages.\n Meals: Breakfast\n Accommodation: Hotel in Hue"},{"title":"DAY 7: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel.\nToday, we will spend a full day touring Hue city. \nIn the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant. \nIn the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village\nThen airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 8: SAIGON CITY + CU CHI TUNNELS TOUR","description":"Pickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon.\nIn late afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 9: SAIGON – MEKONG ADVENTURE","description":"07:40am - 8:10am Pick you up at your hotel and depart for Ben Tre.\nAfter arriving at Ham Luong dock, board the boat & cruise along Ham Luong River, a tributary to the Mekong River. The cool breeze from the river and lush tropical islands along its banks will immediately get you excited to explore all the great things ahead.Arrive and visit various local workplaces to find many wonderful examples of how local people use ageless techniques to create their crafts, including activated charcoal, dried coconut, handy coconut husk brooms, and many family businesses using coir, or coconut fiber, to create amazing art. Drive around the village roads by “Xe Lôi”, the local vehicle, which is a kind of motorized rickshaw.\n\nPerfect your day with a delicious and filling lunch at a local host house.Break time, treating yourself to a relaxing time to relish the beautiful countryside or cycling around the village. Visit the local fruit plantation, enjoy seasonal fresh fruits, and spend time relaxing while being rowed in a small boat slowly through the natural canals to get a sense of how truly beautiful this area is.Embark on the sampan and return to the dock. Travel back to Saigon.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 10: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Vietnam Vacation From Hanoi in 9 Days","duration":9,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":629,"summary":"The most beautiful and stunning view and landscape from North down to South Vietnam will appear on your eyes. As a Pearl in the North, Halong Bay will be in touch while cruising. Giant Hai Van pass will be viewed from the train. In the busy society, however Hoi An old town is as a quiet and peaceful town where you can take off the modern city. Floating lives in famous Mekong River will be in your photo what is different from other in the World.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117745_bcb5b130.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117745_bcb5b130.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_d181a2a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_d256e0f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_95057b60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_2e5154a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_17699549.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_4920432c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_eb29e7fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_7608744a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_34b6d11e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_6a82ade3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_8c823ad8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_853a133c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_8ce6af03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_3c4f6949.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_afb691cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_16c8dfef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_aeed1be2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_ec76eb2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_355e2e99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_537d69f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_90f9438c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_2727bc82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117745_5867e2dc.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival – Pick-up at the airport – Hotel check-in (Meal:No)","description":"Welcome to Hanoi city. Our driver will pick you up from Noi Bai airport and transfer you to the hotel in Hanoi old quarter. \nAs the heart of the capital of Vietnam – Hanoi old quarter is the most interesting place where you can taste a lot of local street foods, experiencing the local lives, culture, tradition..ect. Take a visit Temple of Literature – Known as “First University of Vietnam”, Dai Nghien “ Ink Stand”, Ngoc Son temple “ The Jade Mountain temple” on Hoan Kiem Lake…Having a Cyclo visiting around the old quarter.\nOptional: Hanoi Street Food Walking tour, Water Puppet Show\nNote: Hotel check-in time: 13:00\nOvernight at hotel in Hanoi\n"},{"title":"Day 2: Hanoi – Halong Bay – Overnight on cruise (Meal: B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise"},{"title":"Day 3: Halong Bay – Kayaking – Hanoi (Meals: B, L)","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast and tasting Tea & Coffee\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\n"},{"title":"Day 4: Hanoi – Overnight train to Da Nang (Meal:B)","description":"Today, you take your own time to explore Hanoi old quarter until the transferred time to Hanoi train station to Da Nang.\nTrain takes about 16  hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOptional: Hoa Lu – Tam Coc – Cycling 1 Day trip\nOvernight on the train"},{"title":"Day 5: Da Nang arrival – Hoi An (Meal:No)","description":"On the train, you can see the beautiful Hai Van Pass in the morning. The stunning and breathtaking landscape along the rail way, offer you the opportunity to take a lot of nice photo.\nOur driver meets you at Da Nang train station and transfer you to Hoi An. \nLeisurely walking under the lanterns on Hoi An old town, seeing the simple and friendly local lives, breathing the pure air, tasting a coffee cup on Thu Bon river…\nOvernight night at hotel in Hoi An"},{"title":"Day 6: Hoi An – My Son Hollyland (Meal:B,L)","description":"7:45 – 8:30: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide. \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon river. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip! \nOvernight at hotel in Hoi An"},{"title":"Day 7: Hoi An – Flight to Ho Chi Minh city (Meal:B)","description":"After breakfast, you should do walking around to feel the quiet and peaceful atmosphere in the old town. Or going to any tailor shop to make a lovely costume.\nMeeting to driver and going to Da Nang airport for flight to Ho Chi Minh city.\nHo Chi Minh arrival, our driver will welcome and transfer you to the hotel in the central of Ho Chi Minh city. Visiting the biggest city in Vietnam and explore the busy lives as the Western one.\nOvernight at hotel in Ho Chi Minh city.\nOptional: HCM cooking Class\n"},{"title":"Day 8: Mekong Delta Full Day Tour (Meal:B,L)","description":"7:30-8:15 am: Tour guide and driver will pick you up at your hotel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City\nOvernight at hotel in HCM city"},{"title":"Day 9: Ho Chi Minh city Departure (Meal:B)","description":"After Breakfast, feeling your own time with locals. Visit HCM city until the transferred time to the airport for the flight out.\nIf you are not ready to leave, please let us know to help you extend your travel in Vietnam\nPlease note: Hotel check-out time: 12:00\nNote: This is group joining, there is a different group each day trip during your vacation.\nIf you are Solo traveller, you will stay at Share Dorm Room at the hostel during your vacation.\nWho should participate? - This tour is suited for all, including children as well.\nPrice structure: - Price quoted is based on per person basis. \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!"}]},{"name":"Private tour: 5-day Explore Hanoi - Hoa Lu - Halong highlights","duration":5,"travelStyle":["Sightseeing","Family","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":598,"summary":"Full with experiences for 5 days in Vietnam\nOnce you have chance to visit Vietnam, you should make use of it to explore the whole beauty of the most famous destinations in this pretty country. Hanoi, Hoa lu and Halong are some of the highest recommended destinations in northen Vietnam. This 5-day tour is designed to cover the highlights of these wonderful places and help you have unforgetable experiences in VIetnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/127408_74181faf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/127408_74181faf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_874dcbff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_3e3823c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_afe93ab6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_2f5422e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4cf978c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4fed30e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_83373cee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_2aed85a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_de26c257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_e79bffd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_0d2ff1cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_29a717c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_ca5b7757.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_4b45ef9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_380cfb2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127408_377b5202.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival- Hanoi Street Food tour on Foot","description":"Hanoi Arrival\nArrive in Hanoi. Greeted by your guide and driver at the airport. Transfer to your hotel in the city centre for check-in and relax. In the afternoon, you will have a street food tour on foot.\n\nExperiences with local foods\nHanoi is one of the world’s greatest street food cities and there’s no better way to unlock the hidden secrets of the Old Quarter and its cuisines than through this unique walking tour. \nIt will be great when you have a local guide to help you explore local foods in Hanoi.\nAccommodation : 3 star hotels in Hanoi likely ANGLE PALACE HOTEL or Similiar"},{"title":"Day 2: Hoa Lu - Tam Coc Rowing - Mua Cave Exploring(B,L)","description":"Visiting the first capital of Vietnam, sailling a boat along river, hiking to the peak of Mua Cave\nAt 8 a.m: Our PRIVATE tour guide will meet you at your hotel in Hanoi Old Quarter. Then you're on way to Ninh Binh.\nAt here, you'll enjoy a visit to the two remaining old temples of the Dinh and Le king. Learn about the history of the countries foundation of the Great Viet after being liberated from thousands of years of Chinese domination.\nNext, start your biking trip. You'll cycle along rural paths towards Tam Coc, three tunnel grottoes until you reach Tam Coc. \nHere you will stop to enjoy lunch in Tam Coc.\nAfter lunch, take a three-hour boat trip meandering along the canals (two people per boat) throughout the three tunnel grottoes called “ Tam Coc”. Enjoy the landscape of green rice field among mountains and rain forest of the National Special Preservation zone. After that, we go back Tam Coc town.\nAccommodation: Overnight in Bungalow in Tam Coc Town"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Exploring the Suprising Cave, Hiking to Titop Island, Sunset Party\nAfter an early breakfast at your hotel, relax on the private car to Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. After Check in Halong Bay Cruise:\nAt lunch around 12:30, you will have a lunch on a cruise \nIn the afternoon: Visit Amazing Cave in Halong bay  and Go to Titop island for hiking, swimming \nIn the early evening :Having dinner with an authentic Vietnamese menu on Cruise Overnight on Halong Bay Cruise.\nAfter dinner, reward yourself with a large selection of cocktails at our bar or take for you one of our onboard activities: book reading, games, movies, and squid fishing....\n.Accommodation: overnight on a cruise likely Cozy, Apricot or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi (B,L)","description":"Taichi-Kayaking, Swimming, Cooking demonstration\nAt 6.30 a.m: Wake up at sea, and take a swim or Taichi, which helps focus the mind and condition the body.\nThen at 7am-8am, local breakfast is served. \nAt 8am: Mingling yourself in the stunning views of the Bay and it's dramatic limestone islets. Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\nAt 9.15: Check out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\nAt 10am: You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\nAt 12am: Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus and return to Hanoi.\nArrival back at your hotel approximately 16:30\nAccommodation: 3-star-hotels in Hanoi likely ANGLE PALACE HOTEL or Similiar"},{"title":"Day 5: Hanoi departure( B)","description":"Free and easy to explore Hanoi till airport transfer for departure flight. Trip ends."}]},{"name":"Amazing Vietnam 10 Days 9 Nights Tour From North Central To South","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":1062,"price":850,"summary":"Vietnam Travel Top is proud to offer you the best of the best deal to discover my beautiful country. Vietnam tour 10 days 9 nights from North to South included flight and train tickets. Destination covers Hanoi, Halong bay, Da Nang, Hoi An, Ho Chi Minh city, Mekong delta, Cu Chi Tunnel. All of hotel we select is top ranking on Tripadvisor and guarantee satisfaction ! Let’s book and enjoy your holiday! Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["An amazing itinerary with all activities included","Enjoy a cruise on Halong Bay, a UNESCO World Heritage Site","Explore limestone cliffs and caves in Halong Bay","Kayak through the emerald waters of Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9daf9f1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9daf9f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ddad92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ddcb06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9dde925.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de0463.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de2573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de41b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de603b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de7a42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9de9718.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9deb309.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9ded2e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e118a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e13a36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e15b8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e174ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e1e7f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147360_5e22cc9e24b3c.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Vinh Long"],"timeline":[{"title":"Day 1 Hanoi - airport pick up - Check in hotel in Hanoi (Meal: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nNote: Check in time is 13:00 P.M."},{"title":"Day 2 Hanoi - Halong Bay - Overnight on Cruises (Meal: B, L, D )","description":"Morning:\nShuttle bus picks you up from your hotel at 8:00am. Enjoy a scenic drive to Halong Bay with lush green paddy fields and romantic rivers. Embark on Cruise by noon for a short cruise briefing and check-in.\n\nAfternoon:\nSavour a delectable lunch as Cruises amongst the limestone islands. In the afternoon, we will stop at Surprise Cave, the most impressive cave in Halong Bay. Climb up the stairs and be thrilled by what Mother Nature has crafted here. Later return to main boat and continue cruising further into the Bay to Titop Island.\nHave a shower to relax then you can join us in our cooking class in the dining room or sunset party on sundeck. For the rest of the night, socialize with other guests, fish for squid, or just laze around. Overnight on board."},{"title":"Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meal: B, L )","description":"Start your day with morning Tai Chi exercises a photo hunt on the sundeck.  Have a light breakfast with coffee and tea and cake then head toward the Luon Cave. Come back to the ship and check out of your cabin while the farewell party is ready at the dining room. Passing famous sites like Ba Hang Fishing Village, Dog Islet on the way back to Ha Long Harbour. "},{"title":"Day 4 Hanoi Free day – Train station transfer- Night train to Da Nang (Meal: B )","description":"Today, you are free to visit Hanoi Old Quarter, see the water puppet show until transfer to Hanoi Train Station for solf – Sleeping train to Da nang. Time you need to spend on the train is around 13 hours. On the train you can view our beautiful country along the coastal line. You also stay overnight on the train and reach Danang train station at around 10.30 am"},{"title":"Day 5 Da Nang pick up - Check in hotel in Hoi An town (meal: No)","description":"Train arrive on the next day. We will pick up and transfer to Hoi An Ancient town. Check in hotel in the ancient town and relaxing."},{"title":"Day 6 Hoi An - My Son day tour (Meal: B,L)","description":"7:30 – 8:00: The bus and tour guide pick you up at your hotel 8:30 : Leaving Hoi An  for My Son HolyLand.\n9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa  Kingdom with our tour guide.\n12.00: Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!."},{"title":"Day 7 Hoi An - Airport transfer - Flight to HCMC- Pick up- check in Hotel (Meal: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City."},{"title":"Day 8 HCMC - Mekong delta - Cai Be Floating Market - Vinh Long tour (Meal: B, L )","description":"08:00 Picking up from hotel/stay.\n08:15 Starting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30 Start the motorized boat to visit the Cai Be Floating market, experience how people exchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn.\nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature.\nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30 Arrive in your hotel."},{"title":"Day 9 HCMC - Cu Chi tunnel tour (Meal: B )","description":"08:30 Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n12:00 Back to Ho Chi Minh City\n13:20 Arrive in your hotel in Ho Chi Minh City."},{"title":"Day 10 HCMC - Airport transfer - end the trip (Meal: B )","description":"This day you are free to visit Ho Chi Minh City and shopping for souvernirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends. "}]},{"name":"Short Northern Vietnam packages 6Days/5nights","duration":6,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":585,"summary":"Start and end in Hanoi! With the Adventure tour Short Northern Vietnam packages 6Days/5nights, you have a 6 days tour package taking you through Hanoi, Vietnam and 5 other destinations in Vietnam. Short Northern Vietnam packages 6Days/5nights includes accommodation in a hotel as well as an expert guide, insurance, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128179_ff337029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_54040105.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_270bbbb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_ae16d885.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_b7818dc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_47413246.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_096bda65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128179_d4f64ff2.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Cai","Cat Cat Village","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival – Night train to Sapa (No Meal)","description":"You will be greeted at the airport and transferred to down town. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day is yours. \n\n\nIn the evening: Bus and guide will pick up again then transfer to Railway Station to catch night train to Sapa. Overnight on the train."},{"title":"Day 2: Lao Cai –Lao Chai –Tavan Village (B/L/D)","description":"5:30 – 6:30: Pick up at Lao Cai train station by our staffs then drive to Sa Pa by bus.\n\n\n7:00 -8:00: Have breakfast and relax at hotel. If hotel has avaiable room, you can check in early, if not, you join in tour first.\n\n\n9:00 – 9:30: Our guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van village. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12 kms.\n\n\n17:00 When you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.\n\n\nDinner and Overnight in hotel.Overnight in Sapa."},{"title":"Day 3: Sapa- Cat Cat village- Sin Chai - Ha Noi (Meals: B/L/D)","description":"7:00 Have breakfast.\n\n\n9:00 – 9:30 Our guide takes you to visit a village of Black H’mong people.It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French ( This activity take 2 hours walking up and down to the valley ). \n\n\n12:30 -13:00:Back to SaPa town and have lunch.You are free and easy to discover Sapa town.\n\n\n16:30 – 17:00: Transfer from hotel to Lao Cai train station. Have dinner at the restaurant, near the train station before getting on the night train to go back to Ha Noi.\n\n\n Overnight on the train."},{"title":"Day 4: Hanoi – Halong Bay (B/L/D) – Golden Star Cruise","description":"07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi Opera House then depart to Halong. On the half way stop for short break about 20 minutes.\n\n\n12:30 Arrive Ha Long International Port, then tranfering to Golden Star Cruise by small boat. Enjoy welcome drinks, crew briefing before checking in cabin. Start cruising and enjoy a special lunch with Vietnamese traditional dishes while the boat slowly slides on romantic \n\n\n15:30 Visiting Sung Sot Cave (surprising cave)\n\n\n16:30 Our cruise will take you to the Titov Island, it is noted for having a viewpoint at its peak which affords splendid views all around Halong bay. Or you can enjoy your swimming on romance sandy beach.\n\n\n17:30 Enjoy the Sunset party with wine and fruit and relaxing on sun deck \n\n\n18:00 Cooking class how to make fresh noodle roll, you can enjoy product which you make it.\n\n\n19:00 Enjoy your dinner in restaurant in middle romantic quite bay.\n\n\n20:00 Playing some sports games like: Football table, Darts, Fishing, karaoke, dancing…"},{"title":"Day 5: Halong Bay – Hanoi (B/L)","description":"06:30 Wake up early to see the sunrise on Ha Long Bay then have breakfast with tea and coffee free\n\n\n08:00 The boat cruising to Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years. \n\n\n09:00 Enjoy kayaking discover Halong bay. Then back to Cruise check out, take time to relax\n\n \n11:00 Have lunch while the boat is cruising back to Tuan Chau International Port, \n\n\n12:30 Get on the bus back to Hanoi, on the half way stop for short break 25 minutes\n\n\n16:30 - 17:00 Arrive at the hotel in Ha Noi old quarter and Hanoi Opera House.\n\n\nOvernight in Hanoi"},{"title":"Day 6: Hanoi - Departure (B/L)","description":"Breakfast at hotel. Free time to explore Hanoi by yourself until driver take you directly to the airport .\n\n\nEnd of trip!"}]},{"name":"Hanoi, Halong & Sapa - 6 Days","duration":6,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":360,"summary":"Get HUGE DISCOUNT for staying 3 nights Superior room at The Hanoian Hotel, 1 night on Board the World Nature Heritage Halong Bay and 1 night on Heavenly Sapa Plus FREE 1 hour cyclo trip or water puppet show.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138202_245d3385.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138202_245d3385.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_871e3af7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_1b0fb8df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_69a85984.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_03a05c86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_4901df6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_3ab0598a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_cca71c2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_32a1751f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_c4547009.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_9ed0e3aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_e7359124.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_fc631c1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_484a700c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_075ad5a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_7891b1d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_c423ca54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_4a18f520.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_81924436.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_ddb2ae61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_34320d86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_341fe396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138202_d59c865a.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Pick up at airport. Stay 01st night in Hanoi at 3 star hotel (Superior room)"},{"title":"Day 2: Hanoi - Halong Bay","description":"Have breakfast, check out and be ready at lobby by 8am for pick up by shuttle bus for 2 days 1 night trip in Halong Bay with Deluxe Cruise ( 3 star Cruise )\nStay 02nd night on Board. (Deluxe room)"},{"title":"Day 3: Halong - Hanoi","description":"Return from Halong Bay, enjoy the FREE 01 hour cyclo trip around the famous Hanoi Old Quarter/ Water puppet show. Stay 03rd night in Hanoi at 3 Star Hotel (Superior room)"},{"title":"Day 4: Hanoi - Sapa","description":"Have breakfast, check out and be at lobby by 6h50am for pick up to  Sapa 2 days 1 night trip by bus. \n\nArrive to Sapa by noon for lunch, easy trekking trip in small group, back to hotel for dinner and stay 4th night at Standard room on the best 3 star hotel the either Vista/Panorama hotel "},{"title":"Day 5: Sapa - Hanoi","description":"Have breakfast, check out and be pick up at 9am for continue trekking in small group. Finish trekking in afternoon, back to hotel to fresh up and take bus back to Hanoi. Arrive to hotel in Hanoi by 9h30pm. Stay 5th night at in Hanoi at 3 star hotel (Superior room)"},{"title":"Day 6: Hanoi Departure","description":"Free time for shopping. Check out. Our car brings you to the airport. Trip ends. "}]},{"name":"Adventures from Hanoi to Hoi An 7 days 6 nights","duration":7,"travelStyle":["Sightseeing","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":746,"summary":"Seven legendary days from Hanoi to Hoi An. Immerse yourself in the local culture, culinary delights and scenic landscapes on a journey through rural Vietnam. Mr Linh's Adventures has  been designed by travellers for travellers. It showcases some of the most spectacular “off  the beaten track” destinations while keeping a fun and relaxed atmosphere, all being enjoyed with a bunch of like minded souls.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/106717_e7042ef3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/106717_e7042ef3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_e4b49132.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_351c9999.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_4b9ef8d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_d9380140.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_793e5b44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_26b13def.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_7fbafc48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_df7d4396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_a9fa5ad8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_c0016dcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_fab492a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_aee7da5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_89c19e8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_c9f05d56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_dd97ebc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_e81298db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_bf6956f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_45bf649f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106717_543cae35.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An"],"timeline":[{"title":"DAY 1 HA NOI - HA LONG - NINH BINH (L/D)","description":"After breakfast, you will start the tour by heading to Ha Long Bay, an iconic and beautiful spot designated as a UNESCO World Heritage Site. Here we set out on a sailing boat for an exploration of the Bay and the many wonders within. \n\nThis exciting 4-hour cruise provides a fantastic view of the bay which is dotted with some 3,000 limestone islands rising amazingly from the clear and emerald water. These limestone karst formations are littered with beaches, grottoes and beautiful caves. Along the way we will anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath the towering cliffs. \n\nAfter your exploration of Ha Long Bay, we will transfer you to Ninh Binh, making sure you have the chance to take in the beautiful scenery along the way. Once in Ninh Binh you will be ped off at your hotel and the rest of the evening is yours to spend at your leisure."},{"title":"DAY 2 NINH BINH – NIGHT TRAIN TO DONG HOI (/L/D)","description":"Today, you will have a chance to visit a natural wonder just as impressive as Ha Long Bay. About 150 kilometres from the famous Vietnamese bay is another equally as impressive landscape. This one, known as Trang An, is nowhere near the coast though, and the mountains are connected by rice paddies, not water. After enjoying a delicious lunch, we will take a boat up the beautiful river fed by natural springs, through caves that bisect amazing limestone karst mountains to visit an Ancient 10th Century pagoda and temple.\n\nAfter our visit to the Pagoda and Temple, it’ll be great fun to hop on a bike for a trip to Thung Nham Bird Garden. The route to the garden is a quiet one, consisting of flat roads and dams set to a back of stunning scenery. In total the round-trip is roughly 10 kilometres long.\n\nAfter all this activity you might feel a bit damp, so we’ll take you back to the hotel where you can enjoy a shower and get cleaned up, before boarding the overnight train to Phong Nha-Ke Bang National Park.\n\nFollowing this, we will have dinner and a shower in central Ninh Binh town before boarding the overnight train to Phong Nha­Ke Bang National Park."},{"title":"DAY 3 PHONG NHA NATIONAL PARK (B/L)","description":"Phong Nha­Ke Bang is one of the largest National Parks in Vietnam and is home to a huge amount of wildlife, breath-taking scenery, crystal clear rivers and immense cave systems. \n\nA documentary by National Geographic has given this area much attention with the discovery of Son Doong, the world’s largest cave, in the early 1990’s. Our first stop is Eight Lady Cave which is named for the eight women working on the Route 20 highway who died from a bomb attack that caused a massive rock to seal off the exit, trapping them inside. Then we move on to Paradise Cave, one of the most beautiful and famous caves in Phong Nha stretching for more than 30 kilometres and featuring hundreds of incredible rock formations.\n\nAfter lunch we visit the awesome Dark Cave by zip line or kayaks for the slightly less adventurous. With only a head torch to light our way, we will navigate through the darkness to the mud baths where you can either relax and soak up goodness, leaving you with baby smooth skin, or have some fun with a classic mud fight! Afterwards you can take a refreshing dip in the lake and wash all the mud away."},{"title":"DAY 4 PHONG NHA NATIONAL PARK (B/L)","description":"After so many great activities the day before, this day is free for you to cycle around & explore the town, check out the local life by the river or just chill out. We will take you on a short but bumpy ride through the villages to and from the homestay if needed."},{"title":"DAY 5 VINH MOC TUNNEL (B/L)","description":"Vinh Moc is a tunnel complex in the Demilitarized Zone (DMZ), built to shelter families from the intense bombings of the area during the American war. Over 600 people lived here and 17 babies were even born in these tunnels between 1965 and 1972. \n\nAfter lunch we will visit the Mine Action Visitors Centre in Dong Ha, which examines the effects of the war that persist to this day, even after hostilities ended over 40 years ago in 1975. After this you will arrive in Hue, and discover Thien Mu pagoda which rests on the banks of the perfume river. This is actually the tallest pagoda in Vietnam, featuring 7 tiers reaching for the sky, each level representing one step of the path to enlightenment.\n\nYou will then spend the rest of the evening and night in Hue.\n"},{"title":"DAY 6 HUE CITY TOUR AND BEACHES (B/L)","description":"After breakfast, our tour guide will take you to the Imperial Citadel. The structure and its majestic architecture, built by Gia Long, sadly suffered extensive damage during the years of fierce conflict which took place here. These scars provide an extra layer of history, telling a tale of the decades of fighting long past.\n\nWe will continue your trip into the past by visiting Minh Mang Tomb, the final resting place of the 2nd emperor of Vietnam. This tomb is special in the way its architecture blends seamlessly with its surrounding landscape (a result of Minh Mang’s staunch belief in Confucianism). Following this, you can hop back on the bus and we’ll take you to the local beach to enjoy some lunch and cocktails as we swim and enjoy the sunset. This hidden gem is a great way to cap off an eventful day."},{"title":"DAY 7 HAI VAN PASS – HOI AN (L)","description":"We will depart Hue in the morning, riding motorbikes all the way to Hoi An. There will of course be many stops along the way to let you appreciate the beautiful beaches and coastline and enjoy the breath-taking Elephant Springs. Make sure you have packed your swimming gear as this is a great place to relax, swim and enjoy lunch for a couple of hours. \n\nThe journey then heads south to take in some breath-taking views as we ascend the famous Hai Van Pass where we will stop at the top to see some French and American bunkers, remnants of the past war. This road, made famous by the Top Gear motoring programme, is a site that simply cannot be missed.\n\nOnce you arrive in Hoi An the rest of the day will be free for you to spend at your leisure exploring all that the ancient town has to offer.\n\nAnd this will be where your Adventure tour of Vietnam ends. If you feel like you haven’t had enough and want to continue further south, consider booking an extension!"}]}]