[{"name":"Getaway Vietnam Tour from Hanoi via Phong Nha cave, Khe Sanh, Hue, Hoi An to Saigon & Mekong Delta","duration":15,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2174,"summary":"This 15-day Vietnam Vacation Tour from Hanoi to Saigon takes you to hidden charms of Hanoi , Halong Bay … and nice coast with world heritages in Central then visit beauties of Mekong Delta.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170902_aad0f8f9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170902_aad0f8f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_f4585e75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_a5febc2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_38441d29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_ee24e3e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_31673fbf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_8d25d538.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_4bf1047d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_00d9ddf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_6aa74180.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_c1c9db58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_a0a6ef64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_4a185362.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_344ac679.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_a7d1312e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_81411b1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_17a09c8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_7fd65ffb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_d8fe11d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_70c6172f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_c3caa73b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_9a4d380e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_6408c304.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170902_7b93fda5.jpg"],"destinations":["Hanoi","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: ARRIVAL – HANOI","description":"Upon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in. The rest of time, you’ll be free on your own.\nO/N in Hanoi."},{"title":"DAY 2: HANOI CITY GROUP TOUR (B/L/-)","description":"Today you’ll be on a full day tour to discover the most outstanding attractions of Hanoi. Beginning with a visit to Ho Chi Minh’s mausoleum. This imposing monument, dedicated to the father of modern Vietnam, was constructed from marble and granite and takes the form of a stylized lotus (closed Mondays and Fridays). Located nearby is Ho Chi Minh’s house on stilts and the One Pillar Pagoda, a symbol of Hanoi. Continue your tour with a visit to the Temple of Literature, or Van Mieu, a structure dedicated to Confucius. Constructed in 1070, the compound soon became the first Vietnam’s university.\nEnjoy your lunch at a rustic restaurant Cha Ca La Vong which was founded more than 100 years ago and was the first restaurant in the city to serve Cha Ca – grilled fish. This is undoubtedly good introduction of the local food and great place to fill up your empty stomach to get you ready for the afternoon excursion.\nAfter lunch, stroll down the streets and try café Trứng—egg coffee at Café Giang, 39 Nguyen Huu Huan Street, about a 10-minute walk from the restaurant.\nBoard a “cyclo”, the traditional bicycle rickshaws for a leisurely ride, which is a perfect chance for photo taking and slow-moving sightseeing. Disembark at the Thang Long Water Puppet Theater for a unique traditional art form and expression of cultural identity. The shows capture Vietnamese traditions; farming, tending buffaloes, and catching fish; entertainment, like swimming contests and lion dancing; and historical legends with traditional music. The one-hour show is a fun and insightful look into Vietnamese culture enjoyed by both adults and children.\nO/N in Ha Noi"},{"title":"DAY 3: HANOI – GROUP TOUR TO HALONG BAY – OVERNIGHT ON CRUISE (B/L/D)","description":"07:30     Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30    Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager.\n13:30    Great lunch is served while cruising passing by islets.\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises."},{"title":"DAY 4: HALONG BAY – SUNG SOT CAVE – HANOI – FLIGHT TO DONG HOI (B/L)","description":"06:15    Tai Chi class on the Sun-Deck.\n07:15    Have light breakfast with Coffee, tea, and bakeries on board.\n07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45    Brunch is served.\nAfter brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina.\nOn the way, you’ll be transferred to Noi Bai Airport for a flight to Dong Hoi on VN123 (18:00 – 19:00).\nUpon landing at Dong Hoi airport, our local guide & driver will be welcoming then escorted to your hotel for a check-in.\nFree time to stroll around this charming beach city by night.\nO/N in Dong Hoi."},{"title":"DAY 5: DONG HOI – PHONG NHA CAVE – THIEN DUONG CAVE (B/L/-)","description":"After having breakfast, you’ll be picked up by our guide and driver to continue your cave discover tour at Phong Nha & Thien Duong caves which are the two most famous caves in Phong Nha Ke Bang National Park. It was listed in UNESCO’s World Heritage Sites in 2003 for its geological values. Both of them have created a special attraction for the “Kingdom of the caves”, Phong Nha Ke Bang National Park. Nowadays, there are a lot of tourists not only domestic but also international coming to visit and admire their beauty. If you are a person who likes exploring caves, Phong Nha is really an ideal place for you.\nUpon reaching Phong Nha wharf, we’re quickly getting on a boat trip to go up romantic Son river to explore splendid beauties of Phong Nha Cave that has been regarded by British Cave Research Association as the top cave in the world due to its 4 top records: the longest underground river, the highest and longest cave, broadest and most beautiful fine sand beaches inside the caves, the most spectacular stalagmites and stalactites. Once you reach at the entrance of cave, you will feel like you are entering in the mouth of mountain.\nAfter having lunch, we’ll keep on our journey to the Paradise Cave which is one of the most famous cave in Viet Nam. It has 31.4km length, with many beautiful stalactites and stalagmites. British Caving Association has been evaluated as the most beautiful and longest dry cave in Asia. It has been creating continuously by the nature over 350 million years. It was ranked at international level in terms of science and high aesthetics. It is waiting you to discover and enjoy.\nBy the end of the day, you’ll be lazing on the bank of river for cold beer.\nOvernight in Phong Nha."},{"title":"DAY 6: PHONG NHA – HIEN LUONG BRIDGE – BEN HAI RIVER – VINH MOC TUNNEL – TA CON AIRPORT – DAKRONG BRIDGE – KHE SANH (B/-/-)","description":"In this morning, after having breakfast, our tour guide and driver will pick you up at your hotel in Phong Nha to visit the DMZ (Demilitarized Zone).\nWe’ll keep on following along the highway 1A, en route our guide will provide you so many useful information relating to the history of war between Vietnam & US and our first stop would be at Hien Luong Bridge, Ben Hai River – which marked the former border between North and South Vietnam from 1954 to 1972. Next stop is to visit Vinh Moc tunnels – a network of tunnels built by villagers seeking shelter from bombings during the American War, this is the place where an entire village lived and fought for two and a half years. Later on, before having lunch (Your own account) at Dong Ha town, we’ll take a visit to the Mine Action Visitor Center where provides an excellent historical overview – in English and Vietnamese – with photographs of the 1972 destruction of Quang Tri Citadel and of people attempting to deactivate mines with bamboo sticks. A newer display details the tragic legacy of the defoliant Agent Orange.\nLeaving Dong Ha Town, we will go ahead to Khe Sanh town. On the way, we will stop to visit Dakrong Bridge which was rebuilt in 2001 and bears a marker hailing its importance as a conduit for the Ho Chi Minh Trail (NR 14). Then we move to Ta Con airport to see the things in nature of the fierce war, and how hard Quang Tri people fight against the enemy. And finally enter to Khe Sanh combat base – one of the most famous sieges of American Vietnamese War and was the site of a United State base that fell under attack in early 1968 before check in hotel in Khe Sanh.\nO/N in Khe Sanh."},{"title":"DAY 7: KHE SANH – HUE – HUE ANCIENT CITADEL (B/-/-)","description":"After breakfast at the hotel, we’ll continue driving along the West Truong Son road to Hue City and you will have chances to witness big changes of this region after the war ended and sometimes we can stop by nice places to meet the local hill tribes (Paco, Van Kieu) to understand more about their daily life as well as shoot nice photos with spectacular landscapes on the roadsides, we will arrive Hue after your lunch-on time and free by your own time.\nO/N in Hue City."},{"title":"DAY 8: HUE CITY TOUR (B/L/-)","description":"This morning, after breakfast at the hotel, our guide and driver welcome you at hotel and start day trip to explore Hue Imperial City. This morning, you will start your tour by making a dragon boat trip on Perfume River and enjoy the fresh atmosphere of Hue. Visit the famous Thien Mu Pagoda upon arrival at the dock to discover Buddhism in Hue. \nThen you will be transferred to visit the Imperial City (Citadel), the Royal Palace of Nguyen Dynasty. Explore the glory history and stunning architecture inside this complex. Next, you are free to go shopping at Dong Ba Market, you can also discover the interesting local life here while looking for souvenir for friends and family. Have lunch at the restaurant.\nAfternoon is the time for Nguyen Emperors’ Mausoleums. You will have chance to visit two of three most famous tombs. Visit Khai Dinh Mausoleum to admire the spectacular architecture which was influenced by Oriental and Western styles. Then visit Minh Mang Mausoleum and discover its traditional style with a peaceful atmosphere. Back to Hue city and end tour at your hotel.\nO/N in Hue City."},{"title":"DAY 9: HUE – DA NANG – HOI AN TOUR (B/-/-)","description":"Today, at 8:00am, our guide and driver welcome you at hotel in Hue and transfer you to leave Hue city for Hoian. You will be driven along National Highway No1 and see more of beautiful landscapes of rice fields, Cau Hai Lagoon, local villages. You will have chance to see Lang Co beach – one of the most beautiful beach in Asia to enjoy nice view.\nNext, you will see the spectacular view of Hai Van Pass through windy road to the summit. From here the panorama of Lang Co Beach, Da Nang city is under your eyes. It is the ideal spot to take wonderful photos of forest and mountains. Arrive Da Nang, you will discover Da Nang city including Cham Museum where shows the collection of Champa sculptures to learn more of Cham culture and then Marble Mountain which is well known as Five Mountains to visit and discover pagoda, cave and view of Da Nang city from the summit. You arrive in Hoian in the early afternoon around 2pm. Tour end at hotel.\nO/N in Hoi An."},{"title":"DAY 10: HOI AN SIGHTSEEING – MY SON TOUR (B/-/-)","description":"In the morning, you will have breakfast at the hotel and then make a visiting to My Son Sanctuary to explore the Ancient Champa Kingdom and its spectacular culture. Here is the chance for you to enjoy Apsara traditional music show. Then you will be back to visit Thanh Ha ceramic village. You have chance to try to make a product under the guidance of workshop owner, receive a little gift called To He before leaving. Take the boat on Thu Bon River back to Hoi An Ancient Town. Have lunch at restaurant.\nThis afternoon you will make a walking around old streets to discover the charm of Hoi An Ancient Town including Japanese Covered Bridge, Chinese Assembly Halls, Sa Huynh Museum, old houses and the local market… Hoi An is an ideal for shopping and making tailor with reasonable price.  Drop you off at your hotel in Hoi An and end tour.\nO/N in Hoi An."},{"title":"DAY 11: HOI AN – GROUP TOUR TO BA NA HILLS – DA NANG (B/-/-)","description":"You will leave Hoi An at 8:00 am and transfer to discover Ba Na Hill – 25 km to the south west of Da Nang City. To reach the summit, you will take a cable car from the foot with spectacular sceneries of forest, trees, and waterfall underground when you are on cable. On arrival you will visit Old French Villas, Nui Chua and conquer the mountain peak at the height of 1487 meters. You will take mountain climbing train to visit Flower Garden where has many kinds of beautiful flowers. Visit Linh Ung Pagoda and learn more about Buddhism and then Wine tunnel to see different wines are stored here for many years. You also have chance to admire the Golden Bridge which is new attraction at Ba Na. Have lunch at the restaurant.\nPm: You spend more time to enjoy at the hill or play game at Fantasy Park Amusement. Here, you can join many thrilling games and 4D movies (almost normal games and 4D Movie already included in your tour package but only some games which have reward & wax museum, you will pay the fee by yourself). After that you will take cable car back the foot mountain, the driver picks up and transfers you back Da Nang city.\nO/N in Da Nang."},{"title":"DAY 12: DA NANG – FLIGHT TO HCM CITY (B/-/-)","description":"After having breakfast at hotel, you will be free to explore Danang City and check out hotel before transferred to Da Nang airport for a short flight to Ho Chi Minh on VN127 (13.00-14.30). On arrival you are met by our guide and transferred to hotel.\nO/N in Ho Chi Minh City."},{"title":"DAY 13: SAIGON PRIVATE CITY TOUR + CU CHI TUNNEL (B/-/-)","description":"This morning, you will join the trip to Cu Chi with approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time.\nThen, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. Break time for relax or time for those who want to try the real shooting gun. And then return to Saigon City.\nAn afternoon will acquaints us with some major sights of Ho Chi Minh. We drive past many lively streets on our way to the Reunification Palace. This mansion was the former residence of the President of South Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon post office is the end stop.\nO/N in Ho Chi Minh City."},{"title":"DAY 14: SAIGON – MEKONG – CAI BE FULL DAY GROUP TOUR (B/L)","description":"At 6.30 am, our guide and driver will welcome you at hotel in Ho Chi Minh City and transfer you to Cai Be. On the road, you will have chance to survey the beautiful rice field scenery along Trung Luong Express Highway. On arrival in Cai Be, you will set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then you continue to make biking tour into the small villages to visit the orchard and fruit plantation.\nKeep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Then you continue visiting a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc Village, the green pearl of Vinh Long Town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music.\nAfter lunch, you will take a delightful walk through the bonsai garden. Then our guide and driver will take you to come back and drop you off hotel in Ho Chi Minh City. \nOvernight in Ho Chi Minh City."},{"title":"DAY 15: SAI GON – DEPARTURE (B/-/-)","description":"There is a free time to relax or further explore Ho Chi Minh. The tour ends after your transfer to Tan San Nhat Airport for departure."}]},{"name":"16 Days Best of Vietnam","duration":16,"travelStyle":["Sightseeing","Group","Partially Guided","Easy","Holiday"],"oldPrice":0,"price":1019,"summary":"Immerse yourself in the sights, tastes and energy of Vietnam on a 16-Day Tour, it is a comprehensive classic package tour which includes all the classic must-see highlights and interesting activities. Tour includes 2 domestic flights to save your time of transfer. It is the best combination of culture exploration, natural sightseeing and interesting activities. Beginning in Vietnam’s elegant capital Hanoi and finishing in bustling, vibrant Saigon. Our tour includes the picturesque Halong Bay, the lush mountain scenery of Sapa, World Heritage Hue, charming Hoi An, Mekong Delta and more","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130291_5e20438c71db2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130291_5e20438c71db2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130291_5e20438c7b6f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130291_5e20438c83899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130291_5e20438ca1f0d.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Check in Hotel in Hanoi and Free and easy (Meals: No)","description":"Our driver will pick you up from the airport or train station to the hotel. Then you will have time for discovering by yourselves the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\nOptional Activities ( Not Included)\nHanoi Foodie Tour on foot (Traditional food tour and Old Quarter Sightseeing): https://swallowtravel.com/tour/hanoi-lovers-foodie-private-tour-ct500.html\nMy Village Show (Vietnamese Bamboo Circus with live traditional music ): https://swallowtravel.com/tour/my-village-show-ct504.html\nNight 1: Overnight at 3 star hotel in Hanoi"},{"title":"Hanoi - Halong cruise (B,L,D)","description":"Have breakfast at your hotel.\n\n7.45-8.30: Pick-up at the hotel then travel to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours) with a short break on the way. The bay is dotted with sandy coves, grottoes and 1,600 limestone islands, which have been formed over millennia by wind and water erosion.\n\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n15.00-16.30 Do kayaking through the magnificent landscape with Limestone Mountains, visit Titov Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay. After kayaking, you will be back to Lavender Cruises and join sunset party.\n\nThe cruise passes by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n\nJoining our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities:\nJoin squid fishing on boat with our crews, playing card, karaoke or laze yourself with our happy-hour drinks at the bar. To end the day, spend a peaceful night aboard the boat beneath the night sky.\n\nNight 2: Overnight on Halong bay Cruises"},{"title":"Halong Bay trip – transfer back to Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck.\n\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n\n08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n\n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n\n16:30: Arrive in Hanoi. End of the trip!\n\nNight 3: Overnight at 3 star hotel in Hanoi"},{"title":"Hanoi – transfer to Sapa – Cat Cat Village trekking tour(B,L,D)","description":"Have breakfast or ask for take-away breakfast at your hotel.\n\n6:30 – 7:00: We will pick you up at your hotel then leave for Sapa. Traveling on new Highway Noi Bai by sleeper bus, it takes around 5 hours. We will have a short break around 20 minutes on the way.\n\nAround 13:00: Arrival in Sapa town. Have lunch at the restaurant.\n\nAfter lunch and short time to relax, trekking from hotel to Cat Cat village of H’mong – It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.\n\nWe will go back to Sapa Town. Spend your time for fresh up then have dinner at the hotel.\n\nYou will have your own leisure time to explore Sapa Town’s night life.\n\nNight 4: Overnight at 3 star hotel in Sapa"},{"title":"Y Linh Ho – Lao Chai – Ta Van trekking tour - transfer back to Hanoi (B,L)","description":"7:00: Have breakfast at hotel.\nAfter breakfast, we leave the hotel and start trekking. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields to get to Y Linh Ho hamlet, and from here to the Black H'mong village - Lao Chai village (Black H'mong is one of the biggest minority groups in the Sapa). After that, you will continue your trekking along Muong Hoa stream, paddy field to Ta Van village, visit and understand about \"Zay\" ethnic people. You will see houses of The Zay people which are built of wood and bamboo with a clay floor.\n12:30: Enjoy lunch at the restaurant or picnic lunch at the village\n15:00: We will transfer you to the bus station to catch the bus back to Hanoi.\n21:00-21:30: Drop you off at the hotel.\n\nNight 5: Overnight at 3 star hotel in Hanoi"},{"title":"Hanoi –Free and easy (B)","description":"You have breakfast at the hotel then have the whole day free in Hanoi to relax, go shopping and explore this city by yourself. Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\n\nOptional Activities (not included)\nHanoi City Tour : https://swallowtravel.com/tour/hanoi-city-group-tour-ct422.html\n\nHoa Lu Citadel – Tam Coc Boat Trip Tour: https://swallowtravel.com/tour/hoa-lu-tam-coc-group-tour-ct425.html \n\nTrang An Grottoes – Bai Dinh Pagoda Tour :https://swallowtravel.com/tour/trang-an-bai-dinh-pagoda-group-tour-ct428.html\n\nNight 6: Overnight at 3 star hotel in Hanoi"},{"title":"Hanoi – Fly to Hue city (B)","description":"After breakfast at your hotel, you are free till our driver come to transfer you to the airport. Today you will take a flight to Hue city and stay at the most touristic area of Hue city.\n\nNight 7: Overnight at 3 star hotel in Hue"},{"title":"Hue city full day small group tour (B,L)","description":"08:00am - 08:30am: Our tour guide will pick you up from your hotel then start the tour.\nIn the morning, we will accompany you to visit these places:\n12:30pm: Have lunch at local restaurant\nAfter lunch, we continue to visit:\n04:00pm - 04:30pm: We will drop you off at your hotel in the center of city. Tour ends.\nNight 7: Overnight at the hotel in Hue"},{"title":"Hue – get transferred to Hoi An by private car (B)","description":"You will have breakfast at the hotel then get transferred by private car to Hoi An. We will drop you off at Lang Co beach, Hai Van pass, Marble Mountains and stone carving village for taking photo if you request.\n\n12:30: Arrive Hoi An. Drop of at hotel.\n\nNight 9: Overnight at 3 star hotel in Hoian"},{"title":"Hoi An - My Son Sanctuary - boat trip on Thu Bon river (B, light L)","description":"8:00 – 8:30: We will pick  you  up  at  your  hotel \n8:30: Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village  alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n9:45: Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4th to 15th century.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area  your guide will explain the history of the religious site which served as a burial place for the Cham monarchs centuries ago.\n12:00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river.  Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village. You will have a soft lunch (Quang-style noodle with pork and shrimp) served on boat.\n15:30: The boat trip will finish at Nguyen Hoang dock in the old town and back to your hotel.\n\nNight 10: Overnight at 3 star hotel in Hoian"},{"title":"Hoi an - Tra Que cooking class- foot massage private tour(B,L)","description":"Tra Que vegetable village is located 3km north of the Old Town of Hoian. Thanks to the rich soil and unique source of underground water, the village has long been known for growing many kinds of vegetables and herbs such as basil, mint, lettuce, and coriander, etc. with which the traditional dishes of Hoian like “Quang” noodle, “Tam Huu” roll, “Banh xeo” Pancake, and fresh spring roll have gained their reputation throughout the country. Interestingly, Tra Que is named after the sweet-scented vegetables that spice up the everyday meals of the local people.\n8:00  Local guide pick up at the hotel, then you will go bicycle to Hoi An’s colourful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients  you will use in the cooking lesson later.\n9:00 Ride pass small roads, rice padddy fields, take pictures of water buffalos, cow or farmers on daily working at their fields and fish – ponds. Explore many beautiful views of VietNam country side meet many warm hearted local people. They will pass through the bendy small narrow roads in the village to one of the typical local houses and then how they are living and farmer teach you how you plan the beansprouts.\n10:00  Take a rest with special welcome drink. You will be taken around the herbs garden where local farmers work on their field using organic methods from 300 years ago.Then you will enjoy foot massage with local herbs ( lemongrass, basil thai….)\n10:30  We will give you foot massage with some local herbs.\n11:00 Learn the traditional ways of preparing and cooking Vietnamese food.( Made some  flowers and animals by vegetables for decoration). After the lesson, enjoy what you have cooked.\n13:30 Return to the hotel. Trip ends.\n\nNight 11: Overnight at 3 star hotel in Hoian"},{"title":"Hoi An – Free day (B)","description":"You will have breakfast at the hotel. Today you have a free day to relax, go shopping or take a free bicycle to look around Hoian ancient town and the surrounding countryside. Many people like to just wander around and soak up the ambience of the town, perhaps visiting a couple of the old traditional Chinese mansions. Others shop till they drop, spend time at the tailors or head out to the beach outside town, which has glorious white sand.\nPlease contact us if you want to join any daily tours with us.\n\nNight 12: Overnight at 3 star hotel in Hoian"},{"title":"Hoi An – Danang- Fly to Ho Chi Minh city (B)","description":"After breakfast at your hotel, you are free till our driver come to transfer you to the airport. Today you will have a flight to Ho Chi Minh city and stay at the most touristic area of Ho Chi Minh City.\n\nNight 13: Overnight at 3 star hotel in Ho chi Minh"},{"title":"HCM – My Tho – Ben Tre – Can Tho deluxe group (B,L)","description":"A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit.\n\n7:30 - 8:30: Our tour guide and driver will pick you up at your hotel and then start leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, enjoy the folk song music which performed by the local people. Visit the fruit plantation.\nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop.\n\nHave lunch at local restaurant. Break time.\n\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t joint the cycling trip.\n\n17:30: Drop off at your hotel. Trip ends.\n\nNight 14:  Overnight at 3 star hotel in Ho chi Minh"},{"title":"Ho Chi Minh-Cu Chi tunnel deluxe group (B,Light Lunch)","description":"7:30-8:30: Our tour guide and driver will pick you up at your hotel and then start driving to Cu Chi which located 70 km from the Ho Chi Minh City Center to the Northwest.  Cu Chi was known as the “area of steel” in the war time, and the tunnel systems were over 200km, which was considered the unbreakable underground village in the Vietnam-American war. It is legendary for its network of tunnels and is a popular destination for both Vietnamese and foreign visitors.\n\nThe trip to Cu Chi will take approximately one and a half hours bus driving.\n\nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\n\nBreak time for relax or time for those who want to try the real shooting gun.\n\n13:00: Return to Ho Chi Minh city. Have lunch at the restaurant\n\n14:30: Get transferred back to your hotel. Trip ends.\n\nNight 15: Overnight at 3 star hotel in Ho chi Minh"},{"title":"Ho Chi Minh – Back Home (B)","description":"You will have breakfast at the hotel then have free time to explore Ho Chi Minh city before getting picked up to the airport by our driver. Trip ends. We can customize the tour as your request."}]},{"name":"Vietnam from Mountains to the Seas - 17 Days","duration":17,"travelStyle":["Sightseeing","Group","Fully Guided","Holiday"],"oldPrice":2018,"price":1009,"summary":"\n  The best quality and unbeaten price for 17 Days Trip\n  100% Guaranteed Departure\n  NO hidden Cost, NO Optionals\n  Start in Hanoi and finish in Ho Chi Minh City\n  Visit Hanoi, stay in Boutique hotel inside the Old Quarter\n  Discover Sapa with unique terraced-ricefields and Hill Tribes\n  Stay overnight on Boat in Halong Bay - World Heritage Site\n  Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n  Explore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\n  Chillout in Ho Chi Minh City - the biggest City of Vietnam\n  Learn about Vietnam War throughout Cu Chi Tunnels\n  Cruise on Mekong River\n  And more...\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187105_2a96e409.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187105_2a96e409.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_d987b964.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_5507bc4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_c065ecfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_c7172b86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_1c5ecf7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_27940aac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_22652b64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_f9465dad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_c6e7555c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_34351d83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_21425db2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_fbdbe736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_895b838e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_d5b5cb40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_630fd637.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_bf546764.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_4f13b4a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_863efc9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_9f4805a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_b998612b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_248a78e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_69ee36d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187105_22556544.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Mai Chau","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Sapa by Sapa Express Bus (B)","description":"Depart: 6:45 - 7:00am from Hanoi to Sapa.\nArrive Sapa: 13:30\nTotal duration is 5hour and 30 minutes (subject to change upon weather and road situation)\nOur bus transfer and tour guide will pick you up at Hanoi Old Quarter then come back to Pick-up Point street depart to Sapa by Sapa Express Bus - Noble Limousine 29 seats is called \"Special aircraft on the ground\"/or similar Bus Company, following Lao Cai - Hanoi highway.\nAlong the way, you will have chance to contemplate the beauty of northwest mountains, Red Rive,on Noi Bai - Lao Cai highway. Have a short break in 30 minutes then continue the trip to Sapa. Arrival in Sapa, check-in hotel for leisure. Overnight in lovely town Sapa.\nBamboo Sapa Hotel 3* or similar"},{"title":"Day 3: Trek to Y Linh Ho-Lao Chai-Ta Van Villages (B, L)","description":"9:30 AM, start from Sapa Ethnic (04 Hoang Dieu Str) on the main road to go down to Muong Hoa valley. Begining of the trip is the moment for admire the panorama view of the town and then the valley from the main road. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields to get to Y Linh Ho hamlet, a small village of the Black Hmong people.\nFrom Y Linh Ho village, we go along the river to go to Lao Chai village (means \"old village\" in the local dialect). It is time for you to visit the local families, listen to your guide's explanation about the local culture: how they live, way of building the traditional house, techniques of making clothes... or listen about the way of treatment for a sick person.\nStop for lunch. The lunch is served in one of the local refreshment restaurants on the side of the river.\nIn the afternoon, we leave Lao Chai to continue to Ta Van village, the Giay people's residence. The guide to bring you into some family: listen about their life, enjoy some green tea, learn about the differences of their culture from the other hill tribes even they leave close to each other.\nQuitting Ta Van, we head up to the main road where the car will pick up us to tranfer back to Sapa. Free for leisure and overnight in Sapa.\nBamboo Sapa Hotel 3* or similar"},{"title":"Day 4: Visit Cat Cat Village - Express Bus to Hanoi (B)","description":"Trekking from Sapa to Cat Cat Village to see its waterfall and meet H’mong family and learn more about their way of life.\nCat Cat is a small but bustling village situated at the foot of Fansipan Mountain. Here you will see traditional H’mong homes at their best, and you will be able to meet a H’mong family to learn more about their way of life. The village is also the perfect place to see traditional clothing being made, hemp being dyed and women weaving. From Cat Cat we will follow the Muong Hoa Valley for 3km through rice terraces and small dwellings to Sin Chai. This village is a little off the usual trekking route and less visited, but offers the opportunity to see traditional wooden homes built using the indigenous Pumu tree. Transport will be waiting in Sin Chai to take you back to Sapa. \n15:30: Our car and guide will pick you up at the Sapa Tourism Information Center (inside) for departure back to Hanoi towards new Noi Bai - Lao Cai Highway. There will be 2 stops on the way for restroom (max 20mins/stop)\nArrive in Hanoi at 8:30pm to 9:00pm. End of the trip with sweet memories about our Sapa and Hill-tribe village of the north of Vietnam.\nCheck in hotel & overnight in Hanoi\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Halong Bay with overnight on Cruise (B, L, D)","description":"At 8:30 am we will pick you up, by Shuttle mini-van/bus, at the hotel and begin our journey to Halong city. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the at port. Board your private boat, an authentic Chinese Junk, and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave”, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck. Stay overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 6: Halong Bay - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs, We stop to visit a floating fishing village and listen to some legendary stories of the fishermen’s daily life. Have lunch on boat while cruising back to the Halong city pier, return to Hanoi.\nArrive Hanoi around 4:00pm. Check in hotel & overnight in Hanoi!\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 8: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Danang City. Overnight on the Train (4 Berth Cabin sleeper) without breakfast in the morning (day 9th)"},{"title":"Day 9: Arrive Danang - transfer to Hoi An","description":"Spend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30 am! Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. You`ll prepare the breakfast by yourself because the Train doesn`t serve breakfast.\nCheck in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An..\nPhu Thinh Resort 4* or similar"},{"title":"Day 10: Hoi An Town free for leisure/shopping (B)","description":"Hoi An Ancient Town is considered as Shopping and Sightseeing Heavens so today you`ll spend your whole day to discover and go shopping in Hoi An Ancient Town.\nStay overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 11: Half day Tour to My Son Sanctuary (B)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries.\n1:00pm: Return to Town for lunch by your own.\nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 12: Hoi An full day Tour with river cruise & craft villages (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families.\n3:00pm: Return to your haven on world-famous \"Cua Dai Beach,\" with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 13: Cycling Tra Que Village - Cooking Class (B, L)","description":"8:00am: Have breakfast at hotel. Our guide welcomes you at hotel in Hoi An and ride bicycle to Tra Que Vegetable Village far from Hoi An Ancient Town 3km. You ride through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. Arrive in Tra Que Vegetable Village; you can experience the living and working of local farmers at this organic vegetable and herb garden. Your learn how to prepare soil, grow vegetable, water to get fresh vegetables as you see at the garden from previous tourists. You have 15 minutes foot massaged by herb to fresh yourself. Here is the chance for you to join in cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods like Tam Huu Spring Roll, Banh Xeo pancake… Have lunch at the family. And then ride bicycle back Hoi An Town or hotel at 3:00pm.\nThis afternoon you have more free time to experience around the town to get some souvenir gifts or spend your time at Cua Dai beach - 4km from the ancient town. Free to have your own dinner. \nStay overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 14: Hoi An - Ho Chi Minh City (B)","description":"Today you are free in Hoi An until catch flight to Ho Chi Minh City. Picked up at airport upon arrival. Transfer to hotel for check in. Overnight in Ho Chi Minh City (Saigon).\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 15: Cu Chi Tunnels - Cao Dai Temple full day (B, L)","description":"This morning you take a drive to Cao Dai Temple in Tay Ninh, near the Cambodian border, is home to the unique Cao Dai sect, whose patron saints include Joan of Arc, Victor Hugo and Winston Churchill to name a few. The religion is a hybrid of Buddhism, Taoism, Confucianism and Christianity. The Cao Dai Temple at Tay Ninh has been described as a Walt Disney fantasia of the East. The temple's exterior is decorated with multi-colored dragons of all shapes and sizes competing for space with a number of Buddhist symbols. Above the main entrance is the all-seeing holy eye, the symbol of the Cao Dai sect. The interior is just as engaging as statues of Jesus Christ, Buddha and the Hindu god, Brahma, stand side by side.\nThe trip to Tay Ninh is combined with a visit to the Cu Chi Tunnels. At its height, the tunnel system stretched over 250km. from Saigon to the Cambodian border and was three levels deep. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers and kitchens.\nToday the remaining tunnels have become a major tourist attraction giving the visitor a unique experience and a feel of what underground life during the US – Vietnam War.\nTour finishes at 6:00pm at hotel.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 16: Mekong Delta - Cai Be floating Market full day (B, L)","description":"8:30 am. Depart for Cai Be Floating Market, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta.\nVisit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of the garden accompanied by traditional southern Vietnamese folk music.\nTake a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Check in & stay overnight in Ho Chi Minh City\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 17: Ho Chi Minh City - Concluded/ Departure home (B)","description":"Breakfast at your hotel, then transfer to Airport for your International flight to back home!\nEnd of services with great memories about Vietnam with us. Thank you so much and hope to see you again soon!"}]},{"name":"Glimpse of Vietnam","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1475,"summary":"Hanoi is a blend of long established traditions and modern imprints of Western colonization. Tree-lined boulevards and colonial buildings give the city a touch of Western elegance, while crowded blocks of tiny old houses and narrow lanes full of daily life bear the charms of the past centuries. Take 60 minutes ride on an electric car through Quan Su Pagoda, Silk Road, Hanoi Railway Station and Hoa Lo Prison then Hanoi Opera House.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177157_1389ae90.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177157_1389ae90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177157_ed69b36f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177157_5c793e45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177157_d4298066.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177157_fdd26d51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177157_7f4a0bf3.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi-Halong","description":"Day 1\tHanoi - Halong (Lunch: Meals incl. in itinerary (Vietnam) )\nBy vehicle from Hanoi to Halong Bay\nStop en-route for stretch your legs and use the restroom at one of the souvenir shop for charity.\nTransfer to/from Tuan Chau Marina Port\nExcursion by boat through Halong Bay including lunch\nBoard the charming traditional wooden junk for a cruise through the Bay and en-route lunch will be served. Following lunch witness rock formations with names like Stone Dog, Incense Burner (Dinh Huong), and Fighting Cock (Ga Choi). At the core of the islets, there is an enchanting cave to visit thusly named Surprise Cave (Sung Sot), after that stop at Titov Island. Sail past floating villages, fishermen casting their nets and pearl fisheries and observe the rhythms of daily life on the bay - Overnight in Halong"},{"title":"Day 2: Halong - Hanoi","description":"Day 2\tHalong - Hanoi (Breakfast: Hotel )\nBy vehicle from Halong to Hanoi\nSightseeing around Hanoi city centre with electric car (possible to make some quick stops\nfew minutes en route to take photo)\nHanoi is a blend of long established traditions and modern imprints of Western colonization. Tree-lined boulevards and colonial buildings give the city a touch of Western elegance, while crowded blocks of tiny old houses and narrow lanes full of daily life bear the charms of the past centuries. Take 60 minutes ride on an electric car through Quan Su Pagoda, Silk Road, Hanoi Railway Station and Hoa Lo Prison then Hanoi Opera House.\nVisit Hoan Kiem Lake, Ngoc Son Temple and the Rising Sun bridge\nHoan Kiem Lake (Hoan Kiem means Lake of the Returned Sword), is a lake in the historical centre of the Hanoi capital. It is one of the major scenic spots in the city and serves as a focal point for its public life. Legend has it that King Le Loi handed a magic sword called Heaven's Will which brought him victory in his revolt against the Chinese Ming dynasty back to the Golden Turtle God in the lake. The Tortoise Tower (Thap Rua) standing on a small island near the centre of the lake is linked to the legend.\nThe Ngoc Son Temple was erected in the 18th century. It honours the 13th -century military leader Tran Hung Dao who distinguished himself in the fight against the Yuan - Mongol invaders, Van Xuong, a scholar and Nguyen Van Sieu, a Confucian master and famous writer in charge of repairs made to the temple in 1864. Jade Island is connected to the shore by the wooden red-painted Huc Bridge (The Huc, means Morning Sunlight Bridge) - Overnight in Hanoi"},{"title":"Day 3: Hanoi - Hue","description":"Hanoi - Hue (Breakfast: Hotel )\n \t\nTransfer by air conditioned vehicle\nFlight from Hanoi to Hue\nTransfer by air conditioned vehicle\nSightseeing in Hue\nHue served as the capital of Vietnam for more than 140 years. It houses ancient temples, imperial buildings and French-style edifices. It was established in the 17th century.\nVisit the Imperial Tombs of Tu Duc and Khai Dinh\nVenture into the countryside around Hue to the Imperial Tomb of Tu Duc. Tu Duc, the longest reigning Vietnamese emperor, designed and built this elegant tomb during his lifetime, using it as a retreat for meditation, reading and theatre performances. Take some time to soak in the tranquil atmosphere, wandering among the gracefully proportioned pavilions, courtyards and lotus ponds. Afterwards visit the Imperial Tomb of Khai Dinh, dramatically located on a hillside. The last of the monumental tombs of the Nguyen dynasty, completed in 1931, this tomb incorporates distinct European elements into traditional Vietnamese architecture.\nVisit the Imperial Citadel\nLocated in the heart of Hue is the Imperial Citadel, a vast complex built in the early 19th century and modelled after the Forbidden City of Peking. The original walls stretched for 10 km and were surrounded by a wide moat. Today, most of the buildings have been destroyed due to bombing during the Vietnam-American War, but the monuments that remain provide a fascinating glimpse into the court life of the Nguyen Dynasty. Approach the city past the striking Flag Tower, where a giant Vietnamese flag waves proudly overhead, to the imposing Ngo Mon Gate, the main entrance to the Imperial Enclosure. Enter into an area of spacious courtyards and serene lotus ponds, and visit Dien Tho Residence (Dien Tho palace) where the Queen mother lived, visit Thai Hoa Palace, the magnificently decorated reception hall, the Halls of the Mandarins, and the original Nine Dynastic Urns, among other sites, including a visit to the Hue Royal Antiquities Museum. - Overnight in Hue"},{"title":"Day 4: Hue - Hoi An","description":"Day 4: Hue - Hoi An (Breakfast: Hotel )\nBy vehicle from Hue to Hoi An with sightseeing in Danang\nDrive south from Hue along scenic mountain roads with spectacular views over the coastline. Highlights along the way include the dramatic Hai Van Pass, the high dividing line between the climate zones of North and South Vietnam; Lang Co, a lovely stretch of beach curving outwards between a clear blue lagoon and the East Vietnam Sea; and the large coastal city of Danang.\nAfter arriving in Danang, visit the Cham Museum, an elegant colonial building which houses the finest collection of Cham sculpture in the world; and pass by Non Nuoc Beach, a famous spot for American soldiers during the Vietnam-American War. Continue south to Hoi An, stopping enroute to visit the Marble Mountains, a group of limestone and marble hills filled with caves. The mountain represent the five elements of the universe.\nSightseeing in Hoi An\nHoi An, a picturesque riverside town, was one of South East Asia's major international ports during the 17th, 18th and 19th centuries. This walking tour includes many of the town's highlights. Visit the Japanese Covered Bridge, constructed in 1593 by the Japanese community to link the town with the Chinese quarters across the stream. Near the bridge is Sa Huynh Museum which houses exhibitions from the earliest period of Hoi An's history. Wander into the Tran Family Chapel, a 200 year old house built for worshipping ancestors. Visit Phuoc Kien Assembly Hall, a Chinese pagoda built around 1690 and enlarged in 1900. It is typical of the Chinese clans in the Hoi An area and is dedicated to Thien Hau Thanh Mau, the Goddess of the Sea and Protector of Sailors and Fishermen. Also enter into a Lantern Making Workshop to see how the frame is made and the silk cloth put onto the lantern - Overnight in Hoi An"},{"title":"Day 5: Hoi An - Danang - Saigon","description":"Hoi An - Danang - Saigon (Breakfast: Hotel )\nBy vehicle from Hoi An to Danang\nFlight from Danang to Saigon\nTransfer by air conditioned vehicle\nSightseeing in Saigon\nA vibrant metropolis, Saigon teems with energy, activity and motion. Everywhere you look, you see the convergence of traditional and modern life. Begin the trip into modern history with a tour of the Reunification Palace. Formerly the Independence Palace of the South Vietnamese president, this 60s style building was famously stormed by tanks on April 30, 1975 signifying the fall of South Vietnam. It has been preserved in its original state, and the original tanks remain on display near the entrance gates.\nAfterwards, drive to the historic centre to visit the Emperor of Jade Pagoda, one of Saigon's most interesting pagodas. Proceed to pay a quick visit to the neo-Romanesque Notre Dame Cathedral and the Central Post Office. Pass by the classic European-style landmarks such as the ornate City Hall (Hotel De Ville), the old Opera House (both may only be viewed from the outside). Finally, end up at the central Ben Thanh Market, where vendors display a vast array of goods and handicrafts, appealing to every taste - Overnight in Saigon"},{"title":"Day 6: Saigon","description":"Day 6\tSaigon (Breakfast: Hotel )\nTransfer by air conditioned vehicle\n*\tHo Chi Minh Mausoleum will be closed annually for maintenance between from September - November.\n**\tHon Chen Temple festival will take place on Perfume river in Hue between March - April and August - September. Please check your traveling date with us in advance."}]},{"name":"The Heart of Mekong Delta - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":182,"summary":"See the highlights of Vietnam's Mekong Delta on this three-day adventure through rivers, canals and mangrove forest. Your journey will take you to the hub of the delta Can Tho and the sleepy riverside town of Chau Doc, to discovery why the region is world - famous for fishing, rice farming and tropical biodiversity. Visit a small homemade coconut factory, cruise on a converted rice barge and take a sampan ride though the waterways of an ecological reserve.\n\nRoute: Ho Chi Minh City - My Tho - Ben Tre - Can Tho - Chau Doc - Tra Su Sanctuary","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/135701_a76ba4ef.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/135701_a76ba4ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_ede5b0b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_fd750db9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_869ff331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_04189165.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_8de2d541.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_d06469e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_13ade401.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_2d315f90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_9679a074.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_50bd6805.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_532794cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_d082bafe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_69144cfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_84e55058.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135701_db5203ec.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Chau Doc"],"timeline":[{"title":"Day 1: HO CHI MINH - MY THO - BEN TRE - CAN THO (L)","description":"Leave Ho Chi Minh City and enjoy the scenic journey along the National Highway bordered by green rice fields (seasonally). On arrival at My Tho, visit the Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet to have lunch in the orchard garden. Then take a boat ride to An Khanh – a less touristy attraction in Ben Tre. Enjoy cruising on a hand-rowed sampan under the shade of water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through the fruit plantations and villages. Proceed towards Can Tho. Overnight in the hotel (family home-stay with dinner can be arranged on request). Free time to visit the bustling Can Tho market.\nCheck into your hotel on arrival at Can Tho. Free to explore the city on your own in the evening. Overnight at your chosen hotel in Can Tho."},{"title":"Day 2: CAN THO - FLOATING MARKET - CHAU DOC (B/L)","description":"Taking a very early morning boat trip (5:30am usually recommended) to visit the Cai Rang floating market which is wholesale market of fruit and vegetable at its busiest at this time of the day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Head towards Phong Dien for the smaller, quieter floating market (optional for private tour). Break for lunch. \nProceed to Chau Doc and continue the tour to visit Tra Su - This nature reserve covers a massive area that is home to the rich and diverse species of water birds, fishes, reptiles, bats and some endangered species. The lush vegetation, florals and fauna in abundance created an amazing haven for wildlife. Taking a motorized boat followed by a rowing boat deep into the forest through the lovely channel of waterways, a short walk to the observation tower to enjoy the panoramic view or the area. Back to the town, on the way back stop by to visit Sam Mountain, the Cave pagoda (if time permitted). Hotel check in. Overnight in Chau Doc."},{"title":"Day 3: CHAU DOC - HO CHI MINH (B/L)","description":"After breakfast, take a nice boat trip through the floating village to visit a fish farm to see how the Mekong Delta people raise fish in their floating houses. Visit the Cham minority with their traditional weaving village, followed by a local Islamic Mosque. \nTrip back to Ho Chi Minh City (around 7 hours on the way). There are some stops on the way to take a rest and have lunch. End at the office or your hotel. \n\n--\nOPTIONAL: From Chau Doc, An Giang, Vietnam, you can take speedboat to Phnom Penh, Cambodia, so if you want to visit Cambodia after this trip instead of coming back to Ho Chi Minh, please let us know and we can help you to book speed boat tickets with extra surcharge. "}]},{"name":"Sapa trekking: Muong Hum Market and Sapa Tribal Villages Explore 4 days","duration":4,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":348,"summary":"Attending tribal Sunday Market in Muong Hum for encountering the most variety of tribal peoples in their colorful traditional dresses, enjoying fresh smell from exotic herbs and spices,.. walking along the trails winding up and down hills in spectacular Ta Phin and Muong Hoa Valleys, paying visit to Red Zao, Black H’mong or Zay villages and homes… they are all unforgettable experiences included in this trip.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159218_c743ae71.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159218_c743ae71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_79f3fc08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_8ff49344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_4971f57f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_1b63efbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_a3c8d104.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_8395bdaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_7d1e7113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_370dd448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_094cb619.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_3752cd48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_1d865344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_fd5f73ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_6384730e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_19ef2861.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_1811160b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_d208070b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_aaf65a8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_de066b32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_1eb7e2aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_98e08d7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_437b4801.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_21eb1ea6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159218_fdd28535.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1( Saturday): Take overnight train from Hanoi to Lao Cai","description":"Please, be ready at your hotel lobby at 20.00 for a short transfer to Hanoi railways station. Tonight you will travel to Lao Cai on sleeping train in the most comfortable 4 bed cabin of Victoria compartment or in 2 bed deluxe cabin of other train carriage. \nOvernight on train"},{"title":"Day 2 (Sunday) Lao Cai - Muong Hum Market - Sapa ( B,l,D)","description":"Early arrival in Lao Cai, at the Chinese border, you will meet your local guide and driver as soon as you check out the station, freshen up and Breakfast before taking an hour drive through scenic countryside to Muong Hum. Arriving at the market at about 09.00Am, joining the locals for the market activities. It is here at this market place where you can see and meet the most diversity of ethnic minority peoples living in Lao Cai Province: The four H’mong sub groups: Black, Flower, Red and Blue; Red Zao, Black Zao, Zao Tuyen; Ha Nhi; Zay; Nung…You will realize easily women from many different groups by watching at traditional costumes they wear. The Zay wear black trousers, pink or blue blouse or shirt with a woolen headscarf, the Flower H’mong and Red H’mong wear colorful skirts which decorated with thick red and yellow embroidery on the batik patterns, silver ear rings and necklaces while the Black H’mong choose the simple indigo color with light decorative embroidery…\n\nTime has passed away fast and the market coming to an end. Let’s sit down on a large and flat rock by the river to relax and enjoy picnic lunch before taking the road ride to Sapa. You’ll enjoy some stops for sightseeing along the way. Check in your hotel upon arrival in Sapa and time is set free at your leisure.\n\n• Accommodation: Hotel in Sapa "},{"title":"Day 3 (Monday) Tribal village exploration in Ma Tra and Ta Phin Valley ( B,L,D)","description":"Lying on the south of Sapa town, this vast valley composes of 3 chambers surrounded by high mountains with thick forest at the top and terraced rice paddies from lower slopes stretching to the bottom. It is home to the Black H’mong and the Red Zao ethnic minority who live in wooden houses scattering here and there.\n\nStarting from Sapa with your guide, you will follow a trail running through fruit and orchard gardens, lush pine forests to a Black Hmong ethnic minority village named Matra, isolated away from the civilization. Chickens, water buffalos, pot – belly pigs and piggy everywhere, some locals will be happy to invite us to their home which offers chances to see their dwellings, weavings on belly looms to makes traditional costumes out of hemp fiber…Our path weaves itself up and down hills, through valleys with terraced rice fields which create spectacular landscapes. After picnic Lunch, we get to Taphin Commune where the Black H’mong and the Red Zao live together. It is very interesting to realize culture assimilation: Which can be mixed, which can not! At the end of the footpath, our Jeep is waiting for us for the return journey to Sapa. \n\n• Accommodation: Hotel in Sapa "},{"title":"Day 4 (Tuesday) Explore Muong Hoa Valley ( B,L)","description":"Today you will spend the whole day exploring the spectacular Muong Hoa Valley. Two high ranges of mountains run in parallel north to southwest of Sapa town had created a narrow and long valley, which is the most famous valley in the region for its breathtaking scenery and is home to the major part of Sa Pa’s ethnic population including the H’mong, Zao, Zay, Tay and Xa Pho.\n\nA Jeep will take us out of the town, following the only road built on the side of a mountain range, looking down the valley, over viewing magnificent landscapes composed of high mountains, deep valleys, and stream of water winding, waterfalls and terraced rice paddies… leaving the main road for some short trek, you will visit tribal villages such as Ta Van of the Zay, Su Pan of the Black H’mong, Ban Ho of the Tay…enjoy meeting and contacting locals at home and at works.\n\nWe leave Ban Ho of the Tay people in late afternoon, drive back to Sapa. After a short rest for shower, we then transfer down hill to bus station at 10p.m. Trip ends when arrives in Hanoi early next morning on Wednesday morning at 5:00 am."}]},{"name":"Sapa Authentic experiences : Untouched Region and Coc Ly Market 3 days","duration":3,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":309,"summary":"Getting off the beaten track, moving along quiet roads, be amidst wild and fabulous nature, exploring remote villages, meeting locals from some very small ethnic groups and joining them at their weekly market. This 2 days trips is for those who love wild nature, new culture discovery and wish to be away from crowds.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71bd1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71bd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71bda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71bdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71be2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71be6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159233_5e561ded71be9.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1(Sunday Night): Take overnight train from Hanoi to Lao Cai","description":"Please, be ready at your hotel lobby at 20.00 for a short transfer to Hanoi railways station for taking the overnight train (first class 4 beds cabin with air-condition) which arrive in Lao Cai city, near the Chinese border next morning. \nOvernight on train"},{"title":"Day 2 (Monday) Lao Cai - Muong Khuong - Cao Son (B,L,D)","description":"Upon arrival to Lao Cai station early morning, you will meet your local tour guide and driver and enjoy breakfast in a restaurant nearby. Freshen up and heading along the road to Muong Khuong district which weaves its way up and down hills of the tea plantation and pine trees. It gets wilder and greener with thick forest and small tribal villages scattering isolated on slopes of the mountains as you get close to Cao Son Commune. You will enjoy much of the scenery which is marvelous and changes very fast after every bend. Arriving in Cao Son almost at noon, checking in the Lodge where you will stay overnight, take a rest or wandering around breathing fresh air.\n\nAfternoon is for walking to explore tribal villages nearby for a discovery of tribal culture, custom and self subsidiary way of life of different ethnic minorities. \n\n• Accommodation: Cao Son Ecolodge "},{"title":"Day 3 (Tuesday) Cao Son - Coc Ly Market - Overnight train to Hanoi (B,L)","description":"Coc Ly market is a tribal market on every Tuesday. About 50 km away from Bac Ha town, the market place lies on the bank of the Chay River, surrounded by steep mountains covered with lush forest. Going to the market, minority people such as H;mong, Zao, Tay, Nung… from remote villages have to wake up very early and walk up and down hills for hours.\n\nLeaving Cao Son after Breakfast and drive along local road for nearly 2 hours, enjoying fabulous scenery, you will arrive at the Coc Ly market right at the most crowded time of the market. Spending few hours joining the locals, fancying cheerful atmosphere and studying the differences between people from many ethnic groups through colorful traditional costumes. It is an unique experience for sure!\n\nThe market over at noon when you board a wooden sampan for spectacular landscapes and exploring villages of the Zao and Tay on the two banks of the river. \nBack to bus station at 4p.m in Sapa and arrive in Hanoi at 10p.m"}]},{"name":"Vietnam For Teens - 9 days","duration":9,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":1895,"summary":"FAMILY TOUR TO VIETNAM (for children aged 12 years and above): Travel with all the family from Hanoi to Ho Chi Minh City taking in stunning Halong Bay, charming Hoi An and ancient Hue along the way.","highlights":["Take a junk boat cruise on Halong Bay","Visit Hanoi","Discover Hue and its sights","Explore village life by bicycle","Take a walking tour of Saigon"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/70486_7a53175a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/70486_7a53175a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_b39062da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_d64874eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_6d9c3493.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_c5d8eb3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_8d080d3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_19fb112a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_27941089.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_7bb55090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_de23535d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_98da46d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/70486_615dc025.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Day 1: Hanoi","description":"Saturday. Welcome to Hanoi and the start of your holiday! Transfer from airport to hotel for check-in is included. The rest of the day is free for you and your family to explore the city, which is easily accessible by foot. "},{"title":"Day 2: Junk boat cruising, Halong Bay","description":"Hanoi – Halong Bay. This morning drive to beautiful Halong Bay. Boarding junk boat we cruise the emerald waters. Later we visit spectacular Tien Ong Cave. Tonight, there's a Vietnamese cooking demonstration and seafood dinner."},{"title":"Day 3: Floating villages and cyclo rides","description":"Halong Bay - Hanoi - Hue. Start the day with a Tai Chi class on the sundeck before exploring the Floating village of Cua Van. On arrival to Hanoi embark on a guided cyclo tour of the French Quarter, followed by a walking tour of the Old Quarter. Later, board overnight sleeper train to Hue. "},{"title":"Day 4: Imperial Hue","description":"Breakfast onboard the train. After arrival and hotel check in at Hue, we tour the city's Thien Mu Pagoda, Imperial Purple Palace, and the countryside Royal Tombs. As the sun sets, opt for a peaceful cruise along the Perfume River."},{"title":"Day 5: Delightful Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. We take the scenic Hai Van Pass (Road of the Ocean Clouds), to the port of Hoi An, stopping for a stroll along China Beach. Enjoy a short afternoon walking tour of the historic old town, a UNESCO World Heritage Site."},{"title":"Day 6: Village Life","description":"For a taste of provincial life, today we take a bicycle ride out of Hoi An to Tra Que village, famed for its traditional farming practises and rural atmosphere. Enjoy a hands-on day family day, tending to the fields and gardens, before a lesson in preparing traditional Vietnamese cuisine. Enjoy your culinary masterpiece while soaking up the clean air and country views."},{"title":"Day 7: Hoi An - at leisure","description":"Today is free for you to spend as you choose - relax or sightsee further."},{"title":"Day 8: Ho Chi Minh City","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City, once called the 'Pearl of the Orient'. Enjoy a walking tour of the city, including visits to the Notre Dame Cathedral, Old Post Office and the sobering War Remnants Museum. Spend the remainder of the evening at your own leisure – Ho Chi Minh City has plenty of fun to offer all ages!"},{"title":"Day 9: Ho Chi Minh City","description":"Sunday. This morning is free for you to do some last minute shopping or sightseeing before your included departure transfer to the airport in the afternoon. Why not opt for a relaxing foot massage, bargain for goods at Ben Thanh Market or visit the grand Independence Palace."}]},{"name":"Ho Chi Minh City - Mekong Delta - Cu Chi Tunnels 4 Days 3 Nights","duration":4,"travelStyle":["Adventure","Family","Group","Partially Guided","Discovery","In-depth Cultural","Historical","Holiday"],"oldPrice":0,"price":245,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108213_707b2e74.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108213_707b2e74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_94d955ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_3266239e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_0c62d8c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_9f4c627e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_c7202bd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_1e2fcc25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_4a8d2c17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_8ea96b6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_21b693a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_92a45831.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_9fb14c81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_1487211a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_c09f006e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_54fa8028.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_dd8e109a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_794a889d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_74b35798.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_f1cf31da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_848d6c1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_fe57a2ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_416b43c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_22d39413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108213_1c2e67d1.jpg"],"destinations":["Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: AIRPORT PICK UP - HO CHI MINH CITY VISIT BY VIETNAM CYCLO","description":"Meals included: Phở Vietnam \nDriver will pick up at the airport transfer to the hotel in the center.\nExplore Ho Chi Minh City’s historic by the locals, and experience the city as it was before the war. Traveling by cyclo which is the typical pedicabs of the city, experience local life up close, stopping to enjoy tasty food. Ho Chi Minh City Tour visits the War Remnants Museum - originally opened in September 1975, it displays old military equipment and other related items from Vietnam War. We continue to visit the Reunification Palace, formerly known as the Presidential Palace that was the sight of South Vietnam's Surrender in April 1975. Walk down to see Notre Dame Cathedral and General Post Office which are beautiful examples of architecture from the French colonial period. After that, you transfer to local restaurant for enjoying Vietnamese noodles soup - Phở. Back hotel, free time for leisure. Overnight in Ho Chi Minh city."},{"title":"Day 2: DISCOVER MEKONG DELTA BY WOODEN BOAT","description":"Meals included: Breakfast, Lunch\nStart: 8.00am – Return: 5.00pm\n7h30 a.m Our tour guide welcome you at Vietnam Adventure Tours office, then transfer to the City of My Tho by bus. During 1.5 hours bus drive to My Tho join activities of local people and enjoy nice scenery of green rice paddy fields. We visit Vinh Trang pagoda - biggest pagoda in Mekong delta. Continue going to My Tho, where we take a boat trip along Mekong River. During a boat cruise along Mekong River, you can see fish cages, floating houses on the river.\nThe boat take you to small canal, where is the place you totally escape from the busy town. The boat cruise in the coconut trees canal takes you to a coconut island in Ben Tre. We disembark and have a walk around the village. Stop at a local family to enjoy tropical fruit, taste honey tea, honey wine and listen to Vietnamese traditional music, performance by the villagers.\nContinue walking on the village’s road to coconut candy shop, learn how to make candy, show some handicraft made by coconut tree. Take a walk through village with two sides there are so many kind of fruits, flowers, trees, local houses, children in Mekong delta, take your time to have nice photos and enjoy nature scenery. Then, we head to the local restaurant. Lunch is set with special Vietnamese food at here. Enjoy lunch under tree shadow you will feel the life is so beautiful.\nAfter lunch you relax half an hour to walk around the village or biking, travel on the river to back the ferry, transit to the bus back Saigon, arriving in Vietnam Adventure Tours office around 5:00pm. Tour ends with the sweet memories. Free time for leisure. Overnight in Ho Chi Minh city."},{"title":"Day 3: CU CHI TUNNELS","description":"Meals included: Breakfast\nStart: 8.30am – Return: 3.00pm\nWe depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh city. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out! \nBack Ho Chi Minh city, free time for leisure. Overnight in Ho Chi Minh city.\nExtra option: Dinner Cruise and Water Puppet Show from 06.00pm to 09.30pm. Please confirm the extra service when you book, it is 65usd/person. "},{"title":"Day 4: DEPARTURE","description":"Meals included: Breakfast\nDriver take you to Tan Son Nhat Airport for next trip. Say goodbye and hope to see you again."}]}]