[{"name":"Vietnam Family Holiday - 8 days","duration":8,"travelStyle":["In-depth Cultural","Adventure","Family","Group","Fully Guided","Sightseeing","Historical","Holiday"],"oldPrice":0,"price":1295,"summary":"VIETNAM FAMILY TOUR (for children aged 5 years and above): Discover the highlights of Vietnam on this 8 day group tour for families. See Ho Chi Minh's famous house and the '36 Streets' of Hanoi, cruise between stunning limestone islets in Halong Bay and enjoy a fun farming experience at Cam Thanh. With plenty of free time to relax by the pool or at the beach in enchanting Hoi An.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/181551_1a23d419.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/181551_1a23d419.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_78d07d00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_a4e230ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_26b58b83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_091178a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_dc87e9dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_d23b0121.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_e3af2362.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_67748541.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_2e1c5326.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_16ccbfcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_792061ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_ae821ef8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_3ac8ebb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_6d13f7cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181551_da354403.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"Sunday. Xin Chao! Welcome to Vietnam and the start of your family holiday. You'll be met by our representative at the airport and transferred to our hotel for check-in. The rest of the day is free for you and your family to explore the city, with its picturesque tree-lined avenues, scenic lakes, ancient pagodas and bustling old town, all of which are easily accessible by foot. At 6pm there will be a Welcome Meeting in the hotel lobby."},{"title":"Day 2: Hanoi","description":"After breakfast, we head out to explore the Vietnamese capital, starting at the Ho Chi Minh complex. Here we take in Ho's mausoleum and the former leader's simple house on stilts, where he chose to live throughout the Vietnam War. We also enjoy a guided walking tour of the Old Quarter of Hanoi with its '36 Streets', where skilled craftsmen and artisan guilds set up shop in what was once the beating heart of the city. After our tour, we enjoy a delicious lunch before returning to the hotel. The afternoon is free to relax or further explore independently."},{"title":"Day 3: Halong Bay","description":"Hanoi - Halong Bay. Leaving Hanoi, we transfer to perhaps the jewel in Vietnam's crown - pristine Halong Bay. Here karst limestone islets dappled with green vegetation rise out of the emerald water. We'll be exploring the bay on an overnight cruise aboard a deluxe junk boat, which are based on a traditional design, combining oriental style with modern luxury. This afternoon we visit Trinh Nu Cave to marvel at the stalactites and stalagmites. You can also go kayaking or enjoy a refreshing swim in the bay. This evening there's a Vietnamese cooking demonstration back onboard and we tuck in to a tasty seafood dinner. "},{"title":"Day 4: Hoi An","description":"Halong Bay - Da Nang - Hoi An. Early risers can join a Tai Chi class on the sundeck at sunrise. There's also time to explore the beautiful Sung Sot Cave, which consists of two cavernous chambers that are big enough to hold thousands of people. After visiting the cave, we disembark our junk boat and transfer to Hanoi airport for our flight to Da Nang. From Da Nang we transfer to Hoi An, where the evening is free to relax or explore this enchanting waterfront town. "},{"title":"Day 5: Hoi An walking tour","description":"Hoi An is a charming, old-world trading port, home to quaint cobbled streets, traditional Vietnamese houses and tiny shops - the perfect place to lose yourself in a bygone era. On a short walking tour we take in the Chua Ong Pagoda, Chinese Assembly Hall, 200-year old Tam Ky house and the even older Japanese Bridge. The rest of the day is free to relax at the hotel with your family or further explore this endearing town your way. Boutique restaurants, hip cafes along the waterfront, delightful craft shops and artisans including some of Asia’s best bespoke tailors (whose services come at a nominal price), can all be found here. "},{"title":"Day 6: Hoi An","description":"Today we enjoy a leisurely bicycle ride past rice paddies, local orchards and rural farm workers to Cam Thanh village. Meeting local farmers, we enjoy a fun, hands-on farming experience. Get stuck in as we help the farmers with their daily works, including spreading organic manure, creating organic pesticides and cultivating the soil. Our hard work deserves its rewards and after the gardening, we use some of the farms organic produce to cook a delicious lunch. Eat your meal out in the garden before we continue on our bicycles to a bamboo workshop. Here we work with a talented craftsman to make our own bamboo sculptures and products. We then transfer back to the hotel. "},{"title":"Day 7: Hoi An","description":"Today is completely free of scheduled activities so that you can relax with your family or further explore however you like. Hoi An is great for shopping and there are many fantastic restaurants that foodies may wish to visit, alternatively consider heading to the beach for the day."},{"title":"Day 8: Hoi An","description":"Hoi An - Da Nang. Today our Vietnamese family adventure comes to an end. There's an included departure transfer to Da Nang Airport for your onward flight home."}]},{"name":"Highlights of Vietnam","duration":10,"travelStyle":["In-depth Cultural","Adventure","Jungle Trekkings","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1799,"summary":"This trip encapsulates the magic of Vietnam: the conservative north, the rich \nheritage of the imperial cities, coastal scenery, rural rolling countryside \nwith soaring mountains and the vibrant life of Saigon and the Mekong Delta. \nWe come face to face with an outgoing culture, where so much goes on in the \nstreets; eating, washing, socialising, buying and selling or impromptu games. \nThis intoxicating parade of Vietnamese daily life may leave us with our \nstrongest memories, as much as the superb landscapes and amazing cuisine.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/103605_444972dd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/103605_444972dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_bc0ee8d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_6bf98271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_0f335f08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_2405025a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_24e6e44d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_72fe1611.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_b3d2a6ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_f3dcce41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_ac15e836.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_ce2ec0ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_bc4bc3a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103605_4b66286a.jpg"],"destinations":["Hanoi","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Start Hanoi","description":"Depending on your arrival time you might like to start exploring this \nfascinating city by strolling amongst broad tree-lined avenues dating from \nthe French period. There is a faded colonial charm where baguettes and good \ncoffee are sold from doorways of grand buildings of a past era. There will be \na welcome briefing this evening with your leader followed by a welcome dinner \nat KOTO, a social enterprise that trains and employs underprivileged youth to \nprovide a step up in life. The delicious food provides a fitting welcome to \nVietnam and chance to meet your fellow travellers.\n\n*May De Ville City Centre Hotel or similar*"},{"title":"Day 2: To Halong Bay; cruise among limestone formations; overnight on boat","description":"We make an early start for the approximate 4-hour journey to Halong Bay. This \nis one of the most stunningly beautiful sights in South East Asia with \nroughly 3,000 limestone peaks rising directly from the clear emerald sea. We \ncruise amongst this amazing karst scenery and enjoy a seafood lunch on board. \nWe overnight on board in twin share cabins with en suite facilities.\n\n*Overnight Boat*"},{"title":"Day 3: Transfer back to Hanoi; overnight train to Dong Hoi","description":"We continue to cruise around Halong Bay this morning before returning to \nport. We then drive back to Hanoi where we have a bit of free time to explore \nthis fascinating city. You might like to join the locals by pulling up a \nplastic stool and sampling one of the many street food offerings; the bun cha \n(barbecued pork with rice noodles and fresh herbs) is not to be missed! Late \nafternoon we transfer to the train station to board our overnight train to \nDong Hoi, 500km south of Hanoi. \n\n*Overnight Train *"},{"title":"Day 4: Journey to underground rivers, karst mountains and verdant jungle of UNESCO site Phong Nha N.P","description":"Arriving into Dong Hoi at sunrise we journey to the Phong Nha Ke Bang \nNational Park and have breakfast at the farm-stay that will be our overnight \nspot later on. Designated a UNESCO World Heritage site in 2003, the National \nPark contains the oldest karst mountains in Asia. Riddled with hundreds of \ncave systems and spectacular underground rivers, this is an area very new to \ntourism but sure to impress with its scale. We will first explore Thien Duong \ncave, known locally as Paradise Cave. This was only discovered in 2005 by \nscientists from the British Cave Research Association with the help of a \nlocal man who had heard the mountains ‘whistling’ while farming.\n\nAfter lunch we will visit Phong Nha cave by boat before returning to the \nfarm-stay. There will be time to relax and enjoy the peace of the countryside \nor for those who wish there is the option to cycle around the local \nvillages. \n\n*Chay Lap Farm or similar*"},{"title":"Day 5: To Hue via Vinh Moc tunnels; a key resource during the Vietnam War","description":"We start our journey to Hue today stopping en-route at the Vinh Moc war \ntunnels. Less well-known than the Cu Chi tunnels in the south, these tunnels \nwere predominantly used as bomb shelters during the Vietnam War. During times \nof bombing, village life carried on underground; children went to school, \nhospitals were established and films were even played with a generator.\n\nWe next stop at the Hien Luong bridge which crosses the Ben Hai River. This \nformed part of the border between North and South Vietnam from 1954 until \nreunification in 1975. We will arrive in Hue mid-afternoon and will have some \nfree time before an optional group dinner. \n\n*Park View Hotel or similar*"},{"title":"Day 6: Hue city tour; transfer to Hoi An","description":"It is claimed that Hue is the cultural and historical centre of Vietnam, and \nthere is plenty to see. The most outstanding sight is the Imperial Citadel \nwith walls six miles in length; inside are the palaces and halls of the \nMandarins, and the remains of the Forbidden Purple City, where only the \nemperor, his eunuchs and concubines were allowed. The Forbidden Purple City \nwas almost totally destroyed during the Vietnam War's Tet Offensive, but the \nfoliage-covered ruins are still atmospheric and the gaping holes left by \nbombs give an idea of the destruction wreaked upon the country during the \nwar. This morning we visit the Imperial Citadel and the famous Thien Mu \nPagoda. The pagoda was a centre for anti-government protest in the early \n1960's and it houses the Austin car that transported a monk, Thich Quang Duc, \nto Saigon in 1963 where he burned himself in protest against the President. \nThe photograph of his self-immolation was printed in newspapers all around \nthe world.\n\nAfter lunch we leave for Hoi An via the spectacular Hai Van Pass; 19kms of \nroad winds up and over the fortress of mountains providing breath-taking \nviews of the coast. \n\n*Hoi An River Green Boutique or similar*"},{"title":"Day 7: Walking tour of Hoi An; free time for market exploration","description":"This morning will include a walking tour of Hoi An, the original European \ntrading port in Vietnam dating back to the mid-16th century. It is now a \nliving museum, with attractive wooden merchant's houses and pagoda-style \ntemples with Chinese, Japanese, Vietnamese and European architectural \ninfluences. It is also a marvellous place to wander around and enjoy the \nthriving riverside market and great silk, clothes shopping. \n\nThis afternoon is free, one popular option is to jump on a bike for a ride \nthrough the countryside past local markets, schools and villages before \ncontinuing on to Cua Dai beach (5 km).\n\n*Hoi An River Green Boutique or similar*"},{"title":"Day 8: Fly to Saigon; visit main sites","description":"We drive to Da Nang and then fly to Ho Chi Minh City (Saigon), an exciting \nand absorbing city where scooters pack the streets and temples stand \ndefiantly alongside modern developments. Devastated by the Vietnam War, it is \nnow a bustling free market city where anything goes. Here, we include a visit \nto the Ben Thanh Market, Reunification Palace, Notre Dame Cathedral and War \nRemnants Museum. The Museum has an interesting photographic record of the \nVietnam/American War. Please be aware that some images at the museum are very \ngraphic.\n\n*Adora Hotel or similar*"},{"title":"Day 9: Day trip to Mekong Delta; return to Saigon for final evening","description":"Journeying out of the city we head to the lush countryside that is the Mekong \nDelta for a day tour. Known as the ‘rice bowl’ of Vietnam, this region \nproduces most of Vietnam’s fruit, sugar cane and coconuts. We take a boat \ntrip along the many tributaries and stop to see some small cottage industries \nalong the way. We will journey by sampan, a traditional wooden low-riding \nboat still used by the locals as the main form of transport. After sampling \nsome of the local produce we head back to Saigon where your leader will \norganise an optional group farewell dinner.\n\n*Adora Hotel or similar*"},{"title":"Day 10: End Saigon","description":"For land only clients, the tour ends this morning in Saigon after breakfast."}]},{"name":"Cycle Vietnam","duration":14,"travelStyle":["Bicycle","Adventure","Group","Fully Guided","Discovery","In-depth Cultural"],"oldPrice":0,"price":2240,"summary":"On this trip we discover the highlights of Vietnam by bike. Explore the charming cities of Hanoi, Hue, Old Saigon and Hoi An and experience the natural beauty of Halong Bay. Visit the ancient capital of the Cham Empire at My Son and discover the thriving Mekong Delta by boat and on two wheels.  Halong Bay - cruise amongst the beautiful landscapes of Halong Bay  Bike Vietnam - Get closer to Vietnam's fascinating sites and welcoming people from Hanoi to Saigon  Hue, Hoi An and My Son - Cycle the Imperial sights and World Heritage monuments  ","highlights":["Wander through ancient sites and enchanting villages","Discover the colonial charms of Vietnam's capital","Cruise amongst the beautiful landscapes of Halong Bay","Cycle the Imperial sights and World Heritage monuments"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124493_281a26db.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124493_281a26db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_fcf93b28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_0434ee40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_8a8972db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_44acd090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_89f7e7fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_72869c70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_db7dd366.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_a78d4fda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_909e197e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_1278b673.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_6717067d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_6d398d0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_d2a673b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_f7035f05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_11ff16ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_6003d199.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_ba9c9e11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_530551db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_d2a89a56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_b48be454.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_53f24f29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_f999934d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124493_2a5a190e.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Join tour Hanoi. PM orientation of Hanoi’s Old Quarter","description":"Our journey starts in Hanoi - Vietnam's vibrant capital. Architecturally styled like a French provincial town, with tree-lined boulevards and low-rise buildings, a walk through the bustling streets of its Old Quarter provides an ideal introduction to its fascinating heritage. Named after the various crafts and specialities of the city's artisans, each street bears such descriptive monikers as Paper Street, Silk Street and Basket Street. This practice dates back to the 13th century, when the city's original 36 guilds established themselves here, adopting a street each to differentiate them from their neighbours. Street food sellers tempt you with all manner of noodles, snacks and stir-fried delights from shoulder panniers, all adding to the charm of Hanoi's historic heart.\n \n The Tour Leader plans to meet you in the hotel reception at 4pm for the welcome meeting followed by a walking tour through the Old Quarter. If you would like to receive a complimentary airport transfer today, you'll need to arrive into Noi Bai International Airport (HAN), which is 45 minutes from the hotel.\n \n Please note that if you wish to join the afternoon orientation walk today, you must arrive at the hotel by 4pm. If you are booking your own flights, we recommend giving yourself 30 minutes to an hour to clear the airport. Therefore the latest your flight can arrive is about 1.30pm. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk.Start point\n Anise Hotel Hanoi, Hotel Reception, 22 Quán Thánh, Nguyễn Trung Trực, Ba Đình, Hà Nội, Vietnam 16:00"},{"title":"Day 2: AM Hanoi city tour. PM cycle ride around West Lake","description":"After breakfast we will have the opportunity to check out our bikes and complete any necessary fine tuning. We then continue by bus for a morning sightseeing tour of the city in the company of our local guide. We will include visits to the 11th century Quan Thanh Taoist Temple, the charming One-Pillar Pagoda, the temple of literature and the Presidential Palace. Ho Chi Minh himself was a spartan living and scholarly who chose not to reside in the Presidential Palace itself, but himself preferred a simple teak, 2 - storey stilt house especially built for him in the grounds. We'll have a chance to visit this simple structure today, before heading back to the hotel. After lunch we will enjoy an afternoon's cycle ride around the nearby West Lake. A journey of some 17-20 kms, the ride takes us around the largest fresh water lake in the capital, a place steeped in legend and lying in the bustling heart of the city. Covering some 500 ha and surrounded by gardens, temples and some of Hanoi's most opulent real estate, the lake provides us with an ideal venue to test out our bikes. Our circuit will include stops at the Buddhist library of Thu Sacha and the Phu Tay Ho Temple, an especially lucky place for women who come here to ask for blessings. \n \n Our total cycling distance today is approximately 17 to 20 kilometres"},{"title":"Day 3: Drive to Dong Ho; cycle through villages of the Red River Delta","description":"Departing Hanoi this morning, we head first for the village of Dong Ho, situated to the east of the city. Famed for its folk paintings, the village has existed on the banks of the Duong River since the 16th century and its art reflects centuries old traditions. Hand printed on papyrus-like paper, the paintings traditionally reflect feelings of prosperity and happiness, their colours generated from locally acquired materials such as charred bamboo leaves and finely ground oyster shells. We will have an opportunity to spend some time with the artisans this morning, before continuing our journey from here by bike, cycling along the dyke of the Duong River. The dyke system in the North of Vietnam is the longest in Indochina, stretching over 2400 kilometres. Cycling atop the dikes we will pass through commercial vegetable gardens providing much of the capitals fresh produce and encounter plenty of grazing cattle. After a distance of around 8kms we will arrive at But Thap, where we will visit the 17th century Pagoda before continuing on our bikes through lush landscapes to Kim Son. Here we will visit the Sui Pagoda, where novice monks are trained in the art of meditation. Nearby a small vegetable market will provide us the opportunity to see some of the produce from the dike gardens. Re-joining our bus here we then drive on to Phu Thi in the Red River Delta, for a home cooked lunch and a chance to learn a little about local customs and traditions from our hosts, before continuing by bus towards the Gulf of Tonkin and the stunning karst landscapes of Ha Long Bay. \n \n Our total cycling distance today is approximately 15 kilometres"},{"title":"Day 4: AM Ha Long Bay cruise. PM drive to Ninh Binh via Nhan Muc","description":"One of South East Asia's most spectacular settings, where thousands of limestone islands rise from the jade green waters of the bay like the scales of some great submerged dragon, Ha Long Bay is a World Heritage site of natural majesty. Ha Long translates as the place \\ where the dragon descends to the sea\\  and local legend tells of a time when this rugged landscape was created by the pounding tail of a mighty dragon as he ran from the mountains into the sea. This morning we will board a charter boat for a cruise amongst its limestone islands, threading our way through a flotilla of boats, junks and wooden sampans as they ply their way across the gentle waters of the bay. The plan is to spend the morning sailing through this stunning seascape, stopping off to visit some of the limestone caverns that pepper the landscape and enjoy a delicious seafood lunch on board. This afternoon we then continue by road to the village of Nhan Muc, where we will enjoy a traditional water puppet show (a practice that dates back to the 15th century) and have a chance to interact with the locals, before we complete our journey to the town of Ninh Binh. We arrive to our hotel in the evening after a long yet rewarding day. No cycling, rest day."},{"title":"Day 5: Exploring rural scenes of Ninh Binh by bicycle. Overnight Reunification Express to Hué","description":"Cycling the back roads to Hoa Lu this morning, we visit the country's ancient capital. Once the political and cultural centre of Dai Co Viet (Vietnam), the city ruled over the region's first centralised feudal state. Whilst many of its ancient monuments are long gone, we will get a chance this morning to visit the temple of King Dinh Tien Hoang, the man who unified the country and founded Vietnam's first feudal dynasty. From here we cycle along narrow concrete paths through picturesque local communities on to the 12th century Nguyen Saint Temple. After a break at the temple we head through rural countryside towards the spectacular limestone karst formations of Van Long, and finally on to the nearby village of Vuon Thi, where we enjoy a delicious traditional lunch. There may be an opportunity to try some traditional farming and fishing instruments in the yard. After lunch we cycle the short distance to the nearby dock for a tranquil sampan journey around the stunning caves and Karst scenery of the Van long Reservoir. Returning to Ninh Binh later this afternoon by bus, there will be some free time in the city and to freshen up in our hotel dayroom before we board the Reunification Express for the overnight journey to Hué. \n \n We plan to sleep in 'soft-sleeper' four berth cabins, and bunk bed style and bedding is provided. Both Western and Asian style toilets are at the end of each carriage as well as a basin. The Leader will allocate beds keeping people together as far as possible but it may be necessary to share with other travellers.\n \n Our total cycling distance today is approximately 34 kilometres"},{"title":"Day 6: Arrive Hué. PM biking tour of Hué.","description":"Arriving in Hué this morning we transfer to the hotel and check in, after checking and adjusting our bikes the rest of the morning is free to relax and enjoy at your leisure. Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hué is divided by the waters of the Perfume River, which separate the city's 19th century citadel from the suburbs that radiate from the eastern shore. Even today, its easy air of leisurely ambience makes it one of the most engaging cities in the country to explore and, after lunch, we will cycle our bikes on a tour of the imposing Citadel. Built by the Nguyen dynasty (Vietnam's ruling emperors from the early 1800s to 1945), the Citadel still dominates the left bank of the Perfumed River. Its formal moats and impressive ramparts were constructed to be an exact copy of the Forbidden City in Beijing, and whilst much of the inner city suffered badly during the heavy bombardments of the Tet Offensive in 1968, the huge outer walls and the West Wing remain an eloquent reminder of the palace's former glory. Later today we will cycle out to the lovely tile-roofed bridge at Thanh Toan. Built over two centuries ago, the arched wooden bridge spans a canal that runs through the village and has long been an iconic and cultural landmark in the area. Late in the afternoon the old folk gather on the bridge to talk and reminisce. After enjoying the tranquil atmosphere around the bridge we will cycle back to our hotel.\n \n Our total cycling distance today is approximately 18 kilometres"},{"title":"Day 7: AM Exploring around Hué by bicycle. PM Perfume River optional.","description":"This morning we will enjoy the peaceful leafy backstreets of this charming city, cycling out to explore the countryside around Hué. We begin with a visit to the Ho Quyen amphitheatre, where the emperor presided over duels between tigers and elephants. Continuing on to the 19th century Nguyen Tomb of Tu Duc, we will enjoy the beautiful complex of ornate temples, pavilions and tombs built beside a picturesque lake. After a visit to the eunuch tombs at the Tu Hieu Pagoda, a gentle ascent of Vong Canh Hill rewards us with spectacular views. From the pine forest atop the hill we can look over the Perfume River and the surrounding countryside and tombs of the Nguyen dynasty. We finish our morning cycling further out to the vast 19th century tomb of Minh Mang, possibly the finest of all the imperial tombs. Returning to Hué by bus around lunch time, the rest of the day is then free. There is the option to take a half day excursion along the Perfume River, visiting the iconic Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hué. Dedicated to the Manushi-Buddha, the existing temple was constructed in the middle years of the 19th century, under the auspices of the Emperor Thieu Tri, and within its confines you can find a number of superb Buddhist statues, as well as an enormous cast bell that weighs in at over 2000 kg and is reputed to be audible over 10 km away.\n \n Our total cycling distance today is approximately 35 kilometres"},{"title":"Day 8: Bus and bike to Hoi An, via Hai Van Pass and Danang","description":"20 This morning we drive south for about an hour to reach Phouc Tuong Pass where today's ride commences. We cycle firstly past arable lands and later beside a large lagoon after which the cycle ride finishes. Getting back in the vehicle we start our drive south, and time permitting we will stop at Lang Co, a section of the famed China Beach, to enjoy a spot of swimming. Known locally as My Khe, the name China Beach was accorded by US troops who came here for R & R during the Vietnam War. After our break to relax here we follow the coastal road towards the Truong Son Mountains and the lofty heights of the Hai Van (Sea Cloud) Pass. This scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and as we reach the pass itself the views before us are simply spectacular. After a short stop at the pass we drive downhill towards the major city of Danang, accompanied by stunning panoramas of mountains, islands and ocean. We soon encounter Thuan Phuoc Bridge - the longest suspension bridge in the country at 1850 metres in length - spanning the Han River, then we continue our onward journey to the bustling port of Hoi An. First colonised by the Portuguese in the 16th century, by the 17th and 18th centuries, Hoi An had become one of the busiest international trading posts in South East Asia and, even today, it still retains the engaging charm of a medieval port, with many of its old buildings superbly preserved. The rest of the day has been left free to wander through the historic heart of this World Heritage Site at your leisure. You might like to pay a visit to the Japanese Bridge, Hoi An's emblematic symbol, believed to have been constructed to quell the violent rumblings of a restless monster, or perhaps explore the traditional wooden houses and Chinese temples that line the streets. Other alternatives include visits to the local cloth mill and the hire of rowing boats to explore the landscapes along the river.\n \n Our total cycling distance today is approximately 28 kilometres"},{"title":"Day 9: Around Hoi An: river trip, cycling and free time","description":"This morning we board another boat, for a cruise down the river to the busy village of Kim Bong. However, in the company of an appointed village guide, we will uncover a hive of cottage industries amongst old colonial houses and temples. Biking through lush rural landscapes we will see local people producing boats, straw matting and rice noodles. Continuing by river on to the pottery village of Thanh Ha, we then have an opportunity to visit a traditional workshop and watch local artisans continuing a tradition that has existed in this village since the 16th century. We cycle the few kilometres back to Hoi An with the rest of the day free for more personal sightseeing. There is an opportunity to extend todays cycling with an optional visit to Tra Que village to learn about organic vegetable and herb farming. Here you can also enjoy a delicious lunch and even a herbal footbath and massage (at your own expense) in a local house in the village. \n \n Our total cycling distance today is approximately 8 kilometres with an additional optional 12 kilometres."},{"title":"Day 10: Visit to My Son","description":"Today we start our day with a short bus journey to a place called Nam Phuoc from where we will cycle our way through to My Son. My Son has been dubbed as a UNESCO World Heritage site and has ruins of structures from ancient Champa Kingdom which flourished between the 2nd and 15th Centuries. For those hankering for culture and history, this presents an ideal opportunity to explore the most evocative of Vietnam's Cham sites at My Son. The Chams were dynastic lords who rejected the authority of China in 2AD and established their own kingdom. For 1000 years they managed to stave off attacks by the Vietnamese and Chinese, before being overcome by the Vietnamese in the 15th century. The site contains several impressive groupings of Cham temples and present probably the finest example of Cham masonry skills in the country. We take a bus back to our hotel in Hoi An. \n \n Our total cycling distance today is approximately 30 kilometres"},{"title":"Day 11: Fly to Saigon (Ho Chi Minh City); afternoon downtown orientation","description":"After first transferring to Danang airport this morning, we fly south to Vietnam's largest and most vibrant city - Ho Chi Minh City. Still commonly referred to by its old colonial title, Saigon is an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit. After a short flight from Danang, we'll transfer to the hotel and check in, after which we will take a brief orientation tour of the city on foot. As part of our tour we will include the prominent sights of the Hotel de Ville, whose ornate grandeur is today the home of the People's Committee. We also take in the Opera House (formerly the National Assembly building), the Romanesque Notre Dame Cathedral and the impressive French style edifice that is the GPO building. Afterwards you will be free to enjoy some personal exploration, affording a chance to visit some of the many temples that lie dotted around the city, or perhaps to do some shopping amongst the bustling stalls of the Binh Tay Market, the largest wholesale market in southern Vietnam and a fabulous place to stroll and meet the locals. No visit to Saigon would be complete without exploring something of its tragic recent history too and this afternoon also offers a chance to visit the remarkable Reunification Palace and the emotive War Crimes Museum, where you can find some poignant and moving reminders of Vietnam's colonial wars.\n \n No cycling, rest day."},{"title":"Day 12: Cycle to the Cu Chi Tunnels. Freetime in Saigon","description":"This morning we drive out of the city to Cu Chi (1.5 hours), from where we cycle out visit to the infamous Cu Chi Tunnels. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops and were a major part of the Tet Offensive. This area was the centre of intense fighting during the war, much of it falling prey to the incessant carpet bombing, napalm and defoliants utilised by the Americans in an attempt to dislodge the Viet Cong from their underground shelters. There is little evidence of any of that now and the landscape has returned to something of its pre-war beauty, but exploring the tunnels of Ben Dinh and Ben Bihn gives some idea as to the conditions that the Vietnamese and their American adversaries had to endure. Be warned, the tunnels are low and narrow and can be claustrophobic. Driving back to Saigon after lunch, the remainder of the afternoon is free to enjoy a last look at this remarkable city. \n \n Our total cycling distance today is approximately 25 kilometres."},{"title":"Day 13: Cycling in the Mekong Delta","description":"Today we journey by vehicle, boat and bike into the Mekong Delta to explore these fascinating waterways. Firstly we make our way by bus from Saigon to Cai Lay (2 hours), where we start cycling alongside calm canals and rivers. Along the way we will learn more about local life, taking in the verdant gardens and orchards as we go. After an included lunch we take a boat trip to see local cottage industries making such things as rice paper, coconut sweets and rice cakes, before returning to Saigon later in the afternoon (3-4 hour drive).\n \n Our total cycling distance today is approximately 20 kilometres."},{"title":"Day 14: Tour ends Saigon","description":"The trip ends after breakfast at our hotel in Ho Chi Minh City.\n \n There are no activities planned today, so you are free to depart from Ho Chi Minh City at any time. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you'll need to depart from Tan Son Nhat International Airport (SGN), which is 30 minutes from the airport.End point\n Huong Sen Hotel, Hotel reception, 66-70 Đồng Khởi, Bến Nghé, Quận 1, Hồ Chí Minh, Vietnam 09:00"}]},{"name":"Northern Vietnam KOM Challenge: Hanoi to Sapa","duration":9,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Discovery"],"oldPrice":0,"price":1900,"summary":"Northern Vietnam has long attracted adventurers in awe of its vistas, but vastly improved roads have caught the attention of the cycling adventurers. And it's not hard to see why road cycling in Asia is developing: an endless green expanse of climbs and descents, ribbon roads through forests, rice paddies to peaks and cloud-skimming mountain passes. Our road cycling Northern Vietnam trip from Hanoi to Sapa takes riders through the very best of Southeast Asia's next cycling paradise, for a truly unforgettable cycle tour.","highlights":["Cycle through tranquil countryside flanked by green mountains","Ride through rice-terraced hillsides and lush tropical forests","Test yourself with short and steep climbs through karst countryside"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/172871_a824efe1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/172871_a824efe1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_a30c38d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_d875b4dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_d09e078e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_e64b271f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_0a8db595.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_717ee06d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_4506d205.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_dc193d7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_05399bb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/172871_2b353f63.jpg"],"destinations":["Hanoi","Mai Chau","Sapa"],"timeline":[{"title":"Day 1","description":"After checking in to your hotel, meet your guide and tour group for a bike fitting followed by a welcome dinner."},{"title":"Day 2","description":"Transfer out of the city by car and begin riding through the rural beauty of Northern Vietnam. Test your legs on some climbs before arriving at a stunning resort on the shores of a lake."},{"title":"Day 3","description":"A long a gradual climb followed by undulating hills through picturesque rice terraces and tea plantations."},{"title":"Day 4","description":"A long, cruising descent followed by a scenic ride through hillside villages."},{"title":"Day 5","description":"In the morning, conquer historic Lung Lo Pass."},{"title":"Day 6","description":"Tackle the second challenging pass of the trip at Khau Pa."},{"title":"Day 7","description":"A final challenging ride with many climbs and a steep pass to the mountain town of Sapa."},{"title":"Day 8","description":"Free morning in Sapa followed by an afternoon transfer to Hanoi."},{"title":"Day 9","description":"Departure for onward travel."}]}]