[{"name":"Northern Vietnam 6days/5nights","duration":6,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":494,"summary":"In and around HanoiUpon arrival at Noibai International airport, our driver will meet and transfer you to downtown for relax. Overnight in Hanoi.\n\n\nTips: - Enjoy water puppet show\n-\tEnjoy 1 hour cyclo to Visit Hanoi old quarter .\n-\tEnjoy local food or Beer in Ta Hien Street.Start point\n Noi Bai Airport , Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam 06:50 - 21:00","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147488_b6277c6b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147488_b6277c6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_413d13ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_247376a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_01afe1ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_22476ebc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_9ca7b4a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_ff84d95c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_0a198484.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_315ac955.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_7d0ac7f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147488_54b3405d.jpg"],"destinations":["Hanoi","Ninh Binh","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival – (No Meal)","description":"Upon arrival at Noibai International airport, our driver will meet and transfer you to downtown for relax. Overnight in Hanoi.\n\n\nTips: - Enjoy water puppet show\n-\tEnjoy 1 hour cyclo to Visit Hanoi old quarter .\n-\tEnjoy local food or Beer in Ta Hien Street."},{"title":"Day 2 : Hanoi – Bai Dinh Pagoda – Trang An complex - Sapa(B/L) on Train","description":"In the morning:\n07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and\nHanoi Opera House then depart to Ninh Binh province. On the half way stop for short break about\n20 minutes.\n\n\n11:00 Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La\nHan statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n\n\n12h30 Have lunch buffet with Vietnamese traditional dishes, in case you are vegetarian, we have\nother food options for you\n\n\nIn the afternoon:\n14:00 Depart to visit Trang An eco-tourism, take boat trip to visit cave complex: Sang Cave, Toi\nCave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers Ha Long\non land of Ninh Binh. Or you can choose to visit Kong Films, take a photo shoot at Aboriginal\nvillage one of the main scenes in Hollywood blockbuster movie &quot;Kong Skull Island&quot.\n\n\n16:00 Get on the bus back to Hanoi, on the half way stop for short break 20 minutes\n\n\n19:00 - 19:30: Arrive at the hotel .Drop off your hotel. \n\n\nFrom 19:40 -20:00 pick up an transfer to station catch train to Sapa. Overnight on Train "},{"title":"Sapa – Y Linh Ho – Lao Chai – Ta Van(B/L/D) –Trekking","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\n\n\nStart the trip at 9:30 as below.\n12 km of trekking, visit Y Linh Ho and Lao Chai villages of the H’mong minority. after lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay where we stay overnight in a local family. Here you have opportunity to experience their daily life, work and original custom. \n\n\n•\tBreakfast, Lunch and dinner are all included\n\n\n•\tHome-stay at the Dzay local house in Tavan Village\n\n\n•\tTrekking level: 5/10\n•\t12 Km of trekking     \n"},{"title":"Sapa – Fansipang mountain by cable car – Hanoi by bus (B/L)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery.\n9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos).\n11.00: Come back to Cable Car Station and return to Sapa town.\n12.30: Have lunch in the hotel\n13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi\n16.00: Get on bus to go back to Hanoi with two comfort breaks\n20.45: We say goodbye to you at your hotel/stay. Drop off your hotel. Overnight in Hanoi"},{"title":"Day 5 : Hanoi – Halong bay full day with kayaking (B/L)","description":"In the morning:\n07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi\nOpera House then depart to Halong. On the half way stop for short break in Hai Duong province 20\nminutes.\n\n\n12:30 Arrive Tuan Chau Habor. Then embark the Incredible Asia Journeys – Day cruise followed by\na short cruise briefing.\n\n\nIn the afternoon:\n13:00 Start a dreamy cruise to stunning scenery with thousands of limestone mountains and have\nlunch (we serve you with Vietnamese traditional dishes, in case you are vegetarian, we have other\nfood options for you) while cruising through the emerald water passing by the Dog Stone, the\nBurning Incense islet, Fighting-Cock island of Halong Bay symbol.\n\n\n13:30 Stop at Ba Hang fishing village for enjoy kayaking or sit in a bamboo boat rowed by locals (if\nyou have booking before)\n\n\n14:30 Visiting Heavenly Well Cave “Thien Cung Cave” makes the visitors the impression of being in\na heavenly world.\n\n\n15:30 Enjoy the Sunset party with wine and fruit and relaxing on sun deck while cruising back to\nTuan Chau Habor.\n\n\n16:30 Get on the bus back to Hanoi, on the half way stop for short break 20 minutes\n\n\n20:30 - 21:00 Arrive at the hotel in Ha Noi. Drop off your hotel. Overnight in Hanoi."},{"title":"Day 6: Hanoi Free & Easy – Depature (B)","description":"Breakfast at your hotel. Free time to relax and shopping before transfer the airport catch flight back your country. \n\n\nEnd of services !"}]},{"name":"Best of North Vietnam Tour 9 Days 8 Nights (Hanoi, Sapa, Fansipan, Halong Bay and Ninh Binh)","duration":9,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":527,"summary":"Asia Focus Travel provide 9 days 8 nights  tour focuses on the treasures of Northern Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb9884db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193747_5e451fb1208ff.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Halong Bay","Ninh Binh"],"timeline":[{"title":"Ha Noi Arrival - Street Food Tour (D)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.\n17:30 to 18:00 The tour guide will pick you up at your hotel to join with street food tour\nBest list of street food (chosen carefully), from 6-8 dishes among hundreds of\ncuisine list, including dishes and drinks. (*if you’re a vegetarian (no meat, no\nfish), it’ll be limited in the choice of food for you).\nOvernight at hotel in Ha Noi.\n"},{"title":"Hanoi City Tour - Night train to Lao Cai (B,L)","description":"Have breakfast at hotel & ready for the trip at the lobby OR the meeting points. Our guide will pick you up between 07h45 and 08h30. (Please see PICK-UP TIMETABLE) 08h30: Arrive Tran Quoc Pagoda – the oldest pagoda in Ha Noi built in the 6 th century.\n09h00 – 9h15: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of Ho Chi Minh then walk around the garden to see 2 houses where he lived & worked from 1954 to 1969. Then visit One Pillar Pagoda where worships the Godess of Mercy – It is the most unique padoga in the world 11h00: Visit one of these  Vietnam Museum of Ethnology to learn about the culture of 54 ethnic groups living in Vietnam (Tuesdays – Thursdays – Saturdays & Sundays)  Bat Trang ceramíc village to explore the daily life of the local & learn about the process how to make a perfect product (Mondays – Wednesdays – Fridays) 12h30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. 13h30 – 13h45: Continue visit Temple of Literature – the first university of Vietnam, established in the 11 century 15h45: Leave for Hoan Kiem Lake to visit Ngoc Son Temple, which honors General Tran Hung Dao who defeated the invader in 13 th certury. 16h15: Tour finishes. Free time until 19:00 to 19:30 my driver will come to pick you up go to train station go to Lao Cai.\nOvernight on the train\n"},{"title":"Lao Cao - Sapa - Y Linh Ho- Lao Chai and Ta Van Village (B,L,D)","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you\ncan have shower.\nStart the trip at 9:30 as below.\n12 km of trekking, visit Y Linh Ho and Lao Chai villages of the H’mong minority. after lunch at a local family in Lao\nChai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay where we stay\novernight in a local family. Here you have opportunity to experience their daily life, work and original custom.\n Breakfast, Lunch and dinner are all included\n Home-stay at the Dzay local house in Tavan Village\n Trekking level: 5/10\n 12 Km of trekking"},{"title":"Ta Van – Giang Ta Chai – Su Pan - Sapa (B,L,D)","description":"Breakfast will be serving at the homestay at about 8Am\nStart trekking at 9:30 Am\n8 km walking to visit 2 villages of the red Dzao, the H’mong (Giang Ta Chai &amp; Su Pan). Visit a beautiful waterfall and\nrattan bridge. Enjoy landscapes… through bamboo forest on the way to the main road to get the jeep to return to Sapa.\nOvernight in Sapa hotel "},{"title":"Fansipan - Hanoi by Bus (B,L)","description":"06.30 – 07:00 am: Breakfast at hotel.\nTransfer to Fansipan Cable Station for an amazing trip to reach the Indochina Roof, 3143m above the sea level: Starting by cable car and step up to the Peak, enjoy the fresh air and the beautiful landscapes from the high.\nBack to hotel.\nHave lunch at the restaurant.\nCheck out hotel. Free time for relax and refresh.\n15h00: It‘s time to say “Good bye Sa Pa!” and drive back to Hanoi.\n20:30 Arrive hotel, check in hotel\nOvernight in Hanoi \n"},{"title":"Ha Noi- Ha Long Bay, overnight on cruise ( B/ L/ D)","description":"Breakfast at the hotel \n8:00- 8:30 Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12:00- 12:30 Embark on the Cruise followed by a short cruise briefing.\n13:00 Savor a delectable lunch as Ha Long cruises among the limestone islands.\n14:00- 16:00 Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay\n16:00- 17:00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17:00- 17:30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way\n17:30- 19:00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set\n19:00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around\nOvernight on Ha Long Cruise in the middle of Ha Long Bay\n"},{"title":"Ha Long Bay- Ha Noi by bus (B/L)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi\n17:00 Arrive Ha Noi\nOvernight in Ha Noi\n"},{"title":"Hanoi - Ninh Binh - Hoa Lu - Tam Coc (B,L))","description":"07:45 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter. - Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs. - Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century.  - Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century.  12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby. - Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi.  18:00 Arrive in Hanoi.  \nOvernight in Ha Noi\n"},{"title":"Hanoi Departure (B)","description":"Breakfast at hotel, free to shpping and our  tour guide  and driver will pick you up at your hotel and drive to the airport for your flight back home. Tour Finish!\nEnd of services!\n"}]},{"name":"Spectacular Sapa 3 Days 2 Nights","duration":3,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":160,"summary":"On this trek you will explore the beautiful Sapa valley for 3 days with a 2 nights at either Panorama hotel & Sapa Vista hotel in Sapa. This trip is a wonderful opportunity to touch base with nature, enjoy the mountain landscape and views, feel revived and mingle with the humorous village residents. A lovely genuine Sapa experience.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156414_9e001f3e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156414_9e001f3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_842919e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_35a0bbb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_7ed7d802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_cb0cc598.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_107026f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_a1289659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_88fdbfc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_cf8d9b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_00b15bae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_e4948486.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_7a155878.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_699bff0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_30eaaa20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_e0117fab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156414_1b9c394b.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Sapa – Y Linh Ho – Lao Chai – Ta Van - Sapa","description":"7:00 AM: Pick up from hotel by sleeping bus then transfer to Sapa. \n12:30 AM: Arrive Sapa. Check in  the hotel and have lunch.\nStart the trip at as below:\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people.\nLast trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or motorbike.\n• Lunch and dinner are all included.\n• Overnight at the hotel in Sapa.\n• Trekking level: 6/10\n• 10Km trekking, 8Km driving from Tavan village back to Sapa"},{"title":"Day2: Cat Cat and Sin Chai","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 3 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a jeep to return to Sapa.\n\n• Breakfast, Lunch and dinner are all included\n\n• Overnight in a hotel in Sapa.\n\n• Trekking level: 4/10\n\n• 7KM trekking, 3Km driving fron Cat Cat village back to Sapa"},{"title":"Day 3: Sapa - Suoi Thau - Ma Tra - Ta Phin - Sapa","description":"5km by jeep, visit the red Dzao in Suoi Thau, Ma Tra villages. 9km trekking through the local village, the rice and corn field. Picnic lunch en –route. Reach Ta Phin village where we have chance to learn about the life styles and the custom of the red Dzao minority, enjoy landscapes…then drive back to Sapa.\n3:30 PM – Sleeping Bus transfer back to back to Hanoi.\n• Breakfast, Lunch are all included\n• Trekking level: 5/10\n• 9KM of trekking, 20km of driving."}]},{"name":"Sapa Adventure: Medium Trekking 4 days","duration":4,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":190,"summary":"Breathtaking mountain scenery and tribal villages amongst perfect nature setting are highlights of Sapa. Getting off the beaten track and walking through villages where ethnic minority peoples live, paying visit to their homes, witnessing their every day activities,.. Although traveling in very basic condition, including 1 night on the train, 1 night home stay in tribal village, 1 night in standard hotel in Sapa, the trip will bring unforgettable experiences.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158295_4c8f148b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158295_4c8f148b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_2bb2c2f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_5a2cb1dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_3ef38f08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_6f537129.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_7cc0dd84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_0f2647f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158295_cf3467b2.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Take overnight train from Hanoi to Lao Cai","description":"Be ready at your hotel lobby at 8:00 p.m, our tour guide and driver will meet and pick you up for a short transfer to Hanoi Station to take the overnight train to Lao Cai City.\n\n• Overnight on the train"},{"title":"Day 2: Sapa - Y Linh Ho - Lao Chai - Ta Van - Homestay ( B,L,D)","description":"Picked up at Lao Cai Station upon your early arrival for over an hour drive uphill in a shared mini van to Sapa. After freshen up and Breakfast in a local restaurant, transfer 6km along the main road to a beautiful spot where your village trek begins.\n\nThis part offers spectacular scenery of the highest part of Hoang Lien Son mountain range and in a nice day, Fansipan Peak can be seen. Crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. Here you will pay visiting to some H’mong families, watching them doing their daily works. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai, a large village of the H’mong and then following the river bank to Ta Van of the Zay people, paying visiting to local homes, village schools… you will enjoy much your cultural discovery of local ethnic peoples as well as breathtaking scenery of the Muong Hoa Valley. Tonight you will enjoy a home stay in Ta Van Village for an unique life experience. \n\n• Accommodation: Homestay in Ta Van Village"},{"title":"Day 3:Ta Van - Giang Ta Chai - Su Pan - Sapa ( B,L,D)","description":"Wake up in the morning, you may feel little bit tired, let go out to the river, breathing fresh air and do some exercises, freshen up and enjoy breakfast, the food get tastier for sure!\n\nLeaving Ta Van Village, your trek goes along Hoang Lien Son mountain range, passing fascinating terraced rice field and some small hamlets of the H’mong before getting through a bamboo forest to a waterfall, enjoy a break for magnificent scenery and then continue walking for half an hour to Giang Ta Chai village of the Red Zao peoples which sits on the top of a hill and looks down Muong Hoa river. After spending time visiting the village, making friend with the Zao and experiencing the hospitality you will cross the river by a suspension bridge and then uphill to visit Su Pan village on the other side of the valley before getting back to the road for transferring back to Sapa, check in hotel and relax. \n\n• 3*  hotel in Sapa Town"},{"title":"Day 4:Sapa - Cat Cat - Sin Chai ( B,L)","description":"Breakfast at your hotel and departing for a walk to Cat Cat village locating near the bottom of a deep valley at the foot of Fansipan Peak. Spectacular scenery of mountains and terraced rice paddies changes after every corner as you walk downhill. Getting through Cat Cat village of the H’mong, you will pay visiting to some local homes, witnessing their daily life activities and experiencing their hospitability. Continue walking down to the valley bottom, having a break at a stunning waterfall where the French built a hydraulic power station. After Lunch you will walk uphill and make a loop around the valley to visit another village of Black H’mong and then back to Sapa in middle afternoon.\nAt 4p.m: Bus take you to be back Hanoi and arrive in Hanoi at 10p.m"}]},{"name":"Private Vietnam Legend 10 Days Package - Hi-end TOP 5*","duration":10,"travelStyle":["Discovery","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":2899,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the Discovery tour Private Vietnam Legend 10 Days Package - Hi-end TOP 5*, you have a 10 days tour package taking you through Hanoi, Vietnam and 5 other destinations in Vietnam. Private Vietnam Legend 10 Days Package - Hi-end TOP 5* includes accommodation in a hotel as well as flights, an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95438_5eb98022.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95438_5eb98022.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_13e44d4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5fbabc0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_51bfdbfc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_9b4a6f2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_25199824.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_7cd3f0fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_e489bbc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_1fda3a12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_94b8e9a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035dffdbd4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035dffe9fa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035dfff1b55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e000e9b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e00154e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e001bb3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e0021211.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e211effa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e213379a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e2140bd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e2147efa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e21505ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e21584bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95438_5e035e5086b73.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi at anytime. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nLegend Metropole Hotel Hanoi or similar"},{"title":"Day 2: Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nLegend Metropole Hotel Hanoi or similar"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nHalong Violet Cruise or similar"},{"title":"Day 4: Halong Bay Cruise - Depart for Hue Imperial City. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive to airport directly. Arrive Noi Bai Airport (Hanoi) at 3:00pm. Catching flight to Hue City. Arrive Hue City, transfer to hotel for check in. Overnight in Hue.\nIndochine Palace Hotel Hue or similar"},{"title":"Day 5: Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nIndochine Palace Hotel Hue or similar"},{"title":"Day 6: Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nThe Nam Hai Resort Hoi An or similar"},{"title":"Day 7: Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nThe Nam Hai Resort Hoi An or similar"},{"title":"Day 8: Leave Hoi An to Saigon/City Sightseeing. (B, L)","description":"Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Colon, which means “Big Market.” Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City.\nPark Hayatt Saigon Hotel or similar"},{"title":"Day 9: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Saigon.\nPark Hayatt Saigon Hotel or similar"},{"title":"Day 10: Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax until your international flight departs. Tourguide & Driver come until hotel to pick you up then transfer to Airport for your International Flight. Finish your unforgettable Legend Class Vietnam Package Tour arranged Legend Travel Group! Good bye & see you in the next times!\nAirport transfer included!"}]},{"name":"Essence of Vietnam 18 Days","duration":18,"travelStyle":["In-depth Cultural","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1919,"summary":"The best quality and unbeaten price for 16 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Ho Chi Minh City and finish in Hanoi.\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam.\nStay overnight on Boat in Halong Bay - World Heritage Site\nLearn about Vietnam history of Kings throughout Hue Imperial City\nExplore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\nTaste wonderful Vietnamese local cuisines along the trip\nDiscover 4 World Heritage Sites: Halong Bay, Hue, Hoi An and My Son Sanctuary\nChillout and shopping in Ho Chi Minh City - the biggest City in Vietnam\nAnd more...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95681_778b9d9d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95681_778b9d9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_9249bec0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_c3685036.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_408c85db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a19c6ef5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a19c77b8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a19c860d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a1d740a34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a1d754727.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a1d75e7c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a1d769cc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a2061dcd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a2062ece0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a20638eb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a20649227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a206513bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a20658658.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a206606f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a20667e95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a2066f60f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a22f6e143.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a22f7bfda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a22f86014.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95681_5e00a22f8e44b.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang","Hoi An","Hue","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Ho Chi Minh City arrival","description":"Today you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by our tour guide & driver at airport & then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nDistance: Tan Son Nhat Airport - Saigon center: 7 - 8 km (~ 30 minute drive).\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City full day tour (B, L)","description":"After breakfast at hotel, take a full day city tour of the dynamic Ho Chi Minh (formerly called Saigon) including Chinatown, Thien Hau pagoda, Binh Tay market, Notre-Dame Cathedral, Old Saigon Post Office, Reunification Palace, Historical Museum, War Crime Museum and Vinh Nghiem Pagoda. Overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City - Cao Dai Temples - Cu Chi Tunnels (B, L)","description":"This morning you take a drive to Cao Dai Temple in Tay Ninh, near the Cambodian border, is home to the unique Cao Dai sect, whose patron saints include Joan of Arc, Victor Hugo and Winston Churchill to name a few. The religion is a hybrid of Buddhism, Taoism, Confucianism and Christianity. The Cao Dai Temple at Tay Ninh has been described as a Walt Disney fantasia of the East. The temple’s exterior is decorated with multi-colored dragons of all shapes and sizes competing for space with a number of Buddhist symbols. Above the main entrance is the all-seeing holy eye, the symbol of the Cao Dai sect. The interior is just as engaging as statues of Jesus Christ, Buddha and the Hindu god, Brahma, stand side by side.\nThe trip to Tay Ninh is combined with a visit to the Cu Chi Tunnels. At its height, the tunnel system stretched over 250km. from Saigon to the Cambodian border and was three levels deep. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers and kitchens. Today the remaining tunnels have become a major tourist attraction giving the visitor a unique experience and a feel of what underground life during the US - Vietnam War. Return to Ho Chi Minh City in the late afternoon.\nOvernight in Ho Chi Minh City.\nDistance: Ho Chi Minh City - Cao Dai: 90 km (~ 2 hour drive), Cao Dai - Cu Chi: 70 km (~ 1.5 hour drive).\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City - My Tho - Ben Tre - Can Tho (B, L)","description":"Leave Ho Chi Minh City in the morning. Enjoy the scenic journey along the National Highway bordered by green rice fields. On arrived in My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoys cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals. Have a short cycling tour & enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages. Proceed to Can Tho. Overnight in Can Tho City.\nDistance: Ho Chi Minh City - My Tho: 70 km (~ 1.5 hour drive), My Tho - Can Tho: 110 km (~ 2.5 hour drive).\nIris Can Tho Hotel or similar"},{"title":"Can Tho - Cai Rang Floating Market - Ho Chi Minh City (B, L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong River (Bassac River), then proceed to visit Cai Rang floating market, which is the liveliest in the whole region.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a “Monkey bridge” which is built by only one stem of bamboo. Visit the orchard garden. Stop for lunch. On the way back to Ho Chi Minh City, the last stop is to see how incense sticks are made. Overnight in Ho Chi Minh City.\nDistance: Can Tho - Ho Chi Minh City: 170 km (~ 3.5 hour drive).\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City - Nha Trang Beach (B)","description":"Free for leisure in the morning until transfer to Nha Trang Beach City - one of the most beautiful beaches all over the world. Upon arrival in Nha Trang, pick up & transfer to hotel for check in. Overnight in Nha Trang.\nDistance: Cam Ranh Airport - Nha Trang City: 30 km (~ 40 minute drive).\nRegalia Nha Trang Hotel or similar"},{"title":"Nha Trang full day tour (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nRegalia Nha Trang Hotel or similar"},{"title":"Nha Trang (B)","description":"Today is a free day at leisure in Nha Trang for relaxing and unwinding at the resort overlooking beautiful Bay. Snorkel or dive among the coral reefs in crystal blue waters, hike nature trails, cool off in your private plunge pool, indulge in spa treatments or just relax on the white sand beach and admire the unspoiled mountain and sea views. Overnight in Nha Trang.\nRegalia Nha Trang Hotel or similar"},{"title":"Nha Trang - Da Nang - Hoi An (B)","description":"After breakfast at hotel, transfer to the airport for the morning flight to Da Nang. On arrival, pick up & transfer to hotel in Hoi An for check in. Then free for shopping & relaxing on Cua Dai Beach. Overnight in Hoi An \nDistance: Da Nang Airport - Hoi An: 30 km (~ 40 minute drive).\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - My Son (B, L)","description":"In the morning, drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries.\nMy Son, considered being in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries were built from the 7 to 13 centuries.\nBack to Hoi An for lunch.\nAfternoon visit the 200 year-old Tan Ky house, Phuc Kien Pagoda, the former merchants’ houses, the 400 year-old Japanese Covered Bridge and the colourful riverside market. Overnight in Hoi An.\nDistance: Hoi An town - My Son: 50 km (~ 1 hour drive).\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - Hue (B, L)","description":"Morning leave Hoi An for Hue, the last imperial capital of Vietnam, well-known for magnificent architecture, pagodas and royal tombs laid in small villages and surrounding hills. En route, have a look at the famous My Khe Beach and visit Cham Museum which contains the finest collection of Cham sculpture in the world. Upon arrival in Hue, visit the Imperial Citadel, the Purple Forbidden City, the elaborate mausoleum of Emperor Tu Duc and the Dong Ba market. Overnight in Hue\nDistance: Hoi An - Hue: 130 km (~ 3 hour drive).\nCherish Hotel Hue or similar"},{"title":"Hue - Hanoi (B, L)","description":"Take a morning boat trip on the romantic Perfume River visiting Hue’s oldest and most revered site, Thien Mu Pagoda & the mausoleum of Emperor Minh Mang. Then transfer to the airport for the flight to Hanoi. On arrival in Hanoi, pick up & transfer to hotel for check in. Overnight in Hanoi \n \nDistance: Phu Bai airport - Hue City: 18 km (~ 30 minute drive), Noi Bai airport - Hanoi city center: 30 km (~ 45 minute drive).\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi full day city tour (B, L)","description":"After breakfast at hotel, we enjoy a full day city tour of this charming capital city including the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Overnight in Hanoi.\nOptional activities:\nTake one hour cyclo ride through the bustling old quarter streets of Hanoi\nEnjoy a fantastic traditional water puppet show (unique to Vietnam).\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay (B, L, D)","description":"About 8 am, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. The drive takes 3.5 hours. Halong covers 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat. \nDistance: Hanoi central - Halong Bay: 180 km (~ 3.5 hour drive).\nGarden Bay Cruises or similar"},{"title":"Halong Bay - Hanoi (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive in Hanoi at 4:00pm. Check in hotel & free time to go sightseeing in the Old Quarter.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi departure (B)","description":"Free at leisure until transfer to the airport for the departure flight. You will be transferred to airport for your Internation Flight. Good bye and see you again!\nEnd of services.\nAirport transfer included!"}]},{"name":"Best Of Vietnam Tour to Sapa, Halong, Hoi An, Nha Trang, Da Lat, Saigon, Mekong Delta","duration":20,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2947,"summary":"This unique 20-day tour covers all the highlights of Vietnam (from north to south) visiting Vietnam Capital to experience the hidden charms of Hanoi, Sapa – an exciting place to see the lives, culture and costumes of the Vietnamese ethnic minorities, from the amazing limestone karsts of Halong Bay to the ruins of the Purple Forbidden City, learn about the fascinating history of Vietnam by visiting the World Heritage Sites of Hue citadel and Hoi An ancient town. Then chill out on the white sandy beaches of Nha Trang before heading south to the bustling city of Ho Chi Minh, the mighty Mekong Delta and the Cu Chi tunnels. The Highlights Tour is perhaps the most comprehensive travel experience on offer anywhere in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170932_1da1b331.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170932_1da1b331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_e378ed73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_40a6d867.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_af66ca69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_498ba458.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_9b78a99c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_22bf39f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_1fc81227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_7d372c4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_3799c5b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_779d33b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_3ccebd30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_e983ddf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_d39b8dcb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_cd1324cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_d068dd0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_b7f5ee6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_31102c0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_fedbf890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_a24a1379.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_526c7328.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_f4332c46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_1e40b634.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170932_65765013.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Cat Ba Island","Hue","Hoi An","Dalat","Ho Chi Minh City","Ben Tre","Can Tho"],"timeline":[{"title":"DAY 1. ARRIVAL – HANOI","description":"On arrival at Noi Bai Airport, you are met by our guide and transferred to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere\nO/N in Ha Noi."},{"title":"DAY 2. FULL DAY HANOI SIGHTSEEING TOURS (B)","description":"Today we commence our sightseeing of Hanoi with the Ho Chi Minh Complex, containing the mausoleum of the nation’s founder Ho Chi Minh, the Presidential Palace and the Ho Chi Minh’s house on stilts. Close to this complex is the One Pillar Pagoda, whose origins date back to the foundation of Hanoi.\nLater on, we follow it with a visit to the Temple of Literature, which is well known as the first university of Vietnam and the History Museum with an excellent collection of artifacts illustrating the Vietnamese history. In the afternoon, we visit the Ethnology museum.\nEnjoy your time to learn about 54 ethics in Vietnam. We also visit the old quarters and the peaceful lake of Hoan Kiem with its sacred temple. In front of this lake is the famous water puppet theater – the traditional unique Vietnamese art where we will see a fantastic performance.\nIf time permits we enjoy a short cyclo ride through the bustling old quarter streets named after the specific goods once offered for sale at these places.\nO/N in Ha Noi."},{"title":"DAY 3. HANOI PACKAGE TOURS – SAPA BY CAR (B, L)","description":"An early morning start to drive along the Red River to Sapa. The roads are bumpy sometimes but various scenic landscapes changing from the delta area to the Tonkinese Alps – where Montagnard hill tribes have lived for centuries will make for an interesting journey.\nAt a height of 1,500 meters, Sapa was once a hill resort of French administrators when the summer heat became unbearable. Now Sapa is considered to be The Queen of the Mountains, Sapa sits regally overlooking a beautiful valley, lofty mountains towering over the town on all sides. Welcome to the destination in northwest Vietnam, gateway to another world of mysterious minority cultures and luscious landscapes.\nO/N in Sapa."},{"title":"DAY 4. SAPA TREKKING TOUR (B, L)","description":"The Phan Si Pang range boasts Vietnam’s highest mountain and lends an alpine feel to the area surrounding this hill station. Today we have enough time to explore some of nearby hill tribe villages and visit the busy market of Sa Pa where the Red Dao, Black Hmong, Tay, Xa Pho ethnic minority people converge from the surrounding valleys and hillsides to sell their goods and buy provision .\nToday, after your breakfast , we will walk from Sapa towards Muong Hoa valley where we can admire magnificient landscapes and trek on small trails going to Y Linh Ho village (with Black H’mong tribe). Trek through lush rice-terraces towards Lao Chai village, enjoy delicious lunch in the local house near by Muong Hoa river, experiencing Black H’mong people’s daily life and traditional culture. Next cross suspension bridges as you walk through Lao Chai village to Ta Van village inhabited by Zay minorities exhibiting strong Chinese culture. In the afternoon, our bus ride you return to Sapa for dinner.\nO/N in Sa Pa."},{"title":"DAY 5. SAPA PACKAGE TOURS – BAC HA MARKET – BACK TO HANOI BY TRAIN (B, L)","description":"After breakfast, we continue venturing into northern Vietnam with the next stop being Bac Ha Market. Driving along the border line with China, up and down and passing wonderful landscape then you are in Bac Ha. It is your time to explore Bac Ha Market where the ethnic people coming down from the mountains taking along their homemade products like embroidery, tobaco, rice wine…and household animals like dogs, cats, chickens, pigs, horse, buffaloes…for sales. Market is like a festival where the locals meet friends, drink rice wine to enjoy the life. An adventure for life!\nIn the afternoon, you have chance to enjoy a boat trip down stream Chay River and then our guide take you for walk to Thai Giang Pho Village of the flower H’mong and the Nung, visiting one school, and trekking by the side of the the highest mountain in Bac Ha through the beautiful plumb gardens before another visit to the palace of the H’mong King that built in 1921. In the end of the day, you will be transferred by bus to Lao Cai Railways Station for overnight train back to Hanoi.\nOption 1: Bac Ha & Muong Khuong Market on Sunday\nOption 2: Coc Ly Market on Tuesday\nAbout 35km from Bac Ha, Coc Ly Market is a colorful Tuesday market in a mountainous area where ethnic people gather to buy and sell goods, dine and drink, or just wander to enjoy the ambience of the montagnard market by the Chay River.\nOption 3: Lung Khau Nhin Market on Thurday\nTaking place every Thursday, Lung Khau Nhin Market is a small market hiding itself amongst the mountains and forests of the far north Vietnam about 10 km from the border with China. Although not being so big or famous among visitors as Coc Ly and Can Cau, Lung Khau Nhin market, be side a normal shopping place, play an important role to spiritual life of local ethnic peoples Flower H’mong, Black Zao, Zay, and especially to those who come from very small ethnic groups such as Pa Zi, Tou Zi, Tou Lao who live in small and isolated villages around this corner of the country, come for meeting, socializing…\nOption 4: Can Cau Market on Saturday\nCan Cau is a rural ethnic market, simply set up on the open ground at the side of a mountain, looking down a picturesque valley about 20 km north of Bac Ha. It is every Saturday morning when hundreds of ethnic peoples mainly Flower H’mong gather to sell their farming products and buy necessities.\nThe market’s most colorful part is clothes section with shirts, blouses, skirts… or parts of the traditional costumes with embroidery patterns in different motifs lying on dark batik background but may be the most interesting section is the tobacco and wine section when buyers are allowed to taste the product before buying and many men get too drunk to buy anything more!\nIn the perfect light of the early morning, It is not only the colorful market and the peoples but also the beautiful surrounding nature make the visit here an unforgettable trip, especially for nature lovers and photo hunters.\nOn train."},{"title":"DAY 6. HALONG BAY CRUISE TOUR TO CAT BA ISLAND (B/L)","description":"06h00: Arrive at Hanoi Railways Station, our guide and driver will come to pick you up and transfer to restaurant for leisure and breakfast. Then we continue transferring to Halong Bay.\nOn arrival, we embark on a cruise to visit Ha Long Bay, listed as a World Heritage Area of outstanding natural beauty. This picturesque “Dragon descending to the sea” Bay has 1,969 limestone islets rising from the sea, many of them containing beautiful grottoes. During the boat trip, fresh seafood lunch prepared and served on board. Arrival in Cat Ba, we have free time to relax on a beach.\nO/N in Cat Ba."},{"title":"DAY 7: CAT BA ISLAND SIGHTSEEING TOUR – HAIPHONG TO HANOI (B)","description":"After a short transfer takes us to the national park of Cat Ba, we set off on a half-day exploring Vietnam’s unique offshore park.\nThe afternoon we board a hydrofoil to Hai Phong and drive back to Hanoi.\nO/N in Ha Noi."},{"title":"DAY 8. HANOI PACKAGE TOURS – FLIGHT TO HUE (NOT INCLUDED) – HUE TRAVEL PACKAGE TOURS (B)","description":"After breakfast at hotel, transfer to Noi Bai airport for flight to Hue on VN1543 (08.30-09.45). Upon arrival we visit the Imperial Citadel. And then we enjoy a boat trip on the Perfumes River to visit the beautiful riverside Thien Mu Pagoda – one of the oldest ancient architectural structures for religious work ship in Hue. We also have an enjoyable visit to the mausoleum of Emperor Minh Mang in a tranquil setting of gardens and lakes.\nThis impressive landmark reflects the beautiful architecture, intricate decor and mysterious statues. Afterwards we take a short drive though the rolling hill to see the elaborate royal tomb of Emperor Tu Duc and the famous Tu Hieu Pagoda. The sightseeing tour of Hue also includes with a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. Along the way we pass many fantastic eating spots, all ideal for visitors to sample some local delicacies.\nO/N in Hue."},{"title":"DAY 9. HUE PACKAGE TOURS – DANANG STOPOVER TOUR TO HOIAN – HOIAN SIGHTSEEING TOURS (B)","description":"In this morning, before leaving to Danang we will take a short drive though the rolling hill to see the elaborate royal tomb of Emperor Tu Duc and the famous Tu Hieu Pagoda. The scenic 4-hour drive via Hai Van Pass offers spectacular views of mountains, the sea, idyllic beaches and villages (we can choose the shorter way by driving through the tunnel).\nUpon arrival Da Nang, we will take a visit to Cham Museum formerly known as the Ecole Francaise d’Extreme Orient. This museum contains many exquisite limestone carvings from the vanquished Kingdom of Champa which has been the central coastal littoral prior to the march of the Vietnamese nation southward. Then a visit to Marble Mountains with its beautiful grottoes and temples whose peaks represent the five elements of the universe. Later on, we keep on rolling further southward to Hoi An, which was originally one of major trading centers of Southeast Asia in the 16th century.\nO/N in Hoi An."},{"title":"DAY 10. MY SON SIGHTSEEING TOUR (B)","description":"We take a morning visit to Hoi An, which was originally one of major trading centers of Southeast Asia in the 16th century. Visit of Hoi An Town with its low tiled houses of Chinese appearance, Japanese covered bridge, brightly painted temples and pagodas make it one of Vietnam’s most delightful places.\nAfter tour in Hoian, drive to My Son, 70 km from Hoian. My Son is the Holy Land of Champa Kingdom from 04th to 13th century. Now the ruins of My Son is well preserved by UNESCO as World Culture Heritage.\nO/N in Hoi An."},{"title":"DAY 11. HOIAN – FLY TO NHA TRANG (NOT INCLUDED) – FREE TIME (B)","description":"This morning, you will be free to explore Hoi An City until transferred to Danang airport for flight to Nha Trang VJ581 (13.45-14.45). Upon arrival, we will pick up you and take to the hotel in Nha Trang city.\nNha Trang has earned its place on Vietnam’s tourist mainline partly on merit and partly due to its location. Fit for a King or a gathering of the world’s most gorgeous ladies, Nha Trang is the 29th most beautiful bay in the world and known as the Vietnamese Mediterranean Towering lush mountains surround Nha Trang Bay, creating a near perfect moon shape crescent as the sun dawn each morning on this lively beach town in Vietnam. This afternoon is the best time to refresh yourself.\nO/N in Nha Trang."},{"title":"DAY 12. NHA TRANG TRAVEL PACKAGES (B)","description":"After breakfast at the hotel, we start the tour with the first stop is Tri Nguyen Aquarium and the off-shore islands around Nha Trang, including Mun Mot island. Next, you can enjoy swimming and beach activities. Lunch at Tam island with fresh seafood. \nAfternoon visit the Po Nagar Cham Tower, it is dedicated to Yan Po Nagar, the goddess of the country. Then continue to visit Chong Promontory – looks like the work of a giant, who carelessly put several massive rocks together. On one side of the rock, facing the sea, there is a deep handprint with the five fingers close together. And finally, discover Oceanographic Institute – established on 14 September 1922, is the National Oceanographic Institution, responsible for research and investigation in the ocean.\nO/N at Nha Trang."},{"title":"DAY 13. NHA TRANG PACKAGE TOURS – DALAT CITY TOUR (B)","description":"Drive to Dalat city, 1500 m above the sea level.  Refresh with a little bit cool of the highland city, which was known as “A little Paris” or “a flower city”. Visit the Tuyen Lam Lake – a natural lake situated on top of a hill covered with pine trees, 6km east of Dalat City. The lake has been surrounded by many stories and legends with sorrowful endings in which the heroine drowns in the lake to keep her true love forever. \nDiscover King Bao Dai’s summer palace – filled with artifacts from decades and governments past and is extremely interesting, then take time to visit city flower garden and Dalat Market, one of the most beautiful markets in the highland with a wide array of flowers, fruits and vegetables.\nO/N in Da Lat."},{"title":"DAY 14. DALAT PACKAGE TOURS (B)","description":"After breakfast, start to visit to garden and Dalat Market, one of the most beautiful markets in the highland with a wide array of flowers, fruits and vegetables.  Then visit to Lat K’ho hilltribe Village on the foot of Lang Bian Mountian, continue to visit the Old Dalat University and the Old railway station from French period. Finally visit to the Crazy house, one of new but strange architecture in Dalat design by the daughter our former president Truong Trinh.\nO/N in Da Lat."},{"title":"DAY 15. DALAT SIGHTSEEING TOURS – HOCHIMINH CITY TOURS (B)","description":"Visit the colorful Dalat Market with arrays of flowers and vegetable and Prenn Water Fall. Drop by Chicken Village, a K’ho hill tribe village near Bao Loc, at the gate of the village has a sculpture of a Chicken, the bird has to do with a village legend (and actually it has about four different versions of the story, and each is a hoot).\nDrive to Ho Chi Minh (320 km) via Bao Loc with stop at coffee and tea plantations.\nO/N in Ho Chi Minh City."},{"title":"DAY 16. HALF DAY SAIGON CITY TOUR (B)","description":"Breakfast at the hotel, A half-day tour of Ho Chi Minh City takes in the Notre Dame Cathedral – the most famous landmark as well as core Cathedral of the city, It is considered to be a famous age-long cathedral in Southern Vietnam that attract not only Catholics but also most tourists for its neo-Romanesque style architecture and a sacred atmosphere.\nThen we visit Old Post Office, It has a Gothic architectural style and was designed and constructed by the famous architect Gustave Eiffel in harmony with the surrounding area. Today, the building is a tourist attraction. Then transfer to Chinatown to visit Thien Hau Pagoda – one of the most active in Cholon and is dedicated to Thien Hau. It is said that she can travel over the oceans on a mat and ride the clouds to wherever she pleases and Binh Tay Market – much of the business conducted here is wholesale.\nAfternoon: Free time (no tour, no guide)\nO/N in Ho Chi Minh City. "},{"title":"DAY 17. SAIGON FULL DAY TOUR TO TAY NINH & CU CHI TUNNELS (B)","description":"Depart for Tay Ninh, the head quarter of Cao Dai region founded on 1926. On arrival we attend the fantastic mid-day mass when the followers fill the hall wearing colored robes, a symbol of the curious combination of the Confucianism, Taoism, Christianity and Buddhism.\nAfternoon, transfer about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The Cu Chi tunnels consist of more than 200km of underground tunnels. This main axis system has many branches connecting to underground hideouts, shelters, and entrances to other tunnels, the tunnels are between 0.5 to 1m wide, just enough for a person to crawl along.\nO/N in Ho Chi Minh City."},{"title":"DAY 18. HO CHI MINH CITY TOUR TO MY THO – BEN TRE – CAN THO PACKAGE TOUR (B/L)","description":"In the morning, transfer to My Tho, take a boat trip downstream to Ben Tre, where you have the opportunity to discover the local people life in Mekong Delta with popcorn and pop-rice workshop, rice paper mill, coconut candy mill, fruit gardens… Biking or transfer by horse carriage on village road.\nAfter lunch at a local restaurant, proceed to Can Tho. Arrive in Can Tho, the city located on Mekong Delta bank.\nO/N in Can Tho."},{"title":"DAY 19. CAN THO PACKAGE TOURS – HOCHIMINH CITY (B)","description":"After breakfast at hotel, transfer to Ninh Kieu wharf for a boat trip to visit Cai Rang floating market. Time for taking part to the local activities and taking pictures. Then continue by boat to Phong Dien Islands. The car picks up at Phong Dien and transfer back to Ho Chi Minh City.\nO/N in Ho Chi Minh City."},{"title":"DAY 20. HOCHIMINH CITY – DEPARTURE (B)","description":"At leisure until transfer to Tan Son Nhat Airport for departure flight (check out hotel before 12h00)."}]},{"name":"Luxury Vietnam Highlight Vacation - 17 Days","duration":17,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Ocean Cruise","Holiday"],"oldPrice":0,"price":2720,"summary":"Hanoi: Located on the banks of the Red River with tranquil Hoan Kiem Lake at its heart, Hanoi is the capital of the Socialist Republic of Vietnam. North of the lake are the bustling streets of the Old Quarter, each street named after the trade that used to take place there. Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95530_6f8955dc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95530_6f8955dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_0dbfa652.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_d8731f4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_13f4ac51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_7848d785.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_16b394a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_83dec381.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_fb0314fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_4d9923ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_d306ede1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_c3d06f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_49e5bbb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_b5a8ccac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_86be479f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_2949e9eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_398c4076.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035188b24d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035188c4cda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035188ce65e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035188daa21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035188ecb12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e035189013c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e03518916170.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95530_5e0351a8906e1.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Halong Bay","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Arrival Hanoi Vietnam, overnight Train to Sapa","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Free for leisure in Hanoi until 7:00pm. Take night train from Hanoi to Sapa. Overnight on the train.\nPrivate Cabin Deluxe Soft Sleeper for 2 Persons"},{"title":"Sapa arrival - trekking to Villages (B, L)","description":"Arrive Lao Cai Railway Station at 6:00am. Pick up to Sapa town for check in. Having breakfast and start trekking down to Lao Chai village to visit the Black H’mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town.\nVictoria Sapa Resorts 5* or similar"},{"title":"Day 3: Lao Cai- Bac Ha Sunday Market - Night train back Hanoi (B, L)","description":"After breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most wonderful and colourful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, horses… are all on sales. This is a golden opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H’mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Overnight on the train.\nPrivate Cabin Deluxe Soft Sleeper for 2 Persons"},{"title":"Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Arrive Hanoi Railway Station at 5:30am. Pick up & transfer to hotel for short rest & breakfast until 8:30am. Leave Hanoi for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nParadise Luxury Cruises 5* or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nSheraton Hanoi Hotel 5* or similar"},{"title":"Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nSheraton Hanoi Hotel 5* or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Bakhan Village - Hanoi Airport - Fly to Hue City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h30. Arrive Hanoi Airport for flight to Hue City.\nArrive Hue City in the evening. Pick up at airport and transfer to hotel for checkin. Stay overnight in Hue City.\nKoi Resorts & Spa Hue 5* or similar"},{"title":"Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Breakfast in the hotel and Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nKoi Resorts & Spa Hue 5* or similar"},{"title":"Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Overnight in Hue City.\nKoi Resorts & Spa Hue 5* or similar"},{"title":"Leave Hue to Danang/City Sightseeing (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble – and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Stay overnight in Hoi An Ancient Town.\nPalm Garden Resorts Hoi An 5* or similar"},{"title":"My Son Holy Land half Day (B)","description":"Breakfast at your hotel\nLeave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An.\nLocated in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. \nReturn to Town for lunch (own arrangement). \nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPalm Garden Resorts Hoi An 5* or similar"},{"title":"Tra Que Herb Village and Cooking Class (B, L)","description":"In the morning, your guide will meet you at your hotel. You experience a bike ride towards Cẩm Thanh village. Right here you take a bamboo boat ride, and learn how to make traditional bamboo handicrafts with locals.\nNext, you cycle to the fishing village of Thanh Nam, where you can see local fishermen catching fish, crabs, squids and shrimps. It is interesting to know that the fishing village is still actively working, even with the appearance of modern fishing methods in Vietnam.\nYou take the next stop at the Tra Que village, where you will enjoy a welcome drink and a walk around this agricultural village. You will meet local farmers and join in with activities like hoeing and sowing.\nYou will have a great time with a cookery lesson. You may learn how to make spring rolls and crispy Vietnamese pancakes, before enjoying a traditional Vietnamese lunch of 7 courses. \nFinally, you cycle back to Hoi An for the end of the tour. Check in hotel and stay overnight in Hoi An Ancient Town.\nPalm Garden Resorts Hoi An 5* or similar"},{"title":"Hoi An Ancient Town fly to Ho Chi Minh City (B)","description":"In the morning, you leave Hoi An Ancient Town to take the domestic flight to Ho Chi Minh City via Da Nang International Airport. \nUpon reaching to Tan Son Nhat airport, you are warmly welcomed by our friendly guide and start your tour around Saigon City Landmarks, almost all of the places of traveler’s interests are located near the town center. \nFree to discover the city on your own way\nRecommend historical sites: Reunification Palace (This famous edifice was ever a former residence of the President of Southern Vietnam until the end of April 1975), Old Sai Gon Post Office, Notre Dame Cathedral, War museum \nRecommend shopping area: Saigon Square, Binh Tay Market, Ben Thanh market etc. \nStay overnight in Ho Chi Minh City.\nNew World Saigon Hotel 5* or similar"},{"title":"Cu Chi Tunnels half Day Tour (B)","description":"Breakfast at hotel at 7:00am\n8:00am - 8:30am: Take a half day trip to visit Cu Chi Tunnels for an half day Tour.\nWalk through what were once the front battle lines during the Vietnam War. \nYou can weave your way through the extensive tunnel system or even pay a small fee to try your aim with several firearms - AK47 included.\n1:00pm. Arrive at hotel. Check in & overnight in Ho Chi Minh City\nNew World Saigon Hotel 5* or similar"},{"title":"Full day to Mekong Delta/River Boat Trip (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City around 3:00pm - 4:00pm. Check in hotel and stay overnight in Ho Chi Minh City.\nNew World Saigon Hotel 5* or similar"},{"title":"Ho Chi Minh City - Concluded/ Departure home (B)","description":"Breakfast at your hotel, then transfer to Airport for your International flight to back home!\nEnd of services with great memories about Vietnam with us. Thank you so much and hope to see you again soon!\nAirport transfer included!"}]}]