[{"name":"Southern Vietnam Packages - 4 Days","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":305,"summary":"Explore the amazing site where Viet Cong hid during the War.\nEnjoy the local tropical fruits, folk music\nDiscover the life of local people in the mordernest city in Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171258_3e9ddbe4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171258_3e9ddbe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_e60cb36d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_c5a131e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_d23e9a4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_e9862860.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_7c260837.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_f19e2fcf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_50077fda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171258_b250318d.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Saigon Arrival","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy.\n\n\n Overnight in Saigon."},{"title":"Day 2: Cao Dai Temple - Cu Chi Tunnel (B/L)","description":"Have breakfast at your hotel\n7:45 -8:00am: Pick up at your hotel enjoy Cao dai –Cu chi temple\n\n\nThe Great Holy See Temple, built in 1926, is considered one of the most striking structures in all of South-East Asia. It is the headquarters of the unique Cao Dai sect, a religion with a hybrid of Buddhism, Christianity & Confucianism. Above the entrance is the all-seeing holy eye – symbol of the sect. Visitors will attend the midday ceremony’s extravaganza to witness the daily mass held by the Cao Dai followers which is a fantastic experience. \n\n\nAfter lunch, proceed to Cu Chi to explore the amazing site where Viet Cong hid during the War.\nIt is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens. \n\n\nThere is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. Spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food in war time). \n\n\nReturn to SaiGon. Overnight in Saigon."},{"title":"Day 3: Mekong Delta - My Tho (B/L)","description":"Pick up at hotel and departure for Mekong delta trip.\n\n\nThis trip provides a look at a wide variety of the life and scenery of the Delta. On the way you can see green rice paddy fields stretching towards the horizon. After 70km driving, we arrive in My Tho, a private boat trip takes us to Ben Tre. Walking on land and exploring local life and then we’ll visit the local coconut-candy workshop. Lunch at local restaurant.\n\n\nAfter lunch, we’ll enjoy the local tropical fruits, folk music and see how they look after their honey bee farm.\nAfternoon, our boat takes us back My Tho where we meet our bus again for a 2 hour drive back Saigon.\n\n\nOvernight in Saigon."},{"title":"Day 4: Saigon Half Day City - Departure (B)","description":"We start the trip by visiting Notre Dame Cathedral, the historic Central Post Office,followed by exploring the Reunification Palace,and the remarkable site of the War Remnants Museum then transfer the airport catch flight back your country.\n\n\n End of services !"}]},{"name":"Hanoi Easy Getaway Package","duration":4,"travelStyle":["Ocean Cruise","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":230,"summary":"HOT COMBO FOR COUPLE","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138205_6b64d3dc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138205_6b64d3dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_cc3982ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_159aa87a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_197371a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_b82a991b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_b636cbaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_f4d2f8e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_c4f3e953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_1b1135cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_023cb3aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_fb0b8431.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_5b9e61df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_19a983cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138205_2125bbd9.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":" Pick up at airport, stay the night in our Superior DBL room."},{"title":"Day 2: Hanoi - Halong Bay","description":"Spend 2 days and 1 night in Halong Bay on Deluxe Cruise"},{"title":"Day 3: Halong Bay - Hanoi","description":"Come back to Hanoi. Stay another night in our Superior DBL room."},{"title":"Day 4: Hanoi Departure","description":"Check out then go to airport. Trip ends."}]},{"name":"Ho Chi Minh City 4 Days 3 Nights","duration":4,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":209,"summary":"Located at the strategic watergate in Mekong River Delta, Ho Chi Minh City also commonly known as Saigon is national hub of commerce, technology science research and culture. Though just accounting for 0.6% of land area, nevertheless it contributed the largest proportion to Vietnam economy. Ho Chi Minh City always leads the way in terms of high tech renovation, professional managements and decent services.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/166764_12adf8ac.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/166764_12adf8ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_8c3dbb07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_55185438.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_36837b06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_a5a75712.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_e39a5e99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_6b0c204b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_9dae6ba8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_f47ee4c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_093abcc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166764_b4eda688.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"ARRIVE HO CHI MINH","description":"Upon arrival at the airport in HoChiMinh (Saigon), meet with the guide and  transfer to the hotel. Free for exploring  Ho Chi Minh by ownself.  Overnight in Ho Chi Minh"},{"title":"DAY 2: HO CHI MINH CITY TOUR - CU CHI (B/L)","description":"Breakfast at the hotel. We start the trip by visiting Notre Dame Cathedral, the historic Central Post Office,followed by exploring the Reunification Palace,andthe remarkable site of the War Remnants Museum. Lunch at local restaurant\n\nAfternoon we depart to Cu Chi Tunnels, located 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\n\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Ho Chi Minh. Overnight in Ho Chi Minh"},{"title":"DAY 3: HO CHI MINH - MEKONG DELTA TOUR (B/L)","description":"Breakfast at the hotel. Enjoy the scenic journey along the way bordered by green rice fields. \n\nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit& honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\n\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy& observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  Overnight in Ho Chi Minh\n\n "},{"title":"DAY 4: HO CHI MINH DEPARTURE (B)","description":"Breakfast at the hotel, Free at leisure till departure flight. Transfer to airport for departure."}]},{"name":"Sapa Walk and Bac Ha Market 4 days","duration":4,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":280,"summary":"Breathtaking mountain scenery and tribal villages amongst perfect nature setting are highlights of Sapa. Getting off the beaten track and walking through villages where ethnic minority peoples live, paying visit to their homes, witnessing their every day activities,.. Although traveling in very basic condition, including 1 nights on the train, 1 night home stay in tribal village, 1 night in standard hotel in Sapa, the trip will bring unforgettable experiences","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156339_8412de7f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156339_8412de7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_1337a11f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f288a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f288d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f288f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f2890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f2892.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f2893.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536c47f2895.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156339_5e536b34832e2.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: (Thursday Night) Take overnight train from Hanoi to Lao Cai","description":"Be ready at your hotel lobby at 8:00 p.m, our tour guide and driver will meet and pick you up for a short transfer to Hanoi Station to take the overnight train to Lao Cai City.\n• Overnight on the train "},{"title":"Day 2 :(Friday) Lao Cai - Sapa - Y Linh Ho - Lao Chai - Ta Van ( B,L,D)","description":"Day 2 :(Friday) Lao Cai  - Sapa -  Y Linh Ho - Lao Chai - Ta Van ( B,L,D)\nPicked up at Lao Cai Station upon your early arrival for over an hour drive uphill in a shared mini van to Sapa. After freshen up and Breakfast in a local restaurant you will enjoy a free walk around this charming town, paying visit to Sapa market and the old cathedral where you can meet a lot of local ethnic minority peoples such as Black H’mong and Red Zao wearing their traditional colorful dresses selling their farming and gathering products and handicrafts for souvenir. Back to our Sapa office at about 10.30 and begin your exploration trip to Muong Hoa valley. You will follow the main road heading south for about an hour before turning right to a foot path down hill to Muong Hoa Valley. This part offers spectacular scenery of the highest part of Hoang Lien Son mountain range and in a nice day, Fansipan Peak can be seen. Crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. Here you will pay visiting to some H’mong families, watching them doing their daily works. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai, a large village of the H’mong and then following the river bank to Ta Van of the Zay people. Paying visiting to local homes, village schools… you will enjoy much your cultural discovery of local ethnic peoples as well as breathtaking scenery of the Muong Hoa Valley. Settle down in Ta Van village for an overnight home stay. \n• Accommodation: Homestay in Ta Van Village "},{"title":"Day 3 (Saturday) Ta Van - Giang Ta Chai - Hau Thao - Sapa Saturday Market ( B,L,D)","description":"Day 3 (Saturday) Ta Van  - Giang Ta Chai   - Hau Thao - Sapa Saturday Market ( B,L,D)\nLeaving Ta Van village after Breakfast, you will take the trail uphill, passing fascinating terraced rice field and some small hamlets of the H’mong before getting through a bamboo forest to a waterfall, enjoy a break for magnificent scenery and then continue walking for half an hour to Giang Ta Chai village of the Red Zao peoples which sits on the top of a hill and looks down Muong Hoa river. After spending time visiting the village, making friend with the Zao and experiencing the hospitality you will cross the river by another suspension bridge and then uphill again to Hau Thao village where you will pay visiting to a local handicraft center where H’mong and Zao women gather for exchanging experience and skill of making handicrafts. A late Lunch will be prepare here nearby this center and then you have time relaxing as well as getting acquaintance with local school boys, girls and their teachers as well.\nLater a short drive will take you back to Sapa, check in your hotel and evening is free to attend the locals at Saturday market in Sapa. \n• 3* hotel in Sapa Town"},{"title":"Day 4 (Sunday) Sapa - Bac Ha Market - Bus to Hanoi ( B,L,D)","description":"Wake up early for Breakfast and check out your hotel at 07.00 for a 3 hour road ride to Bac Ha via Lao Cai. The road trip is long and hard but the landscapes along the way is so beautiful and several stops at beautiful spots makes the journey shorter. Arrival in Bac Ha at about 10.00 at the most crowded time of the market which is very active and colorful thanks to the traditional dresses of the tribal peoples, especially of the Flower H’mong. You will join the locals at the market for your own discovery, taking a lot of photos as well as enjoying funs. Lunch break in a local restaurant before enjoying a walk for about 2 hours to Ban Pho village of the Flower H’mong and Tay which sits on the sides of several hills looking down a stunning valley. The road trip back to Hanoi by bus,\nBack to Hanoi and arrive Hanoi at 10p.m"}]},{"name":"Explore Vietnam from south, central to north 16 days 15 nights","duration":16,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1065,"summary":"This is a south-central- north route that can impress anyone who once have chance to step in this beautiful S-shaped country. Our first destination is the well-known Sai Gon. You will visit Saigon city and then explore the Mekong Delta which has recently been dubbed as a \"biological treasure trove\". Take night train to Da Nang, the fifth largest city in Vietnam in terms of population, visit Golden Bridge, move to Hoi An ancien town, Hue city. Then take night train to Hanoi, you have 2 days to explore Sapa with many hill tribe villages, spectacular mountains, amazing waterfalls and romantic valleys. We will also have chance to share cultural experiences with families that live in the area. A full day Hanoi city tour and 2-day Halong cruise are good chances for you to catch best glimpse of Northern Vietnam’s nature and people. So exciting!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/179032_7440744f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/179032_7440744f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_89c8f7dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_6813477e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_d2b10085.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_ac9fca28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_b4c277c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_0a0fb277.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_b862aef0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_4e73a33f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_e42685a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_05968923.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_15679018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_5ceaf84e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_1ff6b64a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_20ba4804.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_4277f6e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_9480d1eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/179032_44482c69.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hue","Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh arrival (no meal)","description":"Welcome to Vietnam ! You will be greeted at the airport by our driver and transfered to your hotel. The first day is free time which you’ve been given to rest and later enjoy your by yourself.\nOvernight in Sai Gon."},{"title":"Day 2: Sai Gon city and Cu Chi tunnel (B/L)","description":"( start 8.00 – return 19.30 (LUNCH)\nAM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nOvernight in Sai Gon."},{"title":"Day 3: Sai Gon- Mekong - Ben Tre- Can Tho (B/L)","description":"Leave Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel (family home-stay with dinner can be arranged on request). Free time to visit bustling Can Tho market."},{"title":"Day 4: Cai Rang Floating Market - Sai Gon - night train to Da Nang(B/L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to visit Cai Răng floating market, which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to Sai Gon. Then the driver transfer to the train station to take night train to Da Nang.\nOvernight on the train."},{"title":"Day 5: Da Nang pick up - transfer to Hoi An (no meal)","description":"The driver pick up at Da Nang station and then transfer to Hoi An. The rest of day is your own at leisure. You can visit Hoi An ancient town by yourself. \nOvernight in Hoi An."},{"title":"Day 6: Bamboo basket boat trip - Cooking class (B/L)","description":"9:00am - Local tour guide pick up at the Hotel, meet at the front desk and travel by bicycle through beautiful countryside to the charming Tra Que vegetable village with the chef, and discover the real life of local farmer. The village is named after the sweet scented herbs that were used in daily meals of Hoi An people, such as mint, coriander, basil,… on your way, you can see paddy fields, buffalos, and Vietnamese farmers working hard on their farms. \n10:00 - Transfer to Cam Thanh (water coconut) village and then go to rowing basket boat with the local people. - Explore many beautiful views of fish village, guest come to inside the water coconut palm forest, see these coconut trees growing together and get some water coconut fruit as well as some produces from this tree from local people for souvenir. \n11:30 - Work together with the chef and learn the traditional way of preparing and cooking Vietnamese food. \n- Enjoy the meal that you have prepared and cooked ( included: bicycle, food, mineral water, entrance ticket, boat, chef and tour guide). \n- Return to the hotel\nOvernight in Hoi An."},{"title":"Day 7: Ba Na hill - Golden bridge 1 day (B/L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n09:00 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:00 pm. Drop-off at hotel. Overnight in Da Nang.\n"},{"title":"Day 8: Take train Da Nang to Hue- Hue culinary tour half day (B)","description":"Have breakfast at the hotel. The driver transfer to Da Nang station for train to Hue. And then my partner will transfer to hotel. Relax until 6.00 p.m\n06:00 pm: Cyclo pick up you at hotels in focus at your hotel.\n06:20 pm: The tour guide will take you to “HANG ME restaurant”, located on Vo Thi Sau street to enjoy there specical cakes of Hue (Beo, Nam, Loc cakes...).\n07:15 pm: Cyclo take you to “HEN ISLAND” to enjoy clam dishes such as clam rice, clam noodles.\n08:00 pm: After enjoy Hen island’s foods, you will continue the culinary trip to Dinh Tien Hoang street to enjoy favorite cakes “BANH KHOAI - NEM LUI” (Hue specialities spring rolls). You will have chance to enjoy sweet soup of Hue and also purchase special products souvenir such as: sesame candies, conical hats, sour shrimps, long dress (Ao Dai), Minh Mang wines.\nAt the end, cyclo take you around streets to admire some romantic places at night such as Imperial Citadel, Truong Tien bridge, Perfume River…\n09:30 pm: Ending tour. Cyclo take you back to the hotel.\nOvernight in Hue.\n"},{"title":"Day 9: Phong Nha cave 1 day (B/L)","description":"MORNING: Pick up guests at the hotel at 06:30 am and transfer to Quang Binh province by bus. On the way, stop take photos and visit La Vang Holyland. \n11:30 am: Arrive to Quang Binh. Enjoy lunch at a local restaurant at Xuan Son boat station.\nAFTERNOON: Begin the excursion by boat along The Son river to discover Phong Nha Cave and visit dry and wet caves.\n03:45 pm: Back to the boat station and turn back to Hue city on Ho Chi Minh trail, via Truong Son martyrs cemetery.\n07:30 pm: End of tour in Hue.\nOvernight in Hue."},{"title":"Day 10: Hue city 1 day - night train to Hanoi (B/L)","description":"MORNING: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conical Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nAFTERNOON: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nThen the driver transfer to Hue station for night train to Hanoi. Overnight on the train."},{"title":"Day 11: Pick up at Hanoi station- transfer to hotel for check in - water puppet show (no meal)","description":"Welcome to Hanoi ! You will be greeted by our driver and transfered to your hotel. You are free until the time to see water puppet show.\nOvernight in Hanoi."},{"title":"Day 12: Hanoi - Sapa- Cat Cat village (B/L/D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\n\nOvernight in Sapa. \n"},{"title":"Day 13: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (B/L)","description":"8:00 – Have breakfast at the hotel.\n\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\nOvernight in Hanoi."},{"title":"Day 14: Hanoi - Ha Long - Sung Sot cave (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 15: Ha Long - Hanoi (B/L)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nOvernight in Hanoi.\n"},{"title":"Day 16: Departure (B)","description":"Your trips comes to an end today. There are no planned activities, and you are free until the driver transfer to airport for flight back home. See you on the next trip to Vietnam !"}]}]