[{"name":"4 Day Small-Group Hanoi and Halong Bay Tour Package","duration":4,"travelStyle":["In-depth Cultural","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":550,"summary":"Explorer the beauty of Vietnam’s capital city Hanoi as well as what may be the country’s most famous attraction of Halong Bay on this 4-day tour.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/97666_9c5f45b8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/97666_9c5f45b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_4f74c649.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_00154b3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_84aa2589.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_6f24e2e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_df7965ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_f6472760.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_50cfeec6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_b2e091b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_cc1732eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97666_357c65bd.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Customer will be pick up at the airport with the private car to send to the Hotel in Hanoi by 1 hour driving.","description":"Taking a rest then after that talk a short walk around and enjoy the Water Puppet show in the early evening time"},{"title":"Day 2: 08h00 – 08h30 Pick-up at hotel and start the scenic, 3.5 hour drive to Halong Bay.","description":"Enjoy the landscape of the Red River Delta country side and have a short break on the way. \n12.00 – 12.30 PM arrive to the Cruise location followed by a short cruise briefing \n01.00 – 03.30 PM Savor a delectable lunch \n03.30 – 04.30 PM Kayak among the hidden areas of the bay, around the Luon Cave area. \n04.30 PM Back to the Cruise \n04.30 – 05.30 PM Cruise to Soi Sim Island. Go swimming and relaxing at the beach of Soi Sim or climb up to the top of the island for a panorama view of Halong Bay \n17h30 Return to the main boat for a shower. Relax or snap photos as the sun starts to set \n07.00 PM Dinner is served. Socialize with other guests, fish for squid, or just laze around Overnight on board."},{"title":"Day 3: 06.30 – 07h.00 AM Start your day with Tai Chi exercises or a photo hunt","description":"07.30 – 08.30 AM Have breakfast at sunrise. \n08.30 – 09.30 AM Explore the amazing Sung Sot Cave – the nicest cave in Halong Bay. \n09.30 AM Return to the boat. Freshen up and check out of your cabin. \n09.30 – 10.30 AM Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet and more… \n10.30 – 11.30 AM While heading back to the harbor, watch the cooking demonstration before enjoying a traditional Vietnamese lunch. \n12.00 PM Disembark the Cruise \n12.30 PM Transfer back to your hotel in Hanoi city center. \n04. 30 – 05.00 PM Recheck in to the hotel again take a short rest to join a Hanoi food tour around \n7.30 PM to enjoy some authentic Hanoi street cuisine."},{"title":"Day 4: In the morning, have breakfast at the hotel and then free at leisure until transfer to Hanoi airport for your onward flight or to your continuing Hanoi accommodation.","description":"End of services"}]},{"name":"2 Nights Ha Long Bay Cruising & Bungalow in Sandy Beach Resort","duration":3,"travelStyle":["Sightseeing","Beach","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":308,"summary":"Explore Halong Bay and Sandy Beach Resort on this 3-day tour from Hanoi. Enjoy 1-night overnight accommodation on a deluxe boat and 1-night in a bungalow at Sandy Beach Resort.da Relax as you cruise along the beautiful Halong Bay and enjoy a range of activities enjoy campfires.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/152922_d4de8ece.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/152922_d4de8ece.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_4088c9c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_615cf94c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_ae690ecb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_4d6aa154.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_bb801953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_2513bb11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_c2b27c68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_c5a2f1e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_1a2bf609.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_2c7dc39f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_7479537a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_008f6d57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_fb26986b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_256c9a83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_5030ffbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_d63fa090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_063a5006.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_3867deaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152922_372a7927.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 01: HANOI – HA LONG BAY – LAN HA BAY (L/D)","description":"08:30am: Hotel or private address pick up by shuttle bus. Short break half way.\n12:00pm: Arrive Got Ferry Terminal, transfer by tender to Lapaci Cruise, and\nenjoy welcome drinks, receive cruise briefing, safety instructions then check in\nyour cabin and set sail throung Ha Long Bay while having time to admire the\nmagical landscape go by. The Cruise Pass Da Chong Islet, where you can see a\nlighthouse build by the French over 100 years ago.\n13:00pm: A special lunch in Vietnamese cuisine of fresh seafood and an\nassortment of appetizing favorites are served while sailing through Islets of Con\nVit and Gia Luan.\n16:00pm: The Cruise sails through Lan Ha Bay and completes its entry through\nCua Van Are. The area is surrounding of extraordinary limestore karsts\nlandscapes.\n From October to May: You can start your journey to explore Ba Trai Dao\nBeach, enjoy kayaking and/or enjoy swimming in the crystal clear waters of\nthe Bay.\n From June to September: We progress to Ong Cam area of Lan Ha Bay – a\nseparate part of Ha Long Bay. This is a quiet tourist paradise in Vietnam,\nenjoy kayaking and/or enjoy swimming in the crystal clear waters of the Bay.\n17:30pm: Back to Lapaci Cruise, drop anchor for staying overnight. Enjoy the\ncomplimentary sunset party on the sundeck with local wine and fresh fruits.\n19:00pm: Dinner is served in the restaurant. Enjoy delicious local food\nprepared and served for you by our wonderful onboard catering staff.\n21:30pm: Retire to your cabin or join the fishing excursion, watch a movie, have\na drink at the bar, internet accsess or play exciting games."},{"title":"DAY 02: HA LONG BAY - DARK &amp; BRIGHT CAVE – SANDY BEACH ISLAND RESORT (NAM CAT ISLAND) (B,L,D)","description":"06:00am: Enjoy sunrise and admire the never ending miraculous cenery of the\nBay. Practice an invigorating Tai Chi session on the sundeck.\n07:00am: Light breakfast, coffee and tea.\n08:00am: Visit Dark &amp; Bright Cave and islets by kayaking which is a wild and\nmysterious beauty in the middle of the World Heritage.\n09:00am: Back to our boat, relax before checking out your cabin.\n09:30am: OUR daily boat pick you up at Lapaci Cruise sailing Lan Ha Bay to\nViet HaI Wharf. From Viet Hai Wharf we will hop on bicycles for a 1,5 hour ride\nthrough pictureque trails straight to Viet Hai Village.\n12:00pm: Lunch will be served on daily boat in Lan Ha Bay.\n12:45pm: Visit the Vai Boi area, which is the heart of Lan Ha Bay, there are a\nlot of white sandy and coral beach for swimming, kayaking or rest and relax on\nthe beach.\n14:00pm: Daily boat will be drop off guest to Sandy Beach Island Resort, check\nin your room.\n18:30pm: After seeing sunset on Lan Ha Bay, you will have dinner at the\nrestaurant near the beach.\n20:00pm: Free time to visit Sandy Beach Island Resort."},{"title":"DAY 03: SANDY BEACH ISLAND RESORT (NAM CAT ISLAND)- LAN HA BAY – HA LONG BAY – HANOI (B/L)","description":"07:00am: Have breakfast and check out of the Sandy Beach Island Resort.\n07:45am: Get on a daily trip boat and cruise back to Lapaci cruise. On the way\nback you will see a fishing village filled with fishermen in Lan Ha Bay.\n10:00am: Join cooking class demonstration (teaching you how to make our\nspeciality, Spring rolls) on the cruise.\n10:45am: Lunch is served on boad.\n12:00pm: Disembark at the Got Ferry Terminal by tender. Take our shuttle bus\nto return to Hanoi.\n16:00pm: Arrival back at your hotel or home."}]},{"name":"Sapa & Binh Lu Market - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":244,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n","highlights":["Come with us to explore some of the best sights in Lao Cai","See spectacular Sapa and the colourful Binh Lu hill tribe market","Venture to the stunning Silver Waterfall and Heaven’s Gate"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/59441_dd88543b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/59441_dd88543b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_2fa1bfb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_22cc42de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_aed6754d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_a0be2e42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_370e7c71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_acce9b92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_688dae40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_1c490fab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_75e11796.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_25885364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_ade6e689.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_15036639.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_771611bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_debb6c86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_653e86ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_6e95f27c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_35963fb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59441_a7cf9254.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Cai"],"timeline":[{"title":"Day 1: Sapa, picturesque landscapes and colorful hill tribes (-/L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide, we will start a long trek trip to discover the life of the local minority people. The walk takes you from Lao Chai Village of the Black H'mong Minority to Ta Van Village of the Giay Minority. Along the way, we will take in the different traditions, cultures and costumes of the Giay and Hmong peoples. Then, we will return to Sapa. Overnight in Sapa.\n"},{"title":"Day 2: Binh Lu colorful market (B/L/D)","description":"Have breakfast before heading to Binh Lu Market. Binh Lu market is located on the other side of Sapa, passing the 1,900 meter Tram Tron pass, Viet Nam’s highest mountain pass and considered the most beautiful stretch of road in the country. This colorful market always delivers a very photogenic display of Flower Hmong, Dzao (red, black, coin), Giay, Lu, Nung and Phu La ethnic costumes. Join in to explore the market and learn more the about the Vietnamese Ethnic peoples. The traditional beauty of the Red Hmong, Lu, Thai and Giay peoples will amaze you. They raise buffaloes, cows, horses and other agricultural products to sell and exchange. We will have lunch with a Lu family. On the way back to Sapa, you can take a short walk to see Silver Waterfall and Heaven’s Gate, with its beautiful view of Fansipan Mountain - the highest peak in Indochina region. Arrive in Sapa in the afternoon. Overnight in Sapa. "},{"title":"Day 3: End of the trip, full of experiences (B/-/-)","description":"Free day for shopping and discovering Sapa town. Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. Your purpose may be just to have a look to get a feel about that something special of Sapa. But, in no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. They all could make good presents for you to bring home. Here you will have a chance to buy souvenirs from the local hill tribes themselves. They trek surprisingly long distances to gather here and sell you their hand-made nice items, most impressive of which are colourful clothes made of local fabrics.Check out, transferring to Sapa bus station back to Ha Noi."}]},{"name":"Exploring DaLat, the City of Flowers - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":488,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\nPerched atop a hill at an altitude of around 1500m, the town of Dalat is the perfect respite from the heat and hectic pace of Ho Chi Minh City (Saigon) which is exactly why the French colonists built a resort here. Spend three days filling your lungs with fresh air as you explore the attractions and architecture of this atmospheric town.","highlights":["Venture to Dalat, the perfect respite from hectic Ho Chi Minh City","Spend three days relaxing and filling your lungs with fresh air","Explore the attractions and architecture of this atmospheric town"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33743_785042c3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33743_785042c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33743_f5c62dc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33743_d6f9a21a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33743_6ced2054.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33743_65c27da8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33743_691e66ee.jpg"],"destinations":["Ho Chi Minh City","Dalat"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Da Lat (-/L/D)","description":"We will begin out trip with a comfortable drive by minivan to Da Lat. Upon arrival in Da Lat, we will check into our hotel and later in the afternoon, we will take an exhilarating bicycle ride around the famous Da Lat Market."},{"title":"Day 2: Sightseeing in Da Lat (B/L/D)","description":"In the morning, we will take a coach ride to Lang Biang Mountain and go hiking in the pinewoods to the top of Lang Biang. After the physical, but fun trek to the top of the mountain, we will take time to rest, relax and have a tasty lunch. After our hike, we will continue our day with visiting the Domain de Marie Monastery, King Bao Dai’s Summer Palace, The Crazy House and a number of other well-known tourist attractions in Da Lat. "},{"title":"Day 3: Da Lat - Ho Chi Minh City (B/L/-)","description":"On our last day together will we head back to Ho Chi Minh City, but along the way, we will make a few stops. We will visit to the beautiful Datanla Waterfall, the culture enriched Chicken Village and Tam Chau Restaurant for lunch as well as a complimentary cup of coffee or tea.\n"}]},{"name":"Deep Insight Vietnam Packages 18 Days","duration":18,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1932,"summary":"\n\tExploring Throughout Vietnam 18days, You have time to experience the rural local , enjoy culture, local food.\n\n\tOur itinerary cover almost famous destional Vietnam such as : Hanoi, Halong Bay, Ninh Binh, Sapa , Danang, Hoian ancient town, Hue , Phong Nha Cave, Saigon city, Cao Dai temple, Cuchi Tunnel , Mekong deltal\n\n\tJoin in this tour, You will save money but stil have great experience in Vietnam. \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/138290_6e42f95a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/138290_6e42f95a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138290_740a645f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138290_ec1dcb98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138290_7caac997.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138290_b64971b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/138290_d267e31b.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Mai Chau","Sapa","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi – Free & Easy (No Meal )","description":"Upon arrival at Noibai International airport, our representative will meet and transfer you to downtown for relax.\n\n\nOvernight in Hanoi."},{"title":"Day 2 : Hanoi city tour (B/L)","description":"07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi\nOpera House then depart to Hanoi city tour full day.\n\n\n09:00 Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n\n\n09:30 Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical\naspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to\none side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 -\nthe structure has become an important symbol for the people of Hanoi.\n\n\n11:00 Visit the colorful features of the 54 ethnic groups of Viet Nam in the Ethnology Museum.\n\n\nIn the afternoon:\n13:00 Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n\n\n14:00 Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as\nVietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to\nConfucius, sages and scholars. A vast structure that has existed to present day.\n\n\n15:30 Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and\nformer general commander Tran Hung Dao for his struggle against Mongolians. You also see the\nbeautiful Vietnamese and French architecture around the lake.\n\n\n16:00 - 16:30: Arrive at the hotel in Ha Noi old quarter. \n\n\nOvernight in Hanoi."},{"title":"Day 3: Hanoi – Halong Bay – Surprising Cave – Titop Island (B/L/D)","description":"07:30 - 08:30 Tour guide and shuter bus will pickup you at the hotel in Ha Noi old quarter and Hanoi\nOpera House then depart to Halong. On the half way stop for short break about 20 minutes.\n\n\n12:30 Arrive Tuan Chau International Port, then tranfering to Golden Star Cruise by small boat. Enjoy\nwelcome drinks, crew briefing before checking in cabin. Start cruising and enjoy a special lunch\nwith Vietnamese traditional dishes while the boat slowly slides on romantic.\n\n\n15:30 Visiting Sung Sot Cave (surprising cave)\n\n\n16:30 Our cruise will take you to the Titov Island, it is noted for having a viewpoint at its peak which\naffords splendid views all around Halong bay. Or you can enjoy your swimming on romance sandy\nbeach.\n\n\n17:30 Enjoy the Sunset party with wine and fruit and relaxing on sun deck\n\n\n18:00 Cooking class how to make fresh noodle roll, you can enjoy product which you make it.\n\n\n19:00 Enjoy your dinner in restaurant in middle romantic quite bay.\n\n\n20:00 Playing some sports games like: Football table, Darts, Fishing, karaoke, dancing…"},{"title":"Day 4: Halong – Pearl Farm – Kayaking – Ninh Binh (B/L)","description":"06:30 Wake up early to see the sunrise on Ha Long Bay then have breakfast with tea and coffee free\n\n\n08:00 The boat cruising to Pearl farm. The pearls in Halong are the most renowned in Vietnam. The\nprocess of farming and retrieving pearls takes years.\n\n\n09:00 Enjoy kayaking discover Halong bay. Then back to Cruise check out, take time to relax\n\n\n11:00 Have lunch while the boat is cruising back to Tuan Chau International Port\n\n\n12:30 Get on the bus directly to Ninh Binh. Overnight in Ninh Binh."},{"title":"Day 5. Ninh Binh – Cuc Phuong National Park – Mai Chau (B/L)","description":"Cuc Phuong National Park is located in Ninh Binh province. The Park is conveniently located on the route to several tourist attractions including Bich Dong pagoda, Hoa Lu. It was officially opened in 1960 as the first national park in Vietnam. Cuc Phuong National Park is surrounded by several limestone cliffs, the highest being May Bac, meaning “ Silver Cloud”, with a height of 656m. There are plenty of plants and animals living in the park. There are estimated 2000 different species of flora and the 450special fauna account for 38% of the national fauna.\n\n\n9h30: Visiting Cuc Phuong National Park, you are not only do trekking in the primary forest but also excellent hiking opportunities abound in the park and you could spend a day trekking through the forest. On the way visit the Cave of Early Man ( had over 7000 years). Picnic lunch in the forest. \nKeep following the popular trails will lead you to several ancient trees called by the name Cho Chi 1000 years, the oldest tree in the forest.\n\n\n14h30: Back Tam Coc, enjoy sunset party\n\n\n17:30 Take bus to Mai Chau. \n\n\n23:00 Drop off Mai Chau Valley View"},{"title":"Day 6. Mai Chau –Free & Easy (B)","description":"Breakfast at hotel then free time to explore Mai Chau or Pu Luong by yourself. "},{"title":"Day 7: Mai Chau – Hanoi – On Train Sapa (B)","description":"Breakfast at hotel then free time to explore Mai Chau by yourself. \n14:30 Bus pick you up at Mai Chau Valley View transfer Hanoi.\n\n\n18:00 Drop off ET –Pumpkin \n\n\n19:30 Bus transfer you to Station catch train to Sapa. Overnight on Train."},{"title":"Day 8: Sapa Lao Chai – Ta Van (B/L/D)","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\n\n\nStart the trip at 9:30 as below.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. \n\n\nLunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. \n\n\nLast trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan. Overnight in Sapa."},{"title":"Day 9: Cat Cat & Sin Chai Village – Fanxipang – Hanoi (B/L)","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. \n\n\nEnjoy picnic lunch by the side of the river, and then next 3 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a jeep to return to Sapa.\n\n\nAfternoon. Driver you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery. Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos). \n\n\nCome back to Cable Car Station and return to Sapa town, Free time to have dinner at your own.\n\n\n17:30  -18:00 Transfer you to Lao Cai station catch train back to Hanoi. Overnight on Train "},{"title":"Day 10 : Hanoi – Danang – Hoian old Town (by Plane)","description":"Suggest flight : Hanoi  - Danang (7:00 -08:20) by Jetstar airline –Charge from $80/pax\nArrival Hanoi early Morning arround 4:30 -5:00am. Driver will pick you up then transfer Noi Bai airport catch flight to Danang.\n\n\nArrival Danang. Driver only pick you up thentransfer to Hoi An old town, check in hotel ( 14:00pm)\n\n\nArriving Hoian - one of the World’s Heritage Site, you have chances to walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda by yourselves. In Hoian, everything is preserved as they were hundreds years ago. At night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs. (expense is taken by you).\n\n\nOvernight in Hoi An"},{"title":"Day 11 : Hoi An - My Son Sanctuary (B/L)","description":"After breakfast at hotel:\n8:30 am: Tour guide will pick you up at Hotel, and then we go to visit My Son Sanctuary – one of World’s Heritage Sites\n\n\n10:00 am: My Son Sanctuary, which used to be the citadel of Champa Kingdom, has been keeping the ancient beauty with more than 70 architectural works, which are the temples of the old Champa Kingdom. They still survive until today, despite the destruction of many wars. You will be able to not only discover the old Cham Pa monuments but also admire the Champa traditional dance performed by the professional local artists.\n\n\n12:30 pm: Depart for restaurant near Hoi An\n\n\n1:30 pm: Having lunch in a local restaurant\n\n\n2:30 pm: We will go back to your places in Hoi An.\n\n\nOvernight in Hoi An"},{"title":"Day 12: Tra Que Village – Danang (B/L)","description":"After breakfast at hotel, check out hotel.\n\n\n8.00am: Local guide will see you at your hotel with your bicycle. You will cycle to a local farm in Tra Que Village. A short stroll will take you around the vegetable garden and then you can join the farmers in preparing the land and fertilizing it with seaweed from the local lake. Following steps are raking the ground, sowing, watering, picking vegetable and many other gardening activities. After all these activities, you will take a short rest and enjoy foot bath before getting to preparing lunch with a local family. \n\n\nYour lunch will consist of many local delicacies including “Tam Huu” spring roll, “Banh Xeo” or local pancake of people in Vietnam middle region. You can join the cooking with the chef on these meals. After your morning excurtions and your lunch, you will take a Vietnamese traditional post-prandial nap before learning how to harvest and wrap the vegetables.\n\n\nAround 2.00pm, bid farewell to your host family before riding back to Hoi An.\n\n\nPick you up back to Da nang. Check in hotel. Overnight in Da Nang"},{"title":"Day 13: Danang – Hue Imperial City (B/L)","description":"Enjoy breakfast at hotel. Then, check out hotel\n7:30 am: In the morning, you will be picked up at hotel, then we start Hue city tour. On the way to Hue, you will pass through Hai Van tunnel, the longest tunnel in Southeast Asia.\nBesides that, you will have some time to enjoy the golden sandy beach of Lang Co Bay – one of the most beautiful bay in the planet.\n\n\n9:30 am: After arriving Hue citadel, you will visit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city.\nThien Mu Pagoda – the most beautiful pagoda of Hue, which is considered as the National pagoda of The Nguyen Dynasty, is your next destination after Khai Dinh Tomb. You can find the relics of Monk Thich Quang Duc – his private car, an eloquent witness of the Buddhist era in Vietnam.\n\n\n12:30 pm: At lunch time, introduces to you Hue specialties – the featured local dishes of this ancient city, in one of Hue’s famous restaurants.\n\n\n1:30 pm: We will take you to Hue Imperial city – the former administrative center as well as the accommodation of 13 Kings of the Nguyen Dynasty – the last feudatory Empire of Vietnam. The Imperial city is preserved as new for hundreds years, and tourists are allowed to visit many places such as Meridian Gate, Thai Hoa Palace and Duyet Thi duong theatre. Our tour guide will tell you the secret stories of the Royal family, of the Kings and the Queens’ lives.\n\n\nAffer that, drop you off at Hue hotel to check in. Overnight in Hue"},{"title":"Day 14 : Phong Nha Cave (B/L/ Snack meal)","description":"In the morning: \n6h30: Our guide and bus will pick you up at your hotel. On the way, stop to visit La Vang church and our guide will presenting Quang Tri Citadel (Nonstop) which was built in 1824 (The fierce battle of 81 days and nights has made this citadel well-known all over the world) Then to continue the itinerary our guide introduces about many places such as: Ben Hai river, Hien Luong bridge, Doc Mieu base…\n\n\n12h00: Arrive in Phong Nha - Ke Bang national Park. Lunch at restaurant.\n\n\nAfter lunch, cruise along the Son river to Phong Nha Cave. You will feel the magical and magnificent caves. Phong Nha also boasts underground rivers, large caverns and passageways and broad, pristine sandbanks. The most impressive cave - Phong Nha cave is probably also the most beautiful with many fascinating rock formations with imaginative names such as The Lion, Fairy Caves,... inside the Phong Nha Caves, the more illusory the stalactites and stalagmites look as they glitter when  right light is shone on them.\n\n\n3.30 Pm: Back to Hue on Ho Chi Minh trail. On the way back, you have Snack on the bus. \n\n\n7.30Pm: We arrive in Hue and drop you off at your hotel. Overnight in Hue."},{"title":"Day 15 : Hue – Saigon city (B)– By Plane","description":"Suggest flight: Hue – Saigon (08:50 -10:15) by Vietjest airline from $95/ticket\nHave breakfast then Check out hotel. Pick you up to transfer to Phu Bai airport to catch the flight to Saigon.\n\n\nArrival Saigon. Driver transfer you to Hotel for check in (14:00 ) If avaible room, You will check in soon.\n\n\nAfternoon: You free time to relax and explore Saigon city by yourself. Overnight in Saigon."},{"title":"Day 16: Saigon city – Tay Ninh - Cuchi tunnel (B/L)","description":"Start 8:00 am The Great Holy See Temple, built in 1926, is considered one of the most striking structures in all of South-East Asia. It is the headquarters of the unique Cao Dai sect, a religion with a hybrid of Buddhism, Christianity & Confucianism. Above the entrance is the all-seeing holy eye – symbol of the sect. \nVisitors will attend the midday ceremony’s extravaganza to witness the daily mass held by the Cao Dai followers which is a fantastic experience. \n\n\nAfter lunch, proceed to Cu Chi to explore the amazing site where Viet Cong hid during the War. It is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\n\n\n There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. Spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food in war time). \n\n\nReturn to SaiGon. 19:00 drop off your hotel. Overnight in Saigon."},{"title":"Day 17: Mekong delta full day (B/L)","description":"Start 8:00 Enjoy the scenic journey along the way bordered by green rice fields.  \n\n\nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \n\n\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  \n\n\n17:00 Drop off your hotel. Overnight in Saigon."},{"title":"Day 18: Saigon – Depature (B)","description":"Breakfast at your hotel. Free at leisure until transfer the airport catch flight back your country.\n\n\n End of services !"}]},{"name":"Viet Nam Holiday 19 Days 18 Nights","duration":19,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1079,"summary":"In this travel proposal of 19 days in Vietnam, Hanoi - Sapa - Halong - Cat Ba - Hue - Hoi An - Saigon - Mekong Delta.  you will get to see and enjoy the destinations in a relaxing way, no rushing around, no stress, no overly organized packaged tours, no one will feel the need to go home and sleep. A trip to enjoy Vietnam, its people, its landscapes, and also to enjoy of relaxing day, which is often lacking in these sorts of trips.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/166779_2e46dfff.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/166779_2e46dfff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_f16b7c8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_f6eef736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_013ee834.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_f8fa7cd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_2058db0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_27bc3ae8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_137705e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_69246ce7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_c8b9bd2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_4a499a19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_716268ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_dbf9ba06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166779_775a0fb8.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: ARRIVE IN HANOI (Meal Inc.No Meal)","description":"At your arrival to Hanoi, you will be greeted at the airport by our driver and transferred to your hotel. The first day is free time which you’ve been given to rest and later enjoy your by yourself \nOvernight stay in Hanoi"},{"title":"DAY 2: GETTING TO KNOW HANOI (Meal Inc.: Breakfast, Lunch)","description":"After your breakfast, at 08.00 am our tour guide and driver pick you up from your hotel, we take you to visit Ho Chi Minh complex, including Ho Chi Minh’s Mausoleum – the final resting place of Vietnamese great father or Uncle Ho (Close from 7 Sept till 6 Nov 2012. And close on all Monday and Friday afternoons. We visit outside only during closed time), President Ho Chi Minh’s stilt house – where Ho lived on and off from 1958 to 1969, then visit Ho Chi Minh’s museum where tourists will learn what he had done for Viet Nam and some other countries and a lot of information about President Ho Chi Minh. The next place is One Pillar Pagoda which is a group of structures consisting of a pagoda and a tower built in the middle of a square pond. Leave One Pillar Pagoda for the Temple of Literature  the first college  of Viet Nam dedicated to Confucian. Have lunch at local restaurant. \n \nAfter lunch, we get to visit the Ethnology museum, the Hoan Kiem Lake (Restored Sword Lake), Ngoc Son Temple and a xiclo ride around the heart of Hanoi: the old quarter, filled with street shops, narrow streets and motorcycles, a tour that will show you the more picturesque Hanoi.\n \nNote: For Hanoi City tour, we will visit The Museum of Ethnology on Tues, Thurs, Sat and Sun. We will visit Bat Trang Ceramics Village instead of The Museum of Ethnology on Mons, Weds and Fri.\nOvernight in Hanoi"},{"title":"DAY 3: HANOI - FREE DAY - NIGHT TRAIN TO SAPA (Meal Inc.: Breakfast)","description":"oday will be a free day for you so you can head out around the city and make your own exciting discoveries. We will give you all the necessary information about Hanoi, so that you can plan out your day. At 21:00pm our guide will accompany you to the station to start your journey to Sapa. \nStay overnight on the night train, in a four-bed compartment."},{"title":"DAY 4: SAPA TREKKING [AND OPTIONAL, NIGHT IN A VIETNAMESE HOME STAY] (Meal Inc.: Breakfast, Lunch and Dinner)","description":"<Sapa - Y Linh Ho - Lao Chai - Ta Van>\nUpon your arrival to Lao Cai our personnel will be there waiting to take you to the town of Sapa which is where the tour begins. \nToday awaits you a 4 miles trek southwest of Sapa. From Muong Hoa valley to Y Linh Ho village of the Black H'mong. We continue walking these trails and you head down to Lao Chai. We will walk through rice fields; visiting places where time seems to be stopped. You will arrive at the Ta Van village, home to the minority Dzay and have lunch in a local family’s home. After having another walk around Ta Van, you will be called to start preparing dinner with the local family, where you will spend the night.\n "},{"title":"DAY 5: SAPA TOUR: TA VAN - GIANG TA CHAI - SU PAN – SAPA (Meal Inc.: Breakfast, Lunch and Dinner)","description":"After breakfast we continue with the trekking down to the village of the Red Dzao. You get to see the Rattan Bridge, waterfalls, rice fields, beautiful views and landscapes.\nIn the afternoon we head back to Sapa.\nSpend the night in Sapa"},{"title":"DAY 6: CAT CAT AND SIN CHAI (Meal Inc.: Breakfast, Lunch)","description":"To end this Sapa tour, today we will visit Cat Cat village, here you will also get to see the Black H'mong. We will then visit the hydroelectric plant that was built in the colonial times by the French; it is a great place to have lunch, next to the river falls. After we will head down to the Sin Chai village which lies at the foot of Fansipan. Enjoy a short tour before the jeep will come to take you back to Sapa. \n15:00 Get on the Limousin bus back to Hanoi \n21:00 Arrive Hanoi, check in hotel and overnight in Hanoi \n"},{"title":"DAY 7: HANOI - HALONG BAY (Meal Inc.: Breakfast, Lunch and Dinner)","description":"You will arrive in Hanoi at 5:30 in the morning. We will pick you up at the station and take you to a hotel so you can rest, have breakfast, and shower, if you want to. \nAfter breakfast, at approximately 8:00am, the bus will be waiting for you to take you from Hanoi to Halong Bay (4hrs trip). You will get to visit Halong Bay and spend the night in a traditional Junk boat surrounded by the sheer beauty of this magical place. \n \nAt around 13.00 h we will embark on a cruise with a warm welcoming. After lunch you will visit a fishing village called Cua Van and you can see how real fishermen and families really live there.  Towards evening time you will have the chance to go and explore Halong Bay by Kayak, enjoy a nice swim and have a 15-minutes foot massage or a cooking demonstration of the Vietnamese cuisine. Today you will also get to visit the Hang Trong cave. Dinner will be served at around 19.00h.\nOvernight on  Cruise "},{"title":"DAY 8: LAN HA BAY – MONKEY ISLAND - CAT BA TOWN (Meal Inc.: Breakfast, Lunch and Dinner)","description":"06:00 If you like enjoying Ha Long bay’s sunrise, please get up early before 06:00.\n07:00 Breakfast will be served on cruise \n08:00 Visit to PearlFarm. Enjoy kayaking to discover Halong beauty.\n09:30 Our daily boat will pick you up on cruise sailing Lan Ha Bay \n12:00 Lunch will be served on daily boat.\n13:00 Go to the Monkey island for swimming or relaxing on the beach.\n14:00 Daily boat will be drop of guest to Cat Ba Island Wharf - Beo Harbor  and proceed to hotel via local transportation.\nCheck in hotel Hung Long hotel or the same quality  upon arrival in Cat Ba town. \nFree time after checking in to explore Cat Ba town.\n18:30 Dinner will be served at a local hotel’s restaurant.\n"},{"title":"DAY 9: CAT BA– HANOI – FLIGHT TO HUE (Meal Inc.: Breakfast)","description":"Breakfast at your hotel,\nFree and easy, take the shuttle bus to Hanoi  \nArrive Hanoi at noon, free and easy \nAt the scheduled time, you will be transferred to the airport for your flight to Hue. Once in Hue, our partners will take you to your hotel. \nOvernight stay in Hue"},{"title":"DAY 10: VISITING HUE (Meal Inc.: Breakfast, Lunch)","description":"The picturesque and hilly Hue has a special place in the history of Vietnam. Selected capital of the Nguyen Dynasty (1802-1945), Hue takes us back to the old, the origin Vietnam. A place that has been keeping hundred years of architectural works including palaces and royal tombs of the Nguyen dynasty.\n \nWe will pick you up at your hotel around 7:30 am. We will begin with a visit to the tombs of Minh Mang and Khai Dinh. On this tour we've also included a visit to see and appreciate the Van An, a Vietnamese martial art. We pass through a small village where they specialized in the development of classic items like conical hats and incense made.\n \nAfter our visit to the tomb of Tu Duc, a buffet lunch will be ready at your disposal. And after you have rested, the bus will take you to the Citadel. You will visit the Citadel of Hue, a World Cultural Heritage. It was built on the banks of the Perfume River, Western style combining so great with the citadel oriental architecture. It consists of three campuses: the defensive citadel, the Imperial Citadel and the Purple Forbidden City. You will visit Thien Mu pagoda, and to complete the tour of Hue awaits a boat ride on the Perfume River. At 5:00pm we begin to transfer you back to your hotel.\nOvernight stay in Hue"},{"title":"DAY 11: HUE - HOI AN (Meal Inc.: Breakfast)","description":"We will continue touring the country and be on our way to the South Vietnam, heading down to Hoi an. On the way we stop at the Hai Van Pass, Lang Co Beach and the Marble Mountains.\n \nIn the afternoon we will have time to stroll through the charming Hoi An. The architecture of Hoi An has no equal, with its low houses and wooden painted facades. Visit the Japanese Bridge, which according to local legend is indestructible. We enter the Pottery Museum, the amazing Tan Ky house (which was the first monument of historic interest) and the cantons temple.\n \nHoi An is a city where you can travel on your own, at ease. Thus, we haven’t included a guided tour, but if you’re interested, you can contact us and we will include one for you.\nWe will recommend you places for your dinner. Today you will be responsible for your own dinner.\nOvernight stay in Hoi An"},{"title":"DAY 12: HOI AN FREE DAY (Meal Inc.: Breakfast)","description":"ou have this day free in Hoi An to explore the city at your own pace, there are many things that you can find in the shops in the city. Hoi An is famous for its tailors and its shoemakers. \nOvernight stay in Hoi An."},{"title":"DAY 13: HOI AN FREE DAY (Meal Inc.: Breakfast)","description":"A second free day in Hoi An! Spend it your way. So that you don’t miss any detail of Hoi An, we will send you all the information about this destiny.\nOvernight stay in Hoi An.\n "},{"title":"DAY 14: HOI AN - FLIGHT TO HO CHI MINH CITY (Meal Inc.: Breakfast)","description":"Today you will be taking a flight to Ho Chi Minh City, where we will be waiting for you at the airport to take you to your hotel. You will enjoy a free day in Ho Chi Minh; of course, there will be all the information about Ho Chi Minh that we will have sent to you so you can enjoy your free day as much as possible.\nStay overnight in Ho Chi Minh.\n "},{"title":"DAY 15: HO CHI MINH - CU CHI AND CAO DAI TEMPLE (Meal Inc.: Breakfast, Lunch)","description":"At around 8am, the bus will be waiting for you at the door of your hotel to take you to Tay Ninh, where you find The Great Cao Dai Temple, the headquarters of the Cao Dai religion (one of the most unique religions that originated in Vietnam), it is one of the most emblematic buildings of Asia it’s a fusion of Confucianism, Taoism and Buddhism. \nBack to the temple, we will stop to visit the Cu Chi Tunnels, and see how they managed to surprise their opponents during the war. We will also see the network of tunnels made by the Vietnamese, a real marvel, worthy of being studied by any architect. \nAfterward, you will be transferred back to your hotel.\nStay overnight in Ho Chi Minh."},{"title":"DAY 16: MEKONG DELTA - MY THO - BEN TRE - CAN THO (Meal Inc.: Breakfast, Lunch)","description":"Today we visit the Mekong Delta. From Ho Chi Minh awaits a journey of around two hours and a half to get to My Tho. There you will take a boat that will take you through the canals of the Mekong Delta. You will visit the fruit market in My Tho and Turtle Island. Lunch will be served in a quiet place in the Mekong Delta, surrounded by greenery and gardens. In Ben Tre you will also have a boat tour, get the chance to visit local families to get an idea of their daily lives, and after seeing Thoi Son we then head back to My Tho by boat to visit Can Tho. \nYou will spend the night in Can Tho.\n "},{"title":"DAY 17: MEKONG DELTA: CAN THO, HO CHI MINH (Meal Inc.: Breakfast, Lunch)","description":"You will need to wake up early to see the Delta markets. There will be two floating markets waiting for you, the Phong Dien and Cai Rang. You will also get to visit coconut candy and rice noodle sellers. You will also get to see how they make these products. \nWe return to Ho Chi Minh to spend the night in the city.\nStay overnight in Ho Chi Minh."},{"title":"DAY 18: HO CHI MINH - DAY OFF (Meal Inc.: Breakfast)","description":"We will give you all the information so you can make good use of this day off in Ho Chi Minh. For dinner you will attend a farewell dinner on a cruise across the Saigon River."},{"title":"DAY 19: HO CHI MINH - HANOI - HEAD BACK HOME (Meal Inc.: Breakfast)","description":"Breakfast at your hotel\nFree and easy until the driver pick you up at your hotel transfer to the airport, take flight back home. TOUR FINISH "}]}]