[{"name":"Sapa – Bac Ha Markets tour 3 days 4nights","duration":3,"travelStyle":["Adventure","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":230,"summary":" \nSapa – Bắc Hà Markets tour 3 days 4 nights takes you to two of the liveliest local markets in the Sapa area. Visiting the markets, your senses will be overwhelmed by sights, sounds and smells coming from the maze of stalls. You will meet people from many of the different ethnic groups in the area and learn about their cultures and traditional crafts. This amazing cultural discovery will all be set against the stunning back of Sapa’s rice terraced mountains and sweeping valleys. \nHighlight\n\n  Walk to tribal villages  \n  Discovery of unique local market.\n  Colorful minority groups\n  Homestay with ethnic minority groups \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114360_247ff09b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114360_247ff09b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_ee8c1388.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_ad52c973.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_7c97f7c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_eb952976.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_b1cd8e89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_c1f5488d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_0e337ce3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_739d188e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114360_7f000808.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"NIGHT 1:HANOI – LAO CAI","description":"An English speaking guide will collect you from your hotel in Hanoi at 21:00 and take you to Hanoi Train Station for the overnight train to Lao Cai."},{"title":"DAY 1: LAO CAI – CAN CAU MARKET – BAC HA (B/L/D)","description":"You will be collected from Lao Cai Train Station for the 2-hour drive along the border with China. You will pass through wonderful landscapes, following the mountain road via Bac Ha Town to Can Cau Market (20 km from Bac Ha). Although Can Cau is smaller than some of the other markets, it is special as it has retained its local, authentic appeal. Few tourists come here, so you will be able to get a real feel for the local cultures. After exploring the many fascinating stalls, you will head Bac Ha at around midday to have lunch and check into your hotel. In the afternoon, you take a walk around Thai Giang Pho Village (4 km) to learn about the life of the Flower H’mong and the Nung. One of the qualities of these close-knit mountain communities is their warmth and hospitality. You may even be invited into a local family home for a cup of tea or the infamous corn wine.\nYou will have the rest of the day free to enjoy your beautiful surroundings, or you may wish to visit the palace of a H’mong King, which is not far from your hotel. You will stay overnight at your hotel in Bac Ha."},{"title":"DAY 2: BAC HA MARKET – SAPA (B/L/D)","description":"Today you will walk to Bac Ha Markets, along with the local people also going to peruse the many enticing stalls. This is one of the most colourful markets in the area and looks more like a festival or celebration than a weekly market. The whole area is alive with activity, added to by the scuffle of pigs, cats, buffaloes, horses all being take for sale.\nYou will leave the market to visit the H’mong King’s house (King Hoang A Tuong) which was built by the French and the Chinese in 1920. This unique combination of European and Oriental styles is reflected in the grand architecture of the building. You will then return to Bac Ha Town for lunch. In the afternoon, you will spend some time visiting Ban Pho Village for heading Sapa. On the way to Sapa, you can stop to see the Vietnamese and Chinese Harbour Mouth in Lao Cai. You will reach Sapa in the late afternoon and enjoy dinner at local restaurant. You will spend the night in a homestay in Sapa.\n"},{"title":"DAY 3: SAPA – LAO CAI – NIGHT TRAIN TO HANOI (B/L/D)","description":"After breakfast at the hotel, you will take a jeep ride down into the valley. After being ped off, you will trek through the verdant valley to visit three different villages belonging.\nto the Black H’mong and the Dzay people. You will stop for lunch with a local Dzay family before joining the jeep back on the road for the drive to Lao Cai Train Station. You will have dinner at a local restaurant before taking the night train back to Hanoi.\nNight 3: Over night on the train (soft sleeper). The Sapa Tour from Hanoi finish here. See you in the next trip!"}]},{"name":"Saigon to Phu Quoc 7 Days (with Mekong Eyes Cruise)","duration":7,"travelStyle":["Discovery","Group","Partially Guided"],"oldPrice":0,"price":885,"summary":"Visit Ho Chi Minh City – the most dynamic city in Southern Vietnam\nExplore the engrossing underground network of Cu Chi Tunnels \nVisit the Mekong Delta - Vietnam’s ‘rice basket’, cruise the watery through sleepy villages and green fields \nEnjoy beach break at a beachfront resort on Phu Quoc Island ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/50361_698da03c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/50361_698da03c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_05d4839d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_9becc413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_943ca7ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_73c0818c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_af0c836a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_9061c765.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_356f045d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_38e47929.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50361_0c491781.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Phu Quoc Island"],"timeline":[{"title":"Ho Chi Minh City Arrival","description":"Upon your arrival at Tan Son Nhat airport in Ho Chi Minh City, you'll be pick up and transferred to your hotel. The remainder of the day will be your own. Overnight in Ho Chi Minh City."},{"title":"Ho Chi Minh City - Full Day City Tour","description":"After breakfast, you'll enjoy a guided city tour starting with the Reunification Palace, the former Presidential Palace for the president of the South of Vietnam, the Notre Dame Cathedral and Old Post office to get good shots for our memory of the big, modern city of Vietnam.\n\nAfter lunch at a local restaurant, you will continue by heading to Chinatown with walking tour through back streets of China town near Cho Lon to view the local daily life. Stop off for a visit of Thien Hau temple, which was built in the early 19th Century dedicated to Thien Hau, the goddess of seafarers. We delve deeper into Chinatown visiting the amazing Cholon and Binh Tay Market for an insight into where locals shop. Then you'll will be back to hotel at around 17:00. Overnight in Ho Chi Minh City."},{"title":"Saigon - Can Tho - Panorama Cruise","description":"In the morning we pick you up at your hotel in Saigon and take you to the pier in Can Tho. You board your wooden river cruise boat around noon. After a refreshing welcome drink we show you our on-board facilities and your cosy cabin. As lunch is served, the boat starts cruising. Sit back and watch the fantastic scenery and the daily life of the Mekong people.\n\nIn the afternoon you can disembark for a guided leisurely stroll through the village and the surrounding fruit orchards or rice fields. Meet the friendly locals and taste the local produce and fruits.\nGet back on board and enjoy a drink at the bar or relax on deck as the sun sets over the magnificent water landscape. The boat will anchor for the night. The day ends with a delicious on-board dinner.Overnight on board"},{"title":"Life on the water and floating markets","description":"Wake up well rested to the sound of the River and get ready for another exciting day of sightseeing. At 6.30h the boat sets off for a sunrise cruise. Watch the locals go about their daily work drying exotic fruits and building ships on the wooden yards while enjoying an early breakfast.\nAfter breakfast, we will board a sampan boat to Cai Be floating market. Later in the morning your can boat through the green water landscape on a little rowing sampan to see local houses, verdant orchards and ship-building yards. Alternatively you can discover the nearby town on foot or on explore the small side canals on a bicycle.\nThe vessel now resumes its journey as lunch is served. In the afternoon there will be another side trip to one of the exotic villages or lush plantations along the way. While mooring close to Tra On Island you can enjoy another relaxing evening and night about your river cruiser.Overnight on board"},{"title":"Cai Rang Floating Market and afternoon flight to Phu Quoc","description":"After morning tea and an early start through the glorious morning atmosphere on the river we will visit the famos floating market of Cai Rang. Marvel at the sheer abundance of exotic fruits, vegetables and skilfully handcrafted regional products. We will pull up to the boats for talking and bargaining with the merchants.\n\nYou will return to the boat for a sumptuous brunch before we bring you to Can Tho airport for your afternoon flight to Phu Quoc. On your arrival, you'll be picked up to your hotel/resort. Overnight in Phu Quoc"},{"title":"Phu Quoc Free Day of Leisure","description":"Your time will be free at leisure. Overnight in Phu Quoc"},{"title":"Phu Quoc - Ho Chi Minh City","description":"Your time will be free at leisure until being picked up for a domestic flight to Ho Chi Minh City."}]},{"name":"Vietnam Essential 10 days","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":888,"summary":"Vietnam Essential 10 days is the perfect itinerary for those whose are interested in discovering the majestic beauty of Vietnam with scanty time. Take a fascinating culture experience  from the southern of Vietnam with the magic labyrinthine – Mekong Delta, to the captivating limestone of Halong Bay. You will also have chance to discover the ancient beauty in Hoi An as well as the capital of Hue with royal architecture, before immersing yourself in Hanoi’s colonial charm. Don't forget charge your camera before departuring because there are a lot of ideal places for you to take beautiful pictures to keep as a souvenir","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/133813_55110531.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/133813_55110531.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_f683b56a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_34f8cb20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_b3d4b27f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_73e9d127.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_fa8c2e03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_b77b85f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_095b0e2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_ad90aaf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_e4aa1099.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_e9d6336c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_a6824864.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_e61e38bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_cebcdcc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_31bb1e81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_f6c6f917.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_b1468f31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_b339c3a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133813_ee0b321c.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City Arrival","description":"Upon your arrival in the bustling Ho Chi Minh City, still called “Saigon” by many locals, your guide will welcomed you at the airport and then transfer you to your hotel for check –in. Your room is at disposal from 14:00. Free at leisure to relax in the rest of the day.\nOptional: We introduce the one-of-a-kind traditional performances which are found nowhere else than in Vietnam: Water Puppet Show where puppets are performed on water stage with folk music, presenting ancient tales, folklores and daily life in Vietnamese countryside.\n\nIf you're interested in the shows, please contact our travel consultants to book.\n\nMeals: NA\nAccommodation: Hotel in Ho Chi Minh City\nActivities: Welcome to Ho Chi Minh City ! Just enjoy your free time."},{"title":"Day 2: Ho Chi Minh City - Mekong Delta - Ho Chi Minh City","description":"The lush, riverine tapestry of the Mekong Delta makes the perfect escape from the bustle of Ho Chi Minh City. You can savour blissful peace in Ben Tre where they can explore orchards, farms and fisheries and survey the scenery by bike or from a boat.\nEnjoy the fresh air and immerse yourself in the tranquility in this part of countryside in Mekong Delta, still untouched by tourism.\n\nBoard on a long tail boat and experience the diversity of the Mekong waterways first hand as you explore fish farms and exotic fruit farms. Touring the orchards, paddy fields and swamplands of the Mekong Delta, boat trip along the river to visit a brick kiln factory, a coconut processing workshop and a local mat-weaving house. Visit a quite village where you can have a short walk to experience real Delta village life. Enjoy some local fresh fruits. Take Xe Loi ride (a kind of modern motorized rickshaw) or cycling tour to explore around village under coconut row. Have lunch at a riverside restaurant.\n\nAfter lunch, we take rowing sampan along the water coconut canals with beautiful tropical scenery. We end the tour by taking boat back to pier and return to Saigon.\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Ho Chi Minh\nActivities: Visit Ben Tre - experience the water world of Mekong Delta, embark on a small sampan boat riding through the small canals to observe the daily life along the river banks. After that take a visit to a brick kiln factory, a coconut processing workshop and a local mat-weaving house as well as taste some fresh seasonal fruits"},{"title":"Day 3: Ho Chi Minh City - Cu Chi Tunnels - Flight to Danang - Hoi An","description":"Today morning you will drive 55 km out of Ho Chi Minh City to Cu Chi District famous for the amazing complex of underground tunnels. There are more than 200 km of tunnels, comprising a main axis system with many branches connecting to underground hideouts, shelters and other tunnels. Experience traditional noodle for your lunch.\nAfternoon enjoy the attraction of Ho Chi Minh City. Sightseeing examples of French colonial architecture and exploring the Vietnam’s turbulent in past at the Museum. Our guide will show you the most interesting sights that Ho Chi Minh City has to offer.\n\nDepart from your hotel to the Reunification Palace; this beautifully preserved palace was the residence of the President of the Republic of Vietnam. On April 30th 1975 the American War officially came to an end here. Afterward, we visit Saigon Notre Dame Cathedral, which was built in 1880, and the Old Post Office, which was built sometime between 1886 and 1891. It is one of the best examples of classical French colonial architecture. Our last stop would be at a local Market where you can practice your bargaining skills while shopping for souvenirs. Discover local life and culture. You’ll find some of the friendliest, liveliest, most convivial people in the city in here. Return your hotel in Ho Chi Minh City.\n\nFree time in the rest of day\n\nBack to your hotel and enjoy your free time before transferring to airport in Ho Chi Minh for flight to Da nang. Pick up at airport in Da Nang then transfer to hotel in Hoi An for check - in\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Hoi An\nActivities: In the morning, drive 55 km out of Ho Chi Minh City to Cu Chi District and discover the amazing complex of underground tunnels. In the afternoon, gain an insight into the city’s development through a walking tour to the most significant landmarks. End tour and transfer to airport in Ho Chi Minh for flight to Da nang"},{"title":"Day 4: Hoi An","description":"After having breakfast at hotel, your guide will take you on a stroll through the ancient town. Its friendly inhabitants, narrow streets, old houses, temples and wooden bridge still remain its ancient character.\nThe best way to discover Hoi An, however, is to simply wander. Little more than a maze of a few streets, there are temples, museums and preserved houses to visit; yet with some 850 buildings heritage-protected, the best feel for the town comes from the places which are free to all. As with everywhere in this country, the ‘real’ Vietnam is to be found in unexpected places, such as a back street or turning down an unexpected alley, or talking in broken English to the old lady who sells Chinese scrolls. In hidden nooks and crannies are art galleries, cafes, gastronomic gems, ceramics for sale, shops filled with lanterns and, of course, the silk for which the town is famed. There are woodworkers and carvers, artists at work, craft shops. Plus there are always cold drinks for sale, important no matter the time of year. In this part of Vietnam, it is either hot and dry, or hot and wet.\n\nBack to your hotel and spend the rest of the day on your own.\n\nMeals: Breakfast\nAccommodation: Hotel in Hoi An"},{"title":"Day 5: Hoi An - Free day","description":"Optional: We introduce some ways to explore the beauty of Hoi An. You can choose one of below options:\nOption 1: Discover My Son Holly Land Half day: My Son Sanctuary - a collection of Champa ruins nestled amongst the mountains in a geological basin of the Quang Nam province.\n\nPrice from $ US50/ person\n\nOption 2: Life as a Farmer in Cam Thanh village: Join the farmers in preparing and fertilizing the land. Get to know the villagers’ daily working routines, like raking the ground, sowing, watering and picking greens and many more gardening activities.\n\nPrice from $ US70/ person\n\nOption 3: Hoi An Vespa Tour\n\nPrice from $ US80/ person\n\nMeals: Breakfast\nAccommodation: Hotel in Hoi An"},{"title":"Day 6: Hoi An - Danang - Flight to Hanoi","description":"Transfer to the Da Nang airport to take a flight to Hanoi. Upon arrival, our driver will wait and transfer you to the hotel in the center of city.\nCheck-in hotel and free at leisure to relax.\n\nMeals: Breakfast\nAccommodation: Hotel in Hanoi\nActivities: Transfer to Da Nang airport for flight to Hanoi.\n"},{"title":"Day 7: Hanoi Half day City tour","description":"Half day Hanoi city tour (by car or by motorbike – upon client’s interest) - Morning or afternoon departure depend on availability\nBegin the first day of the trip with a tour of Hanoi. Depart from the hotel at 08:30 for a visit to Vietnam’s first university: the Temple of Literature. Founded in 1076, Quoc Tu Giam was established within a temple to educate Vietnam's royalty, mandarins and members of the elite.\n\nContinue with a visit to the iconic One Pillar Pagoda, one of Vietnam’s most iconic temples. Nearby is the mausoleum of the historic father figure of modern Vietnam, Ho Chi Minh, and his modest house on stilts. (Sites are viewed from outside; closed Mon and Fri and from June -August)\n\nWrap up the morning with a visit to the picturesque West Lake and its sixth century Tran Quoc Buddhist Pagoda.Tran Quoc Pagoda is regarded as the most ancient pagoda in Hanoi with its history line of more than 1,500 years.\n\nHave lunch at an authentic Vietnamese Restaurant. Free time at leisure for rest of the day.\n\nOptional: We introduce two one-of-a-kind traditional performances which are found nowhere else than in Vietnam. You can choose one of below options:\n\n- Water Puppet Show where puppets are performed on water stage with folk music, presenting ancient tales, folklores and daily life in Vietnamese countryside.\n\n- Tu Phu (Four Palaces) Show - a very unique show about ritual of spirit practiced in the Vietnamese indigenous religion with music, colors and lively dance performance. The Four Palaces Shows take place on Thursday and Saturday every week.\n\nIf you're interested in the shows, please contact our travel consultants to book.\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Ha Noi\nActivities: Half day Hanoi City tour in the morning. Ride around the city, outside of the Old Quarter. Take a number of short stops to learn about the history of the sites, including Ho Chi Minh Mausoleum and the Temple of Literature."},{"title":"Day 8: Hanoi - Halong Bay - Overnight on Cruise","description":"Halong Bay is listed by UNESCO as a World Natural Heritage and voted as a Wonder of Nature by the New7Wonders Foundation. You will have a night staying in this world famous bay.\nBe ready for pick-up at your hotel lobby at 08:00. Halfway to Halong City we will have a stop at Hong Ngoc Humanitarian Centre. Apart from having clean western style toilet facilities we will be able to see local craftsmen at work and have time for relaxation.\n\nUpon arrival at the pier, embark on the boat and set sail on a cruise through the limestone cliffs and emerald waters of Halong Bay, taking in the spectacular scenery of this UNESCO World Heritage site.\n\nLunch is served as you cruise by impressive rock formations with unusual names and shapes.\n\nIn the afternoon you will start to discover Halong Bay, listed as a World Heritage of outstanding natural beauty, known in Vietnamese as “Dragon descending to the sea“. Depending on each cruise’s itinerary of the day, you may visit a beautiful cave, have some swimming at Titov or Soi Sim beach.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: On-board an overnight cruise in Halong Bay\nActivities: Drive to Halong Bay where you board a junk for a cruise among the hundreds of islets of this magical World Heritage Site. Enjoy lunch and a swim. Drop anchor in the evening for an overnight stay among the dramatic limestone peaks.\nOur tour guide will not accompany aboard the cruise in Halong Bay. Resident English speaking guide on board is available"},{"title":"Day 9: Halong Bay - Ha Noi","description":"Wake up by the sounds of the sea. After breakfast, cruise will take tourists to explore the most stunning caves in Halong.\nAt around boat starts cruising back to the harbor while brunch is served. We continue cruising through the bay, along the way seeing more of the fascinating formations.\n\nBack on shore we will then transfer back to hotel in Ha Noi\n\nSpend leisure time to relax or discover Ha Noi on your own\n\nMeals: Breakfast, Brunch\nAccommodation: Hotel in Hanoi\nActivities: Continue cruising to explore the most stunning caves in Halong and have the brunch on board. Disembark then back to Hanoi. Spend the rest of the day on your own"},{"title":"Day 10: Hanoi Departure","description":"Free at your leisure in the morning. You room is available until 12:00.\nOur driver will transfer you to the airport to take your departure flight. End services.\n\nHope to serve you again!\n\nMeals: Breakfast\nAccommodation: NA\nActivities: Free at your leisure till driver pick up you at hotel for transferring to the airport in Hanoi for your onward flight. Hope to serve you again!"}]},{"name":"5 Tour Hanoi Package Including City Tour, Bat Trang and Halong Bay","duration":5,"travelStyle":["In-depth Cultural","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":459,"summary":"This package includes 5 consecutive day tours departing from your Hanoi hotel. Over the course of 5 days, you’ll get to go on a Hanoi City Tour, Hanoi Evening Food Tour, Bat Trang Tour, visit the world-famous Halong Bay, and take a tour of Hoa Lu Tam Coc.Hotel stays are not included as part of this tour, please arrange for hotel accommodation accordingly.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/97669_891f43cd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/97669_891f43cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_e6b2fb74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_6cefa925.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_317755c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_cba2d1de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_883e32d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_3b09ffd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_97f20f30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_b415d86b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_aa16910e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97669_6e3a5bf3.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: 8:30 AM: Firstly visit Ho Chi Minh Complex: Ho Chi Minh’s mausoleum then on the way out visit One Pillar Pagoda, Temple of Literature.","description":"After lunch time in local Restaurant \n01.00 PM: Continue to visit the interesting Museum. Hoan Kiem Lake and Ngoc Son Temple. \n04:00 PM: Finish Tour at Hoan Kiem Lake.\nNOTE: Ho Chi Minh Mausoleum and Museum is closed on Monday and Friday"},{"title":"Day 2: Pick you up around 6pm.","description":"Giving you a great insight into the traditions of Vietnamese food culture. First visiting the colorful local markets. Continues along both high streets and back streets exploring many corners in Hanoi’s tranquil French Old Quarter. You will try local meat and vegetarian dishes and try some of our local beverages, whilst chatting with street the vendors. Our final stop we will take to one of Hanoi's best secrets, a hidden café with stunning views over the picturesque Hoan Kiem Lake.  Return to your hotel around 9pm."},{"title":"Day 3: Pick you up at the hotel heading to Bat Trang Village.","description":"The village is surrounded by fertile farmland and well known for its beautiful ceramics. With the local artisans at work or try sitting behind a potter's wheel to see how they create ceramic vases and other masterpieces in their kilns. Return to Hanoi."},{"title":"Day 4: Pick up time: 07.45AM – 08:30 AM","description":"12.00 Arrive in Halong City, board a traditional wooden junk and start the cruising trip \n12.30 Fresh seafood lunch (vegetarian menu available) is served. After lunch, stop at the most beautiful cave named Thien Cung (Heaven Palace Grotto) and explore huge chambers adorned with stalactites and stalagmites of all kinds.\nBack to the boat after the visit and heading to Ba Hang Fishing Village, you have 2 options here:\nEnjoy a rowing boat trip around Ba Hang Floating village Take a kayaking trip on your own to explore this village.\nFrom the floating village, relaxing on the cruise while the boat keeps cruising back to Halong harbor.\n16.30 Transfer back to Hanoi.\n19.30 – 20.00 Arrive in Hanoi, drop off at the hotel. Say goodbye and end of service."},{"title":"Day 5: 8am start our journey to Hoa Lu the ancient capital.","description":"Arriving at 10.30am we will tour the old city and see what is still standing. The visit offers a chance to understand more about the Vietnamese history and its feudal dynasty periods. After our history tour we will stop for a local Vietnamese lunch and enjoy local specialties.\nIn the afternoon we take a 2 hour boat trip to visit Tam Coc, which is known as “Halong Bay on land”. Tam Coc is made up of three limestone caves stretching along Ngo Dong River.\nWe then start our journey home arriving back in Hanoi around 6.30pm."}]},{"name":"Bun Cha & Biking in Vietnam","duration":10,"travelStyle":["Bicycle","Boat","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":2149,"summary":"Take to two wheels and explore northern and central Vietnam by bike. This \nten-day cycling trip guides you around some of Vietnam’s celebrated \nlocations, including the well known centres of Hanoi, Hue and Hoi An. \nYou’ll kayak around the limestone karsts of Halong Bay and row through the \nsublime scenery of Trang An. But you’ll get away from the tourist trails \ntoo, with the chance to cycle through rural Vietnam  and its picturesque \nrice terraces and verdant landscape. And for good measure, you’ll return \nhome knowing how to rustle up a fragrant Vietnamese meal.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186762_b0541b98.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186762_b0541b98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_8d07c1ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_7586e319.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_8633b695.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_c36da5f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_24213f38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_76c32b25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_57ef0a24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_6ccd1a85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_7efff6c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186762_d4f4b472.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Welcome dinner in Hanoi","description":"You’ll arrive in the capital of Vietnam, Hanoi. We love this busy and \nfull-on place, where scooters precariously weave their way through narrow \nstreets to a continual soundtrack of honking horns.\n\nTonight, you’ll get to know your group at KOTO (Know One, Teach One). This \ntraining restaurant for disadvantaged youths serves excellent food and \nyou’ll have the opportunity to try some local flavours as well as dishes \nfrom wider south-east Asia."},{"title":"Day 2: Cycle around glorious West Lake","description":"At dawn, you’ll head to Hoan Kiem Lake for a Tai Chi and Laughing Yoga \nsession. Feeling revitalised, you’ll feast on /pho, /a Vietnamese soup, for \nbreakfast. Next, there’s a walk around the labyrinth streets of Hanoi’s \nOld Quarter, stopping to sample egg coffee. There’s /bun cha/ for lunch, a \nlocal dish of noodles, broth and meat served alongside some greens.\n\nAfter lunch, you’ll pick up bikes before cycling to Ho Tay, the city’s \nlargest lake, to bike 15 miles around its circumference.  The ride provides \na glimpse into modern and traditional Vietnamese life as fishermen wait for a \ncatch and luxury rooftop restaurants compete for space. You’ll stop at one \nof the many cafes to sip on delicious Vietnamese coffee and enjoy the \nlakeside views.\n\nDinner tonight is at Tam Vi, a restaurant serving traditional northern \ncuisine. Then it’s on to a popular cocktail bar, Mojito Bar & Lounge, to \ntry their legendary /pho/ cocktail."},{"title":"Day 3: Bike it to Ninh Binh","description":"Today you’ll leave Hanoi behind, heading an hour-or-so outside of the city \nto Cho Tia railway station. You’ll cycle through pagoda and temple-filled \nvillages, then join the riverside path beside the Chau Giang River and Day \nRiver, one of the four longest rivers in North Vietnam. Today’s 43-mile \nride finishes at Thanh Nghi, where a bus transfers you to the hotel in Ninh \nBinh."},{"title":"Day 4: Boating and biking","description":"After breakfast, you’ll cycle from the hotel to Trang An in Ninh Binh \nprovince for a boating adventure. You’ll spend over two hours journeying \nthrough the spectacular scenery along the Sao Khe River, exploring the \nintriguing limestone caves (and understanding why this area has been granted \nUNESCO Heritage status).\n\nAfterwards, it’s back in the saddle to cycle along the Day River, following \nits banks to Hai Hau in Nam Dinh. There’s a stop along the way to visit the \ncovered bridge, Pham Phao Church, and a locally celebrated chap who makes \nbeautiful brass instruments.\n\nWith another 40 miles under your belt today, it’s back to Nam Dinh for a \nrest."},{"title":"Day 5: Cruising and kayaking","description":"There’s an exhilarating two-hour ride to start the day, cycling 25 miles \nfrom the hotel to Thai Binh before a bus takes you to idyllic Halong \nBay. Easily one of the most beautiful sights in south-east Asia, Halong Bay \nis a captivating place where 3000-odd limestone peaks rise directly from the \nemerald sea. You’ll cruise amongst this phenomenal karst scenery, stopping \nto swim and kayak, allowing you to explore places inaccessible by your cruise \nboat. You’ll sleep onboard overnight in twin-share cabins with en suite \nfacilities.\n\nPlease be aware that the boat trip on Halong Bay can be subject to short \nnotice change if certain adverse weather conditions develop during your trip."},{"title":"Day 6: Fly to Hue","description":"After returning to port, you’ll transfer to Noi Bai airport to board the \nshort flight to Hue. There’ll be time to refresh in the hotel before dinner \nat a local home where you’ll help prepare the evening meal and chat to your \nhost about Vietnamese life.\n\nAfterwards, you’ll head back to the centre of Hue to experience its \ncolourful nightlife."},{"title":"Day 7: Culture and cuisine","description":"Often considered the cultural and historical centre of Vietnam, there is \nplenty to see in Hue and a full day of activities lies ahead. You’ll take a \nmorning tour of the city and surrounding tombs, including a visit to the \nImperial City of Hue. Although much was lost in the French and American wars, \nthe city is undergoing restoration and reconstruction. It’s a fascinating \nplace to visit and admire the atmospheric emperor’s residence, temples and \npalaces.\n\nAfter, you’ll explore the Perfume River by boat, passing the renowned Thien \nMu Pagoda, an imposing Buddhist temple sitting on a hill.  Further on, set \namong beautiful riverside gardens, lies the Tomb of Tu Doc, an expansive and \nelaborate royal mausoleum.\n\nLunch is served at the Peaceful Bamboo Village, a centre that provides \nvocational training for young people with disabilities.  Later in the \nafternoon, you’ll take a cyclo around Hue for a street food experience. \nYou’ll sample an array of food including /Banh Beo, /water fern cakes/, Bun \nBo Hue/, a spicy broth and noodles,and salty coffee."},{"title":"Day 8: Cycle to sensational Hoi An","description":"The calories from yesterday’s food fest will serve you well today as you \nembark on a 52-mile ride. Leaving Hue, you’ll cycle uphill, conquering the \nOcean Cloud Pass, a stretch of highway that winds through the Truong Son \nmountain range with views across the Bay of Da Nang to the south. There will \nbe plenty of breaks along the way to enjoy the scenery before you reach the \natmospheric town of Hoi An with its lantern-lit streets, vibrant markets and \nartisan shops.\n\nAfter dinner, you’ll recover from the long cycle by sipping the best craft \nbeer in town at a local small brewery."},{"title":"Day 9: Villages and vegetables","description":"This morning there’s a guided walking tour of Hoi An to explore the \nhistorical sights of the Old Town. Alternatively, you can cycle to Cua Dai \nbeach for some downtime, or bike further afield to the Marble Mountains.\n\nIn the afternoon, you’ll cycle 15 miles to Tra Que Village, famed for its \navenues of herbs, so fragrant that you can smell them before you see them. \nYou’ll stop at a C/ao Lau/ noodle maker, a bean sprout grower’s home and \nthe local market. En route you should see water buffaloes and wonderful \nbirdlife. Later, you’ll visit a chef’s house where there’s a cooking \ndemonstration before having a go yourself, learning all about central \nVietnamese cuisine, this time."},{"title":"Day 10: Time to rest tired legs","description":"After breakfast, you’ll part with your faithful bike, ready to return home \n(and rest your weary legs!). "}]},{"name":"Tour 6 days Ho Chi Minh – MeKong – Phan Thiet","duration":6,"travelStyle":["Flexi","Group","Partially Guided","Holiday"],"oldPrice":0,"price":560,"summary":"6 days tour to Ho Chi Minh city to discover culture of the south Vietnam. Enjoy a leisurely exploration of the Mekong region. In additon, you will visit to Mui Ne where is famous for sandy beaches, beautiful coastline, white sandy dune and unique yellow sandy dune in Vietnam\n\n ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc960459054.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc960459054.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc96045905a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc96045905d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc960459060.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc960459063.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecc960459066.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199585_5ecca55b501be.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Mui Ne"],"timeline":[{"title":"Ho Chi Minh City arrive (no meal)","description":"Welcome to Vietnam!\nAt your arrival, you are warmly welcomed and transfered privately to the hotel in Ho Chi Minh.\nOvernight in Sai Gon\n\n "},{"title":"Ho Chi Minh City And Cu Chi Tunels (B,L)","description":"This day, you will join a group tour to visit Ho Chi Minh City and Cu Chi Tunels.\nYour activities of the day will be:\nCome back to Sai Gon and overnight in Sai Gon."},{"title":"Mekong Delta To My Tho – Ben Tre (B,L)","description":"Join group tour to visit Mekong Delta.\nCome back and overnight in Ho Chi Minh"},{"title":"Ho Chi Minh – Mui Ne (B)","description":"In the morning, our guide and car will pick you up at your hotel and drive to visit the Mui Ne.\nFree your time on the beach. Overnight at hotel in Mui Ne"},{"title":"Mui Ne (B)","description":"Option 1: Breakfast at the hotel. You have a free day today to enjoy the white sand beaches or explore the surrounding or enjoying local food of Mui Ne beach. \n\nOption 2: Join tour Mui Ne Sand dune (Extra Fee: 100$)\nAround 05:00: our tour guide will meet you at your hotel and start your trip to enjoy the fabulous sunrise on Mui Ne sand dune. You will be fulfilled by the impressive white sand dunes and it is something different which you definitely can’t see everywhere else. Bordering to the sand dunes, you will find a serene lake filled with lotus blossoms.\nBreakfast at a local café.\nVisit the Fairy stream, one of the most beautiful places of Mui Ne, which is a small stream that runs through a forest of bamboo and dunes close to the village. Stop by Mui Ne fishing village, a small town providing much of Vietnam’s supply of seafood being shipped out daily.\nComeback hotel and free time for relaxing on the beach.\nOvernight at hotel in Mui Ne"},{"title":"Mui Ne – Ho Chi Minh (B)","description":"Have breakfast. Free relax in Mui Ne, return to Ho Chi Minh\nThen Transfer to the airport for your return flight home."}]},{"name":"8 days 7 night Ha Noi – Sapa (by bus) – Ninh Binh","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1150,"summary":"Take an amazing opportunity to discover the most famous splendid spots in North Vietnam Tour as the thousand-year Hanoi capital, pure nature in Ninh Binh, enthralling Sapa. This 8-day tour from Hanoi blends the outstanding values of people as well as the nature with its majestic scenery mixed with human values created by the ethnic minorities.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab3a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196906_5e749245eab44.jpg"],"destinations":["Hanoi","Sapa","Ninh Binh"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately by the comfortable car to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city. \n"},{"title":"Ha Noi Sights – Sapa (B,L)","description":"After a truly scrumptious breakfast, join tour Bicycle Tours Hanoi Countryside half day. This tour includes cycling 30 km on flat roads\n8:00 am your tour guide pick up you then transfer to our Bicycle store to choose suitable Bikes. Choose a bike that makes you feel comfortable and hear a safety briefing. Exploring: \nAfter that we visit a fruit garden and cycle back to Hanoi for lunch at local restaurant where you can try traditonal food. Enjoy an Egg Coffee in the old quarter before getting a transfer back to hotel.\n15:00 Bus will come to pick you up and transfer to Sapa town\n21:00 Arrival Sapa town, check in hotel and overnight in Sapa\n"},{"title":"Sapa – Laochai – Tavan – Giang Ta Chai (Muong Hoa Valley) – (B/L)","description":"Join day tour\nHave breakfast. Depart from Sapa town by car to:\nIn the afternoon the car will pick you up for the return journey to Sa Pa\nReturn and overnight in the hotel in Sapa \n"},{"title":"Suoi Ho - Ma Tra (B)","description":"Join Half day tour.\nAfter breakfast and visiting:\n-\tTrekking to Suoi Ho village to see tea plantations and cardamom gardens. \n-\tVisit the hospitable villages of the Black Hmong minority people in Ma Tra, a very small village hiding away from the civilisation. You can walk through rice paddy filds and spectacular scenery. During the day you will also be able to visit a local school. \nThen Transport you back to Sa Pa for tranfer to Ha Noi by bus\n21:00 Arrival Ha Noi, checkin hotel and overnight in Ha Noi\n"},{"title":"Ha Noi Free (B)","description":"Have breakfast, free walking and explore to arround Ha Noi city\nOvernight in Ha Noi\n"},{"title":"Hanoi – Tam Coc – Local Family - Cycling - Thung Nham Bird (B,L)","description":"Afer breakfast, Tour guide and bus pick up from your hotel departure to Ninh Binh. Join group tour Ninh Binh 2 days 1 night. \n-\tArrive Tam Coc start your first visit on a sampan boat rowed by a local for about 1.5 hours.  Known as “Halong Bay on land”, the boat trip is a nice journey along the river with the peaceful scenery of limestone mountains, rice paddy if traveling during harvest season.\n-\tEnjoy a delicious lunch with Vietnamese cuisine.\n-\tVisit a local family in Tam Coc. They are a traditional Vietnamese family with three generations living together. Here you will get the chance to see the house architecture and their daily life and their handicraft job of making traditional embroidery. \n-\tThen you will take a bike and start riding to explore the rice fields and limestone mountains with a unique route.\n-\tGet on a small sampan to visit Thung Nham bird reserve, discover the most features of this area with more than 50.000 birds of 40 species flying to inhabit every day.Then cycling back to the host family for free time relax with afternoon tea break.\nEnjoy your dinner served with Vietnamese, then stay overnight at the bungalow or the hotel in Ninh Binh\n"},{"title":"Mua Cave - Hoa Lu Ancient Capital – Hanoi (B, L)","description":"Have breakfast then take a bike to Mua Cave, Mua Cave one of the most alluring places to get the panorama view in Ninh Binh, Hiking up to the peak of Ngoa Long Mountain to take your amazing views of the Tam Coc, Ninh Binh area.\nBack to the bungalow or hotel for check out and enjoy a lunch with Vietnamese cuisine. After lunch will free time relaxing.\n15:00 - 15:30 Departure to Hoa Lu, the ancient capital of Vietnam in the 10th century, visit the temple of King Dinh. Under the introduction of our local guide, you will get to know more about the Vietnamese history.\nReturn Ha Noi and overnight in Ha Noi city\n"},{"title":"Ha Noi - depart (B)","description":"Have breakfast. Free relax and explore Ha Noi.\nThen Transfer to the airport for your return flight home\n"}]},{"name":"Tour to Hanoi plus 1 Night on Serenity Cruises 5*","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"Free Round Trip Transfer Hanoi - Halong and Airport\nSerenity is Luxury Brand New Cruise\nMost Unique Creative itinerary in Halong Bay\nCruise through Halong Bay and Lan Ha Bay\nKayaking, Biking, Snorkeling, Cooking Class ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55325.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55325.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e537921d2bde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e5532c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e5532e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e5532f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55332.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55334.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161722_5e53785e55337.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Serenity Cruises Halong Bay","description":"8.30- 9.00 am: Pick-up time\nFor those who book our transfer service, you will be picked up at your hotels in Hanoi Old Quarter. Instead of spending 4 hours following the traditional route to Halong city, we travel through the newly opened express way Halong - Hai Phong and shortly arrive at Tuan Chau Wharf in only 2,5 hours.\n11.30: Arrive in Tuan Chau Wharf\nFrom here, you will transfer to SERENITY CRUISE\n12.00: Relax on SERENITY CRUISES\nWarmly welcome to SERENITY CRUISE!\nEnjoy the welcome drink while listening to our cruise manager briefly delivers safety introduction. After that you will check in your cabin\n12.45: Enjoy International buffet lunch\nFantastic buffet lunch is served. In the meantime, the cruise will get you far away from the frequented areas of Halong bay and head to the magnificent scenery in Lan Ha Bay – a hidden charm who has lived in the quiet shadows of its famous twin Halong Bay for a long time. The ship cruised past Finger Islet, Frog Islet and hundreds of uniquely shaped limestone pinnacles.\n15.00: Explore Lan Ha - Ha Long bay, hit the water on kayak and go swimming\nSERENITY CRUISE reaches Dau Be Island, one of the most beautiful islands located in the South East of Ha Long bay. It is time to discover Halong bay on your own with your travel buddies – sharing kayak. Go explore the beauty of nature in hidden lagoon with lots of stalactites hanging down from the cave ceiling. This activity might depend on the tide level of the bay. In case the tide level is too high or too low, we will do kayaking in Dark Cave, Bright Cave area. There is a stop for those who wish to swim and go snorkeling in the lush green water.\n16.30: Cook like local, eat like local\nBack to SERENITY CRUISES after outdoor activities, it’s time to relax with a cocktail. Special deal “Happy Hour” is available from 16.30 – 18.30. You can also join a traditional cooking class presented by our crew onboard.\nBefore dinner, our experienced captain will choose the most tranquil area to anchor for overnight.\n19.00: Taste the life with Deluxe Dinner Set Menu\nEnjoy dinner infused with all energy of our experienced chefs. After the incredible dinner, the rest of the evening is free time for SERENITY CRUISES’ guests to relax on sundeck with a drink, enjoy spa treatment, watch a movie in the restaurant, etc…"},{"title":"Day 3: Serenity Cruises - Hanoi","description":"6.30: Do Taichi on sundeck\nWake up in tranquility and start your second day on SERENITY CRUISES with TAICHI on sundeck. Afterwards, light breakfast is served.\n7.45: Visit Viet Hai village\nOur crew will take you to Viet Hai village, located in the central valley of Cat Ba National Park. Spending around 30 minutes for biking along, you will feel the peaceful atmosphere, charming scenery of a traditional village in the coastal North of Vietnam.\n9:15: Return to SERENITY CRUISES\nYou may simply relax on the cruise then spend few minutes to settle your bill and check out from 9.15-10.00 am\n10:00: Enjoy delightful brunch\nLight brunch will be served while SERENITY Cruise slowly navigates back to the harbour.\n11.15: Disembark SERENITY CRUISES\n12.00-12.15: “Goodbye Lan Ha - Ha Long bay”\nReturn at Tuan Chau Wharf and get ready for driving back to Hanoi (available for booking in advanced)\n15.00: Arrive back Hanoi Old Quarter, end of unforgettable trip"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"8 days 7 night Ha Noi – Sapa (by train) – Ninh Binh","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1100,"summary":"We will take you the most beautiful and untouched area of the north of Vietnam with a 8 days tour from Hanoi to Sapa and Ninh Binh, and We give you chance to capture breathtaking scenery, stay with lovely local ethnic people and experience their life style.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b859.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b859.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b860.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b863.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b865.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196842_5e7349ba1b868.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Ninh Binh"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately by the comfortable car to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city. \n"},{"title":"Ha Noi Sights – Lao Cai (B,L)","description":"After a truly scrumptious breakfast join day tour Bicycle Tours Hanoi Countryside. This tour includes cycling 45 km on flat roads.\n8:00 am your tour guide pick up you then transfer to our Bicycle store to choose suitable Bikes. Choose a bike that makes you feel comfortable and hear a safety briefing. Exploring: \nAfter that we visit a fruit garden and have lunch at local family where you can try traditional food.\nIn the afternoon we ride more around the villages, fields and along the river bank to enjoy the cool breeze of the Red river. Passing through beautiful village of Northern Vietnam Countryside we will reach a local boat station, take a cruise on the red river to go back to Hanoi. Our trip finishes at about 4:00-4:30pm \nRelax in hotel until 20h30. Then our tour guide will come to pick you up and transfer to Ha Noi Railway station to catch the night train to Lao Cai (overnight on train, 4 berths sharing cabin, soft sleeper and air-conditioning)\n"},{"title":"Lao Cai – Sapa – Laochai-Tavan – Giang Ta Chai (Muong Hoa Valley) – (B/L)","description":"Join Group Tour 2 Nights in Sapa\nArrival Lao Cai, Shuttle bus will transfer you go up hill to Sapa, for breakfast. Depart from Sapa town by car to:\nIn the afternoon the car will pick you up for the return journey to Sa Pa\nReturn and overnight in the hotel in Sapa \n"},{"title":"Sa Pa – Suoi Ho – Ma Tra – Ta Phin – Lao Cai – Ha Noi (B/L):","description":"After breakfast then we leave Sa Pa town and visiting:\nEnjoy a picnic lunch after seeing the scenic views enroute. \nAfter lunch we continue our trek to Ta Phin village to visit Red Dao people and handicraft shops. Then back to Sapa for shuttle bus transfer you back to Lao Cai train, catch the train back to Hanoi. \nOvernight on train\n"},{"title":"Ha Noi: Free (B)","description":"Have breakfast, free walking and explore to arround Ha Noi city\nOvernight in Ha Noi\n"},{"title":"Hanoi – Tam Coc – Local Family - Cycling - Thung Nham Bird (B,L)","description":"Afer breakfast, Tour guide and bus pick up from your hotel departure to Ninh Binh. Join group tour Ninh Binh 2 days 1 night. \nEnjoy your dinner served with Vietnamese, then stay overnight at the bungalow or the hotel in Ninh Binh\n"},{"title":"Mua Cave - Hoa Lu Ancient Capital – Hanoi (B, L)","description":"Have breakfast then take a bike to Mua Cave, Mua Cave one of the most alluring places to get the panorama view in Ninh Binh, Hiking up to the peak of Ngoa Long Mountain to take your amazing views of the Tam Coc, Ninh Binh area.\nBack to the bungalow or hotel for check out and enjoy a lunch with Vietnamese cuisine. After lunch will free time relaxing.\n15:00 - 15:30 Departure to Hoa Lu, the ancient capital of Vietnam in the 10th century, visit the temple of King Dinh. Under the introduction of our local guide, you will get to know more about the Vietnamese history.\nReturn Ha Noi and overnight in Ha Noi city\n"},{"title":"Ha Noi - depart (B)","description":"Have breakfast. Free relax and explore Ha Noi.\nThen Transfer to the airport for your return flight home.\n"}]},{"name":"6 Days Explore Mekong Delta & Phu Quoc Island","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":899,"summary":"Joining this 6-day tour, you will see the vast Mekong Delta, which is formed by the alluvia of the mighty Mekong River and the beautiful island of Phu Quoc. It is a great getaway opportunity for you to explore the beautiful nature, unique culture and tradition of friendly Southern people that will leave you endless interesting experiences and memories.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d90001.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d90001.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d8fff5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d8fffc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d8ffff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196732_5e708c9d90004.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang","Phu Quoc Island"],"timeline":[{"title":"Ho Chi Minh City arrive - Sai Gon Night Life On Vintage Vespa (D)","description":"Welcome to Vietnam! \nAt your arrival, you are warmly welcomed by our driver and transfer privately by the comfortable car to the hotel in Ho Chi Minh. \n17:30 Join tour Sai Gon Night life on Vintage Vespa. It’s a chance to see many interesting landmarks in Saigon where most tourists do not know of.  \nOvernight in Sai Gon \n"},{"title":"Ho Chi Minh City - My Tho - Ben Tre - Can Tho (B,L)","description":"This day, you join a group tour for 2 day tour of Mekong Delta with Floating Market\n\nStart from Ho Chi Minh City to depart for My Tho. \nOvernight at your proposed hotel in Can Tho.\n"},{"title":"Explore Cai Rang Floating Market – Phu Quoc (B,L)","description":"Your activities of the day will be:\nArriving at Duong Dong airport in Phu Quoc, you are picked up from airport and transferred to the hotel. Overnight in Phu Quoc.\n"},{"title":"Discover The North - Kayaking & Rach Vem Beach Village (B,L)","description":"You join a group tour to explore Phu Quoc today.\nWe pick you up from your hotel to start the tour:\nAt 15:30, you are to return to your hotel. Overnight in Phu Quoc\n"},{"title":"Phu Quoc Free (B)","description":"Breakfast at the hotel. You have a free day today to enjoy the white sand beaches or explore the surrounding or enjoying local food of Phu Quoc.\nOvernight in Phu Quoc\n"},{"title":"Phu Quoc – Depart (B)","description":"Breakfast at hotel. Free until transfer to Phu Quoc airport. End of services in Phu Quoc. "}]}]