[{"name":"Wonders of Vietnam tour 15 Days","duration":15,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1439,"summary":"Vietnam is not only known to be a brave and strong but also to be a beautiful country with many tourism attractions. Historical attractions and outstanding natural beauty are featured on this 15 day tour of Vietnam’s World Heritage sites, spectacular beaches: Ho Chi Minh City, Mekong delta, Nha Trang, Hanoi and the Halong Bay","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147154_8ac7002a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147154_8ac7002a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147154_e6b46b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147154_6452cfc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147154_b6d60e1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147154_862e3f06.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Dalat","Hoi An","Hue","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Ho Chi Minh Arrival","description":"On arrival at Tan San Nhat Airport, you will be met by our representative and transferred to your hotel to check in. Ho Chi Minh City, formerly known as Saigon, is the center of commerce, finance, culture and tourism in Vietnam. This bustling metropolis, in contrast with its northern counterpart, Hanoi, has a more cosmopolitan atmosphere with numerous modern shopping areas and popular sidewalk cafés, in addition to its cultural and historical attractions.\nOvernight in Ho Chi Minh City."},{"title":"Ho Chi Minh City and Cu Chi Tunnels","description":"Begin your half day tour of the city’s major sights in the morning after breakfast at your hotel.\nPass the now demolished wartime American embassy on the way to the Reunification Palace which was the residence of the President of South Vietnam until April 1975. Near the palace are some striking examples of French colonial architecture including Notre Dame Cathedral and the old Sai Gon Post Office. Visit the Jade Emperor Pagoda and the War Remnants Museum before finishing the tour at the central Ben Thanh Market where anything and everything is for sale.\nAfter lunch, drive to the famous Cu Chi Tunnels, an amazing underground network constructed by Vietnamese fighters in the long struggle for national independence. The tunnels included hospitals, schools and living quarters, and were used as a military base for the Viet Cong during the American war. Return to Ho Chi Minh City to enjoy a free evening to explore the city further and dine in one of its many fine restaurants. Overnight in Ho Chi Minh City"},{"title":"Mekong Cycling and cooking with Overnight in Mekong Lodge (Lunhc, Dinner)","description":"After breakfast at your hotel, you will be picked up and transferred to Cai Be where you will board the Mekong boat around noon and enjoy a complimentary drink on the way to Cai Be.\nTake a local boat through the maze of small waterways to the famous floating market and see local people making pop-rice and sweets along the way. Visit beautiful colonial buildings, old houses, and delightful flower gardens, sample local coconut candy and see how edible rice paper is made. Return to the boat and continue to Cochien.\nLunch served at local restaurant\nWalk or cycle along the country footpaths to discover tropical fruit orchards and observe the local lifestyle. Visit a cottage industry, a local farm, and sample seasonal fruits. Continue your leisurely cruise on the Mekong while taking in the beautiful scenery and enjoying a sunset aperitif before having dinner. Overnight in Cai Be Mekong Lodge Resort"},{"title":"Can Tho Floating Market (Lunch)","description":"Have breakfast and watch the bobbing commotion of Mekong River life waking up for another beautiful day as you cruise to Can Tho through the tributaries and canals. Transfer to Cai Rang to visit one of the busiest floating markets on the Mekong then walk along the canals and palm-shaded creeks to see the local houses and lush, green orchards, observing the boat building yards, rural life and water activities in full swing. Return to the boat at noon and enjoy a welcome back drink.\n11h00 Leave Can Tho where you will be met and driven to your hotel in Ho Chi Minh City to have dinner and spend the evening as you please. Overnight at hotel in Ho Chi Minh City."},{"title":"Ho Chi Minh - Dalat","description":"After breakfast you will be taken to the airport for the flight to Da Lat.\nUpon your arrival head to the countryside, continue to cross Ta Nung pass, enjoy the whole view of Nam Ban town and the mighty sight of huge jungle. Let's stop to enjoy the countryside scenery. Next stop, we will stop at the Coffee farm to learn about the coffee-making process: Dalat is known for producing some of the best coffee beans in the world. So, after a quick history lesson, we'll make sure you'll get to drink some morning coffee as well. You also have the chance to buy the local original coffee for a gift or enjoy at home\nWe hit the road again and make our way towards the: Elephant Waterfall - where you will enjoy exploring the area and getting sprayed by the cool, freshwater. Have lunch then go to Linh An pagoda with a giant statue of Happy Buddha can bring you happiness and luck basing on the belief of local people and the highest giant Ladies Buddha statue in Vietnam\nOvernight in Dalat"},{"title":"Dalat - Nha Trang","description":"Today you will drive through the undulating terrain to the coastal town of Nha Trang by bus, known for some of the world’s most beautiful beaches. Check in to your hotel in Nha Trang and enjoy a free evening to relax and perhaps enjoy a dinner of luscious local seafood. Overnight in Nha Trang."},{"title":"Nha Trang City","description":"The year round sunny weather, the tropical climate, excellent seafood, the turquoise blue water and the stunning white sandy beach along the entire length of the city are all features of Nha Trang, one of the premier beach resorts in Vietnam.\nAfter breakfast at your hotel, embark on a day-long boat trip around the coastal islands, visiting a local fishing village and observing island life along the way. You will have lots of time for swimming and snorkeling in the clear blue water or just lazing on the one of the world’s most beautiful beaches. \nOvernight in Nha Trang."},{"title":"Nha Trang - Danang - Hoi An","description":"You will be transferred early in the morning to the airport for a short flight to Da Nang where our driver will meet you and take you the short distance to the UNESCO World Heritage ancient town of Hoi An.\nOriginally a Cham seaport, this quaint town has been influenced down the centuries by traders from various cultures. There is plenty to see on a walking tour, including the famous Japanese Covered Bridge, the Pottery Museum, and the 200 year old Tamky House, as well as the Chua Ong Pagoda and the bustling, vibrant market. Enjoy the sights of the traditional low tiled-roof houses lining the small streets as well as the assembly halls that reflect the town’s long, multi-cultural past.\nHave the evening free to explore Hoi An further and dine on the well-known local cuisine. Overnight in Hoi An."},{"title":"Hoi An - Hue","description":"After breakfast at the hotel, you will drive to historic Hue, the last imperial capital of Vietnam in the 19th and early 20th centuries.\nDrive north to Danang to visit the Cham Museum in Danang, home of the largest collection of Cham sculptures in Vietnam, then continue on to Hue stopping at sensational Marble Mountain and Non Nuoc Beach en route. The road begins to wind as you make your way up the spectacular Hai Van Pass, pausing at the top to admire the stunning view of Lang Co to the north and and Danang to the south.\nVisit the Imperial Citadel and the Purple Forbidden City when you arrive in Hue. This royal residence was badly damaged during the 1968 Tet Offensive but it was granted UNESCO World Heritage status and has been undergoing extensive renovations in recent years. Wander through the many residences and other buildings within the fascinating Citadel, once only accessible to the royal family and officials.\nHave a free evening to enjoy dinner and perhaps take a stroll along the beautiful Perfume River.\nOvernight in Hue."},{"title":"Hue City Tour (Lunch) - Flight to Hanoi","description":"Take a cruise down the Perfume River in the morning to visit the beautiful Thien Mu pagoda, which now become the symbol of Hue. Enjoy the scenic countryside along the river and stop to explore the elaborate tomb of Emperor Tu Duc and the European inspired landscaping of Emperor Minh Mang’s mausoleum in its tranquil setting of gardens and ponds. After the boat trip take a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. There are numerous eating places along the way where you can sample some of the famous local delicacies.\nTransfer to Airport for flight to Hanoi. Overnight in Hanoi"},{"title":"Hanoi Sightseing with cyclo and puppet show (Lunch)","description":"After breakfast you will have time to explore Vietnam caplital, Hanoi is Vietnam’s historic 1000 year old capital, boasting one of the most beautiful city centers in the world with romantic Hoan Kiem Lake, scenic Ngoc Son temple and the Turtle Tower. Take a tour of the city to see some of Asia’s most striking French colonial architecture and the many lakes and parks that are beloved by locals and visitors alike. Visit the vibrant Dong Xuan Market, the oldest and largest in Hanoi, and end the tour with a traditional cyclo ride through the intriguing 36 trade guild streets of the ancient Old Quarter for a taste of the real Vietnam.\nEnjoy a free evening to watch a water puppet show, dine in one of the city’s many restaurants and perhaps stroll around the lake with the locals.\nOvernight in Hanoi."},{"title":"Hanoi - Halong","description":"Our driver will pick you up at your hotel at 8:00 and drive you through the countryside to arrive in Ha Long around noon.\nOur crew will welcome you on board a traditional junk to check into your cabin and enjoy a complimentary drink before a lunch featuring local seafood. Your 3.5 hour cruise into beautiful Ha Long Bay, one of the New Seven Natural Wonders of the World, begins at 13:00 and takes you past amazing limestone karst formations including Mat Qui (the Monster’s face), But Moc, and Cap De islets, and Trong (Drum) and Trinh Nu caves. Stop by a floating fishing village to see this unique way of life, then explore Luon cave from 16:40 to 17:30 where there will be plenty of time for swimming and sun bathing.\nEnjoy a sunset dinner on board the boat and relax under the starlit sky before retiring to the comfort of your cabin. Overnight on junk.\n\n"},{"title":"Halong - Hanoi","description":"Early risers will enjoy the morning view of the Bay’s landscapes while sipping with a cup of tea or coffee and snacking on fresh fruit. From the upper deck you will experience the stillness, fresh air and gentle breezes as you view the breathtaking beauty of the rocky Islands rising from the crystal-clear waters, accompanied by the tranquil sounds of birds singing and cicadas chirping ashore and the gentle lapping of the waves against the boat. Explore Sung Sot (Amazing) cave and swim and relax at Titop beach before starting to cruise back to the harbor.\nA brunch buffet will served from 10:30 to 11:30 and you will arrive back in Hanoi. Overnight in Hanoi"},{"title":"Hoa Lu - Tam Coc - Hanoi","description":"After breakfast at the hotel, take a trip to Hoa Lu, the capital of Vietnam before Thang Long-Hanoi from 968 to 1010 AD in the Dinh and early Le dynasties. Visit the two ancient temples, each nearly a thousand years old, dedicated to the Dinh and Le rulers, then climb 200 steps up to the top of Mount Ma Yen for a fantastic view over the surrounding landscape. Travel on to Tam Coc (Three Caves), known as the “inland Halong Bay” and take a relaxing boat trip on the Ngo River through the quiet, tranquil countryside with lush rice fields surrounded by stunning limestone formations to see the fascinating grottoes of Tam Coc.\nDrive back to Hanoi and have the evening to spend at your leisure. Overnight in Ha Noi."},{"title":"Hanoi Departure","description":"You will have free time to relax or further explore Ha Noi after breakfast before our driver takes you to Noi Bai International Airport for your departure flight."}]},{"name":"Hanoi Hilton Opera - Paradise Luxury Cruises 5 Days/4 Nights","duration":5,"travelStyle":["Sailing","Motor boat","Group","Partially Guided","Easy","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":652,"summary":"Free round trip transfer pick up from airport03 nights at 5* Hilton Opera Hotel Hanoi01 night on TOP Paradise Luxury CruisesCooking & Tai Chi demonstration includedWater Puppet Show & Rickshaw ride","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100141_1a125227.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100141_1a125227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_f629226f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_80c9cd13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_53123bb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_92f9a7a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_934fa89c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_90ac9c22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_ace90dec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_9ec6427d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100141_a509e5fc.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. "},{"title":"Day 2: Hanoi - Paradise Luxury Cruises (B, L, D)","description":"7:30 am to 8:30 am: Pick up at Hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00: Arrive in Tuan Chau Island\n12:15: Transfer to Paradise Peak\n12:30: Welcome drink, cruise information and check-in\n13:00 - 14:30: Lunch at the restaurant\n14:30 - 16:30: Cruise and sightseeing along Halong Bay\nEnjoy an afternoon spa treatment at Paradise Spa*\n16:00: Visit Sung Sot Cave (1 hour) or kayak near Luon Cave area (1 hour)\n17:00 - 18:30: Happy Hour* on the sundeck\nAnchor at Coconut Tree Island for overnight stay\n18:00 - 19:00: Cooking demonstration on the sundeck\n19:30 - 22:00: Bao Dai Dinner at the restaurant\n21:00: select from: Squid fishing or In-cabin movies"},{"title":"Day 3: Paradise Luxury - Hanoi (B, L)","description":"07:00: Tai Chi on the sundeck\n07:00 - 08:00: Light breakfast, coffee & pastries\n08:00: Visit Ti Top Island (1 hour)\nStay on board and just relax or enjoy a spa treatment at Paradise Spa*\n09:00: A la carte breakfast at the restaurant\n09:30: Bill settlement and check out\n10:30: Return to Tuan Chau Marina\n10:45 - 12:00: Light snacks at Paradise Suites Hotel\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: Arrive Hanoi! Check in  Hotel. Overnight in Hanoi. \n* payable"},{"title":"Day 4: Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). \nStay overnight at the hotel in Hanoi."},{"title":"Day 5: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Orchid Cruises Halong Bay plus Bakhan Village Resort 6 Days Trip","duration":6,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":689,"summary":"The best quality and unbeaten price for 6 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Orchid Cruises 5* Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort 4* - the best brand new Mountain resort in the ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100256_bbce1550.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100256_bbce1550.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_a67973b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_c26a5501.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_7b322f6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_8a1c502b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_ab2db735.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_2a7517e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_3d80738b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_7772abff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_948e0fe5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_a35c0a6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_87fade25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_f8dae8d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_d14d0aaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_d70a9535.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_5b9d5b78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_a0b61d41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_242819ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_00a5f951.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_8e55ece6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100256_fcb8f212.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Check in hotel and stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Orchid Cruises Halong Bay (B, L, D)","description":"\n10:00 am: You will be collected from Hanoi Old Quarter to take the highway to Dinh Vu Port, Hai Phong City where we arrive at around 11h30. A special tea and warm welcome awaits you at Orchid Cruise’s.\n12:00 pm: Transfer by tender to the Orchid Cruise. On the way to the main boat, you will have a chance to see Cai Trap canal.\n12: 15 pm: We welcome our guests onboard the Orchid Cruise and then take time to enjoy your welcome drink, receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature.\n12: 40 pm: Orchid Cruise boat proceeds to Da Chong islet, where you can see a lighthouse built by the French over 100 years ago. We have lunch before continuing our journey via the islets of Con Vit and Gia Luan. These amazing limestone formations rise up out of the sea in an impressive manner. This area is untouched, as not many cruise ships use this route.\n3:00 pm: We progress to Ba Trai Dao beach area of Lan Ha Bay- a separate part of Halong Bay. This is a quiet paradise in Vietnam. The region is known for its pristine beaches and spectacular beauty, having about 400 fascinating islands. Unlike the main, Ha Long Bay, the islands of Lan Ha Bay are forested, and most are small in stature.\nYou may prefer to try your hand at kayaking or simply just enjoy a swim.\nReturning to Orchid Cruise you can watch the magnificent sunset over the Gulf of Tonkin. Onboard you may join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. In the early evening the boat has its Happy Hour deal.\n5:30 pm: Option: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n7:30 pm: Deluxe dinner is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting\n9:30 pm: Enjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)"},{"title":"Day 3: Orchid Cruises - Hanoi (B, L)","description":"6:00 am: Why not rise early to witness the bay at its very best whilst enjoying a Tai Chi session on the sundeck; after which we serve light breakfast. After breakfast we shall continue our journey and head out in canoes to explore the bay in the area where the Sang Toi cave is situated.\n9:30 am: Return to Orchid Cruise for check-out\n10:00 am: Whilst cruising back you can enjoy a delightful brunch\n11:35 am: We return to the quay side in the south of the bay, where our visitors disembark\n12:10 pm: We bid farewell at Dinh Vu port, this is the end of the program.\n4:00 pm: Arrive Hanoi. Check in Hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi - Halong Bay & Bakhan Village Resort Trip. Good bye & see you again!"}]},{"name":"Halong Paradise Luxury Cruises 2 Nights plus 1 Night in Bakhan Village Resort","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":499,"summary":"Halong Bay: Paradise Luxury I, II, III & IV were built according to the traditional Vietnamese junk design and present a lavish outfit blending in subtle harmony with the natural environment of Halong Bay – Vietnam. The 04 Paradise Luxury cruises offer 68 luxurious cabins and suites as well as an exciting array of activities to be enjoyed while experiencing the spectacular scenery of the “Bay of Descending Dragons”.\nMai Chau: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":["Explore Dark & Bright Cave","Enjoy an elegant paradise dinner in Traditional Bao Dai dress","Kayak, swim and explore Thien Canh Son Beach","Hike up to the limestone formations in the biggest and most beautiful cave in Ha Long Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/96194_916f40ba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/96194_916f40ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_cbf33f20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_b32fb6e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_ccbd1cf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_9c531006.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_dcf854e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_011a233d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_d6bad069.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_a90447f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_434693c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_47d85f6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_1ac1d91e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_f40544fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_f501f17f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_3896198e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_b9616555.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_4e516e32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_699a3154.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_8df119ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_2724ab6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_9e8bbe7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/96194_c04afc90.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi - Halong Bay cruise on Junk Boat (L, D))","description":"8.00: Leave Hanoi - Transfer to Halong Bay by shuttle bus pick up from Hotel pick up from Hotel.\n12:00 Arrive at Tuan Chau Island.\n12.15 Transfer to cruise ship.\n12.30 Welcome Drink - cruise briefing, safety instructions, check-in cabins. Cruise and program commence.\n13:00 - 14.30 Serve Special Paradise Lunch on board while cruising passing by islets, Hoa Cuong fishing village. After lunch continues exploration of Halong Bay passing by Soi Sim Beach, Coconut Three Island. Anchoring the vessels at Dark and Bright Cave area.\n14.45 - 15.45 Exploring Dark and Bright Cave by rowing bamboo boats with local people or kayaking by yourself.\n15.45 - 17.00 The Vessels will continuous cruising in Lan Ha Bay and Halong bay passing by Cua Van floating Village, Tien Ong Cave, Trong Cave, Ho dong Tien, Luon cave, Ti Top Island and Coconut Three Island for overnight stay. Enjoy spa at your leisure on-board.\n17:00 - 19:00 Enjoying “Happy Hour” Buy one take one on selected beverages, while the vessels is cruising in Halong Bay. Docking at Coconut Three Island for overnight stay. Enjoy spa at your leisure on board\n18:00 - 18.30 Enjoy cooking demonstration with Chef to discover the Vietnamese cuisine of traditional spring rolls. Learn how to toast Vietnamese way through the evening’s toast of the local rice wine.\n18.30 - 19:00 Pre-dinner cocktail on sundeck serving assorted nuts and canapé.\n19.30 - 22:00 Serve elegant Paradise dinner. Start dinner in Traditional Bao Dai dress and photo shoot with captain and manager on board.\n21:00 - 23:00 Evening Activities - relax at leisure; enjoy Movie Night and squid Fishing or Beauty Spa services."},{"title":"Day 2: Halong Bay Cruise full day with Kayaking (B, L, D)","description":"6.30 Tai Chi session on Sundeck.\n7:00 - 7.30 Coffee & tea with assorted homemade pastries.\n7.45 - 8.30 International Breakfast buffet served on board.\n8.30 - 8.40 Transfer to Day boat – Paradise Explorer\n10.30 Kayaking, swimming and exploring the cave in Thien Canh Son Beach.\n12.30 Return to Paradise Explorer and Continue cruising to the Vung Vieng Floating Village. Vietnamese lunch served on-board.\n14:00 Arrive at Vung Vieng Fishing Village, enjoy time around the village with traditional bamboo boat rowed by the local people.\n15.30 - 16:00 Return to Paradise Explorer heading back to Main boat. Relax and Enjoy Spa services on board while cruising or sightseeing.\n17:00 - 19:00 Enjoy “Happy Hour” Buy 1 take 1 on selected beverages. Enjoy spa at your leisure on board.\n18:00 - 18.30 Enjoy cooking demonstration with Chef to discover another Vietnamese cuisine.\n18.30 - 19:00 Pre-dinner cocktail on sundeck.\n19.30 - 21.30 Serve elegant Paradise dinner.\n21:00 - 23:00 Evening Activities – relax at leisure; enjoy Movie Night, Board Games, and Fishing or Beauty Spa services."},{"title":"Day 3: Halong Bay return Hanoi (B, L))","description":"6.30 Tai Chi session on Sundeck.\n7:00 - 7.30 Coffee & tea with assorted homemade pastries.\n7.30 - 8.30 Relax or Visit Sung Sot Cave – Hiking up and down 600 steps to the magnificent limestone formations of the most beautiful and biggest cave in Halong bay.\n8.30 International Breakfast Menu.\n9.30 Check-out cabins and settle bills.\n10.30 Arrive at Tuan Chau Island.\n10.30 - 12:00 Set lunch served at Paradise Suites Hotel (Applied ONLY for guests booked shuttle bus of Paradise Cruises)\n12.15 - 12.30 Shuttle bus pick up guests at Paradise Suites Hotel\n16:30 arrive Hanoi. Check in your hotel and stay overnight in Hanoi.\nHotel accommodation arranged by your own."},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Trip ends at your hotel in Hanoi. Good bye and see you again!"}]},{"name":"Hanoi To Hoi An Ancient Town 7 Days","duration":7,"travelStyle":["Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":530,"summary":"Starting in Hanoi with some times to visit the Old Quarter on the first day in Hanoi, you will check in one of 7 wonders in the world the next day :  Ha Long Bay. Then we will take you to central of Vietnam with another ancient city Hoi An and visit famous bridge in Ba Na Hills. Spend 1 day to relax at peaceful Island and go shopping. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159181_0a81aa68.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159181_0a81aa68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159181_1d785aae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159181_cc75e9c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159181_b7acd4fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159181_c67c1943.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159181_e06b7a9f.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An"],"timeline":[{"title":"Hanoi Arrival Day","description":"GOOD MORNING VIETNAM.  Your trip begins with arrival in Hanoi. Your private driver will meet and greet you on the airport.  You will be escorted to the hotel by the private transportation.\nOvernight in Hanoi."},{"title":"Hanoi - Ha Long: Paradise on Earth (B/L/D)","description":"- 7:45 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. \n  - 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise. Meet the captain, crew and join us for welcome drink as we tell you about life onboard.\n  - Check into your cabin. Time to refresh and unwind.\n  - Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n -  Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n - Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n - Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n -  Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n  - After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\n  Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom\nMeals: Breakfast, Lunch, Dinner"},{"title":"Ha Long - Hanoi - Fly to Da Nang - Flight included (B/L)","description":"Morning in the bay:\n- 6:30 – 6:45 Start  your day with Tai Chi exercises or a photo hunt\n- 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in 30-45 minutes.\n- 9:30am: We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store.\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and         more…\n- Join in the Cooking Class, teaching you how to make our specifically (Spring rolls) before an early lunch is served.\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina. \n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00\nNote: The itinerary above maybe changes by the effect of weather or different seasons\nLater today, transfer to the airport and board your flight to Da Nang. Upon arrival, our driver will pick you up and transfer you to the hotel. \nMeal: Breakfast, Lunch.\nOvernight in Da Nang Hotel."},{"title":"Ba Na Hill - Golden Bridge - Transfer to Hoi An (B/L)","description":"08:00 am : Our Guide will pick you  up at the hotel and start to visit Ba Na Hills - King Mountain, also known as the second DaLat/ Sapa in Central. The beautiful weather here is always cool.\n09:45 am: You will admire the high by the most modern cable car system in Southeast Asia .After finishing the first cable car, you will visit the golden bridge (Winding its way around a 150-meter course lined with flowers, a golden bridge shimmers against the Ba Na Hills, supported by a pair of giant hands.) ,France wine cellar ,Garden flowers,Linh Ung pagoda. You will see the panorama of Danang City.\n12:00 Have a lunch at the restaurant ( Buffet )\n13:00 Explore  the French Village , Campanile, Nine Floor Goddess Shrine, Tombstone Temple, Linh Phong Monastery,Tru Vu Tea Shop Watch Carnival Performance Show, Square Du Dome ...Challenge the most popular adventure ride - Slide of Tube Car (free ride), Join in Fantasy Park with Walking in Fairy Forest, discover Dinosaur Park, play 5D wild west, enjoy 4D death race ride, watch 3D mega 360 degree, ride on Journey into the underground, enter Jurassic Park, challenge Freefall Tower and participate in adventure in Horror House and over 90 free games. Explore King Peak at an altitude 1.487m, On the top of mountain have Linh Tu Pagoda that is a special temple construction.\n15:00: Return to the Cable Car for leaving Ba Na Hills \n16:45 – 17:45: Our car will bring you back to your hotel. Tour ends.\nMeal: Breakfast, Lunch.\nOver night Hotel in Hoi An."},{"title":"Snorkeling at Peaceful Cham Island (B/L)","description":"07h30-08h30\t:   Pick up at your hotel (in Hoi An city) to CUA DAI  harbour. \n09h00\t:   Relaxing in fresh cool wind and enjoy the beautiful landscape on a Hoi An  Green speed boat to Cham Island. \n09h30\t:   Arriving at Lang Beach.Visiting the Protected Marine Area, The Boat Shelter, Hai Tang pagoda and Traditional fishing Village \n10h30\t\t:   Swimming and snorkeling \n11h30\t:   Staying at Chong beach  ecological zone, swimming, enjoying your sea food lunch. \n13h30\t\t:   Packing luggage for return trip to Hoi An \n14h00\t\t:   See off at your hotel and finish your trip\nIf the weather is bad effect( October to February) the Cham island tour will be shifted to Eco Cam Thanh Tour - A fisher experience day trip.\nCam Thanh eco fishing tour provides you with a close-up and intimate exposure to fishing communities. Discovering all manner of photo opportunities - coming and visiting a beautiful rice paddy field;. As well you will experience the friendliness of the local people greeting you along the way. You will also experience paddling the unique Vietnamese bamboo basket boat while the waterways of coconut palm paradise. Tour Duration: 4hours ITINERARY: • 09h00: Getting on boat to a local farming village traveling along picturesque country roads . Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides. \n• 09h30 :  You will have a chance to meet local fishermen and experience the daily life of their family . \n• 10h15 :  Learn to paddle the strange and unique Vietnamese bamboo basket boats. \n• 11h30 : You will join local fisherman on the river and enjoy hand-on experience of round net and cast net fishing\n• 12h00:  Back to the restaurant for relaxing and enjoy lunch.  \n• 13h00:  Return the hotel by car. \nMeal: Breakfast, Lunch.\nOver night Hotel in Hoi An."},{"title":"Hoi An Free Shopping Day (B)","description":"Free day to enjoy the pool. In the afternoon, you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags.\nMeal: Breakfast,\nOver night Hotel in Hoi An."},{"title":"Hoi An - Da Nang Departure (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends\nMeal: Breakfast.\nOver night N/A"}]},{"name":"Unique Central Vietnam Tour 6days/5nights","duration":6,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":353,"summary":"Highlights:\nHoian - one of the World’s Heritage Site\nVisit My Son Sanctuary – one of World’s Heritage Sites\nCycle to a local farm in Tra Que Village. A short stroll will take you around the vegetable garden \nVisit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city\nCruise along the Son river to Phong Nha Cave","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117659_d8d5f6fc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117659_d8d5f6fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_c28c44fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_5cb7932a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_1865814f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_47c81917.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_cccdc776.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_aed5c40b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117659_09ec5ccb.jpg"],"destinations":["Hoi An","Phong Nha-Kẻ Bàng National Park","Hue"],"timeline":[{"title":"DAY 1: DANANG ARRIVAL – HOI AN OLD TOWN","description":"(No guide/ no meal)\nPick you up at Danang airport flight no…, transfer to Hoi An old town, check in hotel.\n\n\nArriving Hoian - one of the World’s Heritage Site, you have chances to walk around this town, visit the ancient houses, ancient assembly hall, ancestral temple, and the symbol of Hoian, Japanese Bridge Pagoda by yourselves. In Hoian, everything is preserved as they were hundreds years ago.\n\n\n At night time, Hoian shows its beauty with colorful lanterns hung all around the town, and in the night market, where you can buy various kinds of souvenirs. (expense is taken by you)\n\n\nOvernight in Hoi An"},{"title":"DAY 2: HOI AN – MY SON (B/L)","description":"After breakfast at hotel:\n8:30 am: Tour guide will pick you up at Hotel, and then we go to visit My Son Sanctuary – one of World’s Heritage Sites\n\n\n10:00 am: My Son Sanctuary, which used to be the citadel of Champa Kingdom, has been keeping the ancient beauty with more than 70 architectural works, which are the temples of the old Champa Kingdom. They still survive until today, despite the destruction of many wars. You will be able to not only discover the old Cham Pa monuments but also admire the Champa traditional dance performed by the professional local artists.\n\n\n12:30 pm: Depart for restaurant near Hoi An\n\n\n1:30 pm: Having lunch in a local restaurant\n\n\n2:30 pm: We will go back to your places in Hoi An\n\n\nOvernight in Hoi An"},{"title":"DAY 3: TRA QUE VILLAGE – DA NANG(B/L)","description":"After breakfast at hotel, check out hotel.\n\n\n8.00am: Local guide will see you at your hotel with your bicycle. You will cycle to a local farm in Tra Que Village. A short stroll will take you around the vegetable garden and then you can join the farmers in preparing the land and fertilizing it with seaweed from the local lake. Following steps are raking the ground, sowing, watering, picking vegetable and many other gardening activities. After all these activities, you will take a short rest and enjoy foot bath before getting to preparing lunch with a local family. \n\n\nYour lunch will consist of many local delicacies including “Tam Huu” spring roll, “Banh Xeo” or local pancake of people in Vietnam middle region. You can join the cooking with the chef on these meals. After your morning excurtions and your lunch, you will take a Vietnamese traditional post-prandial nap before learning how to harvest and wrap the vegetables.\n\n\nAround 2.00pm, bid farewell to your host family before riding back to Hoi An.\nPick you up back to Da nang. Check in hotel\nOvernight in Da Nang"},{"title":"DAY 4: DA NANG – HUE IMPERIAL CITY (B/L","description":"Enjoy breakfast at hotel. Then, check out hotel\n\n\n7:30 am: In the morning, you will be picked up at hotel, then we start Hue city tour. On the way to Hue, you will pass through Hai Van tunnel, the longest tunnel in Southeast Asia.\nBesides that, you will have some time to enjoy the golden sandy beach of Lang Co Bay – one of the most beautiful bay in the planet.\n\n\n9:30 am: After arriving Hue citadel, you will visit Khai Dinh Tomb – the combination of Asian and European cultural structure, embodying the beauty of this ancient city.\nThien Mu Pagoda – the most beautiful pagoda of Hue, which is considered as the National pagoda of The Nguyen Dynasty, is your next destination after Khai Dinh Tomb. You can find the relics of Monk Thich Quang Duc – his private car, an eloquent witness of the Buddhist era in Vietnam.\n\n\n12:30 pm: At lunch time, introduces to you Hue specialties – the featured local dishes of this ancient city, in one of Hue’s famous restaurants.\n\n\n1:30 pm: We will take you to Hue Imperial city – the former administrative center as well as the accommodation of 13 Kings of the Nguyen Dynasty – the last feudatory Empire of Vietnam. The Imperial city is preserved as new for hundreds years, and tourists are allowed to visit many places such as Meridian Gate, Thai Hoa Palace and Duyet Thi duong theatre. Our tour guide will tell you the secret stories of the Royal family, of the Kings and the Queens’ lives.\n\n\nAffer that, drop you off at Hue hotel to check in.\nOvernight in Hue"},{"title":"DAY 5: PHONG NHA CAVE (B/L/ Snack meal)","description":"In the morning: \n6h30: Our guide and bus will pick you up at your hotel. On the way, stop to visit La Vang church and our guide will presenting Quang Tri Citadel (Nonstop) which was built in 1824 (The fierce battle of 81 days and nights has made this citadel well-known all over the world) Then to continue the itinerary our guide introduces about many places such as: Ben Hai river, Hien Luong bridge, Doc Mieu base…\n\n\n12h00: Arrive in Phong Nha - Ke Bang national Park. Lunch at restaurant.\n\n\nAfter lunch, cruise along the Son river to Phong Nha Cave. You will feel the magical and magnificent caves. Phong Nha also boasts underground rivers, large caverns and passageways and broad, pristine sandbanks. The most impressive cave - Phong Nha cave is probably also the most beautiful with many fascinating rock formations with imaginative names such as The Lion, Fairy Caves,... inside the Phong Nha Caves, the more illusory the stalactites and stalagmites look as they glitter when  right light is shone on them.\n\n\n3.30 Pm: Back to Hue on Ho Chi Minh trail. On the way back, you have Snack on the bus.\n\n\n 7.30Pm: We arrive in Hue and drop you off at your hotel"},{"title":"DAY 6: HUE DEPATURE (B) (No guide)","description":"Have breakfast then Check out hotel. Pick you up to transfer to Phu Bai airport to catch the flight no…\n\n\nWe hope this tour will bring you many unforgettable memories and joyful moments. See you again!"}]},{"name":"10 Days in Vietnam Experiencing Halong Bay to Hue and Hoi An","duration":10,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":609,"summary":"Vietnam is a very lovely country in Asia, and 10 Days in Vietnam Experiencing Halong Bay to Hue and Hoi An offering you the real vision and experience. You’ll visit all MUST SEES in the North, from Halong Bay - World Natural Heritage with seascape, Sapa mountainous area, flat land in Tam Coc with local village, rice field, to ancient Hoi An town where you can see Vietnamese, Japanses and Chinese culture. You also become local farmer in Hoi An to work on the field with locals as farmer, fisherman. Let’s join the tour with best images in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156999_ec0027dc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156999_ec0027dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_65c35f23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_ec1a6cc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_5f8f784f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_c986d4cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_c5ebfa02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_b3601289.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_6b4c6224.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_4e3eda81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_34efbcab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_53990767.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_7b8fe465.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_c02cd6f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_28bb0ed8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_258e858e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_0ca62f83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_371e3fc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_3876c0d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_afc967de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_c0df59b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_638d5e80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_29ea12cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_62437d8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156999_c9e0996a.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi city arrival – Airport pick-up - Hotel check in (Meal: No)","description":"Welcome to Hanoi city. Driver is waiting for you at the airport to transfer you to the hotel in the center.\nCheck in the hotel and free time to take your first step exploring the city. \nYou may take the time to get the visa and feel fee to go out meeting your driver. You can see some driver who are wiating for their guest. Please take looking around and see your driver wil NAME BOARD on hand and your name on. Meeting driver and going to the hotel in Hanoi.\nOvernight at the hotel in Hanoi.\nPlease Note: Hotel check-in time: 13:00\n"},{"title":"Day 2: Ninh Binh Full Day Trip ( Meals: B, L )","description":"8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong River. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful  and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi\n"},{"title":"Day 3: Hanoi free & easy (Meal: B)","description":"Today, you have a free day to visit and explore Hanoi old quarter by your own. Old 36 streets are is most interesting point in Hanoi city where you can experience the local daily life of Hanoian, tasting several local foods, visiting the hitorical and cultural monument...\nOvernight at the hotel in Hanoi.\n"},{"title":"Day 4: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30 am: Meeting your tour guide at the hotel and depart for Halong bay trip. Short break-time on the haft way for relax before reaching Halong Bay. \nVietnamese Lunch will be served after check in the cabin on cruise and cruising through the bay to the center.\nExploring the beauty of Surprising cave – the most beautiful and biggest one in the bay. Leisurely time hiking and swimming on the beach of Titop island.\nGet back the boat for Sunset Party with fresh fruit & local glass wine.\nDinner with delicious local dishes and free evening to feeling Halong Bay.\nOvernight on the cruise\n"},{"title":"Day 5: Halong Bay – Hanoi - Night train to Hue (Meal:B,L)","description":"You should wake up little early to enjoy the Sunrise in Halong Bay.\nAfter breakfast, doing Kayaking by your own to discovering Halong Bay. \nLearning how to make Vietnamese Spring-roll in Cooking Demonstration on the cruise.\nLunch time while cruising back the harbor.\nGet on the bus back to Hanoi.\n17:00: Arrive the hotel in Hanoi.\nYou can go out for your own Dinner and shopping around.\nEvening time: Driver will pick you up and transfer you to Hanoi train station for Night train to Hue. \nTrain takes about 12 hours from hanoi to Hue city with soft sleeping beds on train. You will see the local sountryside during this journey with rice field, mountain, river and he how beautiful and peaceful Vietnam is.\nOvernight on the train."},{"title":"Day 6: Hue arrival - Train station pick-up - Hotel check in (Meal: No)","description":"Welcome to Hue city - ancient capital of Vietnam. Driver will pick you up and transfer you to the hotel in Hue city. Hotel check in and have your own free time.\nHue city is friendly and quiet city with many historical monuments, you can also tasting many local Hue food what is very delicious.\nOvernight at hotel in Hue.\n"},{"title":"Day 7: Hue city tour (Meal: B,L)","description":"07:45 - 08:30 am: Tour guide and bus will pick you up at the hotel and start visiting Imperial Palace during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\nhave Lunch at local restaurant.\nAfter having lunch, We will pick up you at your hotel & transfer to Visit famous sites:\n•\tMinh Mang Tomb\n•\tKhai Dinh Tomb\n•\tConical Hat Making Incense Making Village.\nGet back the bus and come back the hotel.\n17:00: Arrival hotel.\nOvernight at hotel in Hue.\n"},{"title":"Day 8: Hue - Hai Van Pass - Hoi An (Meal: B)","description":"Private Driver pick you up and transfer you to Hoi An. Hai Van Giant Pass where you stop on the way to see the most giant Pass in Vietnam is most famous and very beautiful spot in the Center to see.\nStop on Hai Van Pass for many beautiful photo with stunning and breathtaking landscape. Then keep going to Da Nang city to take overview while driving through Da Nang city, then going to Hoi An old town. Check in the hotel and have your own free time in Hoi An.\nOvernight at hotel in Hoi An.\n"},{"title":"Day 9: Farming & Fishing Trip (Meal: B,L)","description":"09:00 - 09:30 am: Tour guide meet you at your hotel, cycle to a local farming village travelling along picturesque country roads, you have a chance to capture some amazing pictures with the farmers on the field, fishpond and the buffalo, you can also try to riding the water buffalo if you love it.\nKeep riding to local home. Here, you will be welcome local water \"En water\". Then, the farmer will take you to the boat station, boarding across the coconut-palm flanked waterways far from the traffic the motor scooters, and the noises the city to learn and try how to use the local traditional fishing techniques using round and cast nets and paddle the Vietnamese bamboo basket boats. \nAfter that, you will be shared the daily work in the rural by local farmers, you will join in the activities of the farmers – collecting seaweed fertilizer, sowing, raking, watering and picking. \nLeaving the garden, you will back to the farmer's home and enjoy foot massage with the local herbal treatment.\nAfter lunch, take a cycling back to you hotel.\n13:30-14:00: Arrive your hotel in Hoi An. \nOvernight at hotel in Hoi An\n"},{"title":"Day 10: Hoi An Departure (Meal:B)","description":"Today, according to your departure flight, driver will pick you up at the hotel and transfer you to Da Nang airport for your flight out. \nIf you want to stay longer going down the South, please feel free to let me know for further information.\nSee you again!\n"}]},{"name":"Taste of Vietnam Tour from Saigon to Da Lat, Nha Trang, Hoi An, Hue, Halong, Hanoi, Sapa","duration":20,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":3136,"summary":"Stretching over 3200 kilometers in length with countless mountains, rivers, forests, and beaches, this Taste of Vietnam Tour introducing you to the country’s three main regions…","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170950_01cd8874.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170950_01cd8874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_59ebbbc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_93111fb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_d668a87b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_683f6f10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_07ea2ff3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_b7f83a52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_0d24a439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_e62da304.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_95e44a39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_64e6d498.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_1ecc4b30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_06a4a143.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_a85e9666.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_1f97d0ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_13323eb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_b2a3f99b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_1a252002.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_fe534504.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_748408e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_b8015a0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_325da18a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_96646bb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170950_42c3b2a7.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Dalat","Hoi An","Hue","Hanoi","Ninh Binh","Sapa","Halong Bay"],"timeline":[{"title":"DAY 1 – ARRIVAL – HO CHI MINH CITY PACKAGE TOURS","description":"Arrive in Vietnam’s Ho Chi Minh City, still referred to by some as ‘Saigon’, and get ready to experience the exquisite cuisine of Vietnam. As you take an orientation tour, soak in the wonders of the colonial buildings and vibrant boulevards. Our tour guide will accompany you from the airport to your hotel. The rest of the day you are free to enjoy at your leisure.\nOvernight in Ho Chi Minh City."},{"title":"DAY 2 – HO CHI MINH CITY TRAVEL PACKAGES (B)","description":"A full day tour of the city begins with a visit to the Thien Hau Temple before continuing to the lively Binh Tay Market. See the incredible display of fresh produce on offer and enjoy the eclectic array of goods that are on sale. Tour the FITO museum to learn more about traditional Vietnamese medicine and fascinating treatments used by generations of locals.\nAfter lunch, visit the War Remnants or History Museum and the former Presidential Palace. From there, the Notre Dame Cathedral, Old Saigon Post Office, Dong Khoi Street (formerly Rue Catinat), Continental Hotel, Opera House and City Hall are all a short walk away.\nOvernight in Ho Chi Minh City."},{"title":"DAY 3 – HO CHI MINH CITY SIGHTEEING TOURS – TAY NINH – CU CHI TUNNELS – HO CHI MINH CITY (B,L)","description":"Enjoy a morning drive through typical southern Vietnamese countryside to Tay Ninh Province in the west of Vietnam to visit the Cao Dai Great Temple. The Temple called Toa Thanh or Divine Temple, is the largest of all the churches Caodistas. Begun in 1927 and opened in 1955 after many years of construction due to delays caused by financial and political problems. \nThe Cao Dai Temple is a curious and unique architecture building, mixture of Asian and European architectures, where what most noteworthy of its exterior are its vivid colors and shapes of roofs.\nAfter lunch in a local restaurant, visit the famous Cu Chi Tunnels, an incredible underground tunnel network constructed by Vietnamese resistance fighters during the struggle for independence. We have chance to view short video film and presentation about Cu Chi tunnels, before try a real experience with the world well known tunnels.\nAfter that travelers can try delicious manioc which is the main food in Cu Chi during the war. For those interested there is an opportunity to fire off rounds from an AK47 or MK16 at the nearby rifle range.\nYou will return to Ho Chi Minh City later in the afternoon.\nOvernight in Ho Chi Minh City."},{"title":"DAY 4 – HO CHI MINH CITY TRAVEL PACKAGES – MEKONG DELTA PACKAGE TOURS – HO CHI MINH CITY PACKAGE TOURS (B,L)","description":"In the morning, leave Ho Chi Minh City for the Mekong Delta town of Cai Be, where you will board the Cai Be Princess boat for a tour of the Delta. Proceed to visit some local cottage industries before continuing to Dong Phu, Binh Hoa Phuong and Anh Binh; these evergreen islands on the Mekong River combine large networks of meandering rivers, crossed with countless arroyos.\nLunch will await you at a superb colonial style villa located in a quaint village before boarding the boat once again for a tour of the landscapes along the river. After crossing the Co Chien, the boat will dock and from where you will head back to Ho Chi Minh City by road.\nOvernight in Ho Chi Minh City."},{"title":"DAY 5 – HO CHI MINH CITY FLIGHT TO – DALAT (NOT INCLUDED) – DALAT HALF DAY CITY TOUR (B)","description":"Transfer to Ho Chi Minh City’s domestic airport for your flight to Dalat on VN7380 (10.00-10.50)\nArrival Dalat, you will be picked up & transfer to hotel for checking in.\nEstablished as a hill station at the beginning of the century, Dalat’s French chalets and pine forests are more reminiscent of an alpine village than a town in Southeast Asia.\nAn afternoon of sightseeing in Dalat takes in the art deco former summer residence of Emperor Bao Dai, the old Dalat Railway Station, Xuan Huong Lake, the Central Market and Lam Ty Ni Pagoda where a Buddhist monk, Vien Thuc, produces abstract paintings and writes poetry.\nOvernight in Dalat."},{"title":"DAY 6 – DALAT PACKAGE TOURS – PHAN RANG – NHA TRANG TRAVEL PACKAGES (B)","description":"Leaving for Nha Trang after breakfast, travel through vivid green rice fields and salt ponds to Nha Trang, where an afternoon tour of the city includes the Po Nagar Cham Towers and Long Son Pagoda with its enormous white Buddha statue.\nOvernight in  Nha Trang."},{"title":"DAY 7 – NHA TRANG BEACH TOURS (B)","description":"A morning boat trip on Nha Trang Bay visits some of the nearby islands where you will have the opportunity to swim and snorkel in the clear warm waters. After a fresh seafood lunch, return to shore. In the afternoon, explore Nha Trang at your own pace.\nOvernight in Nha Trang."},{"title":"DAY 8 – NHA TRANG FLIGHT TO DANANG (NOT INCLUDED) – HOI AN PACKAGE TOURS (B)","description":"Transfer to Nha Trang’s domestic airport for your flight to Danang on VN1944 (7.15-8.20)\nFrom here transfer to Hoi An, a major Asian trading port in the 17th and 18th centuries with a relaxed lifestyle that has changed little over the years.\nIn the afternoon, take a tour of the ancient town centre to visit the homes of former merchants, the 400 year-old Japanese Covered Bridge and the exotic local market.\nOvernight in Hoi An."},{"title":"DAY 9 – HOI AN SIGHTSEEING TOURS – MY SON -TRA KIEU – HOI AN PACKAGE TOURS (B)","description":"Today there is a half day trip to the capital and religious centre of the former Champa Kingdom, My Son – the ruins of Cham people and was an imperial city during Cham dynasty. Here you can have more chance to explore and understand of technique of Old Cham people in making red bricks to build Tower which still now a secret to everyone, you can see a large complex of religious relics that comprises more than 65 architectural works. \nIt also surprises for those who are curious with architectural art. In 1999, UNESCO labeled the Cham architecture in My Son as a World Cultural Heritage Site. Moreover, you have chance to enjoy traditional music performed by Cham girls in their colorful uniforms.\nOn the way back to Hoi An stop to visit Tra Kieu, formerly known as Simhapura or the Lion Citadel, that once stood as the capital of Champa between the 4th and 8th centuries. On returning to Hoi An, the afternoon is free to relax, browse for souvenirs in art galleries and silk shops, or maybe cycle to the nearby Cua Dai Beach.\nOvernight in Hoi An."},{"title":"DAY 10 – HOI AN TRAVEL PACKAGES – DANANG PACKAGE TOURS – HUE CITY TOURS (B)","description":"Leave Hoi An for Hue by road, passing through Danang where you will visit the Cham museum, which holds the finest collection of Cham artwork in the country. After your visit, drive over the Pass of Ocean Clouds before dropping down to the wonderfully photogenic fishing village of Lang Co. Then, you will reach Hue, the former imperial capital of Vietnam, to visit the ancient. Forbidden City from where the Nguyen Dynasty ruled between 1802 and 1945.\nOvernight in Hue."},{"title":"DAY 11 – HUE DAILY TOUR (B)","description":"After breakfast, our guide and driver will come to your hotel and pick you up to visit the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945. After exploring the ruins of this wonderful monument take a cyclo through the ‘Old City’ to Tinh Tam Lake. We drive onto Thien Mu Pagoda, constructed in 1601, and observe the 21-meter tall tower, the centrepiece of the pagoda.\nIn the afternoon see the tomb of the former emperor Minh Mang which is located in a tranquil setting of gardens and ponds.\nIf time permits pass by the city’s vibrant Dong Ba Market.\nOvernight in Hue."},{"title":"DAY 12 – HUE FLIGHT TO HANOI (NOT INCLUDED) – HANOI DAILY TOURS (B)","description":"Transfer to Hue’s airport for the short flight to Hanoi on VN1542 (10.25-11.40)\nArrival Hanoi, you will be picked up & transfer to hotel for checking in.\nExplore Vietnam’s capital by an escorted, full-day city tour. Tree-lined boulevards, French colonial architecture, peaceful lakes and oriental temples make for a unique blend of east and west in this beautiful city. The tour includes such sites as Ho Chi Minh’s Mausoleum, the One Pillar Pagoda, the Fine Arts Museum and the Temple of Literature. At the end of the afternoon visit Hanoi’s Old Quarter also known as the ’36 streets’. Take a walking tour through charming Old Quarter and around Hoan Kiem Lake. This evening, enjoy a traditional Vietnamese water puppet show with traditional music. (subject to availability)\nFinish the day with a Water Puppet show. This is a uniquely northern Vietnamese art form depicting scenes from rural life and episodes of national history.\nOvernight in Hanoi."},{"title":"DAY 13 – HOA LU – TAM COC TRAVEL PACAKGES – HANOI (B,L)","description":"Leave Hanoi for rural northern Vietnam and the site of the county’s first capital, Hoa Lu. After visiting the two remaining sanctuaries of the ancient citadel, take a sampan (traditional boat) on the river through rice paddies to the grottoes of the sacred Tam Coc Caves. Enormous limestone karsts jut out from the green rice fields giving rise to this place’s other name, ‘Halong on Land’.\nOvernight in Hanoi."},{"title":"DAY 14 – HANOI DAY TOUR TO DUONG LAM (B,L)","description":"Today immerse yourself in ancient Vietnamese culture with an excursion to Duong Lam, one of the country’s few remaining ancient villages.  Explore houses over 400 years old, wander the village’s narrow alleyways, visit local temples, and most interesting of all, chat with friendly locals.\nEnjoy a local style meal for lunch in a 100-year old house.\nAfter your lunch, continue driving to Mia Pagoda (another hamlet of Duong Lam), built in the 15th century, then, visit Ngo Quyen temple and Phung Hung temple, places dedicated to two national heroes – Ngo Quyen and Phung Hung.\nIn the afternoon return to Hanoi.\nOvernight in Hanoi."},{"title":"DAY 15 – HANOI COOKING CLASS – LAO CAI – SAPA TRAVEL PACKAGES (B,L)","description":"A special cooking class is prepared for you in the morning. Start with a visit to a local market accompanied by a chef to learn about Vietnamese ingredients and cuisine, followed by a cooking demonstration. After the class lunch is served so you can sample all the different dishes prepared during the demonstration.\nRest of the afternoon at leisure.\nThis evening transfer to Hanoi Train Station for the overnight train to Lao Cai, the gateway to Sapa.(image)\nOvernight on the train."},{"title":"DAY 16 – SAPA ADVENTURE TOURS IN GROUP (B,L)","description":"You will arrive at Lao Cai train station in the early morning. From Lao Cai the road winds up the terraced hillsides to Sapa, a former French hill resort and home to some of Vietnam’s most diverse ethnic groups.\nOn arrival in Sapa, you will be transferred to your hotel for breakfast and the chance to freshen up. A morning walking tour of Sapa visits the busy market, whilst the afternoon visit features some nearby hill tribe villages.\nOvernight in Sapa."},{"title":"DAY 17 – SAPA PACKAGE TOURS IN GROUP – HANOI TRAVEL PACKAGES (B)","description":"In the morning enjoy a light trek to discover Sapa’s lesser-known areas. Have the chance to enjoy the breathtaking scenery of mountain rice terraces, waterfalls and buffalo at work. Crossing rivers by suspended bridges you will witness people toiling the fields in Vietnam’s traditional way before a free afternoon discover Sapa by yourself. Return to Lao Cai for the onward journey back to Hanoi by overnight train.\nOvernight on the train."},{"title":"DAY 18 – HANOI PACKAGE TOURS – HALONG BAY CRUISE TOURS (B,L,D)","description":"On arrival at Hanoi train station, you will be served breakfast before heading to Halong Bay. \n7:30 – 08:30: Our SHUTTLE BUS with tour guide will pick you up at your hotels (Note: This pick-up is just applied for those who use our shuttle bus service)\n10h30: Stopover in Hai Duong city  where you can experience our hand-made Vietnamese handicraft products.\n12h30: Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities:\n+ Boarding FLAMINGO CRUISEs for departure.\n+ Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager.\n+ Great lunch is served while cruising passing by islets, through Hoa Cuong floating village.\n+ Exploration of Halong Bay passing by Soi Sim Beach, Coconut Three Island. Then arrive in the area of Surprising Cave.\n+ Kayaking & swimming or climbing up to the mountain and getting a complete view of Halong Bay at Titov Beach\n+ Joining our COOKING CLASS on the sun-deck. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n+ Enjoy sunset party with fruits and wine.\n19:30: Under the magnificent night sky, Our luxury set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities include:\n+ Join the SQUID FISHING on boat with our crews. You can enjoy the squid cooked with assistance from our chef.\n+ Or Laze yourself with our happy-hour drinks at the bar.\nOvernight on Flamingo Cruise."},{"title":"DAY 19 – HALONG BAY CRUISES – HANOI (B,L)","description":"06:15: Tai Chi class on the Sun-deck.\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n08:00: Visit the SURPRISING CAVE (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12:00: Disembarkation at Tuan Chau Pier. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00: Arrive in Hanoi. End of the trip!\nOvernight in Hanoi."},{"title":"DAY 20 – HANOI – DEPARTURE (B)","description":"Today is departure day. Enjoy some free time for last purchases or simply relax before the transfer to Hanoi’s Noi Bai Airport and your onward flight."}]}]