[{"name":"Best of Vietnam - 13 Days","duration":13,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":1995,"summary":"Kicking off in Vietnam's capital Hanoi, embark on a breathtaking 13 day journey through imperial cities and rural villages, taking in beautiful Halong Bay and the lush Mekong Delta. Finish up in vibrant Ho Chi Minh City and the fascinating Viet Cong tunnels of Cu-Chi!","highlights":["Take a city tour of Hanoi","Explore Halong Bay by boat","Pay a visit to Cai Rang floating market","Visit Cu Chi Tunnels","Discover Saigon"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/106560_c815b1de.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/106560_c815b1de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_8dd85c57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_f1fa8107.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_236fcdb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_fe326ed8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_ed95e9a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_cc71d646.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_e4b7ab49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_ea2c891f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_c22c5739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_10c1d045.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_c06ee14a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_2862d2c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_27b459da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_1e8ac13b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_e538adb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_d3ee3018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_9592c962.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_bfd5cbfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_31f174b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_9a1539b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106560_e1b35e8c.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Vinh Long","Can Tho","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Friday. Welcome to Hanoi, perhaps the most graceful, atmospheric and exotic capital city in Asia. Airport to hotel arrival transfer. The remains of the day offers free time for you to explore the wide tree lined avenues, beautiful lakes, ancient pagoda’s and thriving, historic old city, all easily navigated on foot. "},{"title":"Day 2: Hanoi","description":"After breakfast we embark on an exciting back streets tour of Vietnam's capital. Our adventure starts with a taxi ride from the hotel to a well known street market northwest of the city which sells giant trees and plants. From here we stroll along the sidewalks, following an urban trail through the backstreets to the quaint district of Vinh Phuc. After exploring this wonderful neighbourhood we stop for refreshments at a unique coffee shop tucked away down a narrow alley. Then it's time for an exhilarating local experience, riding pillion on taxi-motorbikes through a maze of tiny streets and along the shore of beautiful Ho Tay Lake. Our 2-wheeled taxis drop us off for a tasty lunch of Vietnamese street food, in the yard of a former film studio. In the afternoon we walk past Ho Chi Minh's Mausoleum (exterior only), where ‘Uncle Ho’ has laid since 1975 and learn all about the great man himself, who is regarded as the father of the nation. Continuing on we stroll down Hung Vuong Avenue to explore the complex of the beautiful Temple of Literature, which was Vietnam's first university. Then we board the local bus to the Hoa Lo prison, aka the Hanoi Hilton, named by US prisoners of war. We finish the day with a glass of refreshing beer on a sidewalk facing the Soviet palace. Return to the hotel by taxi for an evening at leisure. Please note: If you would prefer not to travel by taxi-motorbike, please an air-conditioned car/ taxi will be provided at no extra cost. "},{"title":"Day 3: Halong Bay","description":"Hanoi – Halong Bay. Take a moment to picture in your mind some two thousand rugged karst islands dappled with lush vegetation seeming to float on top of pristine emerald coloured waters and you have the natural wonder that is Halong Bay. This morning a scenic drive will take us to this beautiful UNESCO World Heritage Site where we will enjoy a junk boat cruise. Based on traditional designs, these wonderful vessels combine oriental style with modern luxury. Soak up the panoramic views from the sundeck as the boat gently plies its course. This afternoon we visit Trinh Nu Cave, one of the finest caves in Halong Bay, covering an area of 2,000m² with a stunning array of stalactites and stalagmites. There's also the opportunity to go kayaking and enjoy a refreshing swim. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner. "},{"title":"Day 4: Halong Bay","description":"Halong Bay - Hanoi - Hue. Early birds can start the day with a relaxing Tai Chi class on the sundeck or a traditional massage - the perfect way to start the day. Before heading back to port this morning we explore the beautiful Sung Sot cave (Surprise Grotto), which is 10,000m² and consists of two major chambers. These spectacular chambers are spacious enough to hold thousands of people. On arrival back into Hanoi mid-afternoon we’ll explore the maze of streets in the French Quarter by cyclo (rickshaw), taking in highlights such as the Opera house and Ly Thai To park. We then swap our wheels for a leisurely walk through ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street from silk tailors to traditional medicine shops. Later this evening there's a chance to freshen up before boarding the train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available. "},{"title":"Day 5: Hue","description":"Today we take in the highlights of Hue. Upon arrival we embark on a guided sightseeing tour of the 19th-century Nguyen empire capital. We visit the Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hue and the citadel. Within the citadel is the Imperial Purple Palace, an exact copy of the Forbidden City in Beijing, with its impressive ramparts, formal moats and imperial palaces, some of which lay in ruin. In the countryside lies the Royal Tombs of the Nguyen kings, here we’ll view the elaborate mausoleum of Emperor Tu Duc. As the sun sets there's an optional cruise in a long boat along the gentle Perfume River, beautifully illuminated at night."},{"title":"Day 6: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. Today we take the scenic Hai Van Pass (Road of the Ocean Clouds), which offers magnificent views of beaches to one side and lush hills to the other. En route we stop for a walk along China beach. Perhaps enjoy a refreshing swim in the sea before continuing our journey south to Hoi An. The charming, old-world trading port of Hoi An with it cobbled streets, traditional homes and tiny shop houses is a perfect place to lose yourself in a by gone era. Boutique restaurants, hip cafes along the waterfront, delightful craft shops and artisans including some of Asia’s best bespoke tailors (whose services come at a nominal price), all can be found here. On a short walking tour of the enchanting historical town, we’ll visit the Chua Ong Pagoda, Chinese Assembly Hall, 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. During your stay in Hoi An, we offer a unique optional Hoi An Street Eats add-on, which explores the city’s most popular local haunts. Cruise the city the way the locals do, by vintage Vespa and enjoy lots of tasty Vietnamese Cuisine. Book early with your reservation consultant, as numbers are limited. "},{"title":"Day 7: Hoi An","description":"This morning we set off on a leisurely bike ride through the countryside to Tra Que village. Here we discover age old farming practices and learn about traditional medicine. It’s a fun, hands on experience today as we don conical hats and assist with tending the fields and gardens before watching an entertaining cooking demonstration and helping to cook a tasty lunch."},{"title":"Day 8: Hoi An","description":"A free day for you relax or further sightsee. You may wish to take a relaxing rowboat journey along the river or spend the day lazing by the beach or hotel pool. Alternatively you can opt to take an excursion to the UNESCO-listed My Son sanctuary or enjoy a day trip to the Ba Na Hills mountain resort, where you will ride the second longest cable car in the world and walk along the striking Golden Bridge (book and pay locally). "},{"title":"Day 9: Can Tho","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City. Drive to the Mekong Delta. Often referred to as the ‘rice bowl’ of Vietnam, the fertile Mekong Delta is famous for its abundant harvests of tropical fruits, flowers and rice, as well as it fantastic views while boating along the canals. Taking our sampan from Cai Be we cruise through the maze of waterways watching the hubbub of daily life on the river. Passing colourful trading boats, house boats and children swimming we stop to visit some of the local cottage industries that produce popcorn, coco candies and paper along the way. Lunch is served today in a traditional wooden home on Dong Hoa Hiep Island."},{"title":"Day 10: Ho Chi Minh City","description":"Can Tho - Ho Chi Minh City. Early today we visit the ever lively Cai Rang floating market before driving back to Ho Chi Minh City. Once called the Pearl of the Orient, modern Ho Chi Minh City is a thriving metropolis on the move. Sleek sky scrapers, gourmet restaurants, designer malls and swanky bars and spas are scattered between ancient pagodas, colonial era landmarks and lively street markets. On a walking tour of Ho Chi Minh City we'll see the Notre Dame Cathedral and the Old Post Office before visiting the sobering War Remnants Museum. Evening at leisure."},{"title":"Day 11: Ho Chi Minh City","description":"Ho Chi Minh City – Cu Chi. This morning we visit the famous Cu Chi Tunnels used by the Viet-Cong in their struggle to keep control of the region during the 1960’s. After a short video presentation we take an exciting walk around the many bush trails and see trapdoors, booby traps, living areas, weapon factories and kitchens that were used and lived in during the war. We can also safely crawl through sections of the tunnels, that have been widened for the tourists and stand in the middle of bomb craters that are still just as defined as the day they were created. At the end of the visit you can opt to fire weapons of the era (including the M16 ‘s and AK47) on the firing range."},{"title":"Day 12: Ho Chi Minh City","description":"Today we head out to explore more of Ho Chi Minh City. Starting off with the Reunification Palace - former residence of the President of South Vietnam until the fall of Ho Chi Minh City on April 30th 1975. The building is now a museum and a popular wedding venue. We’ll take a look in the famous ‘War Room’ where the North Vietnamese army took control in 1975. Next we explore Giac Lam Pagoda, Ho Chi Minh City’s oldest and one of its most beautiful temples. Later on we take a journey through Vietnam’s medical history at the FITO Museum. This is Vietnam’s first traditional medicine museum with an amazing collection of over 3000 items. Our last stop of the day is Ben Thanh Market, where you can shop till you drop and master the art of haggling for just about anything!"},{"title":"Day 13: Ho Chi Minh City","description":"Wednesday. Today marks the end of our tour and after breakfast we will transfer you to the airport for your onward departure flight."}]},{"name":"VNA006 - 7days Hanoi Sapa and Halong Bay","duration":7,"travelStyle":["Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":409,"summary":"Starts/Ends: Hanoi / Hanoi or Vice Versa\nTour Duration: 7 days 6 nights\nDates: No fixed departure dates. You may go whenever you wish.\nTour Type: Landscape and Nature, Cruise Holidays, and Historical\nActivity Level: Regular itinerary, moderate walking\nTour Customizable: Absolutely! (Tell us your specific requirements in the inquiry form)","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/109671_388a5b35.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/109671_388a5b35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109671_5092d056.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109671_71ed71dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109671_af247126.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109671_91a98358.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109671_515ab1d8.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 01: Fly to Hanoi","description":"Fly overnight to Hanoi. On arrival you will be met by your expert tour guide and transferred to your hotel. The rest of the day is at leisure\nOptional: Street Food Tour 3 hours \nOur guide will pick you up at Hotel to enjoy Hanoi Street Food Tour for 3 hours (17.30 – 20.30). We always do highly recommend the customers could do this option. It could be considered as indoor trip that bring to you a new feeling about Vietnam cuisine. Overnight in Hanoi\nAccommodation:\n3*: Gondola Hotel - Superior Room \n4*: Rex Hotel - Superior Room \n5*: Melia Hotel - Deluxe Room"},{"title":"Day 02: Hanoi City Tour (B/L)","description":"After breakfast, our guide pick up at hotel at 8.00AM. Sightseeing today includes explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake including the sedate Tran Quoc Pagoda; and one of the city’s museums (a choice between the History Museum and the Ethnology Museum). End the day’s explorations; watch a traditional puppet show on water that shows off an ancient art form. Overnight in Hanoi. "},{"title":"Day 03: Hanoi - Dcar to Sapa - Cat Cat Village (B/L)","description":"After breakfast at hotel, our driver will pick you up at lobby of hotel at 6.30-6.50, then, departing to Sapa by following Noi Bai - Lao Cai high-way. Upon arrival Sapa, check in hotel and have a lunch at local restaurant. Afterthat, a walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 6 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a Car to return to Sapa\nAccommodation:\n3*: Chapa Dew Hotel - DLX Room \n4*: Horizon Hotel - DLX Room \n5*: Pao's Leisure Hotel - Deluxe Room"},{"title":"Day 04: Trek to Lao Chai Ta Van Village - Transfer to Hanoi (B/L)","description":"Morning, 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. A 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. Lunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Get back to Sapa by Car. Free tuntil 15.00 return Hanoi. "},{"title":"Day 05: Hanoi - Halong Bay - Overnight on Cruise (B/L/D)","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Spend the night on our luxurious boat\nAccommodation:\n3*: Swan Cruise - DLX Room \n4*: Glory Legend Cruise - DLX Room \n5*: Dragon Legend Cruise - Deluxe Room"},{"title":"Day 06: Halong Bay - Hanoi (B/L)","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi "},{"title":"Day 07: Hanoi departure (B)","description":"The morning is at leisure before boarding your flights home"}]},{"name":"FLAVOUR OF VIETNAM 10 DAYS","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1793,"summary":"Highlights:\n\nHanoi - City Tour – Sapa on train – Cat Cat Village – Lao Chai – Ta Van – Halong Bay Day\nCruise – Danang – Hoian – Fish & Rice – Hoian Ancient town – Hochiminh – Cuchi Tunnels – Vinh\nLong (My Tho) – Hochiminh","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/173697_724d022d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/173697_724d022d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_78ba8c9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_32b1e7d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_cee9d773.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_a5330781.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_21098c40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_5a941c52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_09b5f8f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_9e915919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_15fb9f50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_8ca0cadf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_a4a81c44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_6a641b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173697_7cba4f57.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Cai","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"HANOI ARRIVAL (D)","description":"Welcome to Hanoi, the 1000-year-old capital of Vietnam! Upon arrival, transfer to our hotel. Check in and free relaxation after your long haul flight. Enjoy welcome dinner at a specially selected restaurant with Vietnamese traditional food. \n\nOvernight at hotel in Hanoi."},{"title":"HANOI - LAO CAI BY TRAIN (B/D)","description":"After breakfast, you will visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West Lake (One of the oldest pagodas in Vietnam).\n\nAfter lunch proceed to visit the Ethnology Museum  where you have great chance to know about culture, custom, languages, houses of 54 ethnic groups in Vietnam, the Literature Temple and Quoc Tu Giam, see Vietnam’s first university, constructed in 1070 - its gardens and well- preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters, and the beauty of Ngoc Son temple. At the end, journey through Dong Xuan Market and Hanoi old quarter on 36 streets where you can purchase souvenirs for your beloved ones. Dinner will be serve at local restaurant. Around 20:00 hrs you will be transferred to Hanoi Railway Station. Overnight train trip to Lao Cai in superior 4-berth compartments sharing with other passengers. Train departs at approximately 21:50 hrs. Notes: Train schedule is subject to change. Train journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages complete the local experience."},{"title":"LAO CAI - SAPA (B/L)","description":"Early morning picks up from Lao Cai train station to Sapa town. Enjoy breakfast in the hotel. Leave your luggages in the hotel and start your visits off the beaten track to Cat Cat village. You take an easy walk among traditional stilt-houses, Si suspension bridge, Tien Sa waterfall and trekking inside bamboo forest. When in Cat Cat village after a beautiful walk down the valley and enjoy the stunning views of terraced rice fields. Drive back Sapa town for lunch and check-in your hotel. Free afternoon at your leisure.\nOvernight at hotel in Sapa."},{"title":"SAPA - HANOI BY TRAIN (B/L/D)","description":"Morning pay a visit to Muong Hoa valley with a short trek from Lao Chai village to Ta Van village. You trek among the stunning terraced rice fields, intermingle with Hmong and Dzay hill tribes and get insights into the locals’ life. Break for delicious lunch in the local house offering stunning view of Muong Hoa valley. Hear the sound of wind, breath the flavour of ripe rice and taste the local food.Afternoon you find out legendary assumption of Ancient Rock Ground before transferring back Sapa town to visit Rock Church and Sapa town market. \n\nAfter a short rest (time permitting), transfer to Lao Cai railway Station where you will board the overnight train to Hanoi at around 20:15 hrs (shared sleeping compartments, sharing with other passengers in 2 lower & 2 upper berths per compartment). Dinner will be served at local restaurant.\nNotes: Train schedule is subject to change. Private compartments on request at surcharge. Train journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the \ncarriages complete the local experience."},{"title":"HANOI - HALONG BAY OVERNIGHT ON JUNK (B/L/D)","description":"After breakfast, you will be transferred to Ha Long Bay. It’s about 160 km and driving time is approximately 2 hours and 30 munities.\n\nArrive in Ha Long City at 12:00 and check in aboard the booked junk right after the welcome drink is served. Start cruising while having lunch on board and enjoy the mighty bay view. Ha Long Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage sites whose formation dates back 500 million years, consists of around 2,000 karst islands and islets scattered over an area of 1,553 km2. The bay cruise will continue with up close sighting of Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island, a visit to Sung Sot Cave and swimming stop at Titov Beach. Relax to enjoy the bay view at sunset. Enjoy the dinner on boat. After dinner, enjoy your free time spend a night on board. Overnight on cruise in Halong bay."},{"title":"HALONG - HANOI - FLIGHT TO DANANG - HOIAN (BRUNCH)","description":"DOMESTIC FLIGHT HAN – DAD IS INCLUDED\n\nEarly risers can enjoy the splendid yet tranquil view of the bay at the crack of dawn. Breathe the sea’s fresh air, feel the morning breeze and hear the sounds of birds above. Have breakfast and cruise to visit Human head shaped island and Tortoise Island. Continue to cruise into Bai Tu Long Bay to discover the adjacent bay of “The Little Dragon Bowing to His Mother” as it is named. Check out and have lunch on board while heading to shore. Disembark and transfer back to Hanoi. Arrive Hanoi, you will be transferred directly to Airport for flight to Danang. Upon arrival Danang airport, you will be welcomed by your local guide and transfer to Hoian for check-in. Overnight at hotel in Hoian."},{"title":"HOIAN FISH & RICE (B/L)","description":"After breakfast, the local tour guide will meet you at your hotel, check your bike and as a group will begin to cycle for about 1.5 hour through beautiful villages with nipa palm along the road.\n\nArrive Cam Thanh village which located in the low section of Thu Bon River, take the basket boat along the water coconut river where fisherman will teach you how to catch crab and to make unique tools with a water coconut leaf. Next take a boat trip to Tra Que village, on the way you will pass the estuary where Thu Bon River meets the sea. Then, meet and talk with local fishermen who will then show you how to use fishing-nets in a certain spot. A special lunch will be held at the local restaurant looking to the vegetable garden. After lunch, take a strolling to vegetable garden, learn about famous local herbal. Next, meet a local farmer who show you farming skill before you try with these local stuff. After that, vehicle picks up and transfer to Hoian ancient town. Enjoy the walking tour to discover Hoian ancient town, which was originally a Cham seaport but has been influenced down centuries by a myriad of traders from various cultures. There are plenty to see in this tranquil and delightful town, some of which are the famous Japanese Covered Bridges, the Pottery Museum, the 200 years old Tam Ky House, the Chua Ong Pagoda and the bustling market. We visit these sights on an exciting walking tour past many low tiled houses scattered along the small streets and assembly halls which reflect the towns multi-cultural past.\nOvernight at hotel in Hoian."},{"title":"HOIAN - DANANG - FLIGHT TO SAIGON (B/L)","description":"DOMESTIC FLIGHT DAD – SGN IS INCLUDED\n\nMorning, free at leisure until transfer to airport for flight from Da Nang to Saigon. Meet our tour guide in Saigon and lunch is served upon arrival.\n\nAfternoon, take city tour to visit War Remnants Museum, which features a comprehensive collection of the machinery; weapons; photos; and documentation of Vietnams wars with both the French and Americans. Visit Notre Dame Cathedral and Old Post Office, the best examples of classical French colonial architecture. Afterwards, stop at Ben Thanh market for shopping. Overnight at hotel in Hochiminh"},{"title":"SAIGON - MEKONG DELTA (MYTHO) (B/L)","description":"Enjoy a full day tour traveling from Ho Chi Minh City to My Tho, the gateway to the Mekong Delta. Known as the “rice bowl” of Vietnam, the Delta is the most fertile region in the country, and the main producer of rice and tropical fruits. From My Tho, take a boat and travel to one of the islands located in the middle of the Mekong River. On the island visit a fruit orchard and sample some of the local produce, before boarding a smaller sampan that winds along narrow canals. You also have the opportunity to visit a local family’s house and enjoy their hospitality and share with them some tea or rice wine. Return to Saigon. Overnight at hotel in Hochiminh"},{"title":"SAIGON DEPARTURE (B)","description":"Breakfast at hotel and free at leisure until transfer to Tan Son Nhat International airport for flight back home. \n\nEnd of services!"}]},{"name":"Chopsticks & Coconuts Family Holiday","duration":14,"travelStyle":["Family","Adventure","Group","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":2049,"summary":"From the spectacular limestone seascape of Halong Bay to the frenetic streets \nof Saigon, Vietnam is a country full of interest and surprises. The cities \nare an assault on all the senses: noisy, colourful, aromatic and totally \nabsorbing. We tour Hanoi by cyclo and have the option to see a water puppet \nshow. We have quieter time also, snorkelling at Whale Island, exploring the \nfascinating Mekong Delta by boat and cycling past vibrant green paddy fields \nnear Hoi An. We also have the chance to enjoy the superb Vietnamese cuisine \nand practise our chopstick skills (try the fried scorpion if you dare!).","highlights":["Visit Halong Bay","Explore caves at Marble Mountain","Take a cooking class","Visit a floating market"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33345_d3263c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33345_d3263c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_2a791161.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_a849945f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_9e15ee3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_234ab785.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_29a25574.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_513911e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_807fca33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_43cf6356.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_50554a53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_4b23deaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_01100b45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_00259874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_c0686081.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_4895408a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_0b08ac57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_b3c03b06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_bc80fe63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_b81811cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_4e5196fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_fa210597.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_4e173f68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_7281d59c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33345_18813a2b.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Start Hanoi","description":"The day is free to recover from the flight or stroll amongst broad tree-lined \navenues dating from the French period. There is a faded colonial charm where \nbaguettes and good coffee are sold from doorways of grand buildings of a past \nera. There will be a welcome briefing this evening with your leader followed \nby an optional dinner at a local restaurant, where your children will have \ntheir first opportunity to practice their chopsticks skills.\n*May De Ville City Centre Hotel or similar*"},{"title":"Day 2: Morning tour of Hanoi including a cyclo tour around the Old Quarter; afternoon free. Evening at Hanoi's famous water puppet show","description":"This morning we take a city tour, which will include a visit to the Ho Chi \nMinh Mausoleum area to see his 'House on Stilts' and visit the One Pillar \nPagoda. We'll also visit the Temple of Literature and the Hoa Lo Prison (also \nknown as the 'Hanoi Hilton'). Afterwards we enjoy a cyclo (bicycle taxi) ride \nthrough the Old Quarter, with its '36 Streets' where each street is home to \nshops sell particular products - e.g. 'silk street', 'gold street', 'paper \nstreet' and 'souvenir street'. The remainder of the day is at leisure to \nstroll around the Hoan Kiem Lake, stopping for a coffee or ice cream at one \nof the many cafes surrounding it. In the evening there is the option to enjoy \na performance of Hanoi's famous water puppets.\n*May De Ville City Centre Hotel or similar*"},{"title":"Day 3: To Halong Bay; cruise/kayak among spectacular limestone formations; dinner and sleep on boat","description":"We make an early start for the approximate 4 hour journey to Halong Bay. This \nis one of the most stunningly beautiful sights in South East Asia with \nroughly 3,000 limestone peaks rising directly from the clear emerald sea. We \ncruise amongst this amazing karst scenery, stopping to have a go at kayaking, \nallowing us to get to places inaccessible by boat (weather permitting), and \nenjoy a seafood lunch on board. In the late afternoon we watch the sun go \ndown and enjoy another lovely meal before overnighting on the boat in twin \nshare cabins with en suite facilities.\n*Overnight Boat*"},{"title":"Day 4: Cruise then return to Hanoi; overnight train to Da Nang","description":"We continue to cruise around Halong Bay this morning before returning to \nport. We then drive back to Hanoi, and transfer to the train station and \nboard the Reunification Express for the overnight train ride to Da Nang, over \n600km to the south.\n*Overnight Train*"},{"title":"Day 5: Explore caves at Marble Mountain; drive to Hoi An for walking tour","description":"This morning on arrival in Da Nang we drive the short distance to Marble \nMountain where we explore the large caves which were used by the Viet Cong as \na hospital base during the war. From the mountain peak, there are fantastic \nviews over My Khe Beach and the surrounding countryside leading on to Hoi An. \nWe then drive on to the World Heritage site of Hoi An, the original European \ntrading port in Vietnam dating back to the mid-16th century. It is now a \nliving museum, with attractive wooden merchant's houses and pagoda-style \ntemples with Chinese, Japanese, Vietnamese and European architectural \ninfluences. It is also a marvellous place to wander around and enjoy the \nthriving riverside market. We take a walking tour of the old town and visit \nthe Japanese Bridge and Chinese Assembly Hall.\n\n*Hoian River Green Boutique or similar*"},{"title":"Day 6: Cycle through countryside; free afternoon followed by an evening cooking class","description":"This morning we jump on bikes for a ride on quiet roads through the \ncountryside past local markets, schools and villages before continuing on to \nCua Dai beach (5 km). Please note that we are able to provide child sized \nbikes for those children who are 120cm and taller. Children riding their own \nbikes must be aged 7 upwards, for smaller children there will be the option \nof riding on the back of their parents bike in a child seat or saddle. The \nafternoon is dedicated to free time at the beach for swimming, or you can \ntake an optional boat trip on the river or relax back in town. In the evening \nwe join an informal cooking class where adults and children alike will learn \nhow to make some of Hoi An's speciality dishes and even participate in \nrolling your own spring rolls!\n*Hoian River Green Boutique or similar*"},{"title":"Day 7:  Fly to Nha Trang; transfer to Whale Island, free time to swim in the turquoise sea","description":"This morning we transfer to Da Nang airport and fly to the Cam Ranh airport \nin Nha Trang. We then transfer (approx. 3 hours) to the tropical island \nretreat of Whale Island. With just one guesthouse on the island and \naccommodation in beach bungalows, this really is a chance to unwind and relax \nor while away the rest of the day swimming in the sea. \n\n*Whale Island Resort or similar*"},{"title":"Day 8: Cruise around islands with seafood lunch and snorkelling ","description":"We will join a boat trip in the morning for a spot of snorkelling and \nswimming before a seafood lunch is served. In the afternoon there is the \noption to visit a local fishing village, see the Whale temple or walk around \nthe island to the viewpoint for a 360 degree view of the stunning mountainous \ncoastline and the surrounding coves and white sand beaches.\n\n*Whale Island Resort or similar*"},{"title":"Day 9: Fly to Saigon","description":"Depending on flight schedules, there may be time for one last dip in the sea \nbefore transferring to the airport for our flight to Saigon, officially known \nas Ho Chi Minh City. This is an exciting and absorbing city where scooters \npack the streets and temples stand defiantly alongside modern developments. \nDevastated by the Vietnam War, it is now a bustling free market city where \nanything goes.\n*Huong Sen Hotel or similar*"},{"title":"Day 10: Excursion to the Cu Chi Tunnels; afternoon tour of Saigon with visits to Reunification Palace and Ben Thanh markets","description":"In the morning we visit the famous Cu Chi Tunnels used by the Viet Cong \nduring the war the network covers 3 levels and approximately 240km of \ntunnels. The tunnels were used by the guerrillas as living quarters and \nescape routes during the Vietnam War. Although originally very narrow, some \nparts have been widened for the tourists and we have the opportunity to \nexplore parts of the system. Claustrophobes may prefer to stay outside in the \nsunshine before we return to Saigon. In the afternoon we wander around the \ncity visiting the Saigon River, Ben Thanh market, Reunification Hall and \nNotre Dame Cathedral.\n*Huong Sen Hotel or similar*"},{"title":"Day 11: Explore the Mekong Delta by boat, visiting a floating market and villages; overnight in homestay guesthouse","description":"This morning we drive to Cai Be in the Mekong Delta (approx. 2.5 hours). The \nMekong, known as 'the rice bowl of Vietnam', produces much of Vietnam's \nfruit, sugar cane and coconuts. We spend some time at Cai Be from where we \nbegin a Mekong River boat trip passing a floating market and visiting typical \nriverside villages where we learn about some of the local products for which \nthe Mekong Delta is famous - e.g. popped rice, rice paper & coconut candy. \nCai Be floating market is becoming less crowded and smaller as fruit trading \nis mostly now done by trucks due to the bridge being built. However, this is \nstill a great opportunity to see a local market and the trade being conducted \ntraditionally on a smaller scale. \n\nAfter lunch we continue our journey passing some magnificent countryside and \nstopping at some small cottage industries. The evening is tranquil as we have \ndinner on an Island and enjoy some 'Delta' hospitality. We spend the night \nsleeping at a simple guesthouse built in the style of a local house. Bedding, \na mosquito net and a small towel are provided.\n*Homestay*"},{"title":"Day 12: Morning walk through the island's fruit orchards and navigate small canals in a traditional sampan; return to Saigon","description":"This morning we take a walk through the fruit orchards and navigate our way \nthrough the small canals in a traditional wooden sampan. Later we rejoin our \nboat to rendezvous with our vehicle for the journey back to Saigon via a \nlittle visited Cao Dai temple used by devotees of this strange indigenous \nreligion, which fuses all the great religions of east and west.\n*Huong Sen Hotel or similar*"},{"title":"Day 13: Visit to Dam Sen water park to cool off for the day","description":"Today we visit the excellent Dam Sen Water Park with its slides and rides to \nallow the kids to let their hair down!\n*Huong Sen Hotel or similar*"},{"title":"Day 14: End Saigon","description":"For land only clients, the tour ends this morning in Saigon after breakfast."}]},{"name":"Beautiful Sapa & Northwest - 10 Days","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1180,"summary":"The remote mountainous area of Mu Cang Chai offers breathtaking views and interesting subcultures. It is the least traveled area of the North and attract hardier travelers craving a glimpse of some of the most remote ethnic minority people. We offer hiking, home stay and classic tours in this area. Come to discover the most remote areas of Vietnam with amazing preserved landscape and rich culture here","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/154951_f8f3701c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/154951_f8f3701c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_3583da15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_42f49689.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_83f6be05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_787d8c49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_692b9bf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_6e0b6d3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_80db84a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_de9bcb24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_c4b0f0c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_987bb91c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_156ed8df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_2f94d32a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_46ca7e94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_5f3083c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_3e3d5a40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_7caeebb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_bf1264d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_ace89090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_e911d01f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_fb4cf888.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_52a8f708.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_f5435d79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/154951_bdb24c66.jpg"],"destinations":["Hanoi","Sapa","Mai Chau","Halong Bay"],"timeline":[{"title":"Day 1 :Arrive in Hanoi – 4-hour Hanoi city tour by private car","description":"Upon arrival, our car & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transfer to Hanoi Old Quarter and drop at hotel to check in. Then you will get a chance to visit Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the nearby One Pillar Pagoda; the Presidential Palace; the Temple of Literature; West Lake. Afternoon, visit St. Joseph’s Cathedral, Hoan Kiem Lake before enjoy a traditional Water Puppet Performance – a unique Vietnamese Art form hailing from Southeast Asia’s wet-rice culture., End of the day is time for shopping at old quarter. Overnight in Hanoi. Meals : Lunch or Dinner . Accommodation : Hotels in Hanoi"},{"title":"Day 2: HANOI – DRIVE TO SAPA","description":"Your Crossing Vietnam 's private tour guide and car will pick you up at your hotel in Hanoi then start 5 hour drive to Sapa. Stop ont he way for break and photos.\nCheck in on arrival and overnight in Sapa. Meals : Lunch . Accommodation : Hotels in Sapa Town"},{"title":"Day 3 : SAPA TOUR (TREKKING TO MUONG HOA VALLEY)","description":"Start your day at 9:30am by meeting your friendly guide at Cinnamon restaurant. After a short meet and greet with your driver/guide you will set out on a brief, scenic drive full of panoramic views of the valley whilst heading down the main road to Muong Hoa valley.\nWhilst driving along the main road toward the valley you will eventually head off-road and travel down small trails, opening up views of terrace rice fields. Head through these gorgeous bush trails on your way to Y Linh Ho hamlet, seeing a local village of Black Hmong people along the way. \nFrom Y Linh Ho village, you will travel along the river to go to Lao Chai village (old village). Here you will have time to visit the local families and listen to your guide teach you about the local culture. Learn how they live, how they build their traditional housing, their techniques of making clothes and hear stories about traditional ailments for sick people.\nAfter meeting with the locals stop for a bite to eat. Enjoy a fresh, delicious lunch served in one of the restaurants along the side of the river. In the afternoon, you will leave Lao Chai and continue to Ta Van village, the home of the Giay people. Your guide will introduce you to some families. You will learn about their life story, enjoy some green tea and learn about the different cultures that inhabit this area. \nArrival Ta van village, you will be welcomed by the host. Check in and overnight in Ta Van. Meals : Breakfast,Lunch,Dinner . Accommodation : Overnight at Ta van homestay"},{"title":"Day 4: SAPA – THAN UYEN –MU CANG CHAI - 160KM","description":"his morning, we drive to visit the Silver Waterfall - the most beautiful waterfall in Sapa then enjoy the great view and feeling at the \"Heaven Gate\" of Sapa - the highest point of Hoang Lien Son mountain range where you can see majestic Lai Chau valley and imposing Fanxipan mount.\nOn the ways, you have a great chance to visit the small villages of Lu people in Binh Lu, Lao people in Than Thuoc before reaching to Mu Cang Chai. Check in Mu Cang Chai Ecologe. In this amazing place, you have time to take a light walk to explore the daily life of local people.\nMeals : Breakfast,Lunch . Accommodation : Mu Cang Chai Ecologe"},{"title":"Day 5: MU CANG CHAI - NGHIA LO - 100KM","description":"Today you will have an impressive trekking day at Han Xung village of the Hmong people, you will immerse in the majestic natural landscape, the unique terraced fields in this area.\n\nYou will then continue the journey by moving to La Man Tan - a very beautiful and impressive destination because of local people and scenery. You also have the opportunity to visit the family, the school to understand more about the daily life of people in this area.\nContinue the trip to Nghia Lo via Khau Pha pass – one of the four beautiful passes in the North where you have a great chance to enjoy the beauty of Tu Le valley. Lunch on the way before reaching Nghi Lo. Spend the leisure time to discover Nghia Lo town and overnight in Nghi Lo.   Meals : Breakfast,Lunch . Accommodation : Nghia Lo Town\n"},{"title":"Day 6: NGHIA LO – BAC YEN – MOC CHAU – MAI CHAU - 250KM","description":"Say good bye Nghia Lo, we continue our journey through Phu Yen, Bac Yen district of Son La province, where you can have server stops on the way to explore the small villages of Thai ethnic minority.Crossing the ferry in a gentle Da river, you will come to Moc Chau - a famous prairie for the green tea plantations, famous for dairy farms in Vietnam. You will have an opportunity to understand the process of producing the products from green tea. We will then continue the trip to Mai Chau, you are welcome to the village of the White Thai ethnic people. Spend the leisure time to explore several neighbor villages. Overnight home-stay in the traditional house-on-stilts. Meals : Breakfast,Lunch,dinner . Accommodation : Overnight home-stay in the traditional house-on-stilts"},{"title":"Day7: MAI CHAU – HOA BINH – HANOI","description":"Wake up to the sounds of the village: roosters, morning vendors and people's voices. You have an early breakfast this morning before bidding farewell to Mai Chau and its friendly people.\nYour destination for today is Hanoi. It is an 5-hour journey back to the nation's capital with a visit to the Muong ethnic minority in Hoa Binh province..Check in on arrival and overnight in Hanoi.\nMeals : Breakfast,Lunch,dinner . Accommodation : Hotels in Hanoi"},{"title":"Day 8 : Hanoi Walking Street Food Tour & Cyclo","description":"his food tour includes half an hour cycling around the trading area in Hanoi Old Quarter, which is said to be a microcosm of the city. Dating back to the 11th century, the Old Quarter has 36 streets, each named after the commodity traditionally produced and sold on it, such as sugar, bamboo, leather or silver. Even though some of streets have had their name changed, many still retain their ancient attributes.\n\nStart walking though narrow streets to Dong Xuan. Along the edge of the market, dozens of street hawkers sell produce, from live seafood to exotic fruits and spices. Your local English-speaking guide will give you an insight into traditional Vietnamese food culture, including details of ingredients and the historical background of popular northern dishes. Try seasonal fruits and sample a tasty French-inspired snack from a street cart as you go.\nWalking through the maze of bustling streets that make up Hanoi’s Old Quarter, tickle your taste buds with famous Hanoi dish \"Banh Cuon\" at a local eatery. Watch in awe as the skilled chefs demonstrate how the tasty dish is put together.Continuing into the atmospheric heart of the Old Quarter and wander past street stalls and quiet residential lanes where you can observe 1000 years of local life. Your next 2 snack stops are at outdoor barbecue stalls. Sit down with Hanoi locals and sample various meat, vegetable and bread specialties, flame-grilled over hot coals for extra flavor. For dessert, venture down a small alley to feast on fresh fruit served in a cup and smothered with crushed iced and condensed milk. This is not one to be missed!\n\nYour local guide will then take you to one of Hanoi’s best-kept secrets — a hidden café with stunning views over the picturesque Hoan Kiem Lake. This hard-to-find café is one of the few left in the city that still serves egg coffee, a scrumptious local delicacy that you will sample whilst admiring the hustle and bustle of the city center below. If coffee's not your thing, you can just as easily sample a cold beer! At the end, feel free to continue exploring the area on your own, or let your guide assist you with directions or a taxi back to your hotel.  Duration 3.5 hours . Time : Flexiable \n"},{"title":"Day 9: Hanoi – Halong Bay (Lunch, Dinner)","description":"Start your day early with a 7:45am pick-up,  and enjoy the peaceful scenery as you travel through the countryside, farmlands and Red River delta. At around midday, arrive at Tuan Chau marina and meet the crew while you enjoy a welcome drink. Take some time to unwind before setting sail, and enjoying lunch on–board.In the afternoon, head to Hang Sửng Sốt (Surprising Cave), and find out how the cave was named as surprising. Move on to Titop island area. Drop anchor in the calm water, swim, snorkel, or do the short trek to the top of island for an overview of Halong bay.\nIn the evening, watch the sunset, and join the sundeck party. Make acquaintance with new friends, or simply watch the sunset as you savor an authentic Vietnamese dinner, and reward yourself with a large selection of cocktails from the bar, or try an on–board activity: reading, games, movies, and squid fishing. Meals : Lunch,Dinner . Accommodation : Overnight at Cruise"},{"title":"Day 10: Halong Bay –- Hanoi (Breakfast, Lunch)","description":"Early risers can start their day at 6:30am with a Tai Chi session on the sundeck. Otherwise, breakfast is served at 7:30am, before you start your day by sailing through the calm emerald waters of the bay heading to Hang Luồn Cave. Explore the cave by kayak, or by a locally rowed bamboo boat.\nAfter checking out of your cabin, join a short cooking demonstration, and learn how to make spring rolls before an early lunch is served. Around midday, return to the shore and disembark from the cruise, before your transfer back to Hanoi Airport for your departure flight home or the next destination. Meals : Breakfast,Lunch . Accommodation : N/A\n"}]},{"name":"North vietnam adventure tours 7 days- Mu Cang Chai - Halong - Ninh Binh","duration":7,"travelStyle":["Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","Hiking & Trekking","Holiday"],"oldPrice":0,"price":1084,"summary":"Mu Cang Chai  & Van Long Nature Reresve are less touristic & natural destinations in North Vietnam.\nOur trip is gives you long trekking time to discover the mountainous beauty, the amazing Rice Terraces, as well as local life of different ethnic groups in rural tribe in Mu Cang Chai ( instead of tourism area in Sapa).\nCycling in Ninh Binh- through Cuc Phuong National Park & Van Long nature reserve – enjoy the outstanding landscapes of mountains & grottos, the largest area of wetland reserve where is the home  to a rich fauna, flora and many animals.\nAnd 2 days relax on cruise, kayak & swimming will help you enjoy the North Vietnam trip.\nHighlight\nTrekking through the stunning Rice Terraces in Mu Cang Chai.\nExplore & live with ethnic local people in mountainous area. \nEnjoy kayaking & swimming in Halong Bay \nCycling in Cuc Phuong national park & Van Long Nature Reserve.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/118772_eb099c95.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/118772_eb099c95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_7b72872c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_17c45eb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_ed5255a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_b6fda02e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_0602a4f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_f5414d65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_290d689f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_ca3e2e0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_7d43279f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_f79f5a04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_b9749a02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_75082e0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_9326eab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/118772_bb066a62.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi – Nghia Lo – Tu Le(L, D)","description":"8am: Our guide will pick-up you at hotel.We pass Nghia Lo town – the home of Thai people – one of the main ethnic people in Yen Bai. Arrive at Tu Le town, check in our hotel, you can spend around 2hrs to walk around field and village, to enjoy the rice field, explore the life, the house, the culture…of Thai people. After trekking, we can enjoy the Hot Spring – where villagers often gather together and take a bath everyday.\n\nOvernight at the hotel in Tu Le.\nTrekking level: Easy ( 1/5)\n~5-7 Km trekking in 2hrs and 250 Km driving from Hanoi- Tu Le"},{"title":"Day 2: Tu Le – Mu Cang Chai trekking around villages (B, L, D)","description":"8am: After breakfast, we will move to Mu Cang Chai. Run over the Khau Pha pass (one of the four greatest passes in Northern Vietnam with 40km, connect Tu Le and Mu Cang Chai).  Most scenic roads which offer a lot of stops for picturing as the view point to see the Lim Mong, Lim Thai village or paragliding-point on the top of this pass.\n\nWhen arrive Mu Cang Chai, we will spend 1-2 hrs trek to Rasberry Hill  – one of the most famous destination, where have the round shape of rice terrace, all of them was built by human hand of H’mong people since hundreds years ago. Leave Mam Xoi, we will have 3-4hrs to trek from Che Cu Nha village to Kim Noi village – where we will sleep in the stilt house of Thai people.\n\nOn the trekking way, we will go up to the high mountain, pass to the Hmong village and waterfall in remote area. Beside seeing the beauty of Rice field, you’ll guided how to plant rice, harvest rice or discover the farm working of locals.Enjoy stunning landscapes along the way.\n\n "},{"title":"Day 3: Mu Cang Chai – Hanoi(B,L,D)","description":"After our breakfast, depend on the season, we can spend 1-2hrs continue trek some villages where have the beautiful rice field such as: Lao Chai village, Sang Nhu village or enjoy the rice terrace field on the back way.\n\nAfter that, we will drive straight back to Nghia Lo – Yen Bai city- Hanoi around 6-7pm.\n\nStay at hotel 3 star in Hanoi\nTrekking level: Easy (1/5)\n~5-7 Km trekking in 1-2hrs and 300 Km driving from Tu Le – Mu Cang Chai"},{"title":"Day 4: The first day in Ha Long Bay (B,L,D)","description":"8:00: After breakfast, the shuttle bus to Halong Bay will pick-up you at hotel. You will embark on a cruise at midday around the beautiful bay. You will enjoy the seafood lunch while cruising through Bai Tu Long Bay and Ha Long Bay.\nAfternoon, you will discover the floating Vung Vieng village while sitting on rowing boats with local people or experience kayaking, swimming or join the cooking class.\nEvening: Enjoy the Dinner and the bay in night."},{"title":"Day 5: He second day in Ha Long Bay(B,L,D)","description":"Morning:  Rise early for morning tai chi on the sundeck. After breakfast, you will explore the Sung Sot Cave (Amazing Cave)– one of the biggest cave and most impressive of Ha long Bay. When come back cruise, you can enjoy the bay on the Sun Deck when waiting the lunch.\nYou will check out of the cruise at 12:00am, transfer back to Bai Chay beach. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30/17:00.\n\nOvernight in hotel 3 star in HaNoi."},{"title":"Day 6: Hanoi – Ninh Binh – Bike from Hoa Lu to Cuc Phuong National Park (B/L/D)","description":"DAY 6: HANOI – NINH BINH – BIKE FROM HOA LU TO CUC PHUONG NATIONAL PARK (B/L/D)\n \n\nPick-up at your hotel at 8:00 am, then transfer in about 110 km on a good road by mini-van to Ninh Binh (~2 hours). We start cycling on the countryside road, onto Hoa Lu – an ancient citadel, maybe with a stop for its history in the 10th century. Then we continue our riding through the limestone peaks to Tam Coc, passing rice paddies and through the rural villages.\n\nHere we are in Tam Coc and lunch is served in the local restaurant that has view over the boat pier, great chance for photos here. Followed by a short transfer on van, we continue our ride exploring more of Ninh Binh, along the farm for about 2 hours cycling. Cuc Phuong national park is our destination, we load the bike back on the van and transfer to the park center for the night. Dinner and overnight in a simple bungalow inside the park."},{"title":"Day 7: Cuc phuong – boating at Van long nature reserve – Hanoi (B/L/-)","description":"Morning exercise with cycling up hills further into the jungles, this is harder than yesterday but it’s worth being in the fresh nature with sounds of birds, maybe with a short walk here to learn more about plants and animals before we drive back to the gate for visiting the Primates Rescue center.\n\nLeave the Rescue center by van for Van Long, it’ll be time for lunch, then we will take the local bamboo boats visiting (1,5 hours) along this fascinating Nature Reserve in swampland – Van Long, with limestone peaks, caves and there maybe chances to see different kinds of birds and the Delacur langur. Transfer back to Hanoi, tour ends at your hotel by around 6 pm.\n\nP/s: The itinerary can change according your requirement.\n\nSale Department of  ZonitripContact:\n\nMs Bùi Thị Minh Nghĩa – Mobile: 0168 992 7861 – Email: info@zonitrip.com.\n\n "}]},{"name":"On Foot in Vietnam","duration":14,"travelStyle":["Walking Tour","Adventure","Group","Fully Guided","In-depth Cultural"],"oldPrice":0,"price":2070,"summary":"A holiday that explores the exciting diversity of Vietnam on foot. Enjoy walking tours around the must-see city sights in Hanoi, Hue and Ho Chi Minh City, and rural rambles between tribal villages and to ancient jungle temples. Unique accommodation includes a beautiful stilt house eco-resort overlooking tiers of emerald rice paddies and a family-run guesthouse in the sleepy Mekong Delta.  Halong Bay - Cruise among breathtaking limestone landscapes aboard a junk Hoi An - Discover this charming ancient merchant's town   Culinary delights - Enjoy Vietnam's amazing street food","highlights":["Stay in a stilt house in the Pu Luong Nature Reserve","Weave through breathtaking limestones of Halong Bay","Discover the charming merchant town of Hoi An","Tantalise your tastebuds with amazing street food"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124971_6d5f66ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124971_6d5f66ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_df070902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_493f660a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_bc7f7135.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_a91e7d01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_e1a8f008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_9dad167e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_4abfafa5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_12adef6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_8a35471f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_fa8fdb26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_dc8e8e46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_01534c3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_c2c511d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_2143a4f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_1594542f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124971_b2d16d35.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Join trip in Hanoi: introduction to the Old Quarter","description":"The trip starts today in Hanoi. Vietnam's bustling capital is architecturally styled like a French provincial town, with tree-lined boulevards and low-rise buildings. It's a wonderful city to explore on foot.\n \n Your Leader plans to meet everyone in the hotel reception at 4pm for a welcome meeting. Afterwards, for those that wish, we'll head to a restaurant for dinner. On the way to dinner your leader will orientate you and introduce you to life in Vietnam as you head through some of the bustling streets and markets of Hanoi's Old Quarter. The maze of fascinating alleys is known for its interesting 'tube' houses, whose narrow frontages give way to long rooms that stretch back from the road. There are no other activities planned today. Should you miss the welcome meeting, your Leader will inform you of any essential information as soon as you catch up.\n \n If you would like to receive a complimentary airport transfer today, you'll need to arrive into Noi Bai International Airport (HAN), which is 45 minutes from the hotel. Please note that if you wish to join the afternoon orientation tour today, you must arrive at the hotel by 4pm. If you are booking your own flights, we recommend giving yourself at least 30 minutes to clear the airport. From the airport to the hotel is around 45 minutes' drive, so therefore the latest your flight can arrive is 1pm. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk.Start point\n Flower Hotel, Hotel reception, 55 Nguyễn Trường Tộ, Nguyễn Trung Trực, Ba Đình Nguyễn Trung Trực Ba Đình Hà Nội, Вьетнам, Nguyễn Trung Trực, Ba Đình, Hà Nội, Vietnam 16:00"},{"title":"Day 2: Drive to Pu Luong; hike to our stilt house retreat","description":"Leaving Hanoi behind this morning, we drive west to the Pu Luong Nature Reserve, a beautiful region of limestone cliffs, forests and terraced fields that is richly biodiverse. This area is a home to the Thai ethnic minority tribe who live in villages of stilt houses. We will be staying in the heart of the Reserve at the Pu Luong Retreat, an eco-friendly lodge built from traditional materials in a 'boutique' style, with breathtaking views all around. There is even an infinity pool in the former fish pond! At the Retreat we will be staying in its unique stilt house, a beautifully appointed and traditional structure where we sleep on comfortable mattresses in one very large room that can be divided into sections by curtains. The shared bathrooms are connected to the stilt house and open to the elements. See http://puluongretreat.com/house-on-stilt/. On arriving at the Nature Reserve, we hike across the paddy fields to our accommodation while the bus continues there with our luggage. \n \n We can expect today's eight kilometre walk to take around two-and-a-half hours across gently undulating terrain."},{"title":"Day 3: Hiking in Pu Luong Reserve; lunch with Thai family","description":"We spend today hiking among the beautiful landscapes of the Reserve and will enjoy plenty of stops along the way, planning to spend time in some of the villages of the Thai minority tribe and have a traditional lunch at a local house en route.\n  \n Today's leisurely paced hike of approximately 10 kilometres will take around five hours across gently undulating terrain."},{"title":"Day 4: Morning walk and bamboo raft trip; return to Hanoi","description":"In the morning we enjoy another walk, rambling alongside the bubbling river with its vast wooden waterwheels which transport its waters to irrigate the terraced paddy fields. Ending at spot where we take to the river on simple bamboo rafts, we float along in this tranquil place and will no doubt feel rejuvenated and ready for our adventure ahead! We return to the hustle and bustle of Hanoi later today with time in the evening to enjoy a performance of traditional water puppets (optional). These puppet shows date back to the 11th century, and performances took place in the flooded rice fields of the villages in the Red River Delta. \n \n This morning's walk covers approximately five-and-a-half kilometres and is expected to take around two-and-a-half hours."},{"title":"Day 5: Walking tour in Hanoi; drive to Halong Bay","description":"This morning we will discover more of Hanoi outside of the Old Quarter on a walking tour. Architecturally styled like a French provincial town with tree-lined boulevards and substantial low-built houses, the city is wonderfully nostalgic. Among the interesting sights that we will visit are the charming One-Pillar Pagoda, Confucius Temple and the Presidential Palace. Ho Chi Minh himself, a spartan-living and scholarly man, chose not to live in the Presidential Palace; he preferred instead a simple teak stilt-house specially built for him and which we will see in the Palace grounds. In the afternoon we drive to our hotel at Halong Bay in the Gulf of Tonkin. \n \n We can expect today's seven kilometre walking tour to take around four hours including sightseeing."},{"title":"Day 6: Junk Cruise around Halong Bay; overnight train to Hue","description":"This morning we enjoy the romantic scenery of Halong Bay on a junk cruise amongst the thousands of jagged limestone islands that rise out of the jade green waters like the hairy scales of a submerged dragon! In fact Halong means: 'Where the dragon descends to the sea'. As legend has it the rugged seascape was created by the pounding tail of a dragon as he ran from the mountains into the sea, carving the islands in his wake. During our cruise we'll have the chance to stop at a grotto beneath towering cliffs and perhaps visit a beach and enjoy a delicious freshly caught seafood lunch on board the boat. After disembarking, we return to our hotel in Hanoi to freshen up before boarding the 'Reunification Express' to Hue. We travel 'soft sleeper' class on the train, with four people to a compartment with all bedding provided."},{"title":"Day 7: Afternoon walking tour around Hue Citadel","description":"Awaking aboard the train, we pass through a rural landscape of seemingly endless rice paddies before arriving in the city of Hue mid morning. This afternoon we will discover Hue's fascinating history on a walking tour around the Imperial Citadel. Located on the left bank of the river, the palace was built by the Nguyen dynasty, Vietnam's ruling emperors from the early 1800s to 1945. The Citadel has formal moats and impressive ramparts that were constructed by 20,000 men and was a copy of the Forbidden City in Beijing. Although most of the inner part of the city was totally destroyed during the month-long Tet Offensive in 1968, the vast outer walls and the west wing remain an eloquent reminder of the palace's former glory.\n \n We can expect today's seven kilometre walking tour to take around three-and-a-half hours including sightseeing."},{"title":"Day 8: Hike through villages; cruise on the Perfume River","description":"This morning we drive out of the city to enjoy a hike through the countryside and villages overlooking the Huong Giang River, better known as the Perfume River. Exploring on foot enables us to observe rural life up close and our leader is always on hand to explain what we see. Various cottage industries take place in the villages here including silk painting, bronze casting and incense stick production. The river supposedly got its name from the aromas carried by the river downstream from the forests and mountains of its source. Near the end of our walk we'll stop on Vong Canh Hill to admire the great view of the river down below before descending to board our own boat for a leisurely cruise along the river back to Hue.\n \n Today's hike of approximately eight kilometres will take around three hours. We will walk along village footpaths and the terrain is undulating."},{"title":"Day 9: Drive to the laid-back town of Hoi An","description":"Today we enjoy a scenic drive south to Hoi An, crossing the spectacular Hai Van Pass en route and passing through rural scenes of thatched, wooden houses and lime-green rice paddies as well as panoramic sea views. The UNESCO World Heritage town of Hoi An was one of the busiest international trading ports of Southeast Asia in the 17th and 18th centuries. First colonised by the Portuguese in the 16th century, it still retains its medieval charm today, with many of its old buildings superbly preserved. The afternoon has been left free to explore Hoi An at your own pace. You may choose to visit the Japanese Bridge or some of the Chinese temples and meeting halls in the Old Town. There are also many shops, bars and restaurants and it is a great place to buy souvenirs, have clothing tailored or simply watch the world go by in a riverside cafe."},{"title":"Day 10: Hike to the Cham temples at My Son","description":"Today we drive for around an hour from Hoi An and enjoy a hike through a hilly landscape of pine forest and grasslands to the ancient Cham site of My Son. The Chams were dynastic lords who rejected the authority of China in the second century and established their own kingdom in what is now Vietnam. Although they benefited from strong sea links with the rest of South East Asia, the kingdom's interior could not supply sufficient food for a strong military force. For 1000 years they managed to stave off attacks by the Vietnamese and Chinese, before being overcome by the Vietnamese in the 15th century. The site is impressive, despite the fact that much of it was bombed in the 1960s and there are several groupings of Cham temples which we can visit. \n \n We can expect today's eight kilometre hike to take around four-and-a-half hours across undulating terrain with a high point of 168m."},{"title":"Day 11: Travel to Binh Hoa Phuoc Island in the Mekong Delta","description":"After a short drive to Danang Airport first thing this morning, we fly to Ho Chi Minh City, from where we drive further south to Cai Be in the Mekong Delta. Surrounded with lush and fertile land the area is home to small villages and swaying coconut palms. We take a walk on Tan Phong Islands to see local Delta life. Later we travel by boat to the island of Binh Hoa Phoc where we spend the night in a local homestay-cum-guesthouse. At the homestay we will be accommodated in a mix of twin and triple rooms with attached bathrooms. The rich soil of the Mekong provides an abundant harvest, including coconut, fruits, rice and of course fish and tonight we will enjoy a dinner of local produce\n \n We can expect today's four kilometre hike to take around one-and-a-half hours."},{"title":"Day 12: Walk in the Mekong Delta; drive to Ho Chi Minh City","description":"This morning we plan a walk on the island, stopping off along the way to observe some of the traditional cottage industries of the Delta such as the production of rice paper and coconut sweets. Other glimpses of everyday life may include seeing people catching fish from the river, or mending baskets and repairing tools by the river bank. Departing by boat once more we meet our bus in Vinh Long and drive to our final destination of the trip, Ho Chi Minh City. Still unofficially referred to as 'Saigon', the city is the largest in Vietnam with a population of around eight million. You will find an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit.\n \n We can expect today's eight-and-a-half kilometre hike to take around three hours across at a leisurely pace. The terrain of the Delta is flat."},{"title":"Day 13: Walking tour of Old Saigon; free afternoon to explore","description":"This morning we walk around the central sights of Old Saigon, now known as District 1 of Ho Chi Minh City. We see the Notre Dame Cathedral and the GPO building as well as some of the old French Colonial hotels such as The Rex. We then continue to the Independence Palace (renamed the Reunification Hall) and the War Remnants Museum. The afternoon is free for you to explore the city further, perhaps with a visit to the huge Ben Thanh market for some shopping.\n \n We can expect today's five kilometre walking tour to take around four hours including sightseeing."},{"title":"Day 14: Visit Cu Chi tunnels; return to Ho Chi Minh City where trip ends","description":"This morning we take a short drive out of the city to the infamous Cu Chi Tunnels, which formed an incredible underground command base for 10,000 Viet Cong troops and were a major part of the 1968 Tet Offensive. The site is a fascinating insight into the resourcefulness of the Vietnamese. There is the opportunity to crawl through a small specially adapted section of the tunnels should you wish to sample the claustrophobic conditions in which the Viet Cong lived. \n \n You are free to depart from the hotel in Ho Chi Minh City after the morning activity, which finishes at 1.30pm. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you will need to depart from Tan Son Nat International Airport (SGN), which is around 30 minutes' drive from the hotel. If you wish to join the morning excursion to Cu Chi Tunnels then the earliest time you can book a flight to depart is 5 pm.End point\n Good Vibes Boutique Hotel, Hotel reception, 4A Thi Sách, Bến Nghé, Quận 1, Hồ Chí Minh 700000, Vietnam 14:00"}]},{"name":"Exotic North-to-South Vietnam Motorcycle Tour on Ho Chi Minh Trail and Coast","duration":16,"travelStyle":["Bicycle","Trail/Dirt bikes","Group","Partially Guided","Sightseeing","Holiday"],"oldPrice":0,"price":2490,"summary":"\n\tThis 16-day Exotic North-to-South Vietnam Motorcycle Tour on Ho Chi Minh trail and Coast starting from Hanoi via parts of Northern Vietnam with Phu Yen, Mai Chau before turning to Central with Phong Nha, Hoi An, Hue, Khe Sanh then along the coastline of Nha Trang, Quy Nhon brings you sweet memories about scenic rides on both paved roads and dirt trails of regions …\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129800_10bb87d1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129800_10bb87d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_e500846c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_9e1f4c7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_46021068.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_24e60270.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_8b318a08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_619f7a59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_e7b76eff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_1020a3aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_476d7579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_f38bcb0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_038a05c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_49151338.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_468939ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129800_f14fa743.jpg"],"destinations":["Hanoi","Mai Chau","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Dalat","Ho Chi Minh City"],"timeline":[{"title":"Day 1 : Hanoi motorbike tour to Phu Yen (Son La)","description":"Start our Vietnam motorbike tour by riding to Phu Yen on country road with a stop in Son Tay. On November 20-21, 1970, a joint force composed of USAF Special Operations and rescue personnel and U.S. Army Special Forces, supported by U.S. Navy Carrier Task Force 77, made a daring raid on the Son Tay prison camp located less than 50 miles from Hanoi.\n\nThe objective was to rescue as many as 100 U.S. captives thought to be held there. The assault troops, in six ARRS helicopters accompanied by two C-130 aircraft, flew 640km to Son Tay from bases in Thailand. U.S. Navy pilots made a diversionary raid while 116 USAF and Navy aircraft from seven air bases and three aircraft carriers flew refueling, surface-to-air missile suppression, fighter cover, close air support, early warning, communications support and reconnaissance missions. There was no prisoners found in camp.\nAfter lunch, ride on the winding mountain road to Phu Yen, a small mountain town in Son La province to take in some of the best mountain views in Northwest Vietnam and overnight in Hoang Gia Hotel.\n\nSummary"},{"title":"Day 2 : Phu Yen motorbike tour to Mai Chau (Hoa Binh)","description":"There are many small roads that lead into the mountains around Mai Chau so we’ll take the chance to motorcycle out to isolated H’mong, Dao and Thai villages. We will take on the challenge of an old road built by the French army and spend the afternoon exploring nearby villages.\nOvernight in a Thai ethnicity stilt house in Mai Chau.\n\nSummary"},{"title":"Day 3 : Mai Chau motorbike tour to Tan Ky (Nghe An)","description":"Motorcycle on a small, spectacular and paved trail along the Ma river until Cam Thuy town where we stop for lunch. Hit the Ho Chi Minh trail (now a newly built highway) all the way to Tan Ky town where we spend the night in a hotel.\n\nSummary"},{"title":"Day 4 : Tan Ky motorbike tour to Phong Nha (Quang Binh)","description":"Ride on Ho Chi Minh Highway until Pho Chau where we stop to visit the HCM Trail victory monument which is in fact the real starting point of our HCM Trail ride. Motorcycle all the way to Phong Nha – Ke Bang, the biggest and also the most beautiful cave in Vietnam and Indochina and is now a UNESCO World Natural Heritage site.\n\nThe karst formation of Phong Nha-Ke Bang National Park has evolved since the Paleozoic (some 400 million years ago) and so is the oldest major karst area in Asia. Subject to massive tectonic changes, the park’s karst landscape is extremely complex with many geographic features of considerable significance. The vast area, extending to the border of the Lao People’s Democratic Republic, contains spectacular formations including 65 km of caves and underground rivers.\n\nSummary"},{"title":"Day 5 : Phong Nha motorbike tour to Dong Hoi (Quang Binh)","description":"Boating and exploring World Heritage site of Phong Nha where local civilians and military sheltered from incessant bombing during wartime. Then we drive down to the coastal town of Dong Hoi, which was heavily shelled by US warships during the war. At a hotel over looking the beach, we can take in some sunbathing by the beach.\nOvernight in Dong Hoi.\nSummary"},{"title":"Day 6 : Dong Hoi motorbike tour to Khe Sanh (Quang Tr","description":"We strike south through foothills which were once sprayed heavily by Agent Orange towards the former DMZ. There is still much evidence of bombing on the mountain sides and from time to time we will see remnants of the original Trail. We take in the Vinh Moc tunnel, the famous Hien Luong Bridge (former demarcation line between North and South Vietnam, the Truong Son Cemetery and finally Khe Sanh (former US Marine base).\nOvernight in Khe Sanh.\n\nSummary"},{"title":"Day 7 : Khe Sanh motorbike tour to Hue (Thua Thien Hue)","description":"In the morning we head south over the Da Krong Bridge (built by the Cubans in 1973) into the infamous A Shau valley, an area of intense wartime activity. Passing Hamburger Hill and mountains still barren due to the extended effects of Agent Orange, we arrive at A Luoi, where there are many Bru Van hill tribe people. Then, cruising through green back country down the steep Me Oi Pass, we continue on to the beautiful city of Hue which lies along the banks of the Perfume River.\nOvernight in Hue.\n\nSummary"},{"title":"Day 8 : Hue motorbike tour to Hoi An (Quang Nam)","description":"See the Forbidden Citadel in the morning. Join the National Highway 1 and head up the Hai Van Pass (Cloudy Pass) before the World Heritage site of Hoi An, a major trading centre in SE Asia in the 16th and 17th centuries.\nOvernight in Hoi An.\n\nSummary"},{"title":"Day 9 : Hoi An (relax)","description":"Whole morning exploring the old town of Hoi An. Afternoon at the Cua Dai beach, about 6km from the old town. The former harbour town of the Champa people at the estuary of the Thu Bon river was an important Vietnamese trading centre in the 16th and 17th centuries, where Chinese from various provinces as well as Japanese, Dutch and Indians settled down. During this period of the China trade, the town was called Hai Pho (Seaside Town) in Vietnamese.\n\nDuring the French colonial period (1883 – 1945), it was called Faifo. Originally Hai Pho was a divided town, because across the “Japanese Bridge”, it used to be the Japanese settlement (16th – 17th century). The bridge (Chua Cau) is a unique covered structure built by the Japanese, the only known covered bridge with a Buddhist pagoda attached to one side.\nThe town is known to the French and Spanish as Faifo, and by similar names in Portuguese and Dutch. A number of theories have been put forth as to the origin of this name. Some scholars have suggested that it comes from the word “Hai pho” meaning “sea town”, while others have said that it seems more likely to simply be a shortening of Hoi An pho, “the town of Hoi An”, to “Hoi pho” which became “Faifo”.\n\nIn 1999, the old town was declared a World Heritage site by UNESCO (the United Nations Educational, Scientific and Cultural Organization) as a well-preserved example of a Southeast Asian trading port of the 15th to 19th centuries, whose buildings display a unique blend of local and foreign influences.\n\nToday, Hoi An is still a small city, but it attracts a fair number of tourists, also being a well established place on the backpacker trail. Many visit for the numerous art and craft shops and tailors, who produce made-to-measure clothes for a fraction of the western price.\n\nSummary\nAccommodation: Hotel in Hoi An\nMeals:   Breakfast"},{"title":"Day 10 : Hoi An motorbike tour to Kon Tum Town","description":"We strike back up to the mountains, rejoining the Trail at Phuoc Son (also known as Kham Duc). From there we head up the towering Lo So Pass, passing through remote areas thinly populated by peoples of the Ba Na ethnicity. Edging close to the border with Laos, where a number of Trail arteries crossed over in Laos, we continue on to Kon Tum. Overnight in Kon Tum.\n\nSummary"},{"title":"Day 11 : Kon Tum motorbike tour to Buon Ma Thuot (Dak Lak","description":"In the morning we motorcycle head south through the Central Highlands, passing Pleiku and the Ia Drang valley battlefield, before continuing onto Buon Ma Thuot (also known as Buon Me Thuot), the city where northern forces launched their final assault on the then Saigon. Buon Ma Thuot produces most and best coffee products in Vietnam. Overnight in Buon Ma Thuot.\n\nSummary"},{"title":"Day 12 : Buon Ma Thuot motorbike tour to Nha Trang City","description":"We take an easy motor ride back down off the Tay Son highlands towards the coast, arriving at Highway 1 some 30 km north of Nha Trang. Taking in this scenic coastal stretch past turquoise waters and scarlet fishing boats, we arrive in the bright lights of Nha Trang and its relaxing holiday options.Overnight in Nha Trang.\n\nSummary"},{"title":"Day 13 : Nha Trang (relax)","description":"A free day by the beach before gathering for a seafood feast to recount our adventure and toast the Ho Chi Minh Trail.\n\nSummary"},{"title":"Day 14 : Nha Trang motorbike tour to Da Lat Cit","description":"This 150km ride shows you some footages of the famous 2008 BBC’s Top Gear Vietnam Special show. Mountainous motor ride on the Central Highland. Da Lat is known as “The City of Love” and is a favorite holiday resort for Vietnamese as well as the French. With evergreen forests, waterfalls, beautiful lakes, the country’s best flower gardens, and delicious fresh produce, Da Lat has always provided a welcome respite from the heat of the lowlands.\n\nWe can spend the day visiting the highlights of Da Lat – its gardens, cathedral, waterfalls, market, Valley of Love, convent, university, train station and key pagodas. Overnight in Da Lat for the second night.\n\nSummary"},{"title":"Day 15 : Da Lat motorbike tour to Cat Tien National Park","description":"Down on road 20, we ride to Cat Tien National Park. This forest area used to be the head quarter of Vietnamese army during the war. The park suffered historically during the Vietnam War when it was extensively sprayed with herbicides like the defoliant Agent Orange. To this day these areas have extensive bamboo and grassland cover and trees have not yet grown back.\n\nSummary"},{"title":"Day 16 : Cat Tien motorbike tour to Saigon","description":"This is not so long but is a big day as traffic is very crazy when we enter Saigon (HCM City). We ride straight to the train station where we end the ride. If you need information about places to stay and/or to eat, our guide will be able to recommend some.\n\nSummary"}]}]