[{"name":"Pure Nothern Vietnam","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":359,"summary":"LUXURY NORTHEN VIETNAM  TOUR WITH VIETNAM PURE TRAVEL","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140620_32123907.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140620_32123907.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140620_4356d3e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140620_85843031.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140620_8e900866.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140620_aae18283.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi arrival","description":"Arrive Hanoi and check in Hotel located in Hanoi center – get welcome drink when check in hotel. In the afternoon free and easy\n\nAccommodation: Overnight in hotel in Ha Noi\nMeals: No\n"},{"title":"Day 2: Hanoi – Halong – Bai Tu Long bay – Huong Hai Sealife Cruise","description":"7.30-08.10: Depart from Hanoi to Halong bay by shuttle van (optional).\n11.30: Upon arrival at Vinashin TouristHarbor, You are welcomed at our waiting room before enjoying the cruise.\n12.15-12.30: Embark on Huong Hai Sealife. Enjoy welcome drink as Cruise Manager gives you a brief overview of the itinerary and important safety guideline. Check in your cabin.\n13.00: Start sailing among famous Islets (Indochina studio, Am Islet…) of Bai Tu Long Bay, the wildest beauty with the panoramic natural views.\nAdmire the grace of the bay while enjoying the delicious lunch in the restaurant at the first deck.\n14.30: Explore the well-hidden Co Cave (known as ThienCanh Son Cave). Enjoy relaxing on white sandy beach, walking along the beach or swimming at Hon Co Island.\n15.45: Return to Huong Hai Sealifeand enjoy Happy hour. You will have30%discount off from the special menu drinks including of cocktail, mocktail and mixed drinks (from 16.30 pm to 19.00 pm.).\nTreasure the wonderful beauty of Bai Tu Long Bay at sunset, admire the striking islands and islets, savor the fresh and peaceful atmosphere which could hardly be found in landWhile cruising to Cong Do sleeping area.\n16.30: Enjoy kayaking at Cong Do or relaxing on the cruise.\n18.00: Onboard the vessel, surrounded by a stunning setting in motion, attend our chef’s cooking demonstration and try your skills in the art of traditional Vietnamese cooking (spring roll).\n19.15: Dinner is served in the restaurant at the first desk. You can enjoy the charm of Bai Tu Long Bay at night.\n21.00: Evening activities: relax at leisure; enjoy our Movie Night, Board Games or our Massage & Spa services (massage and spa fee is not included in the price), squid fishing.\n\nAccommodation: Overnight on Huong Hai Sealife cruise – 5 stars cruise\nMeals: Breakfast, Lunch, Dinner\n"},{"title":"Day 3: Ha Long Bay: Halong – Bai Tu Long bay – Hanoi – Check in Hotel","description":"6.30: Welcome a new day with an amazing dawn on Bai Tu Long Bay. Refresh your body and soul with a Tai-chi session on the sundeck.\n7.00: Catch the morning view of seascap while enjoying the breakfast with cookies and tea, café in the restaurant.\n7.30: Visit VungVieng village.\n8.30: Return to Huong Hai Sealife.\n9.15: Packup the luggage and check out of the cabin.\n9.30-10.40: Enjoy the brunchin the restaurant while cruisingback to Vinashintourist harbor.\n11.00: Disembark from Huong Hai Sealife.\n12.00: Your driver takes you back to Hanoi.\n16h00-16h30: Arrival Hanoi.\n\nAccommodation: Overnight in hotel in Ha Noi\nMeals: Breakfast,Lunch\n"},{"title":"Day 4: Ninh Binh City: Hoa Lu - Tam Coc day trip","description":"07:45: Picking up from your Hotel in Hanoi old quarter.\n08:15: Starting drive to Ninh Binh Province\n10:00: Arriving at Hoa Lu Ancient Capital\n10:15: Visiting King Dinh and King Le’s temples.\n11:30: Arriving in Tam Coc Wharf.\n11:45: Having buffet lunch with Vietnamese Cuisine.\n13:00: Getting on Sampan boats through caves and visiting countryside landscape\n15:00: Back to Tam Coc Wharf to chill out.\n15:15: Biking on country road around the village\n16:00: Getting on shuttle bus to go back to Hanoi\n18:30: Our guide says goodbye to you at your hotel.\n\nAccommodation: Overnight in hotel in Ha Noi\nMeals: Breakfast, Lunch\n"},{"title":"Day 5: Hanoi departure","description":"Breakfast at the hotel, You have free time the car come to pick you up to the airport. \n\nTrip ends.\n"}]},{"name":"Authentic Vietnam 21 days 20 nights","duration":21,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2582,"summary":"This tour allows you to experience the full range of culture in Vietnam from the ethnic minority communities to the modern cities and the everything in between. One of the best ways to learn about the traditions of Vietnam is to travel around the north where you will be met with breath-taking scenery and fascinating local culture. From here you will travel south taking in the best bits of Vietnam along the way and beaches wild island. This tour is excellent for visiting the World Heritages Sites of Vietnam!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186419_0a223ebb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186419_0a223ebb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_3062aa1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d1d2e8e8f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d3d16c4e3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_8bc315b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_c214bfc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_d2a3366d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d39f5deed7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d1d2e8e8f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_b6093991.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d39f5deeda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_d9e36802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d213c2df95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_aeee03c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_9f11d3c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_6468f643.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d3d16c4e69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_07de538e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5c017901.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5db95834.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_5e3d3d16c4e7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_bcc2a0a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186419_6b924754.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City","Can Tho","Phu Quoc Island"],"timeline":[{"title":"Day 1: Hanoi Arrival (-)","description":"You will be met at Noi Bai Airport by our guide and driver, and taken on a short thirty-minute journey into Hanoi to check in to your hotel. The evening will be yours to explore the city at your leisure, followed by a relaxing overnight stay at your hotel."},{"title":"Day 2: Hanoi city tour – Sapa (B/L)","description":"Your full day tour of Vietnam's capital, Hanoi. First, you will visit Tran Quoc Pagoda, a Buddhist relic and national heritage overlooking West Lake. You will then move onto the Ho Chi Minh Complex, a site of significant historical and cultural importance. Here you will visit the Ho Chi Minh Mausoleum, the Presidents Palace and Ho Chi Minh’s House in which President Ho Chi Minh lived until his passing.\n\nAfter visiting the Ho Chi Minh Mausoleum, you will continue to the Ho Chi Minh museum, which documents President Ho Chi Minh’s life and revolutionary career. After a short trip to the museum, you will visit the unique One Pillar Pagoda, which lies in the campus of the complex.\nYou will stop for lunch at around 11:45 in a local restaurant where you can enjoy some classic Vietnamese cuisine.\nAfter lunch, you will visit Van Mieu – Quoc Tu Giam (The Temple of Literature), the first Imperial University in Vietnam which was built in 1070.\nAt approximately 15:00 you will leave the Temple of Literature for Ngoc Son Temple which sits on an island in the middle of Hoan Kiem Lake. Here you take a moment of calm from the busy streets and learn about the legend of the turtle in the lake.\nThe tour will end at around 16:00 then we find down a local restaurant before you will then have a few hours relaxing in the evening before taking the night train to Lao Cai station."},{"title":"Day 3: Trekking in Sapa (B/L/D)","description":"Arriving at Lao Cai Railway Station around 05:30 am, you will be welcomed by our guide and driver who will take you to Sapa town. After breakfast in a local restaurant, you will set out on a trek down to Lao Chai village to visit a settlement of the Black H'mong ethnic people with a picnic lunch along the way. Moving on from here through the valley, the next stop will be at Ta Van village, home to Dzay ethnic minority people who are said to be some of the friendliest in the area. Pressing on again to Giang Ta Chai village of Red Dzao tribe, you will get the chance to see amazing scenery and a beautiful waterfall. Stay overnight in a homestay of Zay ethnic people."},{"title":"Day 4: Sapa – Bac Ha – Ha Giang (B/L/D)","description":"After breakfast in Sapa, you will leave for Bac Ha to join the Sunday Market with local people (if Sunday). Bac Ha is very photogenic and is considered one of the most wonderful and colourful markets in the far north of Vietnam. Here thousands of local people in their traditional attire buy and sell products from the area including everything from handmade textiles to live animals. In the afternoon, we will take a pleasant walk to Ban Pho village, home to the Flower H'mong people. This is a great opportunity to interact with the friendly locals and take a pleasant walk amongst tribal villages. You will leave Bac Ha Town at 15:00 for driving to Ha Giang, tonight we have dinner and overnight at homestay of Tay ethnic people."},{"title":"Day 5: Ha Giang – Dong Van (B/L)","description":"Today you will encounter some spectacular landscapes. After acquiring a mandatory permit at the Immigration Office, you will begin your journey to Dong Van across a series of long passes. You will have lunch en route in the small but beautiful mountain town of Tam Son. Then, you will head to the majestic King of the H’mong’s Palace, a fortress built by a local chief, Vuong Chin Duc, who was allied with the French against the Viet Minh. The palace, built in the early 1900s was designed in the ancient Chinese architectural style of the Man Qing era. It was made from materials such as solid stone, wood and terracotta tiles. After continuing your journey, you will arrive at Hoa Cuong Hotel around 17:00 in time for dinner and an overnight stay in a hotel."},{"title":"Day 6: Dong Van – Bao Lac (B/L/D)","description":"Your morning will start with a visit to the market of Dong Van (Sunday morning), where the locals shop before returning to their mountain hamlets. You will then climb a pass up to the French Fortress of Pu Lo, built in 1890 and evacuated in 1945, from which you enjoy a spectacular view of the entire region.\nThe road climbs 15 km up to the top of the Ma Pi Leng Pass, through a unique landscape of craggy limestone peaks and gaping valleys. You will descend into Meo Vac Valley to the village of Bao Lac, where you will have lunch. You will then take the mountain road to Bao Lac, overnight at hotel."},{"title":"Day 7: Bao Lac – Ba Be Lake (B/L/D)","description":"From Bao Lac, we take a trip to visit Lo Lo village. The Black Lolo (also know as the Lolo Den and Lolo Noir) reside high in the mountains surrounding the small town of Bao Lac in Cao Bang province. The Black Lolo are identifiable by the black cultural clothes they wear from which their name derives. Drive to Ba Be from Cao Bang. We will share our secret route with you, a gorgeous small road snaking through the mountains to the Tay village of Cho Ra and then down to the Tay village of Coc Toc, where you will be welcomed by Mr Linh and his amazingly friendly Tay family in their traditional stilt house. If it’s hot, you can copy the local kids and jump into the inviting waters of Ba Be lake. You will enjoy a superb dinner  at your  homestay on the river terrace."},{"title":"Day 8: Ba Be Lake – Ban Gioc Waterfall (B/L/D)","description":"After breakfast, we will depart for Cao Bằng, close to Vietnam’s northern border with China. You will be introduced to the Nung people in the village of Phuoc Sen, a small settlement famous for the production of farming tools. Like the Tays, the Nungs largely live by farming the terraced rice paddies that you will see all around as you travel to Ban Gioc Waterfall, the majestic falls that demarcate the border between Vietnam and China. Spend some time at leisure relaxing and taking souvenir photos as you soak up the sublime atmosphere of Vietnam’s most beautiful waterfall. You will Visit Nguom Ngao “Tiger Cave” before returning to Cao Bang town for overnight in Hotel."},{"title":"Day 9: Cao Bang – Halong Bay (B/L)","description":"After a four hour drive from Cao Bang to Lang Son then Halong Bay. Upon arrival, you will embark on a boat where you can take in the magnificent surroundings and enjoy a delicious Vietnamese lunch.\n\nOption 1: You can discover the unique lifestyle of the community living the floating fishing village of Vung Vieng. You will take a bamboo row boat to explore the village which sits in a picturesque location in a lagoon at the foot of the jungle-clad mountains.\n\nOption 2: You can explore the remote and idyllic Ban Chan Beach with a chance to swim in the clear inviting waters and have a go at bamboo boating amongst the islands.\nAt around 16:30, you will return to the cruise to freshen up. You can then enjoy the sun setting lazily over the bay with happy hour in the bar from 17:30-19:00. There will also be an onboard cooking demonstration with the chef. Dinner will be served from 19:00. After dinner, you are free to enjoy your night socialising with other guests, trying night squid fishing or simply relaxing. Entertainment such as karaoke and dancing are available for your enjoyment until 22:00."},{"title":"Day 10: Halong Bay – Ninh Binh (B/L)","description":"As the sun rises over the bay, reflecting on the calm water, you can enjoy a gentle Tai-chi session on the sundeck from 06:30 to 07:00. Breakfast will be served from 07:00 to 09:00 as you cruise past the stunning seascapes towards Thien Canh Son Cave. You will have time to explore the fascinating rock formations inside the beautifully lit cavern. You will check out of your cabin between 09:30 and 10:00 (luggage can be delivered to the reception area). You will begin the cruise back to the harbour, taking in the immense beauty of the bay as you enjoy an early lunch on board."},{"title":"Day 11: Ninh Binh – Hue (B/L)","description":"The site of the first capital city of ancient Vietnam before Hanoi took its leading role in the 11th century. The area features lots of well-known scenery, and we include a boat trip in Van Long and a visit to Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in the 10th century. The visit in Ninh Binh starts with a boat trip in Van Long where spectacular limestone karsts jut out from the green paddy fields reminding us about Guilin (China) and Halong Bay of Vietnam. Further discovery in Ninh Binh will be continued on the site that used to be the King’s palace in the 10th century and is now famous for the wooden reliefs of the shady Dinh and Le temples. After this exciting day of sightseeing, we will go catch a night train to Hue."},{"title":"Day 12: Hue city (B/L)","description":"Pick up in Hue, we will have a full day city tour around Hue. Being recognised by UNESCO as the 1st Cultural World Heritage for Vietnam, Hue is highlighted by the old royal architecture and the traditional Vietnamese lifestyle. We will discover the charm of the city from the Royal Citadel, Forbidden City, Hue Royal Museum and Dong Ba bustling market. After lunch in a garden-house restaurant in “Hue” style, you will go on to Thien Mu pagoda and visit the Tombs of King Minh Mang and Tu Duc – two of the best-preserved monuments of the Nguyen Emperors since the early 19th and early 20th centuries. After this, you will have the evening to enjoy as you please and you will stay overnight in Hue."},{"title":"Day 13: Hue – Da Nang – Hoi An (B/L)","description":"Today, you will journey south past the Hai Van Pass and Lang Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, we will visit the Cham Museum, which features a fine collection of open-air sandstone carvings. Stopping at My Khe Beach, made famous in the American TV series of the same name, you will see how it stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hills - once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Arriving that evening in Hoi An Town, we will check into a hotel to spend the night."},{"title":"Day 14: Hoi An Excursion (B/L)","description":"Enjoy a full-day excursion to Hoi An, a major trading centre, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the centre, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflect the influences of Chinese and Japanese styles. We will also stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, we will take a boat trip on the Thu Bon River to Kim Bong Village on Cam Kim Island to see the woodworkers and shipbuilding families. Returning to your haven on world-famous \"Cua Dai Beach,\" you will have the evening to spend at your leisure, staying the night again in Hoi An."},{"title":"Day 15: Da Nang – Nha Trang (B/L)","description":"After breakfast, your driver will pick up and transfer you to Da Nang Airport for a short flight to Nha Trang where 10km of white sandy beach awaits. For the rest of that day, you will be free to relax and spend some time as you wish (should you want to be a little adventurous at this stage, please contact us for optional excursions that can be arranged such as boat trips, village excursions or Cyclo rides etc.)."},{"title":"Day 16: Nha Trang – Ho Chi Minh city (B/L)","description":"Free and easy in Nha Trang with beaches until we take a flight to Ho Chi Minh city in the afternoon."},{"title":"Day 17: Ho Chi Minh city (B)","description":"Enjoy a full day tour Saigon’s diverse attractions. Start with a visit to Saigon’s China Town, then learn about traditional Vietnamese medicine at the FITO Museum, before browsing through the amazing array of goods at Ben Thanh Market. Stop for lunch then continue on the city tour with a visit to the War Remnants Museum and former Presidential Palace. Conclude the day exploring the city’s French colonial architecture, stopping at the Notre Dame Cathedral and the City’s Post Office."},{"title":"Day 18: Ho Chi Minh City – Mekong Delta (B/L)","description":"The day will start with a drive to the Mekong Delta Region, where you will enjoy a 4-hour boat trip and rowing boat trip through small canals to visit An Binh island. We will have a short walk around the village, visiting some local workshops, a coconut factory and ancient house, then lunch will be served at a local garden restaurant. The boat trip then continues to Vinh Long, from where you will drive to Can Tho. You will be free for the night to discover Can Tho at your leisure."},{"title":"Day 19: Can Tho – Phu Quoc Island (B/L)","description":"Start in early morning to visit Can Tho floating market then drive to Can Tho airport to take a flight at 11:50 to Phu Quoc Island. \nThe floating markets are unarguably the biggest attraction of Can Tho with their unique charm atmosphere attracting hoards of visitors each year. With Can Tho being the largest city in the Mekong Delta, there are a number of different markets to choose from. Daily tours run from the main town to the trading flotillas, picking passengers up at the break of day to catch the main action. The markets are a great place to sample the fresh local produce or watch the friendly to and fro of the vendors as they bob down the river."},{"title":"Day 20: Phu Quoc Island (B/L)","description":"Phu Quoc Island is an idyllic vision of sandy beaches, thick jungle, and clear blue waters. It has undergone many transformations from an undisturbed island with a population of fewer than 1000 people to a topic of contention and fighting between countries and now a quintessential Vietnamese holiday destination.\n\nPhu Quoc is the largest island in Vietnam and stretches 50 km from north to south and is 25 km at its widest part. A large mountain range runs along the length of the island, reaching 603 meters at its highest point. Free and easy on beaches!"},{"title":"Day 21: Phu Quoc - Ho Chi Minh City Departure (B/L)","description":"Free and easy until we take a flight to Ho Chi Minh city. And here, it is your next departure!"}]},{"name":"Vietnam in a week -7 days northen Vietnam","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":429,"summary":"VPT 005: Northen Vietnam for 7days","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140624_27b35989.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140624_27b35989.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_200bfe61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_8f8cd586.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_c077b00f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_f684feae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_8a1b1d86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_550bdb8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_7d696a00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_d7214042.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_4538f0e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_e69cb4cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140624_db2b6546.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi arrival","description":"Fly to Hanoi. Upon arrival, our driver will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in.  At 17h00 our tour guide will come to your hotel to pick you up for the street food tour.  Overnight in Hanoi. Meals: Dinner Accommodation: Hotel in Hanoi"},{"title":"Day 2: Halong Bay - Vspirit cruise 3 stars","description":"08h00 – 08h30 Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n\n12h30 – 13h00 Embark on V’Spirit Classic Cruise followed by a short cruise briefing.\n\n13h30 – 14h30 Savor a delectable lunch as V’Spirit Classic cruises among the limestone islands.\n\n15h00 – 16h00 Explore the amazing Sung Sot Cave - the most beautiful cave in Halong Bay.\n\n16h00 – 17h00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n\n17h00 – 17h30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n\n17h30 – 19h00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n\n19h00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\n\nMeals: Breakfast, Lunch,Dinner\nAccommodation: Overnight on the cruise\n"},{"title":"Day 3: Halong Bay - Hanoi","description":"06h30 – 07h15 Start your day with Tai Chi exercises or a photo hunt.\n\n07h30 – 08h30  Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n\n09h00 – 10h00 Kayak around the Luon Cave.\n\n10h15 Return to the boat. Freshen up and check out of your cabin.\n\n10h15 – 11h00 Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n\n11h00 – 12h15 While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n\n12h15 – 12h30 Disembark V’Spirit Classic.\n\n12h30 – 13h00 Transfer back to Hanoi.\n\nTrip finishes at around 17h00.\n\nMeals: Breakfast, Lunch.\nAccommodation: Overnight in Hanoi\n"},{"title":"Day 4: Sapa - Cat Cat village","description":"06:30 – 7.00: Pick up from the hotel, get on big bus and depart for Sapa\n\n13.00: Arrive Sapa Town with colorful traditional costumes of H'mong, Dzao, Tay ethnic People.\n\nThe tour guide will be waiting for you at Bus station. Then, please follow the guide to go to hotel\n\n• Welcome drink and itinerary briefing\n\n• Enjoy the lunch with local Vietnamese dishes, check-in procedures\n\n14.30: A short trek to the gate of Cat Cat village which is home of Black H'mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\n\nTrekking distance is about 4-5 kms/Duration: ~2hours \n\n17.00: Come back to Sapa Town.\n\nHave dinner         \n\nMeals: Breakfast, Lunch,Dinner\nAccommodation: Overnight in Hotel in Sapa\n"},{"title":"Day 5: Sapa - Y Linh Ho - Lao Chai - Ta Van - Bus back to Hanoi","description":"06:30 – 7.00: Pick up from the hotel, get on big bus and depart for Sapa\n\n13.00: Arrive Sapa Town with colorful traditional costumes of H'mong, Dzao, Tay ethnic People.\n\nThe tour guide will be waiting for you at Bus station. Then, please follow the guide to go to hotel\n\n• Welcome drink and itinerary briefing\n\n• Enjoy the lunch with local Vietnamese dishes, check-in procedures\n\n14.30: A short trek to the gate of Cat Cat village which is home of Black H'mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\n\nTrekking distance is about 4-5 kms/Duration: ~2hours \n\n17.00: Come back to Sapa Town.\n\nHave dinner         \n\nMeals: Breakfast, Lunch,Dinner\nAccommodation: Overnight in Hotel in Sapa\n\nDay 5: Sapa -Y Linh Ho - Lao Chai - Ta Van – Bus back to Hanoi \n\nHave breakfast at hotel and prepare light pack for trekking\n\n9.30: Trek from Sapa to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain.\n\n12.30: Picnic lunch at Lao Chai Village\n\n13.30: Heading to Ta Van village - home of Dzay ethnic people.\n\n14.30: Bus picks you up at Ta Van Bridge to Sapa.\n\n15.00-15:30: The tour guide will take you to the bus stop\n\n21.00 – 21.30: Arrive in Ha Noi.\n\nTrekking Length: 8-10 km/Duration: ~4hours \n\n Meals: Breakfast, Lunch\nAccommodation: Overnight in Hotel in Hanoi\n"},{"title":"Day 6: Hanoi Free and easy","description":"Free and easy for shopping and discover Hanoi City tour by yourself. .\n\n Meals: Breakfast\nAccommodation: Overnight Hotel in Hanoi\n"},{"title":"Day 7: Hanoi deaprture","description":"Breakfast at the hotel then free and easy. \nWait until our driver come and pick you to the airport \nTrip ends.\n"}]},{"name":"Best of Vietnam for Teenagers - 9 days (including Cam Thanh)","duration":9,"travelStyle":["In-depth Cultural","Adventure","Family","Group","Fully Guided"],"oldPrice":0,"price":1495,"summary":"VIETNAM FAMILY TOUR (for children aged 12 years and above): Travel with all the family from Hanoi to Ho Chi Minh City, taking in the highlights of Vietnam en route. Enjoy a cyclo ride in Hanoi and sail around the limestone peaks of spectacular Halong Bay. Explore Hue's Imperial Citadel and enjoy R&R in enchanting Hoi An. Cycle into the countryside to Cam Thanh Farm, discover the highlights Ho Chi Minh City and more on this exciting 9 day tour.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/181651_0af3ea87.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/181651_0af3ea87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_45ad65dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_bf84c643.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_6a9317d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_07917ff1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_ad210bc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_3f74108c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_5d02849b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_89adc9c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_9ed2bfde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_c97d2c9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181651_c43495ee.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Wednesday. Welcome to Hanoi and the start of your holiday. Transfer from Hanoi airport to the hotel for check-in is included. The rest of the day is free for you and your family to explore the city, which is easily accessible by foot. At 6pm there will be a Welcome Meeting in the hotel lobby. "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. This morning drive to beautiful Halong Bay. Boarding a deluxe junk boat we cruise the emerald waters. Later we visit spectacular Trinh Nu Cave and there's the opportunity to swim and kayak. Tonight, there's a Vietnamese cooking demonstration and seafood dinner."},{"title":"Day 3: Halong Bay","description":"Halong Bay - Hanoi - Hue. Start the day with a Tai Chi class on the sundeck before exploring the beautiful Sung Sot cave en route back to port. Arriving back into Hanoi mid afternoon we embark on a cyclo tour of the ‘36 streets of the old quarter’. Later, board an overnight sleeper train to Hue (alternatively there is a flight upgrade available). "},{"title":"Day 4: Hue","description":"We have breakfast on the train before arriving into the imperial city of Hue. Today we take in the highlights of this historic city on a guided tour, where highlights include the Thien Mu Pagoda and the Citadel, which is home to the spectacular Imperial Purple Palace. After our tour we enjoy a leisurely cruise along the Perfume River, en route to our hotel."},{"title":"Day 5: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. We take the scenic Hai Van Pass (Road of the Ocean Clouds), to the port of Hoi An, stopping for a stroll along China Beach. Enjoy a short afternoon walking tour of the historic old town, a UNESCO World Heritage Site."},{"title":"Day 6: Hoi An","description":"For a taste of rural life, today we take a bicycle ride out of Hoi An to Cam Thanh Farm, where we'll learn about traditional farming practices. Enjoy a hands-on day family day, tending to the fields and gardens, before a lesson in preparing tasty traditional Vietnamese cuisine for our lunch. Then we cycle to a bamboo workshop where we can make our own bamboo product with an local craftsman. "},{"title":"Day 7: Hoi An","description":"Today is free for you to spend as you choose - relax or sightsee further."},{"title":"Day 8: Ho Chi Minh City","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City, once called the 'Pearl of the Orient'. Here we take in some of the city's most famous landmarks on a walking tour including the Notre Dame Cathedral and the Old Post Office, before visiting the sobering War Remnants Museum. "},{"title":"Day 9: Ho Chi Minh City","description":"Thursday. Our tour comes to an end today, with a departure transfer to the airport. If you have time, consider shopping for souvenirs at the Ben Thanh Market or visiting the grand Independence Palace. You can also opt to extend your stay for a night and visit the Vietcong's remarkable Cu Chi Tunnels."}]},{"name":"Best of Vietnam for Teenagers 2020 - 9 days","duration":9,"travelStyle":["In-depth Cultural","Group","Fully Guided"],"oldPrice":0,"price":1495,"summary":"VIETNAM FAMILY TOUR (for children aged 12 years and above): Travel with all the family from Hanoi to Ho Chi Minh City, taking in the highlights of Vietnam en route. Enjoy a cyclo ride in Hanoi and sail around the limestone peaks of spectacular Halong Bay. Explore Hue's Imperial Citadel and enjoy R&R in enchanting Hoi An. Cycle into the countryside to Cam Thanh Farm, discover the highlights Ho Chi Minh City and more on this exciting 9 day tour.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/181549_60bcbb1e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/181549_60bcbb1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_3974f7c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_2ba5d16d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_7f893e97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_2672fbc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_aac85bb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_bfc32f34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/181549_30e00704.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Wednesday. Welcome to Hanoi and the start of your holiday. Transfer from Hanoi airport to the hotel for check-in is included. The rest of the day is free for you and your family to explore the city, which is easily accessible by foot. At 6pm there will be a Welcome Meeting in the hotel lobby. "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. This morning drive to beautiful Halong Bay. Boarding a deluxe junk boat we cruise the emerald waters. Later we visit spectacular Trinh Nu Cave and there's the opportunity to swim and kayak. Tonight, there's a Vietnamese cooking demonstration and seafood dinner."},{"title":"Day 3: Halong Bay","description":"Halong Bay - Hanoi - Hue. Start the day with a Tai Chi class on the sundeck before exploring the beautiful Sung Sot cave en route back to port. Arriving back into Hanoi mid afternoon we embark on a cyclo tour of the ‘36 streets of the old quarter’. Later, board an overnight sleeper train to Hue (alternatively there is a flight upgrade available). "},{"title":"Day 4: Hue","description":"We have breakfast on the train before arriving into the imperial city of Hue. Today we take in the highlights of this historic city on a guided tour, where highlights include the Thien Mu Pagoda and the Citadel, which is home to the spectacular Imperial Purple Palace. After our tour we enjoy a leisurely cruise along the Perfume River, en route to our hotel."},{"title":"Day 5: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. We take the scenic Hai Van Pass (Road of the Ocean Clouds), to the port of Hoi An, stopping for a stroll along China Beach. Enjoy a short afternoon walking tour of the historic old town, a UNESCO World Heritage Site."},{"title":"Day 6: Hoi An","description":"For a taste of rural life, today we take a bicycle ride out of Hoi An to Cam Thanh Farm, where we'll learn about traditional farming practices. Enjoy a hands-on day family day, tending to the fields and gardens, before a lesson in preparing tasty traditional Vietnamese cuisine for our lunch. Then we cycle to a bamboo workshop where we can make our own bamboo product with an local craftsman. "},{"title":"Day 7: Hoi An","description":"Today is free for you to spend as you choose - relax or sightsee further."},{"title":"Day 8: Ho Chi Minh City","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City, once called the 'Pearl of the Orient'. Here we take in some of the city's most famous landmarks on a walking tour including the Notre Dame Cathedral and the Old Post Office, before visiting the sobering War Remnants Museum. "},{"title":"Day 9: Ho Chi Minh City","description":"Thursday. Our tour comes to an end today, with a departure transfer to the airport. If you have time, consider shopping for souvenirs at the Ben Thanh Market or visiting the grand Independence Palace. You can also opt to extend your stay for a night and visit the Vietcong's remarkable Cu Chi Tunnels."}]},{"name":"North - West Vietnam adventure 6 days 5 nights","duration":6,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":395,"summary":"This North - West Vietnam tour is a great adventure due to the condition of the road, in contrast, there are plenty of beautiful landscapes; waterfalls; villages of tribal peoples . You have more chance to see the lives of minority peoples in mountainous areas of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/30386_88e59be5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/30386_88e59be5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_4468877e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_b07d6bf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_dc0a7f2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_dd26824c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_cec0847a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_ad754b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_261fb479.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30386_73b53e91.jpg"],"destinations":["Hanoi","Mai Chau","Sapa"],"timeline":[{"title":"Day 1 (L,D): Hanoi - Mai Chau (140km) Homestay.","description":"Drive from Hanoi to Mai Chau (3.5hours). Lunch in the village of the Thai people. Afternoon, small walk around the Lac village, dinner, overnight in Thai stilt-house."},{"title":"Day 2 (B,L,D): Mai Chau - Son La (190km).","description":"Breakfast. Drive to Son La. Stop sometimes on the way for photos. Lunch on the way. Afternoon, visit the Son La French Prison and Museum. Dinner and overnight in hotel in Son La."},{"title":"Day 3 (B,L,D): Son La – Dien Bien Phu. (150km).","description":"Leave Son La to Dien Bien Phu. Lunch on the way. Visit Dien Bien Phu battle field, headquarter of general Christian de Caterris, old French tanks and museum of Dien Bien Phu. Dinner and overnight in Dien Bien Phu."},{"title":"Day 4 (B,L,): Dien Bien Phu – Sapa (270km).","description":"Drive to Sapa. Lunch in Lai Chau. On the way visit some villages, take pictures. Have dinner yourself. Overnight in hotel in Sapa."},{"title":"Day 5 (B,L,D): Sapa Trekking - Homestay.","description":"Walk down through the villages of Lao Chai and Ta Van. The trekking route offers some challenge as you balance on the rice terraces and a small trail on the steep mountainside. The vegetation is dense as the trail leads up to a peaceful village perched on the Hoang Lien mountainside, relax by a local stream for a picnic lunch. Dinner and overnight at homestay at Ta Van village."},{"title":"Day 6 (B,L): Sapa – Hanoi (380km)","description":"After breakfast at the Village, drive back to Hanoi, stop some where you like on the way back for photos. Arrive Hanoi at about 5pm."}]}]