[{"name":"Highlight Vietnam Tour 11 Days/10 Nights","duration":11,"travelStyle":["Discovery","Family","Custom","Group","Fully Guided","Holiday"],"oldPrice":1559,"price":780,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter.\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nDanang - Hoi An: See ancient sculpture in the Cham Museum, and tour Buddhist cave temples in the Marble Mountains. A walking tour through the UNESCO listed Old Quarter; Countryside bike ride, visit an old merchant house, the Hoi An Museum, and a Chinese assembly hall.\nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76133_4a732bb0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76133_4a732bb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_5ee52a2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_cc074bd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_f2d1943f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_94eb8fc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a9cd7c8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_716fb12a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a6b42c6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_56b29ae8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_5831bac7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_3388b299.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_783660cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_8f70bc42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_164f569b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_793e67f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_9d36e633.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_9c4cbb8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_7918afaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_50ca4b70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_6e9297e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_3280d51c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_a3e19924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_94040ba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76133_521dba61.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi\nPomihoa Hotel Hanoi or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a shower and walk around the Old Quarter until transfer to Railway Station to catch the train to Da Nang City. Overnight on the Train (4 Berth Cabin sleeper sharing cabin)"},{"title":"Day 7: Arrive Danang - transfer to Hoi An (No Meal today)","description":"Spend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30am! You`ll prepare the breakfast by your own because train doesn`t serve breakfast included in the ticket. Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. Check in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An..\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 8: Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous \"Cua Dai Beach,\" with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 9: Depart Hoi An for Ho Chi Minh City Sightseeing. (B, L)","description":"Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 10: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Saigon.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 11: Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. Finish your Vietnam trip arranged by Legend Travel Group. We`ll arrange the transfer for you from hotel to Airport. Trip ends at the airport. Good bye and see you again!\nAirport Transfer is included!"}]},{"name":"Vietnam 7-day Sweet Honeymoon","duration":7,"travelStyle":["Other","Honeymoon","Group","Partially Guided","Holiday"],"oldPrice":0,"price":639,"summary":"Start and end in Hanoi! With the discovery tour Vietnam 7-day Honeymoon, you have a 7 day tour package taking you through Hanoi, Vietnam and 2 other destinations in Vietnam. Vietnam 7-day Honeymoons is a private tour that includes accommodation in a hotel as well as meals, transport and more. This package will be a good choice for couple who want to spend honeymoon in Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150935_e03355cf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150935_e03355cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_e6efe887.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_9b349c01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_23e00587.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_284ed34e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_6a229bf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_d593abdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_bc916361.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_c3d02896.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_e3122b8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_6240daef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_92c3c254.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_28b38c8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_278dcf32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_65dcc910.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_8aa6fa9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_106d2034.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_76f83392.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_d36dd43c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_f50ddcee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_739e2524.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_a127107b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150935_3eb1fc56.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrive in Hanoi- Check in hotel","description":"Landing at the Hanoi Airport. Our guide welcomes and pick you up at the airport to your hotel.\nYou will check in hotel and take a rest\nOvernight at 3.5 star hotel like MK Premier Hotel, Hai Bay Hotel or similar\n"},{"title":"Day 2: Hanoi city Private tour by private car- Take a hanoi food tour - Overnight on train to Lao Cai( Breakfast, Lunch)","description":"(Hanoi city  is Private tour, so it is flexible for you and you will be served better)\n- 8:30am: Start a Hanoi city tour by private car\nFirstly, we visit Ho Chi Minh Mausoleum and One Pillar Pagoda which are highlight to understanding more about Ho Chi Minh President, history of Vietnam war and Buddhism culture of Vietnam. . Next we will  go to campus of the first university of Vietnam – Temple of Literature – which was built in 10th century under Ly Dynasty who greatly influenced by Confucianism. The next stop is Tran Quoc Pagoda, the headquarters for the Vietnam Central Buddhist Congregation where many important Vietnamese Buddhism activities are taken place. Going along the Youth Road with two lakes in two sides including West Lake, the biggest lake in Hanoi and Truc Bachlake. \n- 12:15am: Have a lunch\n- 1:00pm: Finish the tour and take come back the hotel.\n- 3:00 pm: Take a Hanoi Walking Street Food tour, our tour guide will meet you at your hotel.\n- 8:00p.m: The local guide in Hanoi pick you up from your hotel about .We will catch the overnight train soft sleeper with AC to Lao Cai. The train leaves at 21.10 - 21.50 from Hanoi railway station. \nOvernight on Train: Chapa Train or similar\n"},{"title":"Day 3: Hanoi - Sapa– Y Linh Ho – Lao Chai – Ta Van –Sapa( Breakfast, Lunch, Dinner)","description":"5.00 - 6.30 Pick up you at Lao cai Transfer to SaPa for breakfast and check in hotel ( if available)\n9.00 – 9h30 Begin 12 km of trekking, visit Y Linh Ho and Lao Chai village of the H’Mong minority. \n13.00 After lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay the our guide will lead you visit some house on stilts of ethnic.Here you have opportunity to experience their daily life, work and original custom, enjoy some green tea and taking with ethnic people.\n14.30 We return to main road Ta Van Village. Where the van will pick you go back the hotel.\n18.00 – 19.30 Enjoy your dinner in our hotel. \nAfter dinner you are free to explore the charm of Sapa by night, enjoy roasted corn, baked eggs beside charcoal fire or go shopping.\nEspecially on Saturday night, we highly recommend a stop at the love market which is one of unique cultures of ethnic minorities (H’mong, Dazo. Int Lao Cai in pacticular and Northwest of Vietnam in general.\n\nStay overnight in Sapa Relax hotel or similar\n"},{"title":"Day 4: Sapa - Fansipan Peak – Ha Noi ( Breakfast, Lunch, Dinner)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery.\n9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos).\n11.00: Come back to Cable Car Station and return to Sapa town, 12.30: Have lunch in the hotel\n13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi.\nOvernight on train like Chapa train or Sapaly train or similar\n"},{"title":"Day 5: Hanoi- Ha Long Bay Pelican Cruise( Breakfast, Lunch, Dinner)","description":"Arrive in Ha Noi at 5.00 am. We rent a small room for you to take a shower and relax until 8a.m. \nThen, you  continue a trip to Ha Long Bay at 8.30 AM\n8.30- 19.30: \nOur mini van will come to pick you up at your hotel in Hanoi centre around 8.30 am. Drive to Halong City.  Enjoy the landscape of the Red River Delta country side.\nStopover at Hai Duong province for refreshment about 30 minutes\nArrive at Tuan Chau island – Take break and welcome drink at Pelican HalongCruise Lounge\nTransfer to Pelican Halong Cruise\nWelcome drink - receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature.\nEnjoy buffet lunch with Vietnamese dishes served while cruising through the bay, passing the most beautiful and quiet areas, such as Incense Burner, Dog Stone Islet, Fighting Cock, Soi Sim beach, Coconut Three Island\nVisiting Tung Sau area, is covered by the leaping rocks, cultured pearl fishery. You can wit yourself the process of the jewel, from culturing to harvesting and sculpting, Moreover, you have a chance to do kayaking based on your preference. Enjoy busy space with pearl maker, you can experience the completion of pearl.\nVisiting the beautiful Ti Top beach for swimming (if the weather permits), Ti Top Beach is especially famous for its fresh atmosphere, clean water, and smooth white sand that create a great ambiance for tourists to relax or passengers can take steps to reach on the top of  Ti Top beach to have a whole panorama view of Halong Bay.\nBack to the boat and free time while sailing to Luon Bo area, and anchor overnight.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)\nAttend the Cooking class on sundeck – How to make Vietnamese spring rolls - traditional Vietnamese food. Then enjoy Happy Hour (Buy one drink-get one free). It is time for chit chat and relaxing. Watch the magnificent sunset over Halong Bay. \n19.30 – 23.00: Dinner – Deluxe Vietnamese  BBQ Set Menu Dinner\nEvening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spending a romantic night on Pelican Halong Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat.\n23.00: End of Program for Day One.\nOvernight on Pelican Cruise\n\n\n"},{"title":"Day 6: Tai chi- Visiting Sung Sot Cave - Relaxing( Breakfast, Lunch)","description":"06.00 – 11.30: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements.\nCoffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape.\nTransfer by tender to Sung Sot Cave. Walk up about 100 steps to the cave entrance. It takes approximately 45 minutes for cave visiting. Visit Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites. Return to the boat by tender. Proper shoes are highly recommended.\nBack to Pelican Halong Cruise. Check out and settle your bill at reception.\nHave a buffet brunch while cruising back to the Tuan Chau Wharf. Relaxing on the sundeck or in the dining room enjoying the bay scenery while approaching the wharf.\nDisembark to Tuan Chau Wharf. Say goodbye  to the crew.\n12.00-15.30: \nStop over the middle to visit a traditional workshop and refreshment about 30 minutes.\nArrive in Hanoi\nEnd of the trip.\nOvernight in 3.5 star Hotel like Hai Bay Hotel, MK premier Hotel.\n"},{"title":"Day 7: Return the Noi Bai airpot and fly back to your home( Breakfast )","description":"-Take a rest in your hotel.\n- Our Private Car will pick you up at your hotel and take you to the airport and say Goodbye. Ends Package tour"}]},{"name":"9 Days in Northern Vietnam","duration":9,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":495,"summary":"Exploring Northern Vietnam in 9 Days will give you an unforgettable memory. Discovering the interesting Hanoi old quarter with 36 streets. Visiting ancient Hoa Lu capital in 10th century. Cycling in the local village and rice fields in the countryside to see the local daily life of local farmer. Taking photo of stunning view in Halong Bay. Trekking on terrace rice fields with breathtaking landscape in Sapa. Experiencing the local Hmong people in mounatainous Sapa. Still have more and more waiting for you exploring. Let’s enjoy!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141811_6d284a1f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141811_6d284a1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_8314e63a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_1b7e629a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_91c601aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_d215fb31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_b212a80f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_ab7fa7ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_cc2d6ffc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_c2902639.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_1bf2eea1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_7049d7fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_0b237521.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_3b728c78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_b0d51949.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_176d0273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_353ece64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_b27e6099.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_c10e5269.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_ca6089f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_48cdc569.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_4cc2618f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_6d8e839f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_fb555e91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141811_56504217.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi city arrival – Hotel check in (Meal: No)","description":"Welcome to Hanoi city. Driver is waiting for you at the airport to transfer you to the hotel in the center.\nCheck in the hotel and free time to take your first step exploring the city.\nOvernight at the hotel in Hanoi.\nPlease Note: Hotel check-in time: 13:00\n"},{"title":"Day 2: Ninh Binh – Hoa Lu ancient capital – Tam Coc Rowing boat – Cycling 1 Day (Meal: B,L)","description":"8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter. \nOvernight at hotel in Hanoi\n"},{"title":"Day 3: Hanoi Street Food Walking Tour (Meal: B,D)","description":"Today, you have free time to visit Hanoi city until 6:00 PM, Your tour guide picks you up from hotel to our meeting point. Star the journey discovering the local foods in Hanoi like street Foodie. Walking through some old streets there, you will discover historical and culture tourist site, visit Heritage House to learn more about Traditional House of Ancient Hanoi. You have chance to enjoy “Bánh Cuốn” from famous local restaurant,  “Bánh Cuốn” (steamed rice rolls) which  is steamed and made from rice flour and filled with a savory ground pork and  ear mushroom mixture. Then stop off at traditional space to try “Che” (sweet gruel)- a very special and famous sweet soup Hanoi old quarter. Then, keep walking to enjoy a bowl of  Pho- taste of  heaven that you could not be anywhere better than Hanoi. Spring roll is very meaningful dish for tourist; many restaurant and company organize cooking class. You will visit Local market to see people show all products, it is really interesting to learn about lifestyle and culture of local people. You will enjoy Bun Cha (Vermicelli with grill pork), an absolute highlight of authentic local culinary you must try as anyone’s the first visit of Hanoi. Then you will savor the real taste of Hanoian at a small corner of Hanoi by drinking a cup of “Bia Hoi”(Fresh beer).  Finally, get the chance to enjoy a very special flavor of the Vietnamese-“Cafe Trung”( egg coffee).\n9:00 pm: Turn back to the hotel. \nOvernight at hotel in Hanoi.\n"},{"title":"Day 4: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)","description":"8:00 – 8:30 am: Meeting your tour guide at the hotel and depart for Halong bay trip. Short break-time on the haft way for relax before reaching Halong Bay. \nVietnamese Lunch will be served after check in the cabin on cruise and cruising through the bay to the center.\nExploring the beauty of Surprising cave – the most beautiful and biggest one in the bay. Leisurely time hiking and swimming on the beach of Titop island.\nGet back the boat for Sunset Party with fresh fruit & local glass wine.\nDinner with delicious local dishes and free evening to feeling Halong Bay.\nOvernight on the cruise\n"},{"title":"Day 5: Halong Bay – Hanoi (Meal:B,L)","description":"You should wake up little early to enjoy the Sunrise in Halong Bay.\nAfter breakfast, doing Kayaking by your own to discovering Halong Bay. \nLearning how to make Vietnamese Spring-roll in Cooking Demonstration on the cruise.\nLunch time while cruising back the harbor.\nGet on the bus back to Hanoi.\n17:00: Arrive the hotel in Hanoi.\nOvernight at hotel in Hanoi city\n"},{"title":"Day 6: Hanoi city Past & Present by your own – Water Puppet Show (Meal:B)","description":"Today, you have the free time to visit Hanoi old quarte by your own. Exploring the local life and culture, custom. Tasting several local foods.\n17:00: Guide will take you to the Water Puppet Theatre for show and come back the hotel by your own.\nOvernight at hotel in Hanoi.\n\n"},{"title":"Day 7: Hanoi – Sapa – Ylinh Ho – Lao Chai – Ta Van village ( Meals: B, L, D )","description":"12km trekking through the terrace fields to homestay.\n06:30 – 07:00: Shuttle bus and tour guide will pick you up at your hotel and transfer you to sleeper bus. Heading to Sapa with short break-time on the half way.\n12:30 pm: Our guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house.\n"},{"title":"Day 8: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":"You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tell your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields.\nGet back to Sapa town by shuttle bus.\nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:30: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi. Shuttle bus will transfer you back to your hotel/stay in Hanoi Old Quarter.\nOvernight at hotel in Hanoi\n"},{"title":"Day 9: Hanoi Departure (Meal: B)","description":"Today, you have free time to relax, shopping the souvenir for your family, until driver transfers you to Hanoi airport for your flight out. Trip ends.\nPlease let us know if you want to extend your trip\nPlease note: If you are Solo traveller booking for Share room, you will stay at Share Dorm Room during the vacation."}]},{"name":"Sapa Wonder and Minority Market","duration":5,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":468,"summary":"5Highlights of Sapa brings most of Sapa’s natural wanders to your holidays. You will enjoy much the natural beauty and magnificent landscapes while paying visit to Sapa’s most beautiful valleys, meeting 4 tribal peoples, witnessing unique ways of life. For your 5th day of the trip, one of the tribal traditional markets in the region such as Bac Ha, Coc Ly, Muong Hum…will add more color to your vacation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/148900_a3aee7d9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/148900_a3aee7d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_75707c13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_5bac106e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_4df0a970.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_e3ecd4a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_4ebb7e4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_80f01f5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_32a0df3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_0b6d7e34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_fe06d1c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_e296ca19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_ba8d1b3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_7b3aec8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148900_9a5b2dfa.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Take overnight train from Hanoi to Lao Cai","description":"Please, be ready at your hotel lobby at 20.00 for a short transfer to Hanoi railways station for taking the overnight train (first class 4 beds cabin with air-condition) which arrive in Lao Cai city, near the Chinese border next morning. "},{"title":"Day 2 : Lao Cai - Sapa Town’s Highlights ( B,L,D)","description":"\nThe train arrives at Lao Cai station early at about 6AM, meet your guide and driver as you check out and an hour transfer uphill the Hoang Lien Son mountains to Sapa. Great views of valleys and terraced rice fields along the way.\nAfter Breakfast your guide will show you around for a brief introduction of this charming town. At the market, ethnic minority people of different groups wearing their traditional costumes made by themselves comes every day selling local products includes vegetable, bamboo shoot, mushroom, medicinal herbs and souvenirs…there are chances to get intact and taking photos.\nLater you will follow the footsteps uphill to the top of Ham Rong Mountain for over viewing beautiful scenery of the town and surrounding area, paying visit to an orchard garden and a mini museum which tells you a lot about ethnic minority people living in Sapa and the northwest region. Later in the afternoon, you may wish to continue your walk down hill to visit Cat Cat village of the Black H’mong, 5 km away or drop in a local terraced café to enjoy your self as the cloud comes \n Overnight at 3-star hotel in Sapa"},{"title":"Day 3: Visit Ta Phin Valley - Silver Waterfall - Tram Ton Pass ( B,L,D)","description":"Today morning, you will visit Ta Phin commune 14 km southeast of Sapa town. Located in a large valley, surrounded by high mountains, which covered by pine trees and forest, Ta Phin Commune is home to the Red Zao and Black H’mong ethnic. Although living close to each other for years, these two ethnic peoples are very different: The H’mong are cheerful and open minded while the Red Zao are economical and reserved… \nTake a 14km drive to the center of the valley, you will enjoy an easy walk following village path around the valley, paying visit to H’mong hamlets scattering from the bottom of the valley to higher mountain slopes. From high elevation, great view of the valley stretching under your foot. Continue your walk to the Red Zao village in which you will meet groups of women making handicrafts includes embroidered clothes, handbags… Transfer back to Sapa for Lunch and noon break.\nAfternoon, Local guide and driver will pick you up at about 02.00 pm and then drive up hill to see the famous Silver Waterfall and then onto Tram Ton, the highest mountain pass in Vietnam at 1,800 m above sea level for enjoying the magnificence of Hoang Lien Son Mountain Range as well as over viewing spectacular landscapes of the whole area, stretching endlessly. Transfer back to Sa Pa and relax.\nOvernight at 3-star hotel in Sapa"},{"title":"Day 4 : Tribal Villages visiting along Muong Hoa Valley ( B,l,D)","description":"Two high ranges of mountains run in parallel southwest of Sa Pa town create Muong Hoa valley, famous for its breathtaking scenery in the region which is home to the major part of Sa Pa’s ethnic population including the H’mong, Zao, Zay, Tay and Xa Pho.\nToday you will spend the whole day exploring the spectacular Muong Hoa. A Jeep will take us out of the town, following the only road built on the side of a mountain range, looking down the valley, over viewing magnificent landscapes composed of high mountains, deep valleys, and stream of water winding, waterfalls and terraced rice paddies…Many time, leaving the main road, you will visit tribal villages such as Ta Van of the Zay, Su Pan of the Black H’mong,  drive back to Sapa. Evening is at your leisure.\nOvernight at 3-star hotel in Sapa"},{"title":"Day 5 : Full day joining a Tribal Traditional Market ( B,L,D)","description":"Depending on what date it is today, you can choose one of the market available for your interest in our market list and we shall refine a detail itinerary and activities.\nAfter a day joining locals and enjoying their market atmosphere and activities, you will have VIP sleeping bus from Sapa to Hanoi at 4p.m and arrive in Hanoi at 10p.m-10.30p.m."}]},{"name":"Highlights of Vietnam Tour to Hanoi, Halong, Tam Hoc, Hoa Lu, Hue, Hoi An, Saigon","duration":11,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1749,"summary":"All highlights of Vietnam will be coverd in this tours, you will have the oppoturnity to explore Hanoi Capital where has had a rich history, the world natural heritage site, and Hoa Lu.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170794_4ed1f68f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170794_4ed1f68f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_a27d3413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_6de23eec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_2713e3b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7e0c7828.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_89f0e76d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7f81b7aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_c1e924c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_a6dc7f27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_8d3e56ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_3e49ed68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_b4bb4280.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_2adc9e13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_d74ca064.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_7db65082.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_5f2fce04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_44979ab5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_ea51413b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_1fe68e4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_10346151.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_d32a1104.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170794_04d9e711.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1. ARRIVAL – HANOI PACKAGE TOUR (-/-/-)","description":"On arrival at Noi Bai Airport, you are met by our guide and transferred to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere. If time permits we enjoy a short cyclo ride through the bustling old quarter streets named after the specific goods once offered for sale at these places.\nO/N in Ha Noi."},{"title":"DAY 2 - HALONG CRUISING TOUR (B/-/-)","description":"7:30 – 08:30: Our SHUTTLE BUS with tour guide will pick you up at your hotels (Note: This pick-up is just applied for those who use our shuttle bus service).\n10h30: Stopover in Hai Duong city where you can experience our hand-made Vietnamese handicraft products.\n12h30: Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities:\n+ Boarding FLAMINGO CRUISEs for departure.\n+ Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager.\n+ Great lunch is served while cruising passing by islets, through Hoa Cuong floating village.\n+ Exploration of Halong Bay passing by Soi Sim Beach, Coconut Three Island. Then arrive in the area of Surprising Cave.\n+ Kayaking & swimming or climbing up to the mountain and getting a complete view of Halong Bay at Titov Beach\n+ Joining our COOKING CLASS on the sun-deck. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n+ Enjoy sunset party with fruits and wine.\n19:30: Under the magnificent night sky, Our luxury set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities include:\n+ Join the SQUID FISHING on boat with our crews. You can enjoy the squid cooked with assistance from our chef.\n+ Or Laze yourself with our happy-hour drinks at the bar.\nOvernight on Flamingo Cruise."},{"title":"DAY 3 - HALONG CRUISE TOUR – HANOI (B/L/-)","description":"06:15: Tai Chi class on the Sun-deck.\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n08:00: Visit the SURPRISING CAVE (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12:00: Disembarkation at Tuan Chau Pier. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00: Arrive in Hanoi. End of the trip!\nOvernight in Hanoi."},{"title":"DAY 4 – FULL DAY TOUR TO HOA LU & TAM COC IN GROUP (B/-/-)","description":"\nThe country capital during the Dinh and early Le Dynasties is Hoa Lu, which however has left its legacy in the form of two small temples, each one nearly a thousand years old. Today we will depart our hotel at 8h00 for Ninh Binh to visit these two remaining structures.\nThe first one is dedicated to the Dinh Dynasty. The second one commemorates the Le Rulers. In front of these temples is the rugged Ma Yen mount; it involves a walk over 200 steps for a fantastic view over the surrounding areas. The following sight is Tam Coc which is surnamed “Halong Bay on land”. We board a sampan for a leisurely trip through the quiet and peaceful landscape of rice fields surrounded by towering limestone cliffs to the grottoes of Tam Coc. The trip ends after arrival in Ha Noi.\nO/N in Ha Noi."},{"title":"DAY 5 - HANOI – FLIGHT TO HUE (NOT INCLUDED) – HUE HALF- DAY SIGHTSEEING TOUR (B/-/-)","description":"After breakfast at hotel, you will be transferred to Noi Bai airport for a morning flight to Hue on VN 1543 (8:30 – 09:45)\nUpon arrival, you will be escorted by our guide & driver then driven to your hotel for a drop of your luggage. Later on,  we have a boat trip on the romantically named Perfume River visits Hue’s best-known religious site, Thien Mu Pagoda. The beautiful riverside Thien Mu Pagoda is one of the oldest ancient architectural structures for religious work ship in Hue.\nWe include this in a half day cruise on the Perfume River which also gives us a taste of the scenic countryside and an enjoyable visit to the mausoleum of Emperor Minh Mang in a tranquil setting of gardens and lakes. This impressive landmark reflects the beautiful architecture, intricate decor and mysterious statues.\nAfterwards, We start our sightseeing tour with the massive citadel named the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945 including Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Forbidden Purple City. This royal residence was all but destroyed during the 1968 Tet Offensive, however it is still fascinating to walk among the ruins.\nClose to this masterpiece is Hue Imperial Museum which displays an interesting collections of bronzes, Chinaware, court robes and various emperors’ personal belongings.\nBy the end of the day, we will have one more chance to take a glancing tour of Hue with a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. Along the way we pass many fantastic eating spots, all ideal for visitors to sample some local delicacies.\nO/N in Hue."},{"title":"DAY 6 - HUE PACKAGE TOURS – DANANG SIGHTSEEING TOURS (B/-/-)","description":"In this morning, before leaving to Danang we will take a short drive though the rolling hill to see the elaborate royal tomb of Emperor Tu Duc and the famous Tu Hieu Pagoda. The scenic 4-hour drive via Hai Van Pass offers spectacular views of mountains, the sea, idyllic beaches and villages (we can choose the shorter way by driving through the tunnel).\nUpon arrival Da Nang, we will take a visit to Cham Museum formerly known as the Ecole Francaise d’Extreme Orient. This museum contains many exquisite limestone carvings from the vanquished Kingdom of Champa which has been the central coastal littoral prior to the march of the Vietnamese nation southward. Then a visit to Marble Mountains with its beautiful grottoes and temples whose peaks represent the five elements of the universe. Later on, we keep on rolling further southward to Hoi An, which was originally one of major trading centers of Southeast Asia in the 16th century.\nO/N in Hoi An."},{"title":"DAY 7 - HOIAN SIGHTSEEING TOURS (B/-/-)","description":"Hoi An which was originally a Cham seaport but has been influenced down centuries by a myriad of traders from various cultures. There are plenty to see in this tranquil and delightful town, some of which are the famous Japanese Covered Bridges, the Pottery Museum, the 200 years old Tamky House, the Chua Ong Pagoda and the vibrant market.\nWe include these sites in an enchanting walking tour past many low tiled houses scattered along the small streets and assembly halls which reflect the town’s multi-cultural past The rest of time, you will be free on your own.\nO/N in Hoi An."},{"title":"DAY 8 - HOIAN PACKAGE TOURS – DANANG – FLIGHT TO HO CHI MINH CITY (NOT INCLUDED) (B/-/-)","description":"After having breakfast at hotel, you will be transferred to Da Nang airport for a short morning flight to Ho Chi Minh on VN7131 (07:50 – 09:20)\nOn arrival you are met by our guide and transferred to hotel. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. An afternoon will acquaints us with some major sights of Ho Chi Minh.\nWe drive past many lively streets on our way to the Reunification Palace. This mansion was the former residence of the President of South Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. We follow these with a visit to the Jade Emperor Pagoda and the War remnant exhibit. The final stop is Ben Thanh Market where anything and everything is for sale!\nO/N in Ho Chi Minh."},{"title":"DAY 9 – SAIGON SIGHTSEEING TOUR TO TAY NINH – CU CHI TUNNELS TOUR (B/-/-)","description":"The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life.\nThere are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range. Upon leaving Cu Chi we drive a short distance to Tay Ninh, the headquarters of Cao Dai Sect . This religion was founded in 1923 and now numbers over 2 million members. We arrive in time to see the ornate temple of Cao Dai and attend the fantastic mid-day service when the followers fill the hall wearing colored robes. These costumes are a symbol of the curious combination of the Confucianism, Taoism and Buddhism.\nO/N in Ho Chi Minh."},{"title":"DAY 10 - SAIGON – MEKONG DELTA PACKAGE TOUR (B/L/-)","description":"Heading out of town, we travel by roads to the Mekong Delta. This plain region boasts the largest rice bowl of Vietnam. On arrival in My Tho we board a boat navigating around the intricate small canals, which is a great way to observe the local lifestyle close-up and catch a view dotted by many islands.\nThe exciting river trip will pass by the lush green vegetation towards the famous Unicorn Island where we have a chance to stroll around an orchard, taste many seasonal fruits and see farmers at work. We navigate some narrower canals using small rowing boats to Ben Tre Province for an interesting visit to some local industries.\nThe extra enjoyment is a lunch at one of the famous local eating spots. We drive back to Ho Chi Minh, stopping off en route to see the beautiful Ving Trang Pagoda and the Saigon’s Chinatown, locally named Cho Lon. This bustling area is crammed with sacred temples and mysterious, narrow lanes.\nO/N in Ho Chi Minh."},{"title":"DAY 11. SAIGON – DEPARTURE (B/-/-)","description":"There is a free time to relax or further explore Ho Chi Minh. The tour ends after your transfer to Tan San Nhat Airport for departure."}]},{"name":"10 Days Vietnam In Style","duration":10,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1690,"summary":"In and around HanoiOn arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. The journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.  \nEvening:  You will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.  \nAccommodation: Hanoi LaSiesta Hotel & Spa\nMeals: Dinner","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/115883_8aef4ac9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/115883_8aef4ac9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_93ed3299.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_294ab863.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_50478adf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_56fd8be4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_acfb19b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_3b9f1bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_6b08223d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_a7b064d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_9e5c8972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_0e830825.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_2675f80b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_bcbae29c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_b9a3b142.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_e94cde25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_ea60dadc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_42463cf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_4876f43f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_f3aeebce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_27589710.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_a4fa8c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_5b7e95c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_6dd05210.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115883_60847eee.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Hanoi","description":"On arrival at Hanoi’s Noi Bai Airport. Friends Travel Vietnam driver will greet you and transfer by private car through the city to your hotel. The journey to the city center will take up to 40 minutes, where our driver will bring you to your hotel. Overnight in Hanoi.  \nEvening:  You will join \"Real Hanoi Street Food Experience\", an amazing adventure to source the best street eats from markets, food carts, street cafes and other hard-to-find-but-totally-worth-the-effort secret spots.  \nAccommodation: Hanoi LaSiesta Hotel & Spa\nMeals: Dinner"},{"title":"Hanoi","description":"This afternoon you will join \"Real Hanoi Bicycle Experience\", an amazing adventure to discover Hanoi City on the way you never explore by foot in the couple of days you be here on your own! It's a great way to crack into the local scene of Hanoi. \nAccommodation: Hanoi LaSiesta Hotel & Spa  \nMeals: Breakfast"},{"title":"Ninh Binh (Hoa Lu -Tam Coc)","description":"Today you will be transferred by luxury van to Ninh Binh a region well-known for its green valleys, karst mountains and conservation areas.07: 15 - 07:45 Approx – You will be met by Bus Line tour guide at our discussed meeting point. Visiting a local family in Tam Coc area. They are a traditional Vietnamese family with three generations living together. Here you will get the chance to see the house architecture and their daily life and their handicraft job of making traditional embroidery. Leaving the family, you will take a bike and start riding to explore the rice fields and limestone mountains with a unique route.\nCome back the local family, enjoy a special lunch with the local cuisine featuring the yin-yang balance of the Asian culture. After lunch, a break with a cup of tea will be served before you continue the journey of discovery Ninh Binh.\nVisit Tam Coc by a small boat rowed by a local for about 1.5 hours. Known as “Halong Bay on land”, the boat trip is a nice journey along the river with the peaceful scenery of Limestone Mountains, rice paddy if traveling during harvest season. Arrive at Hoa Lu, the ancient capital of Vietnam in the 10th century, visit the temple of King Dinh. Under the introduction of our local guide, you will get to know more about the Vietnamese history.\nWe drop you at Hotel in Ninh Binh for overnight stay. Trip ends.\nAccommodation: Bai Dinh Garden Resort \nMeals: Breakfast, Lunch."},{"title":"Ha Long Bay - Lan Ha Bay","description":"After breakfast, leave Ninh Binh to Tuan Chau Harbor for an overnight boat trip on Lan Ha Bay that is a part of Ha Long Bay with the additional attraction of numerous white-sand beaches. Journey there through the rich farmlands, observe everyday life of Vietnamese villagers as they work the rice fields, take pigs to the market on bicycles and plough the fields with their water buffaloes. \n12.00 Ready at the private guest lounge by Genesis at Tuan Chau Harbor. Genesis team will welcome you at lounge and register for your trip.\n12.30 – 13.00 Welcome speech - Lunch time\nYou will embark Genesis Regal Cruise in the warmly greeting of the team who will accompany you guys in the trip. A welcome speech will be given to you be our Cruise Manager, and itinerary briefing instantly. After that, you will enjoy set menu lunch with delicious local seafoods. Regal Cruise slowly glides between the numerous small islands and the sea-green color of the bay.\n14.00 Check in rooms\nReceive the room key, check in and take a rest at your reserved room, while Regal Cruise take you sightseeing among the nature wonder.\n15:00 – 16.30 Kayaking – Sampan boat. Reaching Dark- Light area of 3 underwater caves.\nIn this activity, visitors have two choices, either by themselves creating separate roads for exploring by kayaking or sit on boats that rowed by the local people to soak in the peaceful atmosphere.\n16.30 – 17.00 Swimming – relax\nAfter kayaking, visitors can do swimming in middle of the bay. Immerging the body to emerald water or jumping from top of tender are exciting activities.\n18.30 – 19.30 Cooking class, Sunset Party, Bartender show\nRegal Cruise will move to safety anchorage. It is the time to join the “sunset party” on the open top deck of the ship. In the rhythm of the music, visitor could enjoy the sunset moment, gathering, mingling…\nWatching the skillful Bartender show and do not miss the special offer “Happy hours – buy two get one for free” to enjoy the memorable moments in the trip.\nMoreover, Regal Chef will guide you how to make one of the 50 best dishes in the world, voted by CNN – “Nem” – Deep Fried Spring Rolls in Vietnam.\n19.30 Dinner on board\nGuests will enjoy the delicate dinner in the warm and cozy ambience. With fresh dishes by deluxe Fusion style, promise to bring guests an unforgettable dinner on this memorable trip.\n21:00 Relax on board\nA free time for some activities such as: films; playing chess, reading books, listening to music, trying your luck with squid fishing, tea culture learning, or enjoy the starlight of night sky in the bay on sundeck.\n22:00 Overnight \nCruise goes to overnight point at the quietest part of the wonders. Finishing the first day with a good night’s sleep. Overnight on board.\nAccommodation: Genesis Regal Cruise.  \nMeals: Breakfast, Lunch, Dinner."},{"title":"Lan Ha Bay - Hanoi","description":"06.30 Morning greet\nTai Chi wake up to new days are practiced out on the sundeck. This is also the moment visitors can pick up the dawn on the bay.\n07.30 Breakfast\nA light and nutritious breakfast served at the restaurant will help you enjoy the last day on the bay, which is always full of energy.\n08.30 Visit a floating house\nTour guides and tender will take you to visit a floating house on the bay. The local host will welcome you as home-guests, visitors will be exchanged with the owner, to understand the information about culture, history … of the fishing village on Halong Bay – Lan Ha Bay.\n9.30 – 10.30 Brunch time\nGuests return to the boat, stay and check out procedures. Enjoying the scenery of the Bay and a delicious buffet brunch while cruising back to the harbor.\n11:45 Back pier\nRegal Cruise arrives in Tuan Chau Marina. Guests will relax at the private lounge, preparing luggage and depart back to Hanoi.\n15.00 – 15.30 Back to your accommodation \nReturn to Hanoi Hotel after moving quickly by the highway.\n\nAccommodation: Hanoi LaSiesta Hotel & Spa\nMeals: Breakfast, Lunch."},{"title":"Hue","description":"After breakfast at hotel, your driver will meet you for the transfer to Hanoi Airport for the flight to Hue. \nOn arrival, your guide will welcome you for the 30-45 minutes drive to Hue Hotel. After lunch at local restaurant, we visit Thien Mu pagoda. Then guide will take you to make a cyclo tour for visiting the Imperial Citadel where Nguyen Dynasty ruled between 1802 and 1945 with numerous of attractive places to see like Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Purple Forbidden City…Back your hotel and end of tour.\nAccommodation: Hue Indochine Palace Hotel\nMeals: Breakfast, Lunch, Dinner."},{"title":"Hoi An","description":"Our guide and driver welcome you at hotel in Hue and transfer you to leave Hue city for Hoian. You will be driven along National Highway No1 and see more of beautiful landscapes of rice fields, Cau Hai Lagoon, local villages. You will have a chance to see Lang Co beach – one of the most beautiful beaches in Asia to enjoy the nice view.   Next, you will see the spectacular view of Hai Van Pass through windy road to the summit. From here the panorama of Lang Co Beach, Da Nang city is under your eyes. It is the ideal spot to take wonderful photos of forest and mountains. You arrive in Da Nang city at noon.   After lunch at restaurant you will visit Da Nang city including Cham Museum where shows the collection of Champa sculptures to learn more of Cham culture and then Marble Mountain which is well known as Five Mountains to visit and discover pagoda, cave and view of Da Nang city from the summit. You arrive in Hoian late afternoon.   \nAccommodation: Hotel Royal Hoian - MGallery by Sofitel \nMeals: Breakfast, Lunch"},{"title":"Hoi An","description":"Morning: Our guide welcomes you at the hotel in Hoi An in the early morning and then you will sit on boat to learn fishing for more experience with the instruction of the local people. Continue to visit green Bay Mau water coconut forest; it’s a chance to row the basket boat to enjoy the tranquil atmosphere admire the revolutionary base of Hoi An in the past and use fishing tools to fish the field crab.  You will be transferred to continue to ride bicycle for visiting Tra Que Vegetable Village through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. You will join a cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods. Have lunch at the family.  After lunch, you will learn about farming; dress in farming clothes, take a short walk around to visit the garden where local farmers work and use the traditional methods without having electrical machines support. Come back the house to relax by soaking your feet in Vietnamese herbs. This is one of the ways to refresh ourselves after the hard time in garden of Vietnamese.Then you be transferred back your hotel in Hoi An.  \nAccommodation: Hotel Royal Hoian - MGallery by Sofitel \nMeals: Breakfast, Lunch."},{"title":"Hoi An","description":"Today is a free day to explore Hoi An. Browse the town’s cobbled streets and art galleries, or hire a bike and cycle through rice paddies out to An Bang Beach. Shop for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shop houses. Perhaps visit one of the hundreds of tailors in the city to get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class.  \nAccommodation: Hotel Royal Hoian - MGallery by Sofitel \nMeals: Breakfast"},{"title":"Da Nang","description":"Transfer from Hoian hotel to Danang International Airport for your home back for next extension.   \nMeals: Breakfast"}]},{"name":"Discovery Vietnam Central 5 Days 4 Nights","duration":5,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":350,"summary":"Start and end in Da Nang City! With the sightseeing tour Discovery Vietnam Central 5 Days 4 Nights, you have a 5 day tour package taking you through Da Nang City, Vietnam and 3 other destinations in Vietnam. Discovery Vietnam Central 5 Days 4 Nights includes accommodation in a hotel as well as an expert guide, meals, transport and more.\n\nHighlight of the tour\nDay 1: Arrive Da Nang transfer to Hue City \nDay 2: Visit Hue City \nDay 3: Ba Na hill with golden bridge \nDay 4: Marble moutain and Hoi An ancient house \nDay 5: Hoi An Departure ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153401_9f226924.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153401_9f226924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_eb011959.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_ba993b3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_1ec0711a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_79d350fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_92379b22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_f999c980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_245b852d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_e6aeaaf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153401_14056a1a.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Day 1: Danang arrival – Transfer to Hue – Half day City Tour","description":"Welcome to Danang! You will be greeted by our car and driver at the airport then transfer directly to Hue.  \nArrive Hue, check in hotel. Hue served as an imperial capital to the Nguyen Lords, a feudal dynasty which reigned from the 17th to 19th century. With splendid emperors’ tombs, ancient pagodas and the remains of the Citadel, the city retains its Royal charm.\nOvernight in Hue"},{"title":"Day 2: Hue City Tour – Transfer back to Danang (B/L)","description":"In the Morning: Pick up at your hotel 7:30am by car. You will visit:  Minh Mạng Tomb, Khai Dinh Tomb, Traditional Martial Art Van An, Tu Duc Tomb, Conicat Hat & Incense Making Village\n\nNoon: Buffet lunch (50 traditional foods, Asia & Western foods).\n\nAfternoon: Continue by bus to visit: The Citadel, Thien Mu Pagoda\nThen get on the boat for a sight -seeing along the Perfume River to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River!\n\nFinish tour, the private car takes you back to Da Nang. Overnight in Danang. "},{"title":"Day 3: Danang – Bana Hills – Golden Bridge – Danang (B/L)","description":"After breakfast at hotel, we transfer to Ba Na hills. Arrive Bana, take Cable Car which gains 5 world scores to Ba Na hills station. Stop at By Night station to visit Vong Nguyet hills, Linh Ung pagoda, The Old Villas of French. Continue moving up by cable car to the Nui Chua Mountain – the top of Ba Na range, visiting Nginh Phong top, Le Nim Villas, Orchid Garden… Experience hill climbing train (first and unique funicular in Vietnam) and visit an old French cellar (Debay Ancient Wine Cellar), flower garden Le Jardin D’amour and Linh Ung Pagoda.\nHave lunch at restaurant on Bana Hills.\nAfternoon: Free for joining games in Fantasy Park – the third biggest indoor games zone in Vietnam with series of interesting games: 4 – 5D film, skiver, The death race, dinosaur park… (2 hours) then we take the cable car down. Bus back to Danang City. Overnight in Danang.\n \n"},{"title":"Day 4: Danang – Marble Mountain – Hoian (B/D)","description":"Breakfast at hotel then you are free and easy to relax on the beach or walk around to visit and do shopping in Danang City.\n15h00 – 15h30: Shuttle bus and tour guide will pick you up at hotel.\n16h15: Visit the Non Nuoc carvings-stone village and conquer Marble Mountains, explore the beauty of the mysterious caves, visit the ancient temples hundred years: Linh Ung and Tam Thai.\n17h30: After leaving Marble Mountains, shopping local specialities. Depart to Hoi An Ancient Town\n18h00: Have a dinner at Hoi An restaurant.\n19h30: Walking to visit and shopping in Ancient Town, admire Hoi An at  night flickering in multi – colored lantern. Check in hotel and Overnight in Hoian.\n"},{"title":"Day 5: Hoian – Danang – Flight departure (B)","description":"Today you are free at leisure to walk to the ancient city to visit the Kwan Temple, Phuc Kien Chinese Assembly Hall, Tan Ky Old House, Japanese Cover Bridge and Historic & Cultural museum in Hoi An.\nEnjoy a walking tour through the narrow lanes of the town lined with century-old building and illuminated by hundreds of colorful lanterns till transfer to Danang airport for your flight back home. End of trip. \n\n"}]},{"name":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta","duration":10,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1134,"summary":"This 10-day tour definitely amazes you with the unforgettable discovery of magnificent Hanoi, breathtaking Halong Bay by cruise, Hoi An Ancient Town, mysterious My Son Sanctuary, bustling Saigon, and unique Cai Be Floating Market in Lower Mekong Delta province of Vinh Long.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171057_3c4cd5d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a3ed6870.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_42bb7339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_094ec9ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d9ef09d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_10e60a0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2c417434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_fc4c5886.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_3e6fce9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_f1ebfa6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_5f5ddd1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_383e501e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_a96445a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_cf8262db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_8144b44d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_d42eea53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_87281cf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_2f5d8651.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e170418a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_52762d10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_b07508bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_7ca720ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_9f6dcdd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171057_e642f629.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1 – ARRIVAL – HANOI","description":"Upon arrival at Noibai Airport, you’ll be met by our tour guide & transferred to your hotel in Hanoi for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Hanoi."},{"title":"DAY 2 – HANOI – HA LONG (GROUP TOUR) (B/L/D)","description":"07:30  Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30  Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30  Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30  Great lunch is served while cruising passing by islets.\n15:00  Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises."},{"title":"DAY 3 – HA LONG – HANOI (B/L)","description":"06:15     Tai Chi class on the Sun-Deck\n07:15    Have light breakfast with Coffee, tea, and bakeries on board\n07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45    Brunch is served.\nAfter brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina.\nO/N in Hanoi."},{"title":"DAY 4 – HANOI – FREE DAY – NIGHT TRAIN TO DA NANG (B)","description":"Today you will have leisure time for shopping or discover Hanoi by yourself (No Guide – No Car).\nBy the end of day at around 18:30, we’ll be transferred to the Hanoi Railway Station for a night train to Da Nang on SE1 (19:30 – 11:40 +).\nOvernight on the train."},{"title":"DAY 5 – DA NANG RAILWAY STATION – HOI AN – FREE (B)","description":"Upon getting to the Da Nang Railway Station, you’ll be welcome & escorted to your hotel in Hoi An for a check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Hoi An."},{"title":"DAY 6 – HOI AN – GROUP TOUR TO MY SON SANCTUARY – BOAT TRIP ON THU BON RIVER (B)","description":"08:00 – 08:30 AM: Our guide picks you up at hotel and leave Hoi An for visiting My Son Holly Land – the ruins of Cham people and was an imperial city during Cham dynasty. Here you can have more chance to explore and understand of technique of Old Cham people in making red bricks to build Tower which still now a secret to everyone, you can see a large complex of religious relics that comprises more than 65 architectural works.\nIt also surprises for those who are curious with architectural art. In 1999, UNESCO labeled the Cham architecture in My Son as a World Cultural Heritage Site. Moreover, you have chance to enjoy traditional music performed by Cham girls in their colorful uniforms. Then transferring you back about 30km, you will take a boat trip along the Thu Bon River  to Hoi An Ancient Town. After that, back to the pier and come back your hotel by your own way & end of tour.\nO/N in Hoi An."},{"title":"DAY 7 – HOI AN – DA NANG – FLIGHT TO SAIGON (NOT INCLUDED) (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to the Da Nang airport for a departure flight to Saigon on VN117 (15:30 – 16:50). Upon arrival at Tan Son Nhat Airport, you’ll be met by our tour guide & transferred to your hotel for a Check-in.\nThe rest of time, you’ll be free on your own.\nO/N in Ho Chi Minh City."},{"title":"DAY 8 – SAIGON GROUP TOUR TO MEKONG DELTA (B/L)","description":"PICK UP: 7:30am – 8:15am \nRETURN: 17:30pm \nROUTE: HCMC – My Tho - Ben Tre – HCMC.\nHighlight: A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit. Itinerary: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.Stop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. Riding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. Have lunch at local restaurant. Break time. In the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City. \nO/N in Ho Chi Minh City."},{"title":"DAY 9 – SAIGON GROUP TOUR TO CU CHI TUNNELS (B/L)","description":"After having breakfast at hotel, you’ll be at leisure at the lobby of hotel\nAt around 09:00, you’ll be picked up at your hotel then transferred about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968.\nThe incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation.\nToday we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range.\nAt around 15:00, you’ll get back to your hotel & have a free time to relax by yourself.\nO/N in Ho Chi Minh City."},{"title":"DAY 10 – SAIGON – DEPARTURE (B)","description":"After having breakfast, you’ll be at leisure till the time of a transfer to Tan Son Nhat airport for a departure flight. (Note: The check-out time at hotel is prior to 12:00)."}]}]