[{"name":"Very Vietnam - 10 days","duration":10,"travelStyle":["In-depth Cultural","Group","Fully Guided","Coach / Bus","Holiday"],"oldPrice":0,"price":1795,"summary":"From charming Hanoi with its fading colonial architecture and national monuments, to the spellbinding scenery of Halong Bay and bustling Ho Chi Minh City on the edge of the Mekong Delta, Vietnam is as colourful as it is diverse. See the very best of vibrant Vietnam in 10 captivating days.","highlights":["Visit UNESCO listed Halong Bay","Experience the beauty of Hoi An","Marvel at the mighty Mekong Delta","Enjoy a traditional Tai Chi class"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/30631_4ff22a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/30631_4ff22a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_07a44706.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_70dfdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_6a6a41d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_259eef4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_e41441f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_a8ba711b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_4f445ea7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_bd2638cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_3965bc29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_d6585854.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_c051d191.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_8bfde7ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_22bc0e15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_83e337f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_084a8d53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_131d5909.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30631_081104b7.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho","Cai Rang"],"timeline":[{"title":"Day 1: Hanoi","description":"Saturday. Welcome to Hanoi, perhaps the most graceful, atmospheric and exotic capital city in Asia. Airport to hotel arrival transfer. The remainder of the day offers free time for you to explore the wide tree-lined avenues, beautiful lakes, ancient pagodas and the thriving historic old city, all easily navigated on foot. For those able to arrive very early today or the day prior, why not get off the beaten track and explore Hanoi with us on our optional Back Streets of Hanoi add-on which explores the quaint districts of Cho Buoi, Hoang Hoa Tham and Vinh Phuc, and also includes an exhilarating local experience - riding pillion, on taxi-motorbikes through a maze of tiny streets and along the shore of beautiful Ho Tay Lake. "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. After breakfast this morning we leave Hanoi and transfer to the crown in Vietnam's scenic crown - the incredibly beautiful Halong Bay. We explore the jade waters studded with karst islands aboard a traditional wooden junk boat and after embarkation there's time for lunch soaking up the views. This afternoon we visit Trinh Nu Cave, one of the finest caves in Halong Bay, covering an area of 2,000m² with a stunning array of stalactites and stalagmites. There's also the opportunity to go kayaking and enjoy a refreshing swim. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner."},{"title":"Day 3: Halong Bay","description":"Halong Bay - Hanoi - Hue. Early birds can start the day with a relaxing Tai Chi class on the sundeck or a traditional massage - the perfect way to start the day. Before heading back to port this morning, we explore the beautiful Sung Sot cave (Surprise Grotto), which is 10,000m² and consists of two major chambers which are spectacular and spacious enough to hold thousands of people. Arriving back into Hanoi mid-afternoon we explore the maze of streets in the French Quarter on cyclo (rickshaws), taking in highlights such as the Opera house and Ly Thai To park. We then swap our wheels for a leisurely walk through ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street from silk tailors to traditional medicine shops. Later this evening there's a chance to freshen up before boarding the train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available. "},{"title":"Day 4: Hue","description":"Upon arrival to Hue we embark on a guided sightseeing tour of the 19th-century Nguyen empire capital. We visit the Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hue and the citadel. Within the citadel is the Imperial Purple Palace, an exact copy of the Forbidden City in Beijing, with its impressive ramparts, formal moats and imperial palaces, some of which lay in ruin. In the countryside lies the Royal Tombs of the Nguyen kings and here we view the elaborate mausoleum of Emperor Tu Duc. As the sun sets there is an optional cruise in a long boat along the gentle Perfume River, beautifully illuminated at night."},{"title":"Day 5: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. Today we take the scenic Hai Van Pass (Road of the Ocean Clouds), which offers magnificent views of beaches to one side and lush hills to the other. En route we stop for a walk along My Khe beach, a beautiful stretch of coastline which was nicknamed 'China Beach' by the Americans during the war and famously featured in Francis Ford Coppola’s movie ‘Apocalypse Now’. Perhaps enjoy a refreshing swim in the sea before continuing our journey south along the coast to Hoi An. The charming, old-world trading port of Hoi An with its cobbled streets, traditional homes and tiny shop houses is a perfect place to lose yourself in a bygone era. Boutique restaurants, hip cafes along the waterfront, delightful craft shops and artisans including some of Asia’s best bespoke tailors (whose services come at a nominal price), all can be found here. On a short walking tour of the enchanting historical town, we visit the Chua Ong Pagoda, Chinese Assembly Hall, 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. During your stay in Hoi An, we offer a unique optional Hoi An Street Eats add-on, which explores the city’s most popular local haunts. Cruise the city the way the locals do, by vintage Vespa and enjoy lots of tasty Vietnamese Cuisine. Book early with your reservation consultant, as numbers are limited. "},{"title":"Day 6: Hoi An","description":"A bicycle ride into the countryside leads us to Tra Que village. Here, we discover age old farming practices and learn about traditional medicine. It’s a hands-on experience today where we assist with tending the fields and gardens and cooking lunch!"},{"title":"Day 7: Hoi An","description":"A free day for you relax or further sightsee. You may wish to take a relaxing rowboat journey along the river or spend the day lazing by the beach or hotel pool. Alternatively you can opt to take an excursion to the UNESCO-listed My Son sanctuary or enjoy a day trip to the Ba Na Hills, where you can ride the second longest cable car in the world, explore the resort and walk along the striking Golden Bridge (book and pay locally)."},{"title":"Day 8: Can Tho","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City. Then a drive to the Mekong Delta. Often referred to as the ‘rice bowl’ of Vietnam, the fertile Mekong Delta is famous for its abundant harvests of tropical fruits, flowers and rice, as well as its fantastic views while boating along the canals. Taking our sampan from Cai Be we cruise through the maze of waterways watching the hubbub of daily life on the river. Passing colourful trading boats, house boats and children swimming we stop to visit some of the local cottage industries that produce popcorn, coco candies and paper along the way. Lunch is served today in a traditional wooden home on Dong Hoa Hiep Island. "},{"title":"Day 9: Ho Chi Minh City","description":"Can Tho - Ho Chi Minh City. Early today we visit the ever lively Cai Rang floating market. Watch as melons, pineapples, fresh greens, sacks of rice and children's toys get tossed from one sampan to another at great heights and speed before driving back to Ho Chi Minh City. Once called the Pearl of the Orient, modern Ho Chi Minh City is a thriving metropolis on the move. Sleek sky scrapers, gourmet restaurants, designer malls and swanky bars and spas are scattered between ancient pagodas, colonial era landmarks and lively street markets. Our walking tour of Ho Chi Minh City includes visits to the Notre Dame Cathedral, Old Post office and the sobering War Remnants Museum. Evening is at leisure."},{"title":"Day 10: Ho Chi Minh City","description":"Monday. Today is free for you to enjoy Ho Chi Minh City before your departure transfer to the airport. Opt for a relaxing foot massage, shop for souvenirs at Ben Thanh Market or visit the grand Independence Palace, with its secret bunker and military command centre beneath. You could also extend your stay and join us on a day trip to the Cu Chi Tunnels Here you can go underground to explore the vast network of tunnels and hideouts used by Viet Cong guerrilla fighters, see booby traps, trap doors or test your skill with an AK 47 at the firing range."}]},{"name":"North to South Vietnam (for Solos) - 11 Days","duration":11,"travelStyle":["Discovery","Custom","Group","Fully Guided","Holiday"],"oldPrice":1383,"price":899,"summary":"This tour is for solo travellers, if you are the only one booked onto this tour, you will be guaranteed to depart!\n\nDiscover all the incredible sights of Vietnam on a comprehensive eleven-day tour from North to South of Vietnam! Discover Ha Noi, Ha Long Bay overnight,  Ho Chi Minh City, Da Nang City, My Son Sanctuary, Hoi An Old City, explore the Cu Chi tunnels and more.","highlights":["Discover the secrets of the Vietnam war in the Cu Chi Tunnels","Cruise past limestone islands majestically rising out of emerald water","Fall in love with the cultures and traditions of the local people"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/149439_880f94bd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/149439_880f94bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_3f094bea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_2d82b07e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_39a67d58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_5aa71f6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_5da8e78e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_1771ffd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_21b87b6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_0ac1809f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_1419f98f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149439_2dfeeab4.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Ha Noi - Arrival","description":"Arrive at Noi Bai Airport. Pick up and transfer to hotel.  Check in. Overnight in Ha Noi.\n"},{"title":"Day 2: Ha Noi – Ha Long Bay (BLD) – by shuttle bus","description":"The shuttle bus will pick you up at your hotel and depart for Ha Long Bay within 4 hours, going through the scenic countryside. The wondrous Ha Long Bay is truly one of Vietnam’s most impressive scenic sights. Heading out of the town, embark on a boat for an exploration of the legendary Ha Long Bay. This exciting cruise will provide a fantastic view of the picturesque scenery blending with the sky and some 3,000 limestone islands rising amazingly from the clear and emerald water. The limestone karsts formations are littered with beaches, grottoes and beautiful caves. Along the way, anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath towering cliffs.  Overnight on the Junk Cruise.\n"},{"title":"Day 3: Ha Long Bay – Ha Noi (BL) – by shuttle bus","description":"After breakfast, swimming and sunbathing. After lunch, return to Ha Noi. Overnight in Ha Noi.\n"},{"title":"Day 4: Ha Noi City Tour – Da Nang (B) – by flight","description":"With ochre-colored colonial buildings, tree-lined boulevards and scenic lakes, Ha Noi is full of charms. Visit some of Ha Noi’s heritage sites such as Van Mieu - Quoc Tu Giam (temple of literature), the first Imperial school in Vietnam, built in 1070 during the dynasty of King Ly. We will also visit Hoan Kiem Lake, Ngoc Son Temple (jade mountain temple), But Tower (pen shaped tower), Dai Nghien (ink stand) and The Huc Bridge (wooden bridge painted in red). Then, we will take a cyclo (pedicab) ride around “the 36 meandering streets” of Ha Noi’s historic Old Quarter to enjoy the bustling local life. The history of Ha Noi dated back for over one thousand years, and Ha Noi has different cultural characteristics compared to the areas in Vietnam. The lifestyle, cuisine, fashion… of Ha Noi folks bear special features and through this journey, we can perceive these. It is very interesting to discover Ha Noi in the morning, when the life has just started and we can enjoy the busy atmosphere in all streets. Hanoians are very friendly and hospitable. Hopefully, this is the most remarkable memory in our destination to Vietnam.\n\nTransfer to airport for flight to Da Nang. Upon arrival, pick up and transfer to hotel.  Overnight in Da Nang.\n"},{"title":"Day 5: Da Nang (B)","description":"2019: Day 5: Da Nang – My Son Sanctuary (B)\nOne of the most stunning sights to see in Hoi An area is My Son, Viet Nam’s most important site of the ancient kingdom of Champa. Between the 4th and 13th centuries a unique culture which owed its spiritual origins to Indian Hinduism developed on the coast of contemporary Viet Nam. This is graphically illustrated by the remains of a series of impressive tower-temples located in a dramatic site that was the religious and political capital of the Champa Kingdom for most of its existence. Located in the heart of a beautiful valley and surrounded by high mountains ranges My Son was named a Cultural Heritage site by UNESCO in 1999.\nOriginally built with wood, they were completely destroyed by fire in the 6th century and restored in the 7th century by Sambhuvarman who rebuilt the temples with locally made bricks. Up to the 13th century, more than 70 similar temples were built, establishing My Son as a sanctuary of Hinduism in the Champa Kingdom. Free time in the afternoon. Overnight in Da Nang.\n\n2020: Day 5: Da Nang - Free day (B)\nFree as your leisure day. Overnight in Da Nang."},{"title":"Day 6: Da Nang – Hoi An (B)","description":"2019: Day 6: Da Nang - Hoi An - Ann Tailor for a free tailor-made item of clothing – Hoi An City Tour (B) \n10:00   Check out. Transfer to Hoi An and contact Ann Tailor  to have a free tailor-made item of clothing. \nIn the afternoon, exploring Hoi An on foot is one of the best ways to take in the city’s charm. While exploring the small yet beautiful town, tourists and frequent visitors alike find that it is a place of quiet and peace. The unique atmosphere here combines elements of Vietnamese, Chinese and Japanese culture. Some of the most remarkable views of the city are from the ancient houses. From here, visitors can catch a glimpse of a long gone past and more subdued and simple time.\nThe tour includes visits to Hoi An Museum, many of the town’s renowned Ancient Houses which boast remarkable architecture, Assembly Halls of Chinese influence, a handicraft workshop and of course the must-see Japanese Covered Bridge. An optional stop is at the private home of Diep Dong Nguyen (subject to availability) to view a stunning collection of pottery, seals and old Hoi An photographs. Overnight in Hoi An. \n\n2020: Day 6: Da Nang - Hoi An City Tour - Ann Tailor for a free tailor-made item of clothing – My Son Sanctuary (B) \nCheck out. Transfer to Hoi An and explore Hoi An on foot is one of the best ways to take in the city’s charm. While exploring the small yet beautiful town, tourists and frequent visitors alike find that it is a place of quiet and peace. The unique atmosphere here combines elements of Vietnamese, Chinese and Japanese culture. Some of the most remarkable views of the city are from the ancient houses. From here, visitors can catch a glimpse of a long gone past and more subdued and simple time. The tour includes visits to Hoi An Museum, many of the town’s renowned Ancient Houses which boast remarkable architecture, Assembly Halls of Chinese influence, a handicraft workshop and of course the must-see Japanese Covered Bridge. An optional stop is at the private home of Diep Dong Nguyen (subject to availability) to view a stunning collection of pottery, seals and old Hoi An photographs. After the tour, contact Ann Tailor  to have a free tailor-made item of clothing. \n\n13:00 One of the most stunning sights to see in Hoi An area is My Son, Viet Nam’s most important site of the ancient kingdom of Champa. Between the 4th and 13th centuries a unique culture which owed its spiritual origins to Indian Hinduism developed on the coast of contemporary Viet Nam. This is graphically illustrated by the remains of a series of impressive tower-temples located in a dramatic site that was the religious and political capital of the Champa Kingdom for most of its existence. Located in the heart of a beautiful valley and surrounded by high mountains ranges My Son was named a Cultural Heritage site by UNESCO in 1999.\nOriginally built with wood, they were completely destroyed by fire in the 6th century and restored in the 7th century by Sambhuvarman who rebuilt the temples with locally made bricks. Up to the 13th century, more than 70 similar temples were built, establishing My Son as a sanctuary of Hinduism in the Champa Kingdom. Overnight in Hoi An. "},{"title":"Day 7: Hoi An - Foodie Tour (BL)","description":"09:00    Discover Hoi An’s countryside and its local foods by bicycle. We will start our tour with a ride through the countryside to a local village with a stop to enjoy a bowl of Cao Lau. Cao Lau is a traditional Hoi An specialty composed of local noodles, pork, fresh vegetables and rice paper. The noodles are made with local sticky rice soaked in the water that must be taken from Ba Le Well: the oldest well in Hoi An, believed to have the best water anywhere.\n \nYou will also be able learn to make special white rose cakes with a local family and have the opportunity to enjoy them. Before the end of the tour, we will go to Cam Nam to enjoy the Ying and Yang food such as: Banh Dap, Che Bap. This tour is definitely an interesting journey. Overnight in Hoi An.\n"},{"title":"Day 8: Hoi An – Da Nang – Ho Chi Minh City (B) – by flight","description":"Check out and transfer to Da Nang for flight to Ho Chi Minh City. Upon arrival, pick up and transfer to the hotel. Overnight in Ho Chi Minh City.\n"},{"title":"Day 9: Mekong Delta – Cai Be floating market (BL) - by minivan","description":"The day will begin with a two-hour ride from Ho Chi Minh City to the Mekong Delta. Upon arrival, we will take a boat cruise to visit Cai Be Floating Market. The floating market is one of the most interesting and exciting attractions in the Mekong Delta. At the floating market, you can watch locals aboard their small boats trading fresh goods and local commodities. We will stop over at a local house where we can see how they make coconut candy, rice-paper, rice-pop corn and rice wine. Leave Cai Be for Tan Phong Islet where the maze of shady creeks will surely fascinate you. You will have a chance to spend time, enjoying traditional music and tropical fruits. Have a traditional lunch at a local home, including the popular dish of ‘Elephant Ear Fish’. Return to Ho Chi Minh City. Overnight in Ho Chi Minh City. \n"},{"title":"Day 10: Cu Chi Tunnels - Ho Chi Minh City Tour (BL)","description":"Start the day with a visit to the famous Cu Chi Tunnels. Stretching over 250 km, Cu Chi is one of the most famous and historical aspects of war in Viet Nam. The tunnel system was created in 1948 to assist the Viet Minh as they fought the French for independence and became legendary during the 1960’s in playing a vital role in the Viet Nam War by allowing the Viet Cong (communist guerrillas) to control large rural areas, just 65 km away from Ho Chi Minh City.\n \nIn the afternoon, we will visit some of the other major attractions in HCMC: the War Remnants Museum, Reunification Palace, Notre Dame Cathedral, Old Post Office and Thien Hau Pagoda. Overnight in Ho Chi Minh City.\n"},{"title":"Day 11: Ho Chi Minh City – Departure (B)","description":"Check out, then transfer to the airport for departure flight. END SERVICE.\n"}]},{"name":"Highlights of Vietnam - 12 Days","duration":12,"travelStyle":["In-depth Cultural","Group","Fully Guided","Holiday"],"oldPrice":0,"price":792,"summary":"An excellent value tour covering all the principal sights of Vietnam in a short space of time. Highlights include an overnight cruise around Halong Bay on a junk boat, the historic town of Hoi An, a full day sightseeing trip in the Mekong Delta and the two main cities of Hanoi and Ho Chi Minh. This tour features our selection of the best local hotels which are all centrally located, allowing independent exploration of Vietnam’s delightful shops and restaurants.","highlights":["Soak up the hustle and bustle of Hanoi City","Cruise on a traditional junk boat through Halong Bay","Explore the magical ancient town of Hoi An","Crawl through the mystical Cu Chi Tunnels","Feel the metropolitan pulse of Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132167_4d9e1348.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132167_4d9e1348.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_a1af9d8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_b3448d26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132167_ac935ec8.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi Arrival","description":"“Welcome to Vietnam” at the airport by your EMH tours’ transfer team.  We then transfer you to the hotel.  The remainder of the day is at leisure.\n\n\nAccommodation: Hotel\n\nMeals: Meal is not included on this day.\n\n\nSuggestions for your free time:\n\n- Take a slow walk around Hoan Kiem Lake, which is very scenic, so remember to bring your camera.\n\n- In walking distance from your hotel, you can go to Thang Long theatre where you can enjoy traditional Vietnamese water puppet show.\n\n- Another option is to do shopping, you will find plenty of shops in the old town as well as street night market. Should you wish to taste famous Vietnamese coffee, you will find many coffee shops in French style with a view to the lake."},{"title":"Hanoi City Tour","description":"After breakfast at the hotel, you will be picked up for the city tour. We first head out to the Tran Quoc Pagoda, a 1400 year-old temple, the oldest in the city and is located near West Lake offering a watery landscape, the pagoda is a very scenic attraction.\n\n\nThen, we’ll drive to Ho Chi Minh Complex, where you'll have the opportunity to visit President Ho Chi Minh’s Mausoleum, Uncle Ho’s House and the One-pillar pagoda – a very iconic temple in Vietnam.\n\n\nTemple of Literature will be our next stop. This ancient site offers a lake of literature, the Well of Heavenly Clarity, turtle steles, pavilions, courtyards and passageways that were once used by royalty. Visiting the Temple of Literature you will discover historic buildings from the Ly and Tran dynasties in a revered place that has seen thousands of doctors’ graduate in what has now become a memorial to education and literature.\n\n\nThereafter, we will continue our tour to Ngoc Son Temple, also known as the Temple of Jade Mountain, dedicated to Confucian and Taoist philosophers and the national hero Tran Hung Dao. Photography is also popular at this Huc bridge, a landmark red wooden bridge, leading over a lake to a shrine.\n\n\nThis tour will end with a drop off back to your hotel.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast, Lunch"},{"title":"Hanoi - Halong Bay - Overnight Onboard a Cruise Ship","description":"Wake up early and depart your hotel in Hanoi for a transfer by shared van to Ha Long Bay. This UNESCO World Heritage Site is one of the true natural wonders of the world. In this sweet spot where the land meets the Gulf of Tonkin, over 1,000 karst islets rise above emerald waters and the seascape takes on an otherworldly quality.\n\n\nThe eastward drive from Hanoi takes about four hours, and you’ll arrive at the port about noon. Here you’ll board a pleasure boat for an unforgettable overnight cruise along the bay. After a welcome aboard the ship, you’ll be led to your cabin followed by a short trip briefing.\n\n\nOnce the ship gets underway, you’ll enjoy a lunch of fresh, locally caught seafood.\n\n\nCruise at a gentle pace, disembark onto smaller boats to venture into grottos and caves, stop to explore floating fishing villages and picturesque lookout points.\n\n\nYou’ll return to the boat just in time to watch the incomparable sunset from the top deck ship before sitting down for a dinner of more delicious, fresh seafood.\n\n\nEvening entertainments or activities onboard (such as cards game, chess, karaoke, squid fishing) are also available.\n\n\nPlease note, each junk operates with a slightly different itinerary and on board facilities.\n\n\nAccommodation: Overnight Onboard a Cruise Ship\n\nMeals: Breakfast, Lunch, Dinner"},{"title":"Halong Bay – Hanoi","description":"Begin your day with a Tai Chi session on the cruise’s sundeck accompanied by complimentary tea and coffee. It’s the perfect locale to integrate your mind and body as the sunrise over the bay compliments this internal martial art perfectly. With a rejuvenated spirit and newly healthy qi (life energy), you’ll sit down for a light breakfast to be served on board.\n\n\nAfter breakfast, you’ll have the opportunities for a swim, or to explore by kayak or to join other available activities.\n\n\nPlease note, each junk operates with a slightly different itinerary and on board facilities.\n\n\nAfterward, you’ll return to the cruise where you’ll have time to relax and enjoy lunch. Then you’ll be transferred to a dock on the mainland followed by a drive to Hanoi.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast, Lunch"},{"title":"Hanoi – Fly to Da Nang – Hoi An","description":"Breakfast and free time until time to go to the airport for your flight to Da Nang. The flight time is approx. 1 and half hours. On arrival, we’ll drive to Hoi An, about 45 minutes drive, to check-in the hotel. The remainder of the day is at leisure.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast"},{"title":"Hoi An Free Day","description":"Today you are free at leisure to explore Hoi An, a World Heritage Site.\n\nAccommodation: Hotel\n\nMeals: Breakfast\n\n\nSuggestions for your free time:\n\n\nWalk around Hoi An in the morning. Visit popular highlights including the Japanese Bridge, the Chinese Temple and Phung Hung Old House.\n\n\nOptional Tour (additional cost applies, this tour can be booked locally): Golden Bridge – Travel to the foot of the Ba Na Hills and ride by cable car up to the Marseille station. It is a short walk to the Golden Bridge from the station. The newly-opened bridge has been designed to make its visitors feel as though they’re walking on clouds. Make sure your camera is charged for the incredible photo opportunities! Continue with a walk into le Jardin d’Amour. The whole garden is made up of 9 gardens, all telling different stories and designed in different styles. The last stop of the excursion is a visit to Linh Ung Pagoda to admire the 27-metre high Shakyamuni statue.\n\n\nOptional Tour (additional cost applies, this tour can be booked locally): Tra Que Vegetable Village Tour – Observe and try the local farming activities. Learn the process of planting vegetable such as raking the ground, sowing, watering, picking vegetables and many others. A light meal will be served during the tour."},{"title":"My Son Sanctuary Tour","description":"After breakfast at the hotel, we’ll set off to My Son, a World Heritage site, 50 km southwest of Hoi An.\n\n\nWe will learn about the Cham history and how this massive sanctuary was built. My Son is a complex consisting of more than 65 architectural towers and temples dating back to 4th century. The site was used for religious ceremonies for Kings of the ruling dynasty as well as burial site for national heroes and royal family up to the 19th century. My Son is considered to be of same historical significance as Southeast Asia’s greatest archaeological sites, including Angkor Wat in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia.\n\n\nAfter that, we’ll drive to the Thu Bon river, where we will take a boat trip back to Hoi An. Then we’ll have a lunch at the restaurant before we return to the hotel.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast, Lunch"},{"title":"Hoi An – Da Nang – Fly to Ho Chi Minh City","description":"After breakfast at the hotel, we’ll leave for the Da Nang airport to fly to the Ho Chi Minh City. The flight time is approx. 1½ hours. Upon arrival, you will be met and transferred to hotel for check-in. The remainder of the day is at leisure.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast"},{"title":"Cu Chi Tunnels","description":"After breakfast at the hotel, we’ll set off to explore the Cu Chi Tunnels.\n\n\nCu Chi is a network of more than 120 km under the ground and were built by sweat and blood of Vietnamese guerrillas to hide and fight against the rival forces. You will be introduced to many kinds of booby traps used during Vietnam War. We will take time to explain the methods of creating, maintaining and living in these tunnels as well as the special technique of hiding smoke invented by the guerrillas.\n\n\nThis tour also includes visiting different types of underground halls, secret working, meeting rooms. We’ll also have the opportunity to spend an hour experiencing the tunnels with a guide.\n\n\nAfter that, we’ll enjoy the tea and cassava (guerrilla’s food during the war) before watching a short (15 minutes) documentary about the tunnel. At the end of the tour, we’ll return to the hotel.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast, Lunch"},{"title":"Mekong Delta Full Day Tour","description":"After breakfast at the hotel, we will set off to explore Vietnam’s picturesque Mekong Delta on this day trip. The Mekong Delta, located in southern Vietnam, is a stunning maze of rivers, islets, small villages with rice paddies and fruit plantations.\n\n\nFirstly, we’ll drive to My Tho City. We can observe as the bustling city views transition to serene rice fields and rural settings. On the way, you will have a visit at the Vinh Trang Pagoda. On arrival in My Tho, hop on a boat for a calm cruise along the river observing stilt houses, fruit plantations and fishing villages. Then, continue to Tortoise Islet where we’ll have our lunch in the orchard garden.\n\n\nAfter lunch, your boat will take you to An Khanh in the beautiful green province of Ben Tre. Taste some local treats like coconut candy and honey tea as you sit back and relax on your wooden river boat in the comfort of the shaded canals covered by water-coconut trees.\nThen, your boat will bring you to the marvellous tropical fruit gardens to enjoy a Southern Vietnamese folk music performance by the local islanders. After a relaxing cultural experience on the water, we’ll return to the Ho Chi Minh City by road.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast, Lunch"},{"title":"Ho Chi Minh City Free Day","description":"Today is at leisure to relax at your hotel, or explore more of the local area independently.\n\n\nAccommodation: Hotel\n\nMeals: Breakfast\n\n\nSuggestions for your free time:\n\n\nOptional Tour (additional cost applies, this tour can be booked locally): A O Show is a sophisticated cultural show featuring talented. This show will bring you on a journey from the rural to the urban life of Vietnam via a series of sketches and acts involving Vietnamese traditional props.\n\n\nOptional Tour (additional cost applies, this tour can be booked locally): Teh Dar Show – Join us a fantastic cultural Teh Dar Show and immerse in an interesting story of Vietnamese highlanders. Get ready to be amazed at the stunning acrobatic movements of the skilled artists and feel the spiritual life’s beauty through an exceptional background live music.\n\n\nOptional Tour (additional cost applies, this tour can be booked locally): Dinner on Saigon River Cruise Tour"},{"title":"Fly Back Home","description":"Breakfast and free time until time to go to the airport for departure flight.  Then, transfer you to the Ho Chi Minh International Airport according to your flight departure time.\n\nMeals: Breakfast"}]},{"name":"Amazing Vietnam Tour","duration":14,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1250,"summary":"Within its spectacular bays and mountains, Vietnam hides its mysterious ethnic minority hamlets, majestic cascading rice terraces, and one of Southeast Asia most vibrant food scenes. We have designed a Vietnam trip package that takes you across the country, from Hanoi – Vietnam’s millennial capital city, to Sapa – the North’s ultimate trekking base. The legendary karst limestone mountains of Halong Bay is next on our itinerary. This New Natural Wonder of the World with serene emerald water is undoubtedly a perfect getaway.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/162734_ea5f0f9f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/162734_ea5f0f9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_25233a10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_64df3184.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_ae74486a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_529f05cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_9a22bf3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_72ef7a49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_c42bb6d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_625edfa6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_2108d30f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_f9150c2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_f15d44c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_7e725a8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_5232c0f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_fea65a67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_ca83a80c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_14556450.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_18bb342d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_14146591.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_366bd4ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_e2f181d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162734_8decc2b5.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrive Hanoi","description":"Meals: NA/Accommodation: Hotel in Hanoi\nYou will be picked up at Hanoi Airport and transferred to your hotel. In the afternoon, you are free to stroll around the Old Quarter and try some local food to your heart’s content."},{"title":"Day 2: Hanoi City Tour","description":"Meal: Breakfast – Accommodation: Hotel in Hanoi.\nStart your tour today by a visit to the Ho Chi Minh Mausoleum, where the embalmed body of Vietminh leader Ho Chi Minh is stored, then followed by the Presidential Palace, including Ho Chi Minh’s stilt house at the back garden. Later, you will be guided to the One Pillar Pagoda and Temple of Literature for a visit. Take a stroll around the beautiful West Lake, which is bordered by many significant sites such as Tran Quoc Pagoda and Quan Thanh Temple. After lunch, a comfortable rickshaw will take you to tour around the ancient Old Quarter, and you will pass by the Hoan Kiem Lake along the way. After enjoying a fascinating Water Puppet Show, the proudest and most intricate traditional folk art of the country, you will be transferred to the railway station to take an overnight soft sleeper train to Sapa, a peaceful land with captivating mountain landscapes."},{"title":"Day 3: Sapa- Lao Chai - Ta Van","description":"Meal: Breakfast- Accommodation: Hotel in Sapa\nUpon arriving at the Lao Cai Railway Station, you will be picked up and transferred to the hotel for check-in (If room available). After breakfast, you will start a lovely trekking in the spectacular landscape of Lao Chai Village, home of the Black H’mong, to have a glimpse of tribal life on the mountain. Enjoy a pleasant picnic lunch and continue your highland adventure to visit the Dzay people in Ta Van village, whose houses nestled in a beautiful valley that provides the best view of intoxicating rice terraces in Vietnam. Keep trekking through a bamboo forest; you will finally reach Giang Ta Chai village of Red Dzao tribe for a tour. Later in the day, you will head back to the Sapa Town and enjoy some free time in the Sapa Market."},{"title":"Day 4: Sapa – Hanoi","description":"Meal: Breakfast – Accommodation: Hotel in Hanoi\nAfter breakfast in Sapa, you will head for Bac Ha Town to visit its most colorful Sunday Market. As thousands of villagers from various ethnic communities in beautiful traditional costumes will gather here to buy and exchange local products, it is also a very good opportunity to taste the local life. In the afternoon, you will set out for an enjoyable walking to Ban Pho village, populated by the flower H’mong people. After a close-up experience with the hospitable locals, you will leave for the Sapa Town then take Tourist Bus to Hanoi. You arrive at the hotel at 10 PM. Overnight in hotel."},{"title":"Day 5: Hanoi – Ha Long Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nAfter enjoying breakfast, you will head out for a 3-4 hour ride to embark on a rejuvenating Ha Long Bay cruise. While cruising the emerald waters of the World Heritage Site recognized by UNESCO, you could marvel at its grotesque limestone cliffs and islands, such as Dinh Huong and Ga Choi, etc. Later on, you will go ashore to visit one of the most fascinating caves in the bay area. And you will stay overnight on board."},{"title":"Day 6: Ha Long – Hanoi – Night train to Hue","description":"Meal: Breakfast-Brunch/Accommodation: On Cruise\nKick start your day early with a Tai Chi session on the sundeck and you will get a chance to admire the ethereal sight of the sun rising from the watery horizon. After breakfast, visit an enticing karst grotto and then go back to the ship for a final glimpse of Ha Long Bay while cruising back to the dock. As the boat arrives at the harbor by noon, check out before driving back to Hanoi. You will then have some free time before getting transferred to Hanoi Railway Station for the night train to Hue.\nRemark: Depend on the availability of the train ticket and the time, if not suitable, we will support to travel to Hue by flight without surcharge."},{"title":"Day 7: Hue","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Hue\nIn the morning, you will arrive in Hue – the next destination to be in our Vietnam trip package. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conical Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. Afternoon, we continue to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n\n"},{"title":"Day 8: Hue – Danang – Hoi An","description":"Meals: Breakfast/Accommodation: Hotel in Hoi An.\nThis morning, you will get transferred from Hue to Da Nang while taking in all the beauty of Lang Co Beach and Hai Van Pass along the way. Upon arrival in Hoi An, check into your hotel and your are free to relax and discover this ancient town for the rest of the day. Stay overnight in Hoi An."},{"title":"Day 9: Hoi An","description":"Meals: Breakfast/Accommodation: Hotel in Hoi An\nPerched on the northern bank towards the mouth of the Hoai River, the atmospheric town of Hoi An was once a major entrepot in Southeast Asia from the 15th century to 19 century,  harboring foreign traders from China, France, Nederlands, Japan, Poland, and Arab. These merchants came here to trade for high-grade silk and ceramics, which are still being produced in the area. Due to many geological and political drawbacks, Hoi An was abandoned from a commercial perspective and spared from the searing wars, as well as industrialization and urbanization. This lovely quaint town now looks almost the same way it did centuries ago with eclectic architecture, tailors shops, and numerous cafes. You will enjoy a half-day walking tour through the narrow winding alleyways visiting Chua Ong Pagoda, Chinese Assembly Halls, the 200- year old Tam Ky ancestral house, and the Japanese Bridge. After that, there will be free time for you to shop or relax. You will stay overnight in Hoi An."},{"title":"Day 10: Hoi An – Ho Chi Minh City","description":"Meals: Breakfast/Accommodation: Hotel in Ho Chi Minh City\nYou are free today until the time transfer to the airport for your flight to Saigon.\nFree time in Saigon. "},{"title":"Day 11: Cao Dai Temple & Cu Chi Underground","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Ho Chi Minh City (HCMC)\nThis morning, you will tour around the city with en route visits to the Reunification Palace, Notre Dame Cathedral, the Old Post Office, and Ben Thanh Market. You will stay overnight in HCMC.\nAfter lunch, proceed to the Cu Chi Tunnels, comprising more than 200 km of underground tunnels and standing as a witness to the searing memories of the Vietnam War. The main axis system branches out to underground hideouts, bomb shelters, and entrances to other tunnels. Its underground system is comprised of numerous trap doors, living areas, sleeping chambers with bamboo beds, storage facilities, weapon factories, field hospitals, command centers, and kitchens. Nowadays, the remaining parts have become a major tourist attraction, offering its visitors a unique insight into life during wartime. Go back to the city center and stay there for the night."},{"title":"Day 12: Ho Chi Minh City –My Tho – Can Tho","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Can Tho\nOur Vietnam trip package also offers you an immersive experience exploring the exotic Mekong Delta. You will leave  the hurly-burly of HCMC for My Tho, where you will enjoy a sail along the canals surrounded by luxuriant greenery on a private boat to a lush orchard. Here, you will be treated to a delicious lunch in a local restaurant in the heart of the Mekong, completed with tropical fruits. You then head to Can Tho City, the heart of the Mekong Delta, for an overnight stay."},{"title":"Day 13: Can Tho – Ho Chi Minh City","description":"Meals: Breakfast, lunchAccommodation: Hotel in Ho Chi Minh City\nYou will wake up to the sounds of the Mekong River welcoming a new day and take boat trip to join in the sun-soaked Cai Rang floating market, one of the busiest floating markets in the Mekong Delta, with hundreds of small boats barging and jostling for space to sell their goods that will definitely leave you in awe. After sampling local fruits, your guide will take you back to the hotel through a myriad of canals. You will have lunch at a local restaurant before returning to Ho Chi Minh City for an overnight stay."},{"title":"Day 14: Departure","description":"Meals: Breakfast/Accommodation: NA\nThere is no activity planned for today, so you are free to enjoy your free time shopping for souvenirs until getting transferred to the airport for your onward flight."}]},{"name":"Vietnam Highlights","duration":10,"travelStyle":["In-depth Cultural","Group","Fully Guided","Coach / Bus","Sightseeing","Historical","Holiday"],"oldPrice":1105,"price":884,"summary":"Vietnam Highlights is the perfect way for a taste of Vietnam's best in a short amount of time. Experience the hustle and bustle of Ho Chi Minh City & Hanoi, relax and soak up the rays on a beach in Nha Trang, hit Hoi An by bike & chill out in the amazing scenery of Hue. Later, sit back & discover the amazing limestone formations of Halong Bay aboard a traditional junk boat as you indulge in Vietnam's coolest spots.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198402_ef5abdbd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198402_ef5abdbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198402_5ea69748db2b0.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City","description":"Welcome to Ho Chi Minh city, formerly known as Saigon. This is one of Asia's most exhilarating cities, steeped in grand history and post-Vietnam war memories. This evening you'll meet your travel comrades and explore the Ben Thanh markets, offering the freshest traditional Bánh mì, Pho and Bia hơi. Oh yes, this is the right way to get the Vietnam party started."},{"title":"Day 2: Ho Chi Minh City to Nha Trang","description":"With some traditional R'n'R on our afternoon agenda, the morning can be used to put on our discovering boots. We'll dabble in history and religion before taking flight to a coastal town overlooking the South China Sea.Golden sand beaches, turquoise oceans, water sports galore - this is Nha Trang. This afternoon why not book in for a mineral mud bath and hot thermal spring experience before heading out to dinner with your crew. Ah, the good life."},{"title":"Day 3: Nha Trang","description":"Good news - we're kicking it in Nha Trang for another night. Have a massage, sign up for the optional cruise, or just hang on the beach saving your energy for seaside bar fun as the sun sets."},{"title":"Day 4: Nha Trang to Hoi An","description":"After a zippy flight north & a short coastal drive we find ourselves in a canal town overflowing with beauty and ancient history.With Japanese, Chinese, Vietnamese and European influences, Hoi An has no shortage of charm and architectural interest. Bike riding through rice fields, roaming the old quarter & ordering custom made clothes at an artful tailor are just some of the activities that will colour our day. Tonight you can opt onto a Vietnamese cooking class, whipping up a storm of up to 4 traditional dishes."},{"title":"Day 5: Hoi An","description":"A short drive from Hoi An are the famous Marble Mountains, a collection of 5 peaks that represent the 5 Elements in Vietnamese folk lore – metal, wood, earth, fire and water. Our local guide would be delighted to take us on a tour through the Thuy Son caves and grottos which are home to some of the most beautiful and intricate stone carvings in the area. The Marble Mountains were also the hiding place of the US Forces during the Vietnam Conflict and even a military hospital! Hear about the history while taking in panoramic views and later, kick back at An Bang Beach before heading back to Hoi An for more Free Time Addons."},{"title":"Day 6: Hoi An to Hue","description":"Though we'll have grown content with Hoi An life, this morning the show must go on. After all, the former imperial town of Hue has invited us over, and we'd be foolish to turn it down.Intricately decorated pavilions, lotus flower ponds, and colourful artworks mark our first sightseeing venture in Hue. Totally in awe of Tu Duc Mausoleum, we move on to the 7-story Thien Mu Pagoda & learn of the horrific history of the Hue Buddhist massacre as well as taking in a cyclo ride to see the city from a whole new angle."},{"title":"Day 7: Hue to Hanoi","description":"Today we fly out of Hue in the direction of Vietnam's time capsule capital. A trio of influences and filled with romance, 2-nights here will see us utterly smitten.With an epic fusion of French, Chinese & Vietnamese influence, you'll be nothing short of ecstatic as we check-in to our Hanoi hotel, right in the middle of the bustling Old Quarter. Our time will be spent weaving through a maze of 36 trading streets filled with colourful goods for sale, and unwinding in the walled gardens of the Temple of Literature. Later, we'll roam French-style boulevards and maybe dine on a nom ngo sen lotus-stem salad, dau chien ron fried tofu & a few bia hoi beers."},{"title":"Day 8: Hanoi to Halong Bay","description":"After a Hanoi history 101 lesson we move on to Halong Bay where a night on a UNESCO World Heritage-listed site awaits.A drive through stunning scenery will evoke plenty of 'oh wow's, but it only gets better as we board our home for the night, a Chinese-style junk boat in Halong Bay. Feel the serenity kicking in immediately as we drift the limestone island seas of the Gulf of Tonkin. We will pass hidden lagoons, thick forests & dreamy grottos, & stop to explore the Sung Sot Caves. A fresh seafood dinner and sunset at our docking spot will polish off a wonderful daypacked with No Regrets moments and simply unforgettable experiences."},{"title":"Day 9: Halong Bay to Hanoi","description":"Today will be all about the leisurely vibes as we wake up to breakfast and a grotto swim. Make the most of your time on the junk boat & kayak your way around Halong Bay - the views don't get much better than this.After heading back to Hanoi we find ourselves enjoying our final night together on tour. Save the choir of tears for tomorrow - this evening is all about making the most of your free time and staying positive. The quirky world-famous water puppet performance in Red River Delta makes for the perfect send off, should you fancy opting for something a bit different."},{"title":"Day 10: Depart Hanoi","description":"Enjoy one final breakfast with the squad this morning before the trip wraps up. Hug it out and make plans to reunite sometime soon - Latin America, perhaps?"}]},{"name":"Vietnam South","duration":10,"travelStyle":["Adventure","Group","Fully Guided"],"oldPrice":835,"price":752,"summary":"Enjoy everything Southern Vietnam has to offer. Begin in Ho Chi Minh with a visit to the war museum, then head to the coastal town of Mui Ne for the beach and sand dunes. Enjoy an evening in Nha Trang, before spending a couple of days at Ninhvana - an all inclusive backpacker resort. Finish off exploring the cultural hotspot of Hoi An on bike, and enjoy a bamboo basket boat ride through the coconut woods.","highlights":["Uncover Vietnam's history at Ho Chi Minh museum","Head to coastal town Mui Ne for beach and sand dunes","Explore the cultural hotspot of Hoi An by bicycle","Enjoy a bamboo basket boat ride through coconut woods"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_99507349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_b1f0956d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_07b6f7ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_86007fd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_2048fe00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_be5ad6b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_c634eb5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143395_62830970.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Hoi An"],"timeline":[{"title":"Day 1 - Airport Pick Up","description":"Today is arrival day; feel free to arrive any time. You will be picked up from the airport by one of our drivers, who will be waiting for you. Then head to the hotel where your group leader will be waiting for you. Get excited to meet your new travels buddies for dinner and drinks in the evening."},{"title":"DAY 2 - CITY ORIENTATION & WAR MUSEUM","description":"Enjoy your day exploring Ho Chi Minh with a walking tour learning about the history & culture of the city then visit the National War Museum. Later we head off to the beautiful coastal desitination of Mui Ne."},{"title":"DAY 3 - MUI NE","description":"Have a relaxed morning, but prepare for a fun afternoon of sandboarding down the dunes of Mui Ne and a walk through the Fairy stream. We'll end the day with a group dinner and fun night out!"},{"title":"day 4 - Explore Mui Ne","description":"Enjoy a lie in or spend the morning relaxing by the pool and exploring the town. In the afternoon, we’ll hop on a bus to the city of Nha Trang and spend the night roaming around the markets or enjoying dinner and drinks with the perfect beach view."},{"title":"day 5 & 6 - ninhvana beach hideaway","description":"We leave Nha Trang early morning & will have a spot of breakfast before we jump onto our shuttle bus to spend the next two nights in Ninhvana. This epic spot is a backpackers paradise. It is up to you how you spend your time. You can choose from paddle boarding, kayaking, bike tours, guided trekking, and yoga classes. Facilities also include 2 swimming pools, beach volleyball courts, outdoor cinema & a basketball court. The perfect hideaway."},{"title":"day 7 - TRAVEL DAY","description":"Enjoy a leisurely morning & make the most of the inclusions of this magical place. We head back to Nha Trang late afternoon & arrive in time for our night bus to Hoi An. You should feel relaxed & raring to go for the next leg of our adventure after your time at Ninhava."},{"title":"day 8 - hoi an","description":"We arrive early morning into Hoi An, drop our bags to our hotel, and enjoy a complimentary breakfast on arrival. As they prepare our rooms we head out to join a traditional Hoi An lantern making class where we learn how to make our own miniature lanterns. The afternoon is free for you to relax after a long journey, or you can explore the town’s markets & tailors."},{"title":"DAY 9 - BAMBOO BASKET BOAT TRIP","description":"Start the day with a bike tour around Hoi An old town and lunch at the locals family home. Then spend the afternoon crab fishing with the locals as we explore the 7 hectare water coconut woods in traditional bamboo basket boats. The late afternoon is free to chill or explore the lantern filled streets."},{"title":"DAY 10 - Chilled checkout","description":"It's time to say goodbye to one another as everyone heads off on their separate ways. Whether you’re continuing around Southeast Asia, or heading to the airport to go home, your Group Leader will help you to get you where you’re going."}]},{"name":"Vietnam Heritage Journey","duration":14,"travelStyle":["Discovery","Family","Group","Partially Guided","Historical","Holiday"],"oldPrice":0,"price":1780,"summary":"Vietnam is world well-known for its breathtaking natural beauty and we have 6 places that were recognized by UNESCO. Within 14 days, we will design this tour to cover all these Heritages. First is Ha Long Bay – World Nature Wonder with emerald waters of Ha Long Bay. Second is Trang An, cultural and geographic wonders. Moving to central of Vietnam, We will discover the incredible Phong Nha – kingdom of caves, enjoy the most marvelous and magical caves in Southeast Asia. Escape from this heaven, we arrive Hue with Imperial Citadel, historical Tombs of Kings and poem Perfume River. 2 more Heritages is Hoi An ancient and peaceful town and My Son Holly Land, a unique beautiful sanctuary world of the ancient Cham religion in various cultural values. You will be added extra value with dynamic Ho Chi Minh City, before venturing to the Mekong Delta with its watery maze of rivers and canals.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146211_b633a39a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146211_b633a39a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_e77485da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_fdab0ef8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_f9871d58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_d8e3b045.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_f639872a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_a030453c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_0a006b92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_01e7a2ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_5811e51e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_befd8a88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_89fa1913.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_858a9919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_dbf7688f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_67a05c72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_b5674595.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_8ce1e6c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_91b555f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_cd8a9060.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146211_ae2707f7.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Welcome to Hanoi","description":"Meal: Welcome Dinner – Accommodation: hotel in Hanoi\nWelcome to Vietnam. Upon arrival at Hanoi Airport, obtain your Vietnam visa ( with pre-approval  letter) , and then clear Immigration and Customs. After collecting your baggage, exit the airport to meet outside our guide and driver. He/she will be holding a sign with your names on it. From the airport, you will be privately transferred to your lovely hotel. Enjoy a traditional Vietnamese water puppet performance, a uniquely North Vietnamese art form celebrating rural life and folklore for over 1,000 years. Then have an welcome dinner in the Vietnamese Restaurant."},{"title":"Day 2: Hanoi’s tangible and intangible heritage","description":"Meal: Breakfast, lunch – Accommodation: hotel in Hanoi\nYou will explore the fascinating Old Quarter  with a lot of shop selling local silk, embroidery, handmade product, art gallery. You will immerse yourself in local culture with local activity of trading goods on the street, eating on vender…. Then follow your tour guide to famous coffee local shop in the Old Quarter to taste a black coffee and take in the sounds and smells of the daily life. You will also visit most popular attraction in Hanoi like Ho Chi Minh complex, Temple of literature, the Fine Arts Museum, the Thang Long Imperial Citadel (a UNESCO designated World Heritage site) or Ethnology Museum. Back to your hotel, free to discover the daily life in the evening of Hanoi."},{"title":"Day 3: Ninh Binh -Trang An World heritage site","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Hanoi\nWe transfer to Ninh Binh province ( 2 hours driving by car) where we will visit Hoa Lu Temple and Trang An World heritage site. Hoa Lu temples are ancient temples, pray 2 first kings of Vietnam, and this area was the capital of Vietnam in 11th Century. Vietnamese lunch will be serve in local restaurant. After lunch, you will relax in Trang An eco-tourism attraction. Taking a boat trip in this area will offers us a wonderful view of natural landscapes such majestic mountains, valleys, forest and grottoes altogether. Transfer back to Hanoi and overnight in the hotel"},{"title":"Day 4: Hanoi – Ha Long Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nAfter enjoy a breakfast, you will head out for a 3-4 hour ride to embark on your amazing Halong Bay cruise. Sailing around the UNESCO world heritage site, you could marvel at the grotesque limestone Karsts in the islands of Ha Long Bay, such as Dinh Huong and Ga Choi etc. Later on the agenda, you will go ashore to visit one of the fascinating caves in the bay area. And you will stay overnight on board."},{"title":"Day 5: Ha Long Bay- Hanoi - Dong Hoi","description":"Meal: Breakfast, lunch ( Or Brunch)– Accommodation: Hotel in Dong Hoi\nContinue sailing around Ha Long Bay today. Get an early start to join a Tai Chi lesson with other passengers on the deck, or just sock in the beautiful view of limestone islands, charming beaches, and amazing grottos. Afterward, your tour guide would wait for you at the dock and transfer you to the airport for your flight to Dong Hoi.\nOvernight in Dong Hoi."},{"title":"Day 6: Phong Nha caves in Quang Binh","description":"Meal: Breakfast, lunch, dinner – Accommodation: hotel in Dong Hoi\nMorning, we go to Son River where we take a boat trip to the park and famed caves at Phong Nha – Ke Bang, one of the newest UNESCO-designated World Heritage Sites in Vietnam. You will have chance to discover Phong Nha cave includes 14 chambers, connected by an underwater river that runs for 1.5 kilometer. Continue to Tien Son cave which was discovered by a local inhabitant by accident in 1935.  The entry mouth of Tien Son is 1 km from Phong Nha cave, at an altitude of 200 meter. After spend 3 hours discover the caves, we drive back to your hotel. Overnight in the hotel."},{"title":"Day 7: Quang Binh – DMZ –Hue","description":"Meal: breakfast, lunch– Accommodation: hotel in Hue\nToday, we continue drive to south of  Quang Binh, along Highway 1A  to visit  Vinh Moc Tunnel and  the Demilitarized Zone (DMZ) in Quang Tri province, where much of the fighting occurred. This area still bears the scars of the massive bombardments that took place – the few remains of the many camps and combat bases, the barren ground pockmarked with craters, and the tens of thousands of graves in the National Cemetery, are solemn reminders of war. Arrive in Hue in the afternoon, check in your hotel, relax and enjoy free time in old capital city."},{"title":"Day 8: Hue","description":"Meal: Breakfast, lunch– Accommodation: Hotel in Hue\nToday’s agenda includes a trip to the Minh Mang Tomb, about 12km from the city center. After that, a Royal Dragon Boat will take you to the 400-year-old Thien Mu Pagoda while sailing down the Perfume River. You will then move on your journey to one of Vietnam’s seven UNESCO World Heritage Sites, Imperial Citadel and the Forbidden City, to find out the hidden charm of this little town. Later in the day, you could stroll around the bustling Dong Ba Market to do some shopping."},{"title":"Day 9: Hue- Hoian via Danang","description":"Meal: Breakfast, lunch – Accommodation: Hotel in Hoi An\nIn the morning we will transfer to Hoi An via Hai Van Pass the beautiful mandarin road, stop over on the top of the pass to take panorama picture of mountain and the sea. When we arrive Da Nang, we will stop for lunch. You’ll have short visit Cham architecture & art museum in Danang before transfer to your hotel in Hoi An. Check in your hotel, and free to discover the ancient town."},{"title":"Day 10: Hoian & My Son Holyland","description":"Meal: Breakfast, lunch – Accommodation: Hotel in Hoi An\nWe discover how the traditions of the past are treasured in the present in Hoi An on the Thu Bon River, a key international trading port between the 15th and 19th centuries – now a UNESCO World Heritage Site for its well-preserved, centuries-old streets, dwellings, temples and pagodas, touring Hoi An’s historic highlights, explore its shop-lined streets, view the red-painted Japanese Covered Bridge and tour the 200-year-old “Phung Hung” house, well  noted for its unique architecture. What you’ll see there will reveal much about the lives of Hoi An merchants long ago. You will visit the workshop making traditional; meet the artisans and try your skills to create your own lantern to take home.\nAfternoon we drive to visit My Son holly land, a unique beautiful sanctuary world of the ancient Cham religion. Between the 4th and 13th centuries a unique culture which owed its spiritual origins to Indian Hinduism developed on the coast of Viet Nam. This is witness to the remains of a series of impresive tower-temples located in this area."},{"title":"Day 11: Hoian – Fly Ho Chi Minh City","description":"Meal: Breakfast – Accommodation: Hotel in Ho Chi Minh City\nMorning, you’ll be transferred to the airport in time for your flight to Ho Chi Minh .\nWelcome to HCMC. Upon arrival at HCMC Airport, you will meet your tour guide then transfer to the hotel in city Centre."},{"title":"Day 12 Ho Chi Minh City – Cu Chi Tunnel","description":"Meal: Breakfast/lunch– Accommodation: Hotel in HO Chi Minh City\nThe highlight for today’s trip is a tour to Cu Chi Tunnel, where human knowledge has been enriched by experiencing an web-like tunnels system of more than 200 km in length which used to be the shelters of guerrillas during the war against American troops .Return to Ho Chi Minh City for lunch by your own arrangement. In the afternoon, you will first stop at the famed Notre Dame Cathedral, mostly known as Red Church, and then visit the Old Post Office. Later, you will be guided to the War Remnants Museum to appreciate some Vietnam War exhibits, and drop by the Presidential Palace symbolizing the reunification of Vietnam.Overnight in Ho Chi Minh City."},{"title":"Day 13 Ho Chi Minh City – My Tho – Ben Tre","description":"Meal: Breakfast, Lunch– Accommodation: Hotel in Saigon\nBreakfast at your hotel. The guide picks you up and transfer you to Ben Tre. On arival, you will take a local boat and then cruise along Ham Luong River, a tributary to the Mekong River. The cool wind from the river and green islands along its banks will get you excited to uncover all the great things ahead. This is the homeland of coconut tree in Vietnam so you will have chance to visit local workplaces to find how local people make their crafts. Touring around the village roads by “Xe Lôi”, the local vehicle, which is a kind of motorized rickshaw. Kayak through the natural canals to get a real experience of the peaceful beauty of the Mekong River as well as the rural life there. After lunch at the local house, you will have some time for relaxing. Then take a car transfer back to Saigon. Overnight in hotel."},{"title":"Day 14: Depart Ho Chi Minh","description":"Meal: Breakfast – Accommodation: N/A\nAfter breakfast, you will be transferred to the airport to catch the flight for your next destination. Your memorable tour ends here."}]},{"name":"Amazing Vietnam Super Save Package","duration":10,"travelStyle":["Sightseeing","Private","Partially Guided","Holiday"],"oldPrice":1403,"price":758,"summary":"Vietnam is worth visiting as it offers a wonderful mix of tropical beaches, post-colonial charm, a string of world heritage sites, stunning scenery, cuisine that enchant visitors and a home-grown flair for hospitality. Start your trip from the North, you will be welcomed by the locals with warm attitude in Hanoi countryside and be ready to be amazed by the spectacular Halong Bay- one of the seven wonders of nature. Then head to Hoi An, an ancient lantern town sits peacefully by the Thu Bon river, the essence of the tranquility will cherish your leisure time. Travel to the south and explore the mighty Mekong delta which to be known as 'rice bowl of Vietnam' and astonishing the mysterious underground system in Cu Chi Tunnels. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137412_ee7e88.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137412_ee7e88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_af500fc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_f66ec44a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_4526d6fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_a2db6f14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_e0d328a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_c0bebdc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_535184ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_92791654.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_b5d76850.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_14277c1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_a6b91f81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_9e85e7fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_4146cb09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_b02feb3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_a8a7076e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_7af0d350.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_20d3cafa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_87002f72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_08239fcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_3f677a38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137412_8ad6d38c.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"DAY 2: ESCAPE FROM THE HUSTLE OF BIG CITIES WITH BA VI ECO TOUR (B/L)","description":"08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive at Mr Duoc’s house with a welcome drink.\n10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place where you can enjoy beautiful scenery of the village. This Tea Plantation plays important role in providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea.\nMr Duoc is a veteran of Vietnam War and the owner of a large tea farm. He also is an expert in handling the raw tea leaves, he will introduce you how to make a good green tea before selling.\nYou will have great time listening to the host’s stories of his life in Vietnam war, besides, enjoying great tea with green lentils or lotus seeds that made by his family.\n11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you will have great time to enjoy the lunch you cooked. \n12:30: Have lunch with the host’s family and short break after lunch.\n(Meals: breakfast, lunch)"},{"title":"DAY 3: CRUISING TO THE MOST PICTURESQUE BAY OF VIETNAM (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise at 7:30. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise\n(Meals: breakfast, lunch, dinner)"},{"title":"DAY 4: MORNING IN THE NATURAL WONDER OF THE WORLD - TRAVEL TO HOI AN OLD TOWN (B/L)","description":"Rise early for Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Then, taking the flight to Hoi An. Check in your hotel and free at your leisure time to get your energy back.\n(Meals: breakfast, lunch)"},{"title":"DAY 5: A DAY OF BEING A LOCAL (B/L)","description":"Would you like to go fishing with the local fisherman? Why don't you have a fun experience with the funny basket boat. You shouldn't have any hesitance because the day will put a broaden smile in your face. It is very interesting to fish here on the river with the local fisherman as you catch your fish and we cook for you. \nOn the Fishermen & the Waterways of a Past War Tour you will enjoy a wide range of experiences - from learning traditional fishing techniques to paddling the strange and unique Vietnamese bamboo basket boats while exploring the now tranquil coconut-palm flanked waterways of a past war. On this tour we provide an authentic social and cultural insight into the local Vietnamese way of life. As well you will take part in some hands-on activities that are fun, safe and interesting to people all of ages.\nStrat of the tour at 8:00 am, pick up from your hotel lobby.\n(Meals: breakfast, lunch)"},{"title":"DAY 6: HOI AN LEISURE DAY (B)","description":"Today you will have free time explore Hoi An at your own pace, seeing what interests you. This ancient town is full of Japanese merchant houses and pagodas, temples and antique warehouses. Or just lounge about in a laid-back riverside café on the bank of the Thu Bon River."},{"title":"DAY 7: TRAVEL FROM HOI AN TO HO CHI MINH CITY","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Da Nang to Ho Chi Minh City. Approximately flight time is one hour and 30 minutes. Upon your arrival, you will be transferred from the airport to your hotel in Ho Chi Minh City’s center."},{"title":"DAY 8: EXPLORE THE FASCINATING CU CHI TUNNEL (B)","description":"08:00 – 08:30: Pick you up at your hotel\nThe trip will take approximately one and a half hours driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special native Cu Chi tapioca will be served. \n13:00 – 13:30 Drop off at your hotels. Trip ends.\n(Meals: breakfast)"},{"title":"DAY 9: DISCOVER THE LUSH AREA OF MEKONG DELTA (B/L)","description":"(start 7.20am  – return around 17.30 )\n7:20am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh.\n(Meals: breakfast, lunch)"},{"title":"DAY 10: TIME TO SAY GOODBYE - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"3-Day Ha Long Bay on Deluxe 4-star Cruise with Kayaking, Swimming, Cooking Class,...","duration":3,"travelStyle":["Sightseeing","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":255,"summary":"Observe stalactites in miraculous form inside Sung Sot Cave (Amazing Cave), one of the largest caverns in Halong Bay. Kayak around the scenic bay, go swimming at Ti Top Island, or even hike up for a panoramic view. You'll find plenty to do in this UNESCO World Heritage area, including cooking classes on board.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143974_509e081d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143974_509e081d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_d25979b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_8b903fa5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_e31f6d77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_04b34ace.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_04df1605.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_e7709ea4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_9f5536ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_582b00ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_962f5e38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_bde032af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_456c60fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_10ec9e43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_480f3287.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_5cb9108c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_3d191f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_39870eec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_f03c5734.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_e519394c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_3cdb495c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_b2ebf823.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_56f33931.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_da9222c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143974_bb9975ff.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ha Noi - Ha Long - Sung Sot Cave - Kayaking - Cooking class (Lunch, Dinner)","description":"7.45 - 8.15: Our car and guide will pick you up at your hotel (Hanoi Old Quarter), departure to Halong bay. \n10.00: Have a short break about 20 minuttes \n12.00: Arrive at Bai Chay, Halong Tourism harbour. \n12.15: Transfer by tender to the Cruise. Enjoy welcome drink. \n12.30: Start cruising to visit Ha Long Bay - one of the New Seven Wonders of the World, UNESCO World Heritage Site and check in your cabin. \n13.00 - 14.00: Have lunch - enjoy deluxe Vietnamese Set Menu. \n14.30: Transfer by tender from boat to Surprising Cave (Sung Sot Cave). Walk up about 100 steps to the cave entrance and tour the cave for approximately 45 minutes. \n16.00: Enjoy kayaking or relaxing on the cruise. \n18.00: Have cooking class on the cruise. \n19.00 - 20.00: Have dinner - enjoy Vietnamese food. \n21.00 - 23.00: Evening activities: sing karaoke, join squid fishing or relax on the sundeck, sightsee Halong Bay at night. \nOvernight on the cruise. "},{"title":"Day 2: Ha Long Bay - Kayaking - Hanoi (Breakfast, Lunch, Dinner)","description":"6.00: Starting your day with taichi on the sundeck. \n7.15: Have a breakfast \n08.15: Transfer to the Day Cruise Boat and begin to cruise to some of Halong Bay’s most secluded and untouched area. \n09.00: Enjoy kayaking to explore the Dark Cave and Bright Cave. \n11.00: Return to the boat and relaxing, sun bathing on sundeck. \n12.00: A multi-course lunch will be served mid-day with seafood and grills. \n13.00: Cruise further to the Ba Trai Dao area \n14.00: Swimming or sunbathing on the small ambiance beaches in Ba Trai Dao area. \n15.30: Explore the largest Van Gia fishing village in Halong Bay by Kayak. You will have chance to interact with local fishers. \n17.00: Return to the Cruise. \n19.30: Have dinner and overnight the second night on the boat. "},{"title":"Day 3: Ha Long Bay - Titop Island - Ha Noi (Breakfast, Lunch)","description":"7.15: Have a breakfast on cruise\n8.00: Stop at Ti Top island. Climb to the top of mountain, sightseeing Halong Bay's panorama view or relaxing, swimming at the TiTop beach. \n9.30: Return to the boat. Check out cabins. Enjoy relaxing & have a sunbathing on sundeck while our boat is back on different route \n10.45: Enjoy Set Menu served in dining room while seeing the bay scenery when we approach the pier (passing Fight Cocks, Incense Burner, Stone Dog) \n12.00:Disembark Tuan Chau Habour and take shuttle bus to come back Hanoi\n16.00: Arrive Hanoi and drop you off the your hotel in Hanoi Old Quarter.\nFinish the tour. See you again!"}]},{"name":"SEE ALL EAT WELL: Vietnam Group Tour - 10 days","duration":10,"travelStyle":["Discovery","Adventure","Group","Partially Guided"],"oldPrice":0,"price":849,"summary":"When it comes to food experience, Vietnam owns a soft, memorable and convincing side that can satisfy the craziest hunger of worldwide foodies. For 10 days, join in the Vietnam small group tour, travellers will make the most of Vietnam, plus, taste all way from Hanoi to Ho Chi Minh City with iconic destinations and delightful dishes promoting best local flavours in each region.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108911_cb9fbf4b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108911_cb9fbf4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c331b94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_25b950b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c343e0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c3021ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c33ad2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108911_5e05e4c319aa4.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ben Tre","Ho Chi Minh City"],"timeline":[{"title":"HANOI ARRIVAL: WELCOME TO VIETNAM","description":"Xin chào! Welcome to Hanoi, Vietnam. Hanoi, one of Asia’s most enchanting cities, is full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted by your guide and driver at Noi Bai International Airport for your transfer to the hotel.\n\nWe start our evening with a welcome dinner hosted in a lovely local restaurant where you can taste the various ethnic gastronomy specialties of Northern Vietnam. During dinner will learn about two important aspects of Vietnamese life that will prove very useful during your trip – basic language and chopsticks handling skills. We will teach you the most common phrases and expressions that can used during the many encounters to be expected on our trip; and do not fear the use of chopsticks, we will teach you all the tips and tricks that can be used to really enhance your Vietnamese experience.\n\nOvernight in Hanoi.\n\nMeals: Breakfast, Lunch, Dinner\n\nAccommodation: May de ville Old Quarter"},{"title":"SLICES OF LIFE IN HANOI","description":"Get ready to see Hanoi as very few others do. This tour is the perfect blend of iconic cultural sites of Hanoi and offbeat districts to sample some genuine local life. The guide meets you in the hotel lobby and off we go. After a short car transfer to the South of Hanoi through a busy urban area, we veer off the main road and enter a very special district. It suddenly feels like stepping back in time, into the 1960’s when Hanoi was a quaint capital populated mostly by modest workers. Wander around these narrow alleys covered in colourful market stalls, feel the incredible vibe and let the guide tell you the story of these unusual big yellow buildings. We have a coffee break before transferring to the Temple of Literature. We visit the little gem of architecture and huge piece of history. For lunch, we suggest to walk to a nearby street food shop. There are several options, our favourite would be the Bun Cha flame-grilled pork meat served with sticky rice noodles.\n\nIn the afternoon, we continue to the garden of the Presidential Palace, where you can also see the One-Pillar Pagoda and the house on stilts where Ho Chi Minh lived. Afterwards, we have a quick fresh beer in a local bia hoi, the Vietnamese version of a pub. We return to the hotel in the afternoon. The rest of the day is at your own leisure.\n\nOvernight in Hanoi.\n\nMeals: Breakfast, Lunch & Dinner\n\nAccommodation: May de ville Old Quarter"},{"title":"TRANQUILITY IN HALONG BAY","description":"We gather in the lobby at 8.00 AM for our departure to the majestic Halong Bay. We drive across the Red River delta and reach the coast a little before noon. We then embark on a beautifully crafted junk for an overnight cruise in the legendary seascape of Halong Bay. Once on board, we are served a delicious seafood-based lunch, while the surrounding limestone outcrops make for a truly magical setting. In the afternoon, we reach a less travelled area where we will devote ourselves to pure relaxation. The program is not fixed and depends on the time of the year and weather, but there will be an opportunity to visit a cave as well as explore a floating village or do a little bit of kayaking over the course of these 2 days. We end the day on the sundeck as the sun sets on this magical seascape. This evening, you can enjoy an aperitif or attend a cooking demonstration before dinner. Overnight in a comfortable private cabin with an en-suite bathroom.\n\n *Note:\n\nCruise itinerary and schedule are subject to change due to weather, tide levels and operating conditions. Swimming or kayaking excursions may be cancelled due to poor weather.\nThe tour leader will not be accompanying guests on the shuttle bus or boat. There will be an on-board cruise manager who will be available for guests should they have any questions or concerns.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Bhaya Classic Cruise – Deluxe Cabin"},{"title":"FROM EMERALD WATERS TO THE ANCIENT TOWN HOI AN","description":"For those early birds, start the day with a Tai Chi class or enjoy a cup of tea or coffee as the sun rises and illuminates the surrounding seascape. We then continue our exploration of the bay. Upon returning to the boat, check-out of your cabin and enjoy a lunch while cruising back to the pier. We disembark and transfer to Hanoi airport for your flight to Danang. On arrival in Danang, you are greeted and driven to your hotel in Hoi An.\n\nOvernight in Hoi An.\n\nMeals: Breakfast, Brunch\nAccommodation: Blue Sky Hotel"},{"title":"UNIQUE FLAVOURS OF HOI AN","description":"This morning after breakfast, we start our walk across the enchanting ancient town of Hoi An. Follow your guide as you meander your way through the beautiful streets and narrow alleys, which are bordered by ancient yellow-walled houses. We reach a market where you can spend some time exploring the colourful stalls and the variety of foods and souvenirs on offer. Try some local delicacies before we venture further into the town. The guide will show you various places of interest and will also arrange some spontaneous food tastings as we walk.\n\nAfternoon is at your own leisure.\n\nOvernight in Hoi An.\n\nMeals: Breakfast, Lunch\nAccommodation: Blue Sky Hotel"},{"title":"GETTING ACTIVE IN HOI AN","description":"At 8.00 AM this morning, our guide will pick you up from your hotel, and equipped with bicycles you will set off directly towards Duy Vinh Commune. The picturesque cycling route is highlighted with rice fields, local gardens and markets. Stop as often as you wish to take photographs or engage in some laidback chats with locals (using our guide as a translator). There is also time to pay a visit to a local family who are still practicing the craft of weaving sedge mattresses using traditional techniques.\n\nAfter about 1.5-hour cycling, it is time to hop into a kayak and off we go to explore the river. As you paddle towards Cam Thanh cocopalm forest, you will notice that the area is a large mangrove ecosystem unique to Hoi An, and the scenery is just spectacular. To end an active morning, your lunch will be served at a local farm with tasty Vietnamese food. Take as much time to relax as you wish before transferring back to your hotel. The rest of the day is at your own leisure to enjoy the town or some time relaxing on the beach.\n\nOvernight in Hoi An.\n\nMeals: Breakfast, Lunch\nAccommodation: Blue Sky Hotel"},{"title":"READY, SET, SAIGON","description":"You are met in the lobby of your hotel for a short transfer to Danang airport. Embark on your flight to Ho Chi Minh City, the big metropolis of the South. You are greeted upon arrival and driven to your hotel in the city centre, historically called Saigon. Dinner is served at a local restaurant.\n\nOvernight in Saigon.\n\nMeals: Breakfast, Dinner\nAccommodation: Muong Thanh Centre Hotel"},{"title":"DISCOVERING THE LIVELY DISTRICTS","description":"Your guide meets you in the hotel lobby at 8.00 AM and off we go for an original morning to explore the less travelled trails of this fascinating city. Prepare to travel back in time as we first head to District 3, where we visit the oldest café in town which was opened in 1938. Enjoy a refreshment, before we immerse ourselves into the genuine Saigon popular culture. Walk through a massive street-market, as you gently elbow your way between conical hats and mobile street food sellers to exit at Chung Cu. Here you will find yourself in the heart of Saigon’s working-class, which remains mostly unchanged since the 1960’s. Marvel at the size of these old residential buildings as we walk through and into the Ho Thi Ky Quarter. A place known for its spectacular flower market, and its maze of quiet narrow streets. A place also surprisingly famous for its Khmer delicacies since the 1990’s. Here you will be able to enjoy some of these traditional snacks. We continue deeper into District 10, a fantastic destination where every street corner holds a surprise and a chance to amaze you. Our urban adventure ends at one of the most famous street-food streets in the city, time for lunch!\n\nIn the afternoon, we take a digestive walk around the colonial buildings of the District 1. We start at the Independence Palace, continue to the Notre-Dame Cathedral and the Saigon Central Post office before we get to the beautiful Nguyen Hue street where the City Hall stands. To complete the day, we take you to taste a few brews in one of the most famous craft beer taprooms of the country, located in Pasteur Street.  We transfer back to your hotel afterwards, and end the day at your own leisure.\n\nOvernight in Saigon.\n\nMeals: Breakfast, Lunch\nAccommodation: Muong Thanh Centre Hotel"},{"title":"A DAY IN MEKONG DELTA","description":"Departing from your hotel at 8am, we drive out of the metropolis and after about 2 and a half hours we reach a less travelled region of the delta, about 30-kilometres away from the mouth of the mighty Mekong River. We hop onto our private boat and start our exploration. We will meet some friendly locals, learn more about their daily lives and navigate the Mekong. After visiting a local factory and an ancient communal house, we reach a small island for lunch at a local guesthouse.\n\nIn the afternoon, we visit a honey-bee farm before hoping onto bikes and cycling narrow pathways across the island. We stop at another local farm to unveil the secret of Sâm jelly and sample it. We continue across some orchards and transfer onto a small sampan to explore a thick mangrove. We return to the mainland, where our vehicle awaits to return us to Ho Chi Minh City. We arrive at your hotel in the late afternoon.\n\nOvernight in Saigon.\n\nMeals: Breakfast, Lunch\nAccommodation: Muong Thanh Centre Hotel"},{"title":"TAM BIET SAIGON","description":"The day is free at your own leisure until your transfer to the Tan Son Nhat International Airport for your departure flight. We wish you a pleasant flight!"}]}]