[{"name":"Simply Vietnam (New)","duration":10,"travelStyle":["In-depth Cultural","Group","Fully Guided","Historical","Holiday"],"oldPrice":0,"price":1210,"summary":"This short break encompasses the best of Vietnam in just 10 days. Using local transport and staying in simple hotels, we experience lush landscapes, discover harrowing history and sample incredible fresh food.   Hanoi - Wander through the bustling narrow streets of the Old Quarter.  Hoi An - Take a cookery course or try out traditional lantern making.  Mekong Delta - Meander along palm-lined canals and barter for exotic fruit. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/173186_91fda6a6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/173186_91fda6a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_d8872f8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_8bc76b4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_7a898f42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_2164b1ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_360de542.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_9d569271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_a7a3d866.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_7145a84c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_f851115c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_d16c92bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_91c982af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_7d33b781.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_ffcbc7af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_49b1b213.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_1bf3bcd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_7f4c35f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_1e9a03cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_8a57b248.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_c24496c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_73a49eeb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_c2e1aa07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_05d72b8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173186_62d674ff.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Join trip in Ho Chi Minh City; afternoon orientation walk in Old Saigon","description":"Still commonly referred to by locals as 'Saigon', the city is the largest in Vietnam and the country's commercial hub. You will find an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit.\n \n For those arriving on time today our Leader plans to meet you in the hotel reception at 4pm for the welcome meeting and to take us on the walking tour.  The tour will take in some of the central sights of the city, including the Opera House (formerly South Vietnam National Assembly), Hotel de Ville, Notre Dame Cathedral and the impressive French style edifice that is the GPO building.\n \n If you would like to receive a complimentary airport transfer today, you will need to arrive into Tan Son Nhat International Airport (SGN), which is 30 to 40 minutes\\  from the hotel.\n \n Please note that if you wish to join the afternoon orientation walk today, you must arrive at the hotel by 1.30pm. If you are booking your own flights, we recommend giving yourself at least 30 minutes\\  to clear the airport. From the airport to the hotel is around 30 minutes\\  drive, so therefore the latest your flight can arrive is 1pm. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk."},{"title":"Day 2: In Ho Chi Minh City; Optional visit to the Cu Chi Tunnels or a boat trip in the Mekong Delta","description":"No visit to Ho Chi Minh City would be complete without exploring something of its tragic recent history and the poignant reminders of what the Vietnamese refer to as the American War can still be seen amongst the buildings and artefacts of the old US Embassy, as well as the remarkable Reunification Palace and the emotive War Crimes Museum, which contains a fascinating, and at times chilling, reminder of the cost of the Vietnam War on the people themselves. Another option is to join an excursion out to the infamous Cu Chi Tunnels. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops and were a major part of the Tet Offensive. This area was the centre of intense fighting during the war, much of it falling prey to the incessant carpet bombing, napalm and defoliants utilised by the Americans in an attempt to dislodge the Viet Cong from their underground shelters. There is little evidence of any of that now and the landscape has returned to something of its pre-war beauty, but exploring the tunnels of Ben Dinh and Ben Binh gives some idea as to the conditions that the Vietnamese and their American adversaries had to endure. Be warned, the tunnels are low and narrow and can be claustrophobic. \n A full day's visit to the colourful Mekong Delta can also be organised, to witness locals barter for fresh produce at a floating market and to take a sampan through the small narrow waterways of the Delta."},{"title":"Day 3: Morning flight to Danang, drive to Hoi An and afternoon tour of the Old Town","description":"This morning we transfer to the airport for our short flight to Danang in Central Vietnam. On arrival in Danang we will continue our journey by charter bus to Hoi An. On our way we pass the popular beach resort of My Khe, better known as China Beach, an area that during the Vietnam War was popular with the American GIs on RnR. Given the early hour of our arrival at the hotel we might not be able to check-in so we plan to store our bags, have breakfast (not included) then embark on a walking tour of Hoi An. First colonized by the Portuguese in the 16th century, by the 17th and 18th centuries Hoi An had become one of the busiest international trading posts in southeast Asia and, even today, it still retains the engaging charm of a medieval port, with many of its old buildings superbly preserved. Highlights include the Phuc Kien Assembly Hall, a pagoda dedicated to the worship of Buddha originally built by the Vietnamese people in the 16th century and the 400 year old Japanese covered bridge. We end at the colourful riverside market, a perfect setting for exploring, the rest of the day is free to enjoy as you wish."},{"title":"Day 4: In Hoi An, free day to enjoy the Old Town, visit nearby beach or hire bicycles to explore surrounding countryside","description":"Today is free to wander through the historic heart of this World Heritage Site at your leisure. An early morning visit to the fish market presents a riot of noise and colour that is perfect for some great photo opportunities and some choice local interaction. You might also like to pay a visit to the Japanese Bridge, Hoi An's emblematic symbol, believed to have been constructed to quell the violent rumblings of a restless monster, or perhaps explore the traditional wooden houses and Chinese temples that line the streets. There are numerous tailors shops in Hoi An providing an incredibly cheap and quick service and almost all visitors have at least one item made before they depart. Hoi An is also a great place to hire a bicycle as the roads are relatively quiet. There's a good beach just a few kilometres from the town or alternatively why not set out to explore nearby villages. Cooking classes are yet another option available in this popular traveller's hangout."},{"title":"Day 5: Drive along the coast via Hai Van Pass to Hue; free afternoon","description":"This morning sees us heading along the coastal road towards the historic setting of Hué, crossing part of the Truong Son Mountains and travelling via the Hai Van (Sea Cloud) Pass. This stunningly scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and the journey should get us into the old imperial city around lunchtime, after which the rest of the day is free for personal exploration. Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hué is divided by the waters of the Perfume River, which separate the city's 19th century citadel from the suburbs that radiate from the eastern shore and, even today, its easy air of leisurely ambience makes it one of the most engaging cities in the country to explore."},{"title":"Day 6: In Hue, optional visit to the Imperial Palace and cruise along Perfume River. Catch an overnight train north","description":"With the better part of the day to enjoy the city, Hué offers a wealth of options to make the most of your time here. You could pay a visit to the iconic Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hué. Dedicated to the Manushi- Buddha, the existing temple was constructed in the middle years of the 19th century, under the auspices of the Emperor Thieu Tri, and within its confines you can find a number of superb Buddhist statues, as well as an enormous cast bell that weighs in at over 2000kg and is reputed to be audible over 10km away. Another alternative is to spend some time exploring the Old Citadel that dominates the left bank of the Perfumed River. Built by the Nguyen dynasty (Vietnam's ruling emperors from the early 1800s to1945), the Citadel has formal moats and impressive ramparts that were constructed to be an exact copy of the Forbidden City in Beijing. During the bloody conflicts of the Vietnam War, Hué was the site of some of the most destructive fighting of the Tet Offensive, most of the Inner City being totally destroyed during the month-long battle in 1968. The vast outer walls and the West Wing remain though and provide an eloquent reminder of the palace's former glory. Farther afield, amongst the forested landscapes of the Perfume Valley, you can find the Royal Tombs of the Nguyen kings, the unique mausoleums of the emperors that provide an ideal destination to explore by bicycle. Later this afternoon we will then head for the railway station to board the overnight train north to Hanoi, Vietnam's vibrant and historic capital."},{"title":"Day 7: Early morning arrival in Hanoi; drive to Halong Bay to cruise through the turquoise waters aboard a traditional junk boat","description":"Arriving in Hanoi in the early hours of this morning we disembark the train and transfer by road towards the Bay of Tonkin on Vietnam's northeast coast. Our destination is the breathtaking setting of Halong Bay one of Vietnam's, and indeed Southeast Asia's, most spectacular natural attractions, whose staggering beauty has seen it listed as one of the eight natural wonders of the world. A UNESCO World Heritage site, Halong Bay presents a quite extraordinary vista of hundreds of limestone islands (over 1600 at last count) that rise from the jade green waters of the bay like the scales of some great submerged dragon. Indeed Halong means 'where the dragon descends to the sea' and local legends tells of a time when this rugged landscape was created by the pounding tail of a mighty dragon as he ran from the mountains into the glittering waters of the bay below. On arrival we will board our junk and set sail, threading our way through a flotilla of boats, junks and wooden sampans as they ply their way across the gentle waters of the bay. The plan for today is to sail through this stunning seascape, stopping off to swim and visit some of the limestone caverns that pepper the landscape. Later this evening we disembark from our boat and transfer to our hotel in the Bay."},{"title":"Day 8: Return to Hanoi; orientation walk of Old Quarter","description":"Returning back to Hanoi your tour leader will then take those that wish on a short orientation tour of the city, wandering the streets of the city's Old Quarter, whose narrow streets are named after the various crafts and specialities of the city's artisans: Paper Street, Silk Street, Basket Street etc. This practice dates back to the 13th century, when the city's original 36 guilds established themselves here, adopting a street each to differentiate them from their neighbours. The maze of alleys and streets present a fascinating venue to explore on foot and the area is known for its interesting 'tube' houses, where the narrow frontages give way to long rooms that stretch back from streets, whose pavements are littered with food sellers tempting passers-by with all manner of noodles, snacks and stir-fried delights from shoulder panniers. Later today there may be a chance to witness a remarkable performance of traditional water puppetry, a practice that dates back to the 15th century and is deeply ingrained into the cultural lives of the peoples of the Red River Delta. Set on a flooded stage, the stories tell tales of legendary heroes and everyday life, with dragons and unicorns sharing the stage with ducks and frogs, and even fireworks and naval battles."},{"title":"Day 9: In Hanoi; free day with option to visit the French Quarter or Hoan Kiem Lake","description":"Architecturally styled like a French provincial town, with tree-lined boulevards and substantial low-built houses, Hanoi is a wonderfully nostalgic city to enjoy and amongst its more interesting sights are the charming One-Pillar Pagoda, the Temple of Literature and the Presidential Palace. Ho Chi Minh was a spartan-living and scholarly man, who chose not to live in the Presidential Palace itself, but instead preferred a simple teak 2-storied stilt-house specially built for him in the grounds. You can visit his museum and this austere mausoleum, said to resemble that of Lenin in Moscow, or perhaps taking another walk through the engaging streets of its Old Quarter. The city's French Quarter is a great place to explore by bicycle, its grandiose colonial architecture offering up a rich contrast to the more frenetic pace of the old city, whilst those looking to discover something more of the colonial wars might like to pay a visit to the Museum of Vietnamese Revolution or the Military History Museum."},{"title":"Day 10: Trip ends in Hanoi","description":"The trip ends after breakfast at our hotel in Hanoi.\n \n There are no activities planned today, so you are free to depart from Hanoi at any time. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you'll need to depart from Noi Bai International Airport (HAN), which is 45 minutes from the hotel.\n \n If you have time, you may wish to take another wander through the fascinating Old Quarter or stroll along the shore of Hoan Kiem Lake."}]},{"name":"Discovery Hanoi - Sapa - Ha Long Bay - Ninh Binh","duration":8,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":455,"price":410,"summary":"Northern Vietnam is blessing with many beautiful places as Halong  Bay ( one of the new seven wonders in the world). Sapa, one of the most breathtaking hill stations in Vietnam which reflects the signature of French architecture and colorful hill tribal cultures. This is home to stunning mountain landscapes, verdant rice terraces, unique stilt villages.\nFurther to the northwest, Sa Pa lies among mountains and jungles to maintain a special cultural diversity in a combination of ethnic minority groups’ culture.\n\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/149113_3d2e0386.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/149113_3d2e0386.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_10546be4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_b945bb5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_542fccf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_8b02a79c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_445f469a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_dc0657dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_f36ad75a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_ec356013.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_690581db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/149113_7aac3fc0.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. \nCheck in hotel and overnight in Hanoi "},{"title":"Day 2: Hanoi City Tour - Night train to Lao Cai","description":"Breakfast at the hotel and the car and guide take you visit Ha Noi as Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university\nLeave for a legendary Hoan Kiem lake and Ngoc Son Temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians. Drop you off at your hotel \nFree time until 19:00- 20:00 PM, the driver pick you up at your hotel transfer to Hanoi train station to take night train to Lao Cai, \nOvernight on the train "},{"title":"Day 3: Lao Cai - Sapa – Y Linh Ho – Lao Chai – Ta Van","description":"Pick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\nStart the trip at 9:30 as below.\n12 km of trekking, visit Y Linh Ho and Lao Chai villages of the H’mong minority. after lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay where we stay overnight in a local family. Here you have opportunity to experience their daily life, work and original custom. \n\n•\tBreakfast, Lunch and dinner are all included\n•\tHome-stay at the Dzay local house in Tavan Village\n•\tTrekking level: 5/10\n•\t12 Km of trekking     \n"},{"title":"Day 4: Ta Van – Giang Ta Chai – Su Pan - Sapa- night train to Ha Noi","description":"Breakfast will be serving at the homestay at about 8Am\nStart trekking at 9:30 Am\n8 km walking to visit 2 villages of the red Dzao, the H’mong (Giang Ta Chai & Su Pan). Visit a beautiful waterfall and rattan bridge. Enjoy landscapes… through bamboo forest on the way to the main road to get the jeep to return to Sapa. Tour finish in Sapa by 3PM. You can take a shower before get on the train to Ha Noi.\n•\tBreakfast, Lunch and dinner are all included\n•\tTrekking level: 5/10\n•\t8Km of trekking, 12 Km of driving back to Sapa.\n•\tTourist shared bus to Lao cai Station \nGet on the train to Hanoi, Overight on the train. "},{"title":"Day 5: Hanoi - Ha Long Bay (Breakfast, Lunch, Dinner)","description":"In the early morning around 4:30- 5:00 AM arrive Hanoi train station, you take a taxi to hotel. Free and easy. No check in hotel.\nHave a breakfast at hotel.\n7.45-8.15:  The shuttle bus pick-up at the hotel. (Note: this time applied for those who book our shuttle bus service)\n10.00:  Having short break at stopover in Hai Duong Province.\n12.00 – 12.30: Embark on Halong Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15:  Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner Island, Fighting Cock islet, Stone Dog… The Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n15.00-16.30 PM\n•\tDo kayaking through the magnificent landscape with Limestone Mountains in Luon Cave, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\n•\tBack to Halong Cruise and join sunset party\n•\tPass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n•\tJoin our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19.30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\n•\tJoin squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke….\n•\tOr Laze yourself with our happy-hour drinks at the bar.\n•\tOvernight on Cruises"},{"title":"Day 6: Halong Bay - Hanoi (Breakfast, Lunch)","description":"06.15: Morning exercises on the Sun-deck.\n07.15: Have breakfast with Coffee, tea and Bakeries on board.\n08.00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09.30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10.15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12.00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16.30 – 17.00 : Arrive in Hanoi. Check in and free at night."},{"title":"Day 7: Hanoi - Ninh Binh - Hoa Lu - Tam Coc - Hanoi (Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\n\nDepart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\n\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \n\nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n\nLearn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n\n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\n\n Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n\n18:00 Arrive in Hanoi. Tour ends.\n"},{"title":"Day 8: Hanoi Departure (Breakfast)","description":"Breakfast at hotel, tour guide  and driver will pick you up at your hotel and drive to the airport for your flight back home. "}]},{"name":"8 Day Exploring Vietnam From North to South","duration":8,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1066,"summary":"\n\tExploring Vietnam From North to the South Point ! Guide will pick you up at Noi Bai Airport then transfer to Hanoi Old quarter Hotel which mentioned at 4 star hotel and relax if you arrive at afternoon and enjoy cycling surroundings. Next Day, Finish your breakfast at hotel before departuring to Ha Long Bay on Land ( Ninh Binh - Hoa Lu -Tam Coc Pre -Vietnam capital 1000 years ago....\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137660_b65c7942.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137660_b65c7942.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_c4c3a65a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_d32401d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_097a9344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_bcfb217b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_1e98779e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_e93bbd76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_0b9b7b3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_41af925c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_3317a07a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_e59db114.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_3f82494f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_f79dbbe2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137660_e6ef6dac.jpg"],"destinations":["Hanoi","Ninh Binh","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome Dinner Activities:  Arrive in Hanoi and free. Depending on your Fight on Arrival. LVP Travel will support and give you the best suggestions for the time left, Hanoi City haft of day or Full city hanoi tour will be on available\n\nItinerary:  \nYou will be welcomed at the airport and transferred to downtown. Hanoi, a city of lakes, shaded boulevards and verdant public parks - the capital of Vietnam. The rest of day is yours. Check in hotel and then enjoy a welcome dinner with traditional local food.\nOvernight in Hanoi.\n"},{"title":"Day 2: Hanoi","description":"Hanoi City Tour Activities: Visiting the Ho Chi Minh Complex with the President's Mausoleum (except Monday and Friday), the Presidential Palace and One Pillar Pagoda before reaching the Temple of Literature, the Saint Joseph Cathedral and Hoan Kiem Lake.\nItinerary:  \nToday we will explore the most valuable parts in Hanoi which stores history, culture and architecture of Vietnam. The first destination is the Ho Chi Minh Complex with the President's Mausoleum (except Monday and Friday), the Presidential Palace and the One Pillar Pagoda. Then, we will head to the Temple of Literature which is known as the first university of Vietnam, built in 1070 under the Ly dynasty to dedicate to Confucius and later is teacher Chu Van An and thousands of doctoral laureates in the Mac and Le dynasties. In the afternoon, having lunch at local restaurant. Next we will enjoy the Water Puppet Show before walking to the Saint Joseph Cathedral, a church built in 1886. \n"},{"title":"Day 3: Ninh Binh City","description":"Hanoi - Hoa Lu - Tam Coc - : Arrive in Hoa Lu, visit Tam Coc grottoes, before heading back to Hanoi and move to Sapa by train\nItinerary:\n Arrive in Hoa Lu - Tam Coc in Ninh Binh province, takes 3 hours from Hanoi.\nIn Tam Coc, we will row the sampan to go along the river called Ngo Dong leading to the Tam Coc grottoes, you will see a range of green hills with rice fields at the base. The fields along with the Ngo Dong river change follow the season grain; before the harvest season, the color of the field is green but in harvesting it turns yellow. Say goodbye to Tam Coc, we will head to Hoa Lu, the capital of the Dinh and Early Le dynasties. Inside the place, we will see the Dinh - Le sanctuary, statues of the Emperors and many others historical relics. Then we head back to Hanoi. Private car and guide will pick you up again and transfer you to Hanoi train station to catch night train to Sapa. \nOvernight on train.\n"},{"title":"Day 4: Sapa - Lao Cai","description":"Lao Cai - Sapa Activities: Arrive in Lao Cai, explore Sapa and visit the villages of Cat Cat before meeting and chatting with other minorities and understand more about their culture.\n\nItinerary:\n Take the first step in Lao Cai and then transfer to Sapa; we will feel the cold and strange beauty of this place where varying minorities are living in.\nHaving breakfast at local restaurant with Vietnamese noodles before visiting a the local market. There, your shopping desires will be satisfied because this place is a collection of varying types of goods such as traditional clothes, bracers with sophisticated decorations, crafts... and you can meet local minorities here to know more about their daily life and tradition.\nWe will move to the villages of Cat Cat and meet the H'Mong tribe minority people. You can explore other areas and meet other minorities by walking down the valley below Sapa. Having the lunch and check-in your hotel at noon. Relax and explore Sapa for the rest of the time. Overnight in Sapa.\n"},{"title":"Day 5: Sapa Trekking","description":"Sapa trekking - Night train back to Hanoi Activities: Explore the surroundings of Sapa: Lao Chai, Ta Van villages before train back to Hanoi.\n\nItinerary: \nToday we will further explore Sapa areas by visiting the villages of Lao Chai and Ta Van. Lao Chai village is a peaceful place where you can meet the Black H'Mong minority people and know about their tradition and custom. Near Lao Chai village is Ta Van village, home to Giay minority. Here, beside meeting and chatting with the local, you can see huge terraced fields and wooden bridges which may scare you when walking on.\n"},{"title":"Day 6: Hanoi-Halong","description":"Arrive in Hanoi in early morning. You will check in a mini hotel nearby train station by yourself for rest and breakfast. Around 8.00AM, our driver will come to pick you up and start for Halong Bay. On the way you will have a short break about 25 minutes. Arrive Halong around 12:00 noon, getting on deluxe junk and enjoy a welcome drink with lunch of savoury local sea food. \nStart cruising around the bay to see the amazing karsts with different formations: Lion, Tea Pot, Toad, Dau Nguoi (Human Head) islets, then the boat stop at Titop island, you will have 1 hour for visiting, climbing and swimming. \nThere will be plenty of time for swimming and sunbathing (If weather permitted) after the boat anchors at a clean calm sea. Enjoy a wonderful sunset dinner in our beautiful restaurant before retiring to the comfort of your cabin. \nOvernight on boat.\n"},{"title":"Day 7: Halong Bay- Hanoi","description":"Halong Bay - Hanoi Activities: Tai Chi on Sundeck, Surprise Cave\nItinerary:\n In the morning, start your day with Tai Chi on the sundeck while complimentary tea & coffee are served.\nThen the boat cruise through the Bay passing beautiful spots like Trong (Drum), Trinh Nu (Virgin) and Me Cung Caves, Coc Ngoi (Toad) Islet, etc. Explore the Surprise Cave (Sung Sot).\nBuffet brunch is served on board. The vessel cruises leisurely back to harbor.\nBack to Halong City at noon. Transfer you back to Hanoi City. End of services.\n"},{"title":"Day 8: Hanoi","description":"Hanoi Departure Activities: N/A\nFree day shopping and ready on your return Flight"}]},{"name":"Vietnam - 8 Days","duration":8,"travelStyle":["In-depth Cultural","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2349,"summary":"Featured ArrangementsSouthern Vietnam:Cu Chi Military Tunnels: Crawl through the underground military tunnels.Dinner Cruise: Enjoy live entertainment and the nightscape on the Saigon River.Central Vietnam:Hue – Explore the old imperial capital.Hoi An – Twilight rickshaw tour through this historic and charming town.Da Nang – Discover 14th century Champa culture and relax on a private beach.Northern Vietnam:Hanoi – Ride electric carts in the Old Quarter and enjoy a Vietnamese Water Puppet show.Ha Long Bay – An overnight Paradise Luxury Cruise to discover the “Stone Forest on the Sea.”Luxury AccommodationsHanoi: JW Marriott - Enjoy a lake view roomHa Long Bay** – An overnight Paradise Luxury Cruise to discover the “Stone Forest on the Sea.” Hue: La Residence Hotel & Spa - French Colonial Style LuxuryDa Nang: Hyatt Regency - Luxury resort with private beachHo Chi Minh: Saigon Nikko Hotel - Japanese Style EleganceCulinary ExperienceArranging great culinary experiences is a specialty we are very proud of. Our development team samples each meal before presenting them to our guests. On this trip, you will have a chance to taste Vietnamese delicacies, Vietnam-style buffet, healthy mushroom hot pot, Imperial Hue-style favorites, Hue delicacies, Hoi An Three Treasures, famous Da Nang seafood, and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/66417_2f7e0243.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/66417_2f7e0243.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_909285b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_865568f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_71e7454f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_8e00ad9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_7746d445.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_36da331f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_83099be7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_abf31afb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/66417_72ed9d80.jpg"],"destinations":["Ho Chi Minh City","Hue","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Arrive in Ho Chi Minh, Vietnam 【Lunch, Dinner】","description":"“Xin Chao!” or “welcome” to Vietnam! \nAirline options to arrive in Ho Chi Minh before noon include: Cathay Pacific via Hong Kong, China Airlines, and Eva Air via Taipei, and Korean Airlines via Seoul. "},{"title":"Ho Chi Minh【3 meals】","description":"\n  Cu Chi Military Tunnels: The tumultuous war history of Vietnam can be seen in this elaborate underground tunnel system, used to counter the American military efforts in the Vietnam War.  \n  Cu Chi Leisure Farm: Escape the bustle of the city and enjoy original gardens with an afternoon in a local suburban farm. \n"},{"title":"Ho Chi Minh > Hue【3 meals】","description":"Hue was Vietnam’s capital from 1802-1945, the city is home to the emperors of the Nguyen Dynasty. "},{"title":"Hue(70 miles, 2.5 hrs) Da Nang【3 meals】","description":"Danang "},{"title":"Da Nang (15 miles, 30 mins) Hoi An (15 miles, 30 mins) Da Nang【3 meals】","description":"Da Nang:\n\nHoi An: "},{"title":"Da Nang > Hanoi【3 meals】","description":"Hanoi is graced by many parks and lakes. The Old Quarter features some magnificent French colonial architecture. After a good night’s rest, visit Hanoi’s celebrated sights.  \n"},{"title":"Hanoi (100 miles, 3.5 hrs) Ha Long Bay【3 meals】","description":"Ha Long Bay, a UNESCO world heritage site is one of Vietnam’s natural marvels with thousands of limestone islands rising out of an emerald green sea.  "},{"title":"Ha Long Bay (100 miles, 3.5 hrs) Hanoi sad Your Next Destination【Breakfast】","description":"\n  Capture early morning vistas of the bay while participating in Tai Chi class. \n  Excursion to Titop (Titov) Island or Soi Sim Island: Go swimming, enjoy the beach, or hike to the top for a stunning, panoramic view of the Bay.\n  \"Tam Biet\" or \"Goodbye!\"\nEnd point\n Please arrange flights departing from HAN after 17:00 (5PM)., Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam 17:00 - 21:00"}]},{"name":"Discover Ha Noi 5 Days 4 Nights (Hanoi, Halong Bay and SaPa)","duration":5,"travelStyle":["Sightseeing","Family","Local Living","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":305,"summary":"Asia Focus Travel provide you an experience the contrasts of Northern Vietnam from the charming of Hanoi to the relaxing waters of Halong Bay. Hanoi 5 days 4 nights this five day Discovery Tour is a fabulous introduction to the country and its culture.\nVisiting Hanoi, Sapa. , all of you will have reamarable experience with cultural value.  After explore \" City for Peace \",  an overnight cruise on Halong Bay is the perfect opportunity to truly appreciate the beautiful waters, spending the hours sailing among limestone cliffs and turquoise seas. Stop to visit a mysterious cave, swim in the warm waters and feast on fresh seafood. Please come Vietnam and  Enjoy this trip with Asia Focus Travel \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/113235_790a88ba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/113235_790a88ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_48cd686f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_eaade41d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_02f79618.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_f83fbb91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_559cb53d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113235_d26d9219.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrrive in Hanoi (No Meal)","description":"Upon arrival at Noi Bai International airport, you will be welcomed by the driver of  Asia Focus Travel and transferred to your hotel. The rest of the day is at your leisure to explore the tree-lined boulevards, French Indochinese architecture and tranquil lakes of this unique city."},{"title":"Day 2: Hanoi – Sapa – Cat Cat – Sapa (Breakfast/Lunch/Dinner)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\nOvernight at the hotel "},{"title":"Day 3: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (Breakfast, Lunch)","description":"8:00 – Have breakfast at the hotel.\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\n"},{"title":"Day 4: Hanoi - Halong Bay (Breakfast/Lunch)","description":"07:40 - 08:30 Meet your tour guide ,start the trip to Ha Long Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board Dragon Cruise to start a wonderful time enjoying stunning landscapes of Ha Long.\n- Savor lunch on board while passing beautiful islets of Stone Dog, Incense Burner, “Fighting cock”.\n- Visit Paradise Grotto, Kissing Chicken Rock, Fisherman Village\n- Stop at the harbor again to catch the bus to back Hanoi. "},{"title":"Day 5: Hanoi Departure (Breakfast)","description":"Breakfast at hotel, free time for leisure until transfer to airport for your flight home bringing sweet memories and many souvenirs."}]},{"name":"A Journey Through Vietnam (Overnight on board in Halong Bay)","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1550,"summary":"Discover the 8 days A Journey Through Vietnam Overnight on board includes a night aboard a traditional sailing vessel in one of the most beautiful spots on Earth: Ha Long Bay, a UNESCO World Heritage Natural Site of outstanding natural beauty, known in Vietnamese as Dragon descending to the sea. Start your trip from Hanoi and ending at Saigon, the largest city in Vietnam. You have got a chance to experience the cultural treasures and stunning lakes, mountains and powdery beaches of this mesmerizing country, The rural life of villagers among the paddy fields and relax on a boat trip in spectacular Halong Bay. It is home to an interesting diversity of religions, cuisines and natural landscapes. This is a journey of a lifetime memory.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/116018_c4213bcc.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/116018_c4213bcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116018_d244b674.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116018_8aa7ac10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116018_a9cc1d61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116018_5642897d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116018_cce3c610.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1","description":"Although it is the modern-day capital of Vietnam, Hanoi still retains the mystery and charm of past centuries. Narrow lanes and traditional shop houses invite an exciting exploration by walking, while it's many beautiful public spaces; lakes, parks, tree-lined boulevards and monuments; give the city an air of elegance and harmony with nature unique among Asian capitals.\nVisit the Temple of Literature\nThe Temple of Literature has a peaceful series of walled courtyards and graceful gateways, and this monument is one of the best-preserved examples of traditional Vietnamese architecture. Founded in 1070 and dedicated to Confucius, this was also the site of Vietnam's first university. In one courtyard, giant stone tortoises bear stele on their backs, listing the accomplishments of graduating scholars.\nWalk the Rail Tracks of Hanoi\nStart the tour on the rails a few meters north Hanoi's main train station. Walk along the very narrow streets hosting the rails sometime not even a metre far from the entrance door of houses. Enjoy this original and photogenic scene walking along the street until 153 Phung Hung where you go back down to the road and follow the street's sidewalk. Walk past a funeral home where you will see a group of people mourning and wearing the traditional white fabric around the forehead, which is the local equivalent to the western tradition of wearing black clothes. Continue walking toward Long Bien train station. From Long Bien train station start to cross the bridge and stop half way to go down the stairs onto the urban island. Have a rest and visit the orchards. Continue crossing the bridge and meet with the car which will transfer you to Gia Lam train station. Take your train ticket and jump in to cross the bridge on the other way, riding with the locals in the hard seater wagon. On week days you will stop at Long Bien, and on Saturday and Sunday you will stop at Hanoi Station. Meet your driver after disembarking and transfer back to your hotel. - Overnight in Hanoi"},{"title":"Day 2","description":"By vehicle from Hanoi (city) to Halong Bay\nStop en-route for stretch your legs and use the restroom at one of the souvenir shop for charity.\nAboard the traditional cruise through Halong Bay, Day 1 of 2 * No local guide *\nDepart from Hanoi to Halong Bay; en route take a short stop for a break. Transfer with a tender to the comfortable cruise and enjoy a welcome drink aboard. Begin the cruise through majestic Halong Bay while lunch is served. Enjoy the magical bay where thousands of sculpted limestone islands rise from the waves like dragon's teeth. The cruise continues cruising through a fishing village on the bay and passes the spectacular limestone caves dotted around the bay. Soak up the sun on the top deck with optional on-board activities: sunbathing, and photo opportunities. In the evening the chef will prepare a splendid meal comprised of fresh seafood dishes and other traditional dishes. Overnight on-board - Overnight in cabin / onboard (Vietnam)"},{"title":"Day 3","description":"Aboard the traditional cruise through Halong Bay, Day 2 of 2 * No local guide *\nGreet the day with a morning Tai Chi exercise that offer a perfect opportunity to view the sunrise over the bay. After breakfast, visit a beautiful limestone grotto then back to the boat for a final glimpse of the Halong Bay while cruising back to the dock. Check out luggage and bid tidings to beautiful Halong Bay.\nBy vehicle from Halong to Hanoi (Noi Bai Airport)\nFlight from Hanoi to Hue\nTransfer\n- Overnight in Hue"},{"title":"Day 4","description":"Thuy Bieu village with Cooking Class\nPick you up at Toa Kham Wharf, then visit Thien Mu pagoda\na historic temple, the symbol of Hue city. Back to the boat for a scenic cruise to Thuy Bieu Eco-village for cooking class. Go to Thuy Bieu local market (located near Thuy Bieu village), take time to stroll around and buy necessary foods for cooking class with chef. Prepare lunch (or dinner) by yourself under the instruction of our chief. After your practical class, it's time to taste the Hue traditional dishes that you have prepared and our chef will be able to give his feedback on your own chef skills. Then, spend 2 hours to stroll or bike around peaceful village. Relax by steeping your foot in medicinal herb water a traditional therapeutic practice and enjoy therapeutic massage by the blind people.\nSightseeing in the Imperial Citadel\nLocated in the heart of Hue is the Imperial Citadel, a vast complex built in the early 19th century and modelled after the Forbidden City of Peking. The original walls stretched for 10 km and were surrounded by a wide moat. Today, most of the buildings have been destroyed due to bombing during the Vietnam-American War, but the monuments that remain provide a fascinating glimpse into the court life of the Nguyen Dynasty. Approach the city past the striking Flag Tower, where a giant Vietnamese flag waves proudly overhead, to the imposing Ngo Mon Gate, the main entrance to the Imperial Enclosure. Enter into an area of spacious courtyards and serene lotus ponds, and stroll around the Dien Tho Residence (Dien Tho Palace) where the Queen mother lived. Visit the Thai Hoa Palace, the magnificently decorated reception hall, the Halls of the Mandarins, and the original Nine Dynastic Urns, among other sites - Overnight in Hue"},{"title":"Day 5","description":"Sightseeing in Hue\nHue served as the capital of Vietnam for more than 140 years. It houses ancient temples, imperial buildings and French-style edifices. It was established in the 17th century.\nVisit the Imperial Tombs of Tu Duc and Khai Dinh\nVenture into the countryside around Hue to the Imperial Tomb of Tu Duc. Tu Duc, the longest reigning Vietnamese emperor, designed and built this elegant tomb during his lifetime, using it as a retreat for meditation, reading and theatre performances. Take some time to soak in the tranquil atmosphere, wandering among the gracefully proportioned pavilions, courtyards and lotus ponds. Afterwards visit the Imperial Tomb of Khai Dinh, dramatically located on a hillside. The last of the monumental tombs of the Nguyen dynasty, completed in 1931, this tomb incorporates distinct European elements into traditional Vietnamese architecture.\nBy vehicle from Hue to Hoi An with sightseeing in Danang\nDrive south from Hue along scenic mountain roads with spectacular views over the coastline. Highlights along the way include the dramatic Hai Van Pass, the high dividing line between the climate zones of North and South Vietnam; Lang Co, a lovely stretch of beach curving outwards between a clear blue lagoon and the East Vietnam Sea; and the large coastal city of Danang.\nAfter arriving in Danang, visit the Cham Museum, an elegant colonial building which houses the finest collection of Cham sculpture in the world; and pass by Non Nuoc Beach, a famous spot for American soldiers during the Vietnam-American War. Continue south to Hoi An, stopping enroute to visit the Marble Mountains, five stone hillocks, once islands, that rise sharply from the surrounding rice fields. Riddled with caves and shrines, they are said to each represent one of the five elements of the universe - Overnight in Hoi An"},{"title":"Day 6","description":"Sightseeing in Hoi An with a boat trip on the Thu Bon River\nThe exquisitely preserved merchant town of Hoi An was declared a UNESCO World Heritage Site in 1999. Its colourful shop houses and temples reflect a diverse heritage, dating back to the 16th and 17th century, when it was a major port for Western, Chinese and Japanese traders. Today it is a thriving centre of traditional crafts and a shopper's paradise, best explored on foot.\nWander through the cobbled streets, past low tile-roofed buildings, the bustling central market and the small harbour where colourfully painted boats are moored. The walking tour will include visits to a private house, where members of the same family have lived continuously for centuries in a traditional setting; to one of the family chapels built by prominent merchants and official families as centres for ancestor worship; and to a typical Chinese-style Pagoda or assembly hall. Continue to Sa Huynh MUSEUM, located near the Japanese Covered Bridge, it contains exhibitions from the earliest period of Hoi An's history. Visit a handicraft workshop in Hoi An where local products are being made by the industry itself. Finally, continue to the famous Japanese Covered Bridge, first constructed in 1593 by the Japanese community of Hoi An to link the town with the Chinese quarters across the stream. \nIn the afternoon, board a local boat and cruise down the Thu Bon River, enjoying the unspoiled countryside and stopping to visit a pottery village and a woodcarving village before returning to Hoi An harbour - Overnight in Hoi An"},{"title":"Day 7","description":"Transfer to Danang airport \nFlight from Danang to Saigon\nTransfer\n\nSightseeing in Saigon\nA vibrant metropolis, Saigon teems with energy, activity and motion. Everywhere you look, you see the convergence of traditional and modern life. Begin the trip into modern history with a tour of the Reunification Palace. Formerly the Independence Palace of the South Vietnamese president, this 60s style building was famously stormed by tanks on April 30, 1975 signifying the fall of South Vietnam. It has been preserved in its original state, and the original tanks remain on display near the entrance gates. \nAfterwards, drive to the historic centre to visit the Emperor of Jade Pagoda, one of Saigon's most interesting pagodas. Proceed to pay a quick visit to the neo-Romanesque Notre Dame Cathedral and the Central Post Office. Pass by the classic European-style landmarks such as the ornate City Hall (Hotel De Ville), the old Opera House (both may only be viewed from the outside). Finally, end up at the central Ben Thanh Market, where vendors display a vast array of goods and handicrafts, appealing to every taste - Overnight in Saigon"},{"title":"Day 8","description":"Transfer from Hotel to Airport for your Departure Flight."}]},{"name":"Vietnam Highlights Package 10 Days 9 Nights ( Hanoi, Ha Long Bay, Hue, Hoi An and Sai Gon)","duration":10,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":740,"summary":"\n\tAsia Focus Travel take you visit the most popular destinations in Vietnam with all the highlights — all in Vietnam itinerary 10 days 9 nights. Discover Hanoi with many type of foods as Beef noddle soup, Vietnamese rice roll, grilled pork and noodle, structure architecture and the stunningly beautiful UNESCO World Heritage Site of Halong Bay. Moving to culturally-rich Hue then spend time in incomparable and lovely Hoi An – one of the world’s most charming towns. Finish the comprehensive Vietnam highlights tours in the South after Floating through the lush Mekong Delta, seeing vibrant Ho Chi Minh City. With same destinations in itinerary but you can start this trip from Hanoi or Ho Chi Minh city.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/139527_8d697d1f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/139527_8d697d1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_1cb4f656.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_055113ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_0241b23f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_3dd27df3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_f3e94939.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_f90dafc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_1eab2940.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_7c611686.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_da0f3045.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_c010291d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139527_f415e137.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi Arrival (no meal)","description":"Welcome to Vietnam: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited.\nYou will be warmly welcomed by our driver at the airport and transferred to your hotel in the city center of Hanoi.\nFree on your own afterward.\nMeals included: __/__/__\nParameter: Driving: 30 km/45 minutes\nOvernight in Hanoi\n\n"},{"title":"Day 2: Hanoi - Ha Long Bay (meals: B/L/D)","description":"7.45-8.15:  Pick-up at the hotel. (Note: this time applied for those who book our shuttle bus service)\n10.00:  Having short break at stopover in Hai Duong Province.\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15:  Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner Island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30 PM\n•\tDo kayaking through the magnificent landscape with Limestone Mountains in Luon Cave, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\n•\tBack to Lavender Cruises and join sunset party\n•\tPass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n•\tJoin our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19.30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\n•\tJoin squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke….\n•\tOr Laze yourself with our happy-hour drinks at the bar.\n•\tOvernight on  Cruises\n"},{"title":"Day 3: Ha Long Bay - Hanoi (meals:B/ L)","description":"06.15: Morning exercises on the Sun-deck.\n07.15: Have breakfast with Coffee, tea and Bakeries on board.\n08.00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09.30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10.15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12.00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16.30 – 17.00 : Arrive in Hanoi. "},{"title":"Day 4: Hanoi City Tour - Departure to Hue City (meals: B/ L)","description":"Breakast at your hotel \n8:00 to 8:30 Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nArrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university.  Leave for a legendary Hoan Kiem lake and Ngoc Son Temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians. \n•\t16:30: You will be transfer back to Hanoi airport for the flight to Hue city\n•\tArrive in Hue, you will be picked up by our guide and driver then transferred to your hotel\nMeals included: Breakfast/Lunch/__\nFlight information: VN 1547             Vietnam Airlines          19:00   20:10  \nParameter:  Hanoi – Hue/ Flight: 1.10 hour\nOvernight in Hue\n\n"},{"title":"Day 5: Hue City Tour (meals: B/ L)","description":"In the morning: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conicat Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nIn the afternoon: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue\nMeal: Breakfast/Lunch\n"},{"title":"Day 6: Hue - Hoi An (meal: B)","description":"Breakfast at your hotel\nThe shuttle bus pick you up go to Hoi An.You will firstly pass the Hai Van Pass and Lang Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way\nArrive Hoi An, check in hotel and Discover Hoi An by yourself as: Chinese Assembly Hall, the famous Japanese Covered Bridge and Tan Ky Ancient House and the China Town in the other side of the canal, you’ll find yourself miss that one-of-a-kind port town in every single road of your ahead travel\nOvernight in Hoi An \nMeal: Breakfast"},{"title":"Day 7: Hoi An - Cooking Class at Tra Que vegetable village (meals: B/ L)","description":"Tra Que is a small village located 3km north of Hoi An’s Old Town. Its location is between De Vong\nRiver and Tra Que alga pond. Thanks to the special condition of rich soil and water, the village has\nlong been known for growing many kinds of vegetables: lettuce, salad, houttuynia, flagrant\nknoutwed, basil and coriander vegetables etc, with which the traditional specialities of Hoi An have\ngained part of their fame. The village is named after the sweet scented vegetables that spice up the\neveryday meals of the Hoi An people.\nTime: 9:00- 14:00 PM\n9:00- 9:30 AM Pick up at your hotel\n Riding bicycles to Hoi An’s central market\n Having opportunity to interact with local sellers and learn about the ingredients which\nare used in the cooking class.\n Welcome to Tra Que Village, drink for rest and walk around the vegetable gardens where\nthe local famers work on their fields by traditional tools.\n Joining cooking class with the Chef. After the lesson, enjoy your meal with everything\nyou cooked.\n Goodbye Tra Que village.\n Turnback to your hotel.\nOvernight in Hoi An "},{"title":"Day 8: Hoi An - Da Nang - Ho Chi Minh (meal:B)","description":"In the morning take a flight from Da Nang to Ho Chi Minh. \nSuggest morning flight 8:00 AM or 9:00 AM\nArrive Ho Chi Minh, the driver picks up at the airport and takes you to hotel. You will be free and easy  time until 12:00- 12:30 PM tour guide picks up on tour.\nYou will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war.\nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish.\nCome back hotel and free at your leisure.\nOvernight in Ho Chi Minh City"},{"title":"Day 9: Ho Chi Minh - My Tho - Ben Tre (meals: B/ L)","description":"A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong.\nOn arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nEnjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\nMeet at the bus and return to Ho Chi Minh City. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.Free time in the evening.\n\nParameter: Ho Chi Minh – My Tho: 70 km/Driving: 1.5 hour\n\nMeals included: Breakfast/Lunch/__\n\nOvernight in Ho Chi Minh City"},{"title":"Day 10: Ho Chi Minh Departure (meal:B)","description":"Depending on your flight time, our driver will pick you up at your hotel and transfer you to the airport for your departure flight.\n\nMeals included: Breakfast/__/__\n\nParameter: Driving: 7 km/25 minutes\n\nToday useful note(s):\n\nCheck all your luggage and belongs before checking out and make sure you miss nothing.\n\n"}]}]