[{"name":"Vietnam Experience - 12 Days","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Coach / Bus","Holiday"],"oldPrice":0,"price":669,"summary":"This package journey from Hanoi in the north to Ho Chi Minh City in the south, taking in the best places in central Vietnam for sightseeing and experiencing the lifestyle of the people in the different regions of the land, engaging in various activities like trekking and boating in the Mekong Delta on an extended basis","highlights":["Start your day with Tai Chi on a cruise of Ha Long Bay","Head to Dong Ba Market to see the daily life of locals","Experience the hustle and bustle of the Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117089_055c9841.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117089_055c9841.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_5fbfd80d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_5d9ed5c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_5c52a1ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_d2f4683b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_b8c42ae9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_1f029782.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_630e4a59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_e41693b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_cb287899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_eaa58b63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_1b69ad4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117089_f4ff5c6b.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi - airport pick up - Check in hotel (Meal: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist.  After that you are free to visit Hanoi City by yourself.     \n"},{"title":"Day 2: Hanoi – Halong Bay – Overnight on the Cruise (Meal: B,L,D)","description":"08.00 – 08.30:\tPick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12.30 – 13.00:\tEmbark on V’Spirit Classic Cruise followed by a short cruise briefing.\n13.30 – 14.30:\tSavor a delectable lunch as Classic cruises among the limestone islands.\n15.00 – 16.00:\tExplore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16.00 – 17.00:\tKayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10.15:\tReturn to the boat.\n17.00 – 17.30:\tReturn to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17.30 – 19.00:\tEnjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19.00:\tDinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around. Overnight on board.\n"},{"title":"Day 3: Halong Bay – Hanoi – Check in hotel in Hanoi (Meal: B,L)","description":"06.30 – 07.15:\tStart your day with Tai Chi exercises or a photo hunt.\n07.30 – 08.30:\tHave breakfast on board and enjoy the peaceful morning of Halong Bay.\n09.00 – 10.00:\tCruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay. Freshen up and check out of your cabin.\n10.15 – 11.00:\tContinue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11.00 – 12.15:\tWhile heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12.15 – 12.30:\tDisembark V’Spirit Classic.\n12.30 – 13.00:\tTransfer back to Hanoi. Trip finishes at around 17.00.\n"},{"title":"Day 4: Hanoi – Train station transfer – Overnight train to Hue (Meal: B)","description":"Today you are free in Hanoi till our driver come to pick you up for the transfer to the train station. \nThe train journey will take around 12 hours. On the train you can view the beautiful countryside and coastline. Stay overnight on the train and arrive at the Hue train station at the next morning\n"},{"title":"Day 5: Arrive in Hue – Transfer to Hotel (Meal: No)","description":"Arrive in Hue, our driver would pick you up then transfer you to hotel. Check in the hotel and then you are free in the town."},{"title":"Day 6: Hue city tour (Meal: B,L)","description":"07.45 - 8.30 AM, We will pick up you at your hotel & transfer to Visit 04 famous sites: Minh Mang Tomb, Khai Dinh Tomb, Tu Duc Tomb, Conical Hat Making Incense Making Village.\nAfter having lunch, visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank\nAfter you visit Thien Mu Pagoda, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\nThe tour ends at 16.30 \n"},{"title":"Day 7: Hue – Bus to Hoi An (Meal: B)","description":"08.00 – 08.30 Bus pick up from your hotel and start journey to Hoi An City. On the way, bus will stop at Hai Van Pass for taking photos, Linh Ung Pagoda, Marble Mountain in Da Nang City for the short visit. You will have lunch by yourself in stop over place.\n14.00 Arrive in your hotel in Hoi An City\n"},{"title":"Day 8: My Son tour (Meal: B,L)","description":"7:45 – 8:30: The bus and tour guide pick you up at your hotel \n8:30 : Leaving Hoi An for My Son HolyLand.\n9:30: Arriving in My Son – the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of ancient buildings at of the Champa  Kingdom with our tour guide.\n12.00: Leaving My Son for Cau Lau boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!"},{"title":"Day 9: Check out – fly to Ho Chi Minh – check in hotel (Meal: B)","description":"Today you are free in Hoi An Town till our driver come to pick you up for the transfer to Da Nang for the flight to Ho Chi Minh city. Arrive in Ho Chi Minh, our driver would pick you up then transfer you to the hotel. You are free in the city today"},{"title":"Day 10: Mekong Delta tour (Meal: B,L)","description":"7:30 – 8:00 Picking up from hotel\nStarting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30\tStart the motorized boat to visit the Cai Be Floating market, experience how people\nexchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn. \nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature. \nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30\tArrive in your hotel.\n"},{"title":"Day 11: Cu Chi tunnel tour (Meal: B,L)","description":"8:00 - 8:30 Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was” A Free Target Zone “. The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n13:00\tHave lunch in a local restaurant. Back to Ho Chi Minh City around 14.30\n"},{"title":"Day 12: Check out – Pick up to airport – Departure (Meal: B)","description":"Today you are free until our driver come to pick you up and transfer you to the airport for your flight. Tour  ends"}]},{"name":"Vietnam Highlights","duration":8,"travelStyle":["In-depth Cultural","Group","Fully Guided","Sightseeing","Historical","Holiday"],"oldPrice":689,"price":510,"summary":"Welcome to beautiful Vietnam. Wander through an ancient land filled with an unforgettable history, kicking off in Southern Vietnam and ending in Hanoi. Experience the hospitality of local people then strike a bargain in Ho Chi Minh City’s bustling markets. Be charmed by Hoi An’s many beautiful historic buildings and the imperial city of Hué with its ancient tombs and temples as well as the chaotic Old Quarter of Hanoi on this 8 day adventure.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130849_3250a7d2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130849_3250a7d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_1dc5df79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_f0aa6c4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_c9f01e78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_6e557613.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_8490d541.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_5ce21726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_f5f854ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_4633ddee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_ebc9f4a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_6dd05083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130849_33a689e6.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City","description":"\nThe bustling city of Ho Chi Minh is the former capital of South Vietnam. Formerly known as Saigon until the end of the Vietnam War (around 1975) and the infamous ‘Fall of Saigon”,the city was then renamed after North Vietnam’s illustrious and revered leader Ho Chi Minh. Originally a small fishing village, it is now the most important economic centre in Vietnam and is the largest city in the country.\nToday is free to arrive at your leisure. We recommend arriving early or booking pre tour accommodation to enjoy all Ho Chi Minh city has to offer. Spend hours wandering and haggling in Ben Thanh Market or visit the beautiful Opera House and Notre Dame Cathedral.\nLearn about the sobering stories of the Vietnam War in the War Remnants Museum, or get a glimpse of the art scene at the City Museum of Fine Arts. There are plenty of lesser known museums dotted around the city, including the South Vietnamese Women Museum which provides interesting insight into the role women played during and after the war.\nFor something a little unique, check out the cafe apartments on Nguyen Hue Walking Street. Originally serving as residence for government officials, the apartments were then sold to local workers after the Fall of Saigon. As tourism developed, tenants began renting out or transforming the tiny apartments into various businesses - cafes, boutiques, tattoo studios and restaurants. What results is a miss match of colours, signs and spaces which make for a wonderful place to explore and grab a local coffee.\nAccommodation: 1 night(s) in hotels at La Felix Hotel or similar . Room upgrade available on this day.\nOptional Excursions:• The Reunification Palace – VND 40,000 • Cu Chi Tunnels - VND 235,000 (only available for those who have booked extra time in HCMC or arrive early)"},{"title":"Day 2: Hoi An","description":"Hoi An is widely considered one of the most colourful and beautiful towns in Vietnam. Largely spared of damage during the Vietnamese conflict, the old trading port of Hoi An is a UNESCO Heritage town offering an amazing central old town with small friendly streets dotted with an abundance of family run shops, restaurants and coffee shops. Whether you want to stop for a nice cheap beer while watching the sun set over the river or splash out on an incredible seafood supper, Hoi An has it all within walking distance.\nThis afternoon we will enjoy a short orientation of the area followed by a bike tour of the nearby paddy fields and beach.\nAccommodation: 1 night(s) in hotels at Hai Yen Hotel or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nIncluded Excursions: Bicycle ride to Hoi An Beach\nOptional Excursions:• Old Town Sightseeing ticket (entry to 5 sites) – VND 120,000 • My Son Cham ruins – VND 150,000 entrance, plus transport with guide from US$8 • Cookery class – from VND 250,000 • Tu Bon River boat trip – US$10 - Bicycle rental US$2 (Daily)"},{"title":"Day 3: Hoi An","description":"Today is free to soak up more of the beauty of Hoi An. One of the biggest highlights are the many tailors found around every corner. If you love clothes and want something special or unique Hoi An is the perfect place. Take a photo in to show the tailors or pick an outfit from the brochures and have it ready the next day.\nAnother highlight of the area is renting a bicycle and cycling the short 5km ride through country lanes bordered by rice paddy fields to the wholly unspoiled Cua Dai beach for the day.\nHoi An is also known for offering some incredible local cooking classes. Visit the markets on a local tour and learn the secrets behind the classic Vietnamese spring roll or one of the many other delicacies.\nAccommodation: 1 night(s) in hotels at Hai Yen Hotel or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nOptional Excursions:• Old Town Sightseeing ticket (entry to 5 sites) – VND 120,000 • My Son Cham ruins – VND 150,000 entrance, plus transport with guide from US$8 • Cookery class – from VND 250,000 • Tu Bon River boat trip – US$10 - Bicycle rental US$2 (Daily)"},{"title":"Day 4: Hue via the Hai Van Pass and Da Nang's Marble Mountains","description":"This morning we get picked up and driven to Da Nang's Marble Mountains which are made out of limestone and marble. Following this we drive towards Vietnam's ancient Capital City, Hue. On route we will also stop to enjoy the spectacular views from the Hai Van Pass, the longest and highest mountain pass road in Vietnam. Upon reaching the Imperial City, we will tour the forbidden citadel which was only for the emperors and those closest to them, with severe punishments if you were caught trespassing. Time permitting, you can also take a trip down the Perfume River to visit the tombs of Vietnam's ancient Emperors.\nAccommodation: 1 night(s) in hotels at The Times Hotel or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nIncluded Excursions: Visit to Marble Mountain, Visit to the Hai Van Pass, Walking tour of the Imperial City and Citadel\nOptional Excursions:• Thien Mu Pagoda – free • Amphitheatre and elephant temple – free • Military Museum – VND55,000 + US$3 • Ho Chi Minh Museum – VND 40,000 • Bicycle hire – from VND 30,000 • Perfume River boat cruise – US$2 (depending on numbers)"},{"title":"Day 5: Fly to Hanoi","description":"A short flight takes us to colourful Hanoi.\nHanoi offers a beguiling combination of tranquillity and chaos, from the elegance of its crumbling colonial architecture and tree-lined boulevards, to the boisterous cacophony of street vendors and motorcycles. Much can be absorbed of daily life by wandering the streets of the old quarter, tasting local market food, and people-watching. For the culture buffs there are museums, temples and tombs which offer insight into a city rich in history and character.\nAccommodation: 1 night(s) in hotels at Hanoi House or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nIncluded Excursions: Enjoy fresh Vietnamese beer at Beer Hoi Corner in the evening with your group"},{"title":"Day 6: Hanoi","description":"Our morning begins with a visit to the historical center of Hanoi to walk around the relaxing scenery of Hoan Kiem Lake where you can watch the early morning aerobics and enjoy a local speciality of 'egg coffee'. Legend has it that a magical sword was sent to Emperor Ly Thai which was used to drive the Chinese from Vietnam. The sword was later taken from the Emperor by a golden turtle who dissapeared into the depths of the lake with it, and that's where it gets its name from 'Lake of the restored sword'.\nAfter our morning at the lake, you have the opportunity to travel out to and visit the world famous Halong Bay on either an optional day or overnight excursion. The bay includes hundreds of islands with towering limestone karsts draped in verdant foliage and is a classified UNESCO World Heritage site.\nAccommodation: 1 night(s) in hotels at Hanoi House or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nIncluded Excursions: Morning walk along Hoan Kiem Lake and stop for a speciality egg coffee\nOptional Excursions:• Halong Bay – Full day tour, or a 2 day overnight tour on an authentic Junk Boat"},{"title":"Day 7: Hanoi","description":"Today is free to enjoy as you please. Discover Ho Chi Minh's Mausoleum, the Presidential Palace, the Stilt House and the famous 1-Pillar Pagoda. You can also visit “coffee street” in the old quarter for a ca phe sua da (a milky iced coffee) for a caffeine fix, grab some hearty bowls of Pho from the street vendors selling delicious Vietnamese street food or cross the red Huc Bridge to visit Jade Island where the Ngoc Son Temple (Temple of Jade Mountain) stands.\nAccommodation: 1 night(s) in hotels at Hanoi House or similar . Room upgrade available on this day.\nMeals: 1 Breakfast(s)\nOptional Excursions:• Hoa Lo Prison – VND 20,000 • Temple of Literature – VND 30,000 • Ngoc Son Temple – VND 30,000 • Fine Arts Museum – VND 40,000 • Military History Museum – VND 40,000 • Perfume pagoda/Tam Coc – various day trips available"},{"title":"Day 8: Depart Hanoi","description":"Your adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.\nYour adventure of a lifetime comes to an end today.  If you have a late flight or have lengthened your stay by adding post tour accommodation you will have more time to explore the sights.\nMeals: 1 Breakfast(s)"}]},{"name":"Mekong delta and Da Lat 10 days 9 nights","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1378,"summary":"This 10-day tour takes you on an adventure from the excitement of Ho Chi Minh to the relaxing, verdant landscapes of the Mekong Delta, Da Lat and Nha Trang. As well as taking in cityscapes, winding rivers and sandy beaches you will also discover the unique and interesting cultures of the south of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf13.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667c466f0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194003_5e4667cd2cf29.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Dalat"],"timeline":[{"title":"Ho Chi Minh City Arrival (D)","description":"You will be met at the Tan Son Nhat Airport by your guide who will be waiting to welcome you to Ho Chi Minh City. They will take you to your hotel where you can relax before being picked up later for lunch at a fantastic local restaurant."},{"title":"Ho Chi Minh city - Cu Chi tunnel (B/L)","description":"In the morning, you can enjoy a half-day private excursion to the Cu Chi Tunnels to discover the extreme conditions endured by the Viet Cong in order to overcome the opposing forces of South Vietnam and the USA. The extensive tunnel system stretches right across the country, as far as Cambodia in some places. The tunnels connect the rooms, weapons stores, hospitals, command centers and traps, all hidden underground allowing the soldiers to operate in secret. As well as viewing the interesting displays and information about the war, you will be able to enter the tunnels to experience them first hand. You will then return to Ho Chi Minh City where you will have the afternoon free at your leisure, before spending the night in Ho Chi Minh city."},{"title":"Ho Chi Minh - Can Tho (B/L)","description":"After breakfast, we’ll drive you to My Tho, the capital of Tien Giang Province. Then we make a visit to Vinh Trang Pagoda, regarded as one of the most beautiful pagodas in the country due to its eclectic mix of styles and influences.\nNext, we get on a boat to visit 4 charming islets: Dragon, Unicorn, Phoenix, and Tortoise, before continuing on to the traditional coconut houses of Quoi An Village, where we’ll take a break and enjoy a snack consisting of fresh fruit.\nThen we’ll get to enjoy a 1-hour coach ride through the village, stopping at an orchard to taste honey tea or Mekong whiskey, or both. Then we get in a row boat and row through a palm creek and visit a coconut candy mill, a staple of the Mekong Delta. Finally we’ll have lunch in the home of a local bonsai gardener before continuing to Can Tho City for an overnight stay."},{"title":"Can Tho - Ho Chi Minh (B/L)","description":"As the Mekong stirs into action all around you, you will take an early boat trip to the Cai Rang Floating Market – one of the most exciting floating markets in the Mekong Delta with hundreds of small boats barging and jostling for space to sell their goods. After sampling the fresh local fruits, our guide will take you back to the hotel. You will have lunch at local restaurant before returning to Ho Chi Minh City where you will stay the night."},{"title":"Ho Chi Minh - Da Lat (B/L)","description":"This morning you will leave Ho Chi Minh City and head for the hills, literally. The scenic 7-hour drive along Highway 20 to Da Lat will be broken up by stops at some of the tea and coffee plantations along the way. We will stop for lunch at the picturesque Dambri falls, about 15km from the highway. Here you may have your photo taken next to an elephant! Arriving at Da Lat by late to mid afternoon, there will be an opportunity to take a short walk in the 'City of Eternal Spring'. There will also be an opportunity for a short walk to get the feel for this delightful city. This evening you will head out to a lovely restaurant in Da Lat. You will stay overnight in Da Lat."},{"title":"Da Lat (B/L)","description":"In the morning you can enjoy a tour of Da Lat and the surrounding areas. You will begin with a visit to the Lam Ty Ni Pagoda followed by a trip to the Summer Palace of Vietnam 's last Emperor Bao Dai. From here you will visit the rather bizarre and very aptly named Crazy House to discover its amazing architecture and artwork. This afternoon, you will visit Truc Lam Thien Vien and then take a short train ride on the Cremaillere railway to the village of Tri Mat. You will stay overnight in Dala"},{"title":"Da Lat - Nha Trang (B/L)","description":"Today you will take a drive out of Da Lat and back down the Prenn Pass for a stop at the Chicken village, so-called because of its statue of a chicken. This quirky village belongs to the Koho ethnic minority community. From here, you will head east and down the Ngoan Muc Pass to the coastal lowlands. Your destination for today is Nha Trang, the country's premier resort town. This part of the country was once inhabited by an ancient civilization known as the Cham, and your next stop will be at the Po Klong Garai Cham tower. This amazing structure, which has endured the test of time, the elements and indeed war, was built in the 13 th century. You will stop for a late lunch at Cam Ranh Bay and arrive in Nha Trang by mid to late afternoon. You can check in to your hotel and enjoy some free time relax or explore. Nha Trang also has a vibrant nightlife which you may wish to explore before spending the night in Nha Trang."},{"title":"Nha Trang Beach Relax (B)","description":"You have two free days in Nha Trang for relaxing and unwinding at the resort overlooking the beautiful Bay. There are plenty of options to keep you occupied including snorkeling, divining, swimming in the cool clear waters and coral reef, hiking along the nature trails or simply enjoy the great facilities at the resort."},{"title":"Nha Trang Beach Relax (B)","description":"You have two free days in Nha Trang for relaxing and unwinding at the resort overlooking the beautiful Bay. There are plenty of options to keep you occupied including snorkeling, divining, swimming in the cool clear waters and coral reef, hiking along the nature trails or simply enjoy the great facilities at the resort."},{"title":"Ho Chi Minh City departure (B/L)","description":"This morning you will return to Ho Chi Minh City. The drive will take around 8 hours. On the way, you will make numerous stops for refreshments. You will stop for lunch in Phan Thiet. You will see many interesting sights along the way including a colorful dragon fruit farm. You should arrive at Tan Son Nhat Airport in HCMC in the late afternoon where you can board the onward flight."}]},{"name":"5-day the charming North of Vietnam: Hanoi - Ninh Binh - Halong Bay","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":303,"summary":"This is the tour for people who looking for a trip with unique beauty that recognized by UNESCO. Let visit the City of Peace, then head to World Heritage and ends in World Heritage Site\n\nHIGHLIGHTS\n* Spend a night on board in Halong -One of New Seven Wonders of Nature\n* Visiting Hoa Lu Ancient Capital & Hoa Lu cave - \"Halong on land\" -\n* Experiencing Hanoi - the capital of Vietnam with many delicious food and historic sites\n* Easy to extend this trip to the central and the south of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/135388_e111c8d6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/135388_e111c8d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_2f7e6e57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_7e30de8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_8c23dfbf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_7aa830ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_a3cc8c05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_a35c3500.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_a1897875.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_37d3d2d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_473a6cd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_c9a96d1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_fc2d5b0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_0bc27cff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135388_e25eb1b1.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: HANOI ARRIVAL - CITY TOUR (noon flight)","description":"Welcome to Hanoi – the capital of Vietnam! The tour guide will be welcoming you at airport; it takes us 35 minutes driving to the centre of Hanoi then check-in at hotel. Let’s start our city tour from Temple of Literature, the 1st university in Vietnam then continue to Ba Dinh Square - the biggest square in Hanoi where all biggest cultural, political events of the cities for taking photos of Ho Chi Minh Mausoleum (outside). Later walking around the Old Quarter of Hanoi, stop at Ngoc Son Temple located on the Hoan Kiem Lake (the “Sword” Lake). Overnight in Hanoi.\nPlease note: Check-in time standard is around 14:00"},{"title":"Day 2: HANOI – TAM COC – HOA LU - HANOI (B/L) (SIC tour)","description":"\nHave a breakfast at hotel. A 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Further discovery in Ninh Binh will be continued in the site that used to be the kings’ palace in 10th century and now famous for the wooden relieves of the shady Dinh and Le temples. back to Hanoi. O/n in Hanoi."},{"title":"Day 3: Hanoi- HALONG - OVERNIGHT ON BOARD (B/L/D) – SIC TRANSFER","description":"\nHave breakfast at hotel. From Hanoi, at 8AM, head East to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO. The road will pass by the Red River delta with green paddyfields and rural villages, where hard-work farmers are busy with their farming jobs. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach islets to enjoy their beauty in close distance. Evening attend activities on the boat or relax. O/n on the boat"},{"title":"Day 4: HALONG - HANOI (B/L)","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf & return to Hanoi. Free at your own leisure. Overnight  in Hanoi. "},{"title":"Day 5: HANOI DEPARTURE (B)","description":" Have breakfast at hotel. You are free until transfer to the airport for departure flight (only driver, no tour guide escorts). \nNote: Check-out time standard is around 12:00"}]},{"name":"Vietnam World Heritage Luxury Tour 10 days 9 nights","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1304,"summary":"Vietnam is full of captivating ancient sites and fascinating history, and stunning temples and ruined relics scattered across the land piece together the country's rich past. Starting in the eclectic city of Saigon, this journey through the heritage sites of Vietnam across 10 days will take you along the east coast to discover historical sites, hill resorts, sunlit beaches, ancient palaces, traditional markets and the unique beauty Halong Bay. You can enjoy all this and more in complete luxury on this tour, staying in the finest hotels and resorts, and travelling around in style.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed2a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b91d26ed4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194196_5e4b92107b662.jpg"],"destinations":["Ho Chi Minh City","Hue","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Ho Chi Minh City Arrival","description":"On your arrival at Tan Son Nhat Airport, you will be welcomed by your guide and driver who will take you to Ho Chi Minh city to check-in to your hotel. The rest of the day is yours to explore and drink in the excitement of Saigon. You will stay overnight in your hotel Ho Chi Minh city"},{"title":"Ho Chi Minh city - Cu Chi Tunnels (B/L)","description":"\nThis morning you will enjoy a city tour which takes in some of the most important historical and cultural sites of the city including the Reunification Hall, formerly known as the Presidential Palace. On the morning of April 30, 1975, Communist tanks rolled towards building signaling the fall of Saigon. This fascinating building is filled with history still fresh in the minds of many. The tour also includes the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda, Chinatown, and Binh Tay Market – the central market for the city and one of the liveliest areas. Next, we visit the Cu Chi Tunnels, the incredible network of tunnels that once stretched right to the border with Cambodia. This underground complex was built by guerilla fighters beginning in 1940 and construction continued throughout the Vietnam War. Here you can experience the harrowing conditions for yourself as you descend into one of the tunnels. You will return to your hotel in the late afternoon. The evening is yours to experience some more of the city. You will have dinner by your own arrangement and stay overnight in Ho Chi Minh City."},{"title":"Mekong Delta (B/L)","description":"\nToday, we will take you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometres south-east of Ho Chi Minh City, My Tho is surrounded by orchards and rice fields, which produce grain for the entire country. You will get to experience the unique local culture with a visit to one or two of the islands that produce traditional handicrafts, coconut candy and bee farms. You will also visit the Vinh Trang Pagoda, the oldest one in the delta, on your boat trip on the Mekong River. You will return to HCMC in the late afternoon where you will spend one last night before flying to Hue next day."},{"title":"Ho Chi Minh city- Hue (B/L)","description":"\nAfter breakfast, you will leave HCMC to fly to Hue, Vietnam's capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam's cultural, religious and educational centres. Here you will visit the Imperial City, which is located in the Citadel. Modelled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. You can explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. You will also see the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. You will stay overnight in Hue."},{"title":"Full Day in Hue (B/L)","description":"\nJust outside Hue City, we visit the Thien Mu Pagoda on the bank of the poetic Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, you will visit the complex of the Tomb of Emperor Minh Mang, built in 1840, known for its magnificent architecture and elaborate decorations and considered one of Hue's most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theatre performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh tomb, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. After a day of discovery, you will return to your hotel on the riverbank for the night where you can relax in your Art Deco inspired rooms."},{"title":"Hue - Hoi An (B/L)","description":"\nToday, journey south past the incredible Hai Van Pass and with views of the Lang Co coast. Upon arrival in Da Nang, you will visit the Cham Museum, which features a fine collection of open air sandstone carvings from the ancient civilisation. You will make a stop at My Khe Beach, made famous in the American TV series of the same name. The stunning beach stretches for miles along the coastline separating the Marble Mountains from the sea. Each of the five stone hills which make up the mountain is said to represent one of the five elements of the universe. Within the mountains, there are many natural caves in which Buddhist sanctuaries have been built over the centuries. At the end of the exciting journey, you will arrive Hoi An Town where you will check into your hotel for the night."},{"title":"Full Day In Hoi An (B/L)","description":"\nEnjoy a full-day excursion to Hoi An, once a major trading port for sailors from around the world. Since the main trading business was transferred to Da Nang in the 18th century, Hoi An has managed to retain its charm without the intrusion of over modernisation. You will visit a temple with partially gilded statues in the centre, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Next, you can discover more of the history at the Sa Huynh Museum which contains exhibitions from the earliest period of Hoi An's history. Late in the afternoon, you will take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the unique culture of the woodworkers and shipbuilding families. You will spend the night in Hoi An taking in the sights of the world famous Cua Dai Beach."},{"title":"Hoi An - Halong Bay (B/L/D)","description":"\nYou will leave Hoi An and drive to Da Nang Airport in the morning to fly to Noi Bai International Airport in Hanoi. You will be collected from Noi Bai airport and taken to Halong Bay, one of the most magnificent scenic environments in the world. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone peaks or karsts which jut from the deep blue water as far as the eye can see. You will spend a day and a half, including an overnight stay with dinner and breakfast, onboard a boat exploring this overwhelming seascape. Comfortable and intimate, your boat will feature hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since you'll be staying overnight on the water, you will be able to explore Halong Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia."},{"title":"Halong Bay - Hanoi (B/L)","description":"\nRising to the sound of lapping bay waters, you will have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands and beautiful bay lit up by the rising sun. After breakfast, explore Sung Sot Cave, swim and relax. Brunch is served while you are cruising through the bay, taking in more of the fascinating formations. At the end of the cruise, you will be met by your driver to travel back to Hanoi for overnight where you will stay overnight. You will arrive in Hanoi at about 15:00. You will stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. Here you can visit Ngoc Son Temple and enjoy Water puppet Show after a one-hour cyclo tour around the Old Quarter. You will spend the night in Hanoi."},{"title":"Hanoi Departure (B)","description":"\nYou have the morning free to relax before your return flight home or if you aren't quite ready to go home, why not explore some other amazing destinations with Mr Linh's Adventures."}]},{"name":"Highlights of Vietnam 08 days 07 nights","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1068,"summary":"Discover the wonders Vietnam on this exciting eight-day tour. From exploring the culture of the captivating capital, Hanoi to experiencing the stunning scenery of Halong Bay and unearthing the ancient history of Hue, this tour will show you the true beauty of Vietnam. This tour encapsulates the aspects which make Vietnam a unique and unmissable destination.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6778.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6778.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d677d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d677f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6781.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6782.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6784.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6785.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6787.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d6788.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d678a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d678b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194005_5e466cb0d678d.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Vinh Long"],"timeline":[{"title":"Hanoi Arrival (-)","description":"Welcome to Hanoi: Vietnam’s bustling colonial capital. Your guide and driver will meet you outside the baggage claim of Noi Bai Airport and take you to your hotel in the city centre. In the afternoon, take a walk around the centre, visiting some of Hanoi’s main attractions: the Opera House, Old Quarter, Hoan Kiem Lake and Ngoc Son Temple. In the evening enjoy a traditional Water Puppet Performance – a unique Vietnamese art form hailing from Southeast Asia’s wet-rice culture – followed by a welcome dinner at one of Hanoi’s finest restaurants."},{"title":"Hanoi City Tour – Halong Bay (B/L)","description":"Enjoy a half day to explore Vietnam’s charming capital, before driving through the countryside of the Red River Delta to the magical Halong bay. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, Hanoi is an eclectic mix that offers something for everyone. Your city tour will take you to Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh's Mausoleum and stilt house), the nearby One Pillar Pagoda, the Temple of Literature and the Fine Arts Museum. In the afternoon, leave the bustle of the big city and drive to Halong Bay (3 to 4 hours drive)."},{"title":"Halong Bay – Hoi An (B/L)","description":"Today you will enjoy a day cruise on Halong Bay: a UNESCO World Heritage Site and natural wonderland composed of jutting limestone islands and sparkling turquoise waters, located in the Gulf of Tonkin. After breakfast at the hotel, you will be transferred to the Halong Harbor to board your private junk cruise for a 4-hour journey. Cruise along the calm waters, between looming, limestone outcrops to visit Dau Go Cave “Grotto of the Wooden Stakes”, where, in 1288, one of Vietnam’s most famous generals, Tran Hung Dao, stored hundreds of stakes before battling the invading Mongolian army. A short walk away, visit the newly discovered Thien Cung Cave (\"Grotto of the Heavenly Palace\"), famous for its stalagmites and stalactites. Savour a fresh seafood lunch, served on board before sailing back to Halong City, where your car will be waiting to take you to Hanoi for your flight to Da Nang. Upon arrival, you will transfer to your hotel in Hoi An"},{"title":"Hoi An (B/L)","description":"Immerse yourself in the tranquillity and charm of this sleepy riverside town. From the 16th to 18th centuries Hoi An was a thriving international port frequented by Chinese, Dutch, French, Japanese, Portuguese and Arab traders, who came to trade in the high-quality silk still produced in the region. Today, Hoi An is a relaxing resort popular with tourists for its eclectic architecture, skilled tailors and numerous cafes. Take a half-day walking tour through the narrow winding streets of the ancient town centre, visiting Chua Ong Pagoda, the Chinese Assembly Hall, the 200-year old Tan Ky ancestral house and the famous Japanese Bridge. After lunch, take a short boat trip to a nearby island and visit a handicraft village specialising in ceramics. Return to the hotel in the late afternoon and enjoy a free evening at your leisure."},{"title":"Hoi An – Hue (B/L/D)","description":"Depart Hoi An for the scenic mountainous drive to Hue. Stop at the dramatic Hai Van Pass, the dizzying dividing line between the climate zones of North and South Vietnam, to admire the spectacular views. After stopping in the fishing village of Lang Co for a drink, spend the afternoon on a leisurely walking tour through Vietnam’s ancient capital city, visiting the Royal Citadel, Thien Mu Pagoda and the Mausoleum of King Tu Duc (a replica of the king’s palace built for the next reincarnation of the king), before exploring the Imperial Museum and Dong Ba Market."},{"title":"Hue – Ho Chi Minh City (B/L/D)","description":"Have breakfast at the hotel then drive to Phu Bai Airport of Hue to catch your flight to Vietnam’s modern metropolis: Saigon. Arrive in the late morning and enjoy an orientation tour through Ho Chi Minh City’s bustling streets en route to the hotel. Have lunch at a downtown restaurant of your choosing then set out on a guided city tour. Visit the War Remnants Museum, learn about Vietnam’s recent history at Reunification Palace, visit the nearby neo-Romanesque Notre Dame Cathedral and the City's Centre Post Office before passing by the ornate Opera Theatre and the City Hall. Finally, end up at the Ben Thanh Market, where vendors display a vast array of goods and handicrafts, appealing to every taste."},{"title":"Ho Chi Minh City – Mekong Delta (B/L)","description":"Today you travel to the Mekong River Delta on a day trip to explore the rich culture and lush fluvial landscape. After breakfast, your guide & driver will meet you at your hotel and take you to Cai Be. Start your tour with a visit to Cai Be’s colourful floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends around 15:30 in Vinh Long. Your driver will meet you at the dock and take you back to Ho Chi Minh city."},{"title":"Ho Chi Minh Departure (B)","description":"Today is free at your leisure for last minute shopping or sight-seeing before driving to the airport to catch your departure flight home."}]}]