[{"name":"Vietnam Encounters","duration":11,"travelStyle":["Discovery","Adventure","Group","Partially Guided","Holiday"],"oldPrice":1665,"price":1500,"summary":"If you’re visiting Vietnam for the first time or returning to take in its splendour one more time, this tour combines its most popular tourist attractions with visits to its rural areas - giving you a well-rounded experience that will stay in your memories forever. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/57792_e9baf982.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/57792_e9baf982.jpg","https://cdn.tourradar.com/s3/tour/1500x800/57792_e6203ca1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/57792_17ebf05a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/57792_b927c809.jpg","https://cdn.tourradar.com/s3/tour/1500x800/57792_0ea30ca9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/57792_71a35787.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Vinh Long"],"timeline":[{"title":"Day 1: Welcome to Hanoi! Airport transfers included","description":"Once you arrive at the airport, we’ll meet you at the airport and take you to your hotel in Hanoi. Once settled in, we’ll be briefed about what lies ahead a collection time will be arranged to get things started tomorrow.You can choose if you want to visit Hoan Kiem Lake to watch or participate in some early morning Tai Chi with the locals. | OVERNIGHT Hanoi hotel | EXTRAS Single room supplement, Extra day in Hanoi - pre-tour"},{"title":"Day 2: A historical and culinary adventure in Hanoi","description":"Depending on your choice to sleep a little later or visit Hoan Kiem Lake to watch or join in on some early morning Tai Chi, we’ll have breakfast accompanied by Vietnamese language lessons - to help you interact with the locals during the rest of the tour.On the schedule today is a visit to the Ho Chi Minh Mausoleum, the One Pillar Pagoda and the Presidential Palace. We’ll also have the opportunity to explore the Temple of Literature, built in honour of Chinese scholar, Confucius.We’ll head to the Vietnam Museum of Ethnology, before travelling to Hanoi’s Old Quarter to sample different street foods and taste some of the local brews, some traced back to Eastern Europe. For dessert, we’ll head to Hanoi’s most popular ice cream parlour for some sweet treats. | OVERNIGHT Hanoi hotel | MEALS Breakfast, Dinner"},{"title":"Day 3: Cruising the waters of Ha Long Bay","description":"We take a scenic drive to Ha Long Bay, a UNESCO World Heritage Site and popular travel destination in Quảng Ninh Province. Ha Long Bay is made famous by its emerald waters and its spectacular scattering of limestone islands.Here, we’ll board a classic Junk boat, passing its mysterious caves dotted along the islands, before enjoying a tasty lunch on deck.We’ll visit the Sung Sot Cave - dubbed the most beautiful cave in all of Ha Long Bay before we make our way to Titov Island, where you have the opportunity to swim or relax on the beach. As the sun goes down, we’ll return to the boat for a sunset party and a tasty hearty dinner. We’ll spend the rest of the night listening to the natural sounds of Vietnam. | OVERNIGHT Halong Bay junk boat | MEALS Breakfast, Lunch, Dinner"},{"title":"Day 4: A kayaking adventure and an overnight train trip","description":"This morning, we have the choice to enjoy some Tai Chi or to head out on a photo hunt before we have breakfast on board the junk boat. We’ll then kayak to the arc-shaped Luon Cave situated on Bon Ho Island. The cave looks like a natural gate with a lot of beautiful stalactites on the ceiling. The height of the ceiling ranges from 2,5 to 4 metres, depending on the tidal level, which means only small rowing boat or kayak can pass through it.After the kayak, we’ll head back to the boat as we move further along the bay, drifting past the Ba Hang fishing village and Dog Islet. Once we arrive back at the harbour, we’ll be treated to a fruit carving demonstration and join a cooking class before digging into a traditional Vietnamese lunch.We’ll return to Hanoi, you’ll have some free time in the afternoon. We’ll provide you with a day-use hotel room before we board the overnight Reunification Express sleeper train south to Hue City. | OVERNIGHT On board sleeper train | MEALS Breakfast"},{"title":"Day 5: Welcome to Hue city","description":"Wake up on board today to the sight of rice paddies with their attendant farmers and water buffalo, small villages and rural farmland rushing past us. On arrival in Hue we transfer to our hotel before enjoying a private tour of this historically and culturally rich city and its ancient temples.We'll spend the day exploring the Citadel - a UNESCO World Heritage site, before relaxing on a sunset cruise on the Perfume River as the evening ends with the sounds of traditional music. We'll spend the night in Hue City. | OVERNIGHT Hue hotel | MEALS Lunch"},{"title":"Day 6: Hue - Hoian – Ancient town","description":"We’ll say our goodbyes to Hue City as we head along the coastline, traversing the scenic Hai Van Pas towards the ancient town of Hoi An - located along Vietnam’s central coast. It's also listed as a UNESCO World Heritage Site.From Hoi An, we’ll visit the traditional pottery village of Thanh Ha. The big landmark is the Terracotta Village, a park and centre devoted to all things pottery. Its front garden is full of clay replicas of the architectural wonders of the world, everything from the Taj Mahal to the Colosseum in Rome.We’ll then visit the traditional village of Kim Bong, most notable for its carpentry and traditional woodworking. We’ll visit the area where the build wooden fishing vessels using traditional methods. We’ll then attend a carpentry workshop, where the carpenters amaze us with their craft, creating handcrafted furniture, sculptures and souvenirs.We’ll hop back onto the boat, as we make our way down the Bon River, watching the fishermen cast their lines, and if you’re up for it, you can even join in. | OVERNIGHT Hoi An hotel | MEALS Breakfast"},{"title":"Day 7: A free day in Hoi An. Optional tours available","description":"Ancient and peaceful, Hoi An is one of the most popular destinations in Vietnam. You have a free day to explore its wonders or join in on a variety of local options, which includes a boat trip to the nearby islands, snorkeling, exploring the My Son Holy Land, visiting the markets and a bike ride. Other options include a cooking class in the Tra Que village or a tour with the local fishermen where you can learn how to cast nests, catch crabs and race basket boats.If you’re keen to do some shopping, Hoi An is famous for its tailors, so if you’re looking for a new suit or dress - you’ll get one professionally made in record time here!Exploring Cham IslandA local Vietnam tour guide will meet you at your hotel, before we head to Cua Dai Harbour to board a speedboat to Cham Island. We’ll visit Au Thuyen, a place where many fishing boats throw anchor, before heading towards the ancient temple of Hai Tang Pagoda and fishing village.Afterwards, we’ll make our way to Bac Island, where you’ll have the chance to experience its rich sea life with some snorkeling and swimming before enjoying a seafood lunch.Visit the My Son Holy LandThis optional tour takes you to the evergreen countryside of the My Son Holy Land - located in a narrow valley, surrounded by springs, mountains and green, dense jungle. You’ll get insight into the everyday life of the locals and the scenic landscape will provide you with lots of photographic opportunities.You’ll be given a brief introduction to the history and culture of the Indian-Hinduism influence on the Champa Kingdom before visiting what's left of a carefully-crafted red brick temple - its monuments and epitaphs unrivalled in south-east Asia.Cooking lessons at the Tra Que Vegetable VillageIf you’re looking to take home some Vietnamese cooking tips, then this cooking class in the Tra Que Vegetable Village is perfect for you. A tour guide will collect you at your hotel before cycling to Hoi An’s colourful central market to buy ingredients for your cooking lesson.Once we have everything we’ll need, we’ll cycle to the Tra Que vegetable village. We’ll be met with a welcome drink before being taken on a tour of the vegetable gardens where the local farmers use traditional methods to take care of their crops - no modern machinery needed here.We’ll then head to the restaurant to be introduced to the chef, who will give us a cooking master class on the traditional methods of preparing and cooking Vietnamese food, before digging into a tasty meal.Fish and Chips TourWe’ll cycle to the Tra Que Village, to witness how the local farmers go about their daily duties before making our way to the Hoi An Beach Dock, to board a boat to the Cua Dai Sand Dune. Here, we’ll learn how to cast nets like the local fishermen.We’ll then head to the Cam Thanh Water Coconut Village, where the locals will teach us how to catch crabs, before being split up into groups for basket boat racing. Its lots of fun!By now you may be hungry, so we’ll go to a local family house to enjoy a tasty lunch, learn how to make funny tools with a water coconut leaf, before visiting a craftsman's house in the village. | OVERNIGHT Hoi An hotel | MEALS Breakfast, Lunch | EXTRAS Exploring Cham Island, Visit My Son heritage site, Cooking class at Tra Que village, Fish & Chips tour"},{"title":"Day 8: A flight to Ho Chi Minh City & an evening Vespa adventure","description":"We’ll be transferred to the Danang Airport to board a flight to Ho Chi Minh City - formerly known as Saigon is a dynamic city that rarely sleeps and famous for the pivotal role it played in the Vietnam War.Once we arrive, we’ll have some time to settle in and refresh before exploring the city in a unique way - from the back of a vintage Vespa scooter - driven by a highly experienced driver.We’ll start at Cafe Zoom for cocktails and a few appetizers before making our way to a popular eating spot for a meal. We’ll then hop back onto the back of the Vespa to experience the Saigon nightlife.We’ll make our way through Chinatown and the busy streets of District 4 - as we greet locals and enjoy some street seafood and drinks. We’ll also head through District 3 and 1, marvelling at the sights of Banh Xeo and tasting its southern food.We’ll continue to a hidden Vietnamese-style coffee shop, where we’ll listen to the sounds of live Vietnamese music before heading to another live music venue. All your drinks and food are included. | OVERNIGHT Ho Chi Minh City hotel | MEALS Breakfast"},{"title":"Day 9: Exploring the Mekong Delta and Cai Be","description":"We’ll pass the Mekong Delta as we make our way to Cai Be - a small town on the northern side of My Thuan Bridge, located two hours from Saigon, and the gateway to Vinh Long province. it’s famous for its floating markets.We’ll tour the markets before boarding a private boat to explore the waterways and canals to Vinh Long, where we’ll enjoy lunch at the home of a Bonsai gardener, where you’ll taste the popular 'Elephant ear fish'. Once full, we’ll say goodbye and head further down the tributaries and canals of the Delta.As the day comes to an end, we’ll make one final stop at the home of a local family, where we’ll relax and try to catch fish by hand to prepare for dinner. We’ll have dinner with the locals, getting insight into their way of life before calling it a night | OVERNIGHT Mekong delta homestay | MEALS Breakfast, Lunch, Dinner"},{"title":"Day 10: Mekong Delta – Ho Chi Minh City","description":"We’ll start with an early breakfast before cycling to a local village to buy some ingredients to make food for lunch. Together with the locals, we’ll help to cook some Vietnamese dishes before saying “Tạm Biệt - Goodbye!” to the house owner and their children, as we head back to Saigon to relax. We’ll spend the night in Ho Chi Minh City. | OVERNIGHT Ho Chi Minh City hotel | MEALS Breakfast | EXTRAS Saigon craft beer Vespa tour"},{"title":"Day 11: Free time. Airport transfer included","description":"It's the last day of our Vietnam tour, and you have free time to relax before being transferred to the airport to board your flight back home. You can choose to do some optional activities today if you have a late flight, or if you’d like to extend your stay with a few extra nights.Half day City Tour of Ho Chi MinhThis half day city tour of Ho Chi Minh takes you to its most popular tourist attractions, which includes a visit to the the Reunification Hall, the War Crimes Exhibition, a lacquer or rattan ware factory, the Notre Dame Cathedral, War Remnants Museum, Centre Post Office, Chinatown and Thien Hau Pagoda (built by the Cantos congregation in the early 19th century).You’ll also visit Binh Tay or Ben Thanh Market for some shopping.Explore the Cu Chi TunnelsThis optional tour takes you to the 250-kilometre-long Chu Chi Tunnels - which form part of a massive war museum that offers a sneak-peek into the underground life of Vietnamese soldiers back in 1948.The Viet Cong soldiers could move around war areas undetected by American soldiers. It is believed that Cu Chi Tunnels are built on the land known as “Land of Steel” which is located at the end of Ho Chi Minh Trail.This activity includes●Watching a documentary film about one of the most sophisticated man-made tunnels together with its extraordinary wartime legends●Walking in the jungle and visiting the traps, the secret entrances, the bunkers, and underground hideouts●Relaxing with shooting real guns at the rifle range of Cu Chi Tunnels. (Exclusive of bullets)●Seeing the rice-paper (spring roll skin) and rice-wine production line●Crawling into the tunnels and enjoying the special and fantastic feeling●Taking a rest, drinking green tea and having tapioca - the main food served during the war time.You’ll then head back to Ho Chi Minh for a rest, before heading back to the airport to board your flight home.Saigon Craft Beer Tour - Vespa TourThis optional tour takes you the best craft breweries in Saigon, as we make our way through the busy streets of Ho Chi Minh at the back of a vintage Vespa. Come and explore the unique flavours, made with local Vietnamese essences at four fascinatingly different places.Every beer has been handpicked by a master brewer, giving you a taste of the broad range of flavours in this ever-expanding craft beer scene in Saigon. The brewers will share their knowledge with you, taking you through the entire journey of the brewing process.Along with the craft beer tastings, each destination offers delicious food pairings, which includes pizza, gourmet tapas and a host of Vietnamese inspired bites.Dining by the Saigon RiversideYou’ll be collected at your hotel by a guide, who will transport you in a restored army Jeep to the The Deck - a classy restaurant and bar in Ho Chi Minh City.The Deck is a top dining choice among affluent locals and travellers due to its romantic setting and scenic views, leaving you with unforgettable moments of Saigon. After dinner, the Jeep will be ready to get you back to the hotel, passing some of the city’s landmarks. | OVERNIGHT N/A | MEALS Breakfast | EXTRAS Cambodia Extension, Extra day in Ho Chi Minh - post-tour, Half-day city tour, Cu Chi Tunnels tour"}]},{"name":"Best Of Vietnam","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":999,"summary":"This tour begins in Vietnam’s capital Hanoi, before heading to Halong Bay to sail on board a Junk and marvel at breathtaking views of the Bay. The tour then travels to the center of the country to visit the UNESCO heritage towns of Hoi An.  Guests can wander through the cobbled streets of Hoi An and enjoy its ancient buildings before flying to the bustling southern city of Saigon. In Saigon guests will have a fully guided city tour and visit the nearby villages dotted along the Mekong River. ","highlights":["Lose yourself in Hanoi's charming Old Town","Stay overnight onboard your junk boat in Ha Long Bay","Fall in love with authentic and sleepy Hoi An","Learn about Vietnam's past in bustling Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117028_1645d5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117028_1645d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_2c9ec083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_6c35d16c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_00c2549c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_2e06ddc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_d80f9985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117028_d128356f.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: HANOI ARRIVAL","description":"On arrival at Hanoi International Airport make your own way (transfer not included)to your hotel. Although it is the modern-day capital of Vietnam, Hanoi still retains the mystery and charm of past centuries. Narrow lanes and traditional shophouses invite exploration, while its many beautiful public spaces; lakes, parks, tree-lined boulevards, and monuments give the city an air of elegance and harmony with nature unique among Asian capitals. \nOvernight in Hanoi"},{"title":"Day 2: HANOI (B)","description":"After breakfast begin your day with a one-hour cycle ride to explore the capital city. The city is a blend of long established traditions and modern imprints of Western colonization. Tree-lined boulevards and colonial buildings give the city a touch of Western elegance, while crowded blocks of tiny old houses and narrow lanes bear the charm of past centuries. Afterwards visit the vast Ho Chi Minh Memorial Complex, a lovely park setting home to Ho Chi Minh's final resting place, as well as a museum and other memorials. Visit the Ho Chi Minh Mausoleum (closed on Mondays & Fridays) where one can pay respects to the embalmed body of Ho Chi Minh. Continue through the park to Ho Chi Minh’s Stilt House, the simple two-room dwelling where Ho Chi Minh lived from 1958 until his final days in 1969. Preserved in the same condition as during his life, it may be viewed through windows only. Visit the miniature One Pillar Pagoda dating from the 11th century but rebuilt after being destroyed by the French in 1954. Today it stands near the vast ho Chi Minh Memorial Complex, a lovely park setting which is home to Ho Chi Minh’s final resting place, as well as a museum and other memorials. Then visit the Temple of Literature, a peaceful series of walled courtyards and graceful gateways, and one of the best examples of traditional Vietnamese architecture. Founded in 1070 and dedicated to Confucius, this was also the site of Vietnam's first university. Afterwards visit Hoan Kiem Lake which means \"Lake of the Returned\", which is a lake in the historical centre of the capital of Hanoi. The lake serves as a focal point for locals. Legend has it that King Le Loi handed a magic sword called Heaven's Will which brought him victory in his revolt against the Chinese Ming dynasty back to the Golden Turtle God in the lake. The Tortoise Tower (Thap Rua) standing on a small island near the centre of lake is linked to the legend. Then visit Ngoc Son Temple and the Rising Sun Bridge. The temple was erected in the 18th century. It honours the 13th century military leader Tran Hung Dao who distinguished himself in the fight against the Yuan (Mongol invaders), Van Xuong, a scholar and Nguyen Van Sieu, a Confucian master and famous writer in charge of repairs made to the temple in 1864. Jade Island is connected to the shore by the wooden red-painted Huc Bridge (The Huc, means Morning Sunlight Bridge).  Visit the Neo-Gothic St. Joseph's Cathedral inaugurated in 1886. Visiting this cathedral is like being instantly transported to medieval Europe. The cathedral is noteworthy for its square towers, elaborate altar and stained-glass windows. The first Catholic mission in Hanoi was founded in 1679. Visit Tran Quoc Pagoda, one of the oldest pagodas in Vietnam, located on West Lake. The pagoda is quite beautiful and done in a traditional Vietnamese style. An 11 floor Buddhist tower makes this pagoda a sacred spot for pilgrims from all over the country.  Then visit the Museum of Fine Arts (Bao Tang My Thuat); housed in a colonial building the museum displays traditional Vietnamese fine arts, ranging from sculpture and painting to lacquerware and ceramics.  Afterwards visit Hoa Lo Prison Museum more famously known by American prisoner of war as the Hanoi Hilton. \nOvernight in Hanoi"},{"title":"Day 3: HANOI - HALONG (EMBARKATION) (B/L/D)","description":"If you wish to see how the locals rise and shine in the morning, wake up early and join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi Quan, jogging, martial arts, classical dance and so on. After breakfast, depart for Halong Bay, a Natural World Heritage as designated by UNESCO since 1994. En-route you will pass by the Red River Delta with many rural villages, fascinating towns, and paddy fields. On arrival at Halong Bay Tuan Chau International Marina, a tender boat will take you Halong Phoenix Cruise. A refreshing welcome drink is served followed by check-in into your cabin. Enjoy lunch. A delicious set menu lunch is served in the restaurant while you can enjoy the amazing scenery. Cruise amongst the hundreds of islands. You will pass by a several islands and islets on the Bay. This afternoon stop at Luon cave for Kayaking to visit the small cave and beautiful lagoons. Kayaking provides the opportunity to explore the beautiful lagoons and get closer to the island. (A bamboo boat will be arranged for people who cannot Kayak). The boat will take you to Titop Island for you to enjoy the beach. You can enjoy a swim or climb up to the top to get an overview of a corner of the bay.  As the sun sets over the bay, we head back to our cruise. Relax with Coffee, tea and fruits on the sundeck or order your favorite drink while your boat cruise to the night’s anchorage area. Dinner will be server with local seafood. After dinner you may choose to spend time on the top deck or experience squid fishing before retiring to your cabin. \nOvernight on-board cruise"},{"title":"Day 4: HALONG (DISEMBARKATION) - HANOI (BY FLIGHT) – DANANG – HOI AN (B/L/-)","description":"Enjoy the morning view of the beautiful landscape with a cup of coffee or tea. You will visit the impressive Cave of Halong Bay – Surprising Cave (Sung Sot) with your tour guide, a truly awesome and amazing cave to experience. As the boat begins cruising back to the harbor, experience more views of Halong Bay such as Fighting Cocks Island (Symbol of Halong Bay), Incense Burner and Stone Dogs Islands. A cooking demonstration onboard shows you how to make authentic Vietnamese Spring rolls. You will learn about the recipes and techniques that create this popular dish of Vietnamese people. Lunch is served on board during cruising towards the harbor. After disembarkation, you will then be transferred back to Hanoi to catch a flight to Danang where you will be met and transferred to Hoi an. The exquisitely preserved merchant town of Hoi An was declared a UNESCO World Heritage Site in 1999. Its colorful shop houses and temples reflect a diverse heritage, dating back to the 16th and 17th century, when it was a major port for Western, Chinese and Japanese traders. Today it is a thriving center of traditional crafts and a shopper’s paradise, best explored on foot. \nOvernight in Hoi An"},{"title":"Day 5: HOI AN (B/-/-)","description":"Wander through the cobbled streets, past low tile-roofed buildings, the bustling central market and the small harbor where colorfully painted boats are moored. The walking tour will include visits to a private house, where members of the same family have lived continuously for centuries in a traditional setting; to one of the family chapels built by prominent merchant or official families as centers for ancestor worship; and to a typical Chinese-style pagoda. Continue to Sa Huynh museum located near the Japanese covered bridge with exhibitions from the earliest period of Hoi An's history. Visit handicraft workshops in Hoi An where local products are being made. Finally, continue to the famous Japanese covered bridge pagoda, first constructed in 1593 by the Japanese community of Hoi An to link the town with the Chinese quarters across the stream. \nOvernight in Hoi An"},{"title":"Day 6: HOI AN - DANANG - SAIGON (BY FLIGHT) (B/-/-)","description":"This morning travel back to Danang to the domestic airport for a flight to Saigon.  On arrival you will be met and enjoy a tour of the vibrant metropolis. Saigon teems with energy, activity and motion. Everywhere you look, you see the meeting of traditional and modern life. The emerging modern skyline stands cheek by jowl with colonial buildings and traditional temples. Outside on the streets, young professionals zip by on motorcycles, chatting on cell phones; inside the quiet temple courtyards, worshippers pray amidst clouds of incense. Begin your tour of this exciting city with a tour of the historic center, strolling along Dong Khoi Street, formerly known as the Rue Catinat, the main shopping thoroughfare and heart of old colonial Saigon. Pass by classic European-style landmarks such as the ornate City Hall (Hotel De Ville), the old Opera House (both may only be viewed from the outside) and pay a quick visit to the neo-Romanesque Notre Dame Cathedral and the Central Post Office. Afterwards dive into modern history with a tour of the Reunification Palace. Formerly the Independence Palace of the South Vietnamese president, this 60’s style building was famously stormed by tanks on April 30, 1975 signifying the fall of South Vietnam. It has been preserved in its original state, and the original tanks remain on display near the entrance gates. End the tour at the central Ben Thanh Market, where vendors display a vast array of goods and handicrafts. \nOvernight in Saigon"},{"title":"Day 7: SAIGON (B/-/-)","description":"Enjoy your day at leisure, or perhaps book our optional tours. \nOvernight in Saigon"},{"title":"Day 8: SAIGON USA (B)","description":"Today after your breakfast, make your own way (transfer not included) to the airport for your departure flight."}]},{"name":"Vietnam: Northwest Loop Vietnam 10 Days/9 Nights","duration":10,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1180,"summary":"The discovery tour from Hanoi to the Northwest of Vietnam allows you chance to explore the most beautiful mountainous scenery and colourful hill tribes in Vietnam. Leave the graceful streets of Hanoi behind to travel through bumpy but stunning mountain roads to Mai Chau,  Nghia Lo , Mu Cang Chai , Sapa ,Y Ty, experience breathtaking mountain views, meet friendly locals, take part in performance of folk songs and dance, or join a soft hiking to ethnic villages for a deeper understanding of the local culture that all ensure you unforgettable moments. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/155093_521429e7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/155093_521429e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_11e2791d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_d5b47664.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_21ade71a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_2156d2db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_0f1d089e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_7ca8a4be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_a4341475.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_5c52adca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_4977abc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_09c4bdfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_45e91610.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_48ca875d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/155093_2c306688.jpg"],"destinations":["Hanoi","Mai Chau","Sapa"],"timeline":[{"title":"Day 1 :Arrive in Hanoi – 4-hour Hanoi city tour by private car","description":"Upon arrival, our car & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transfer to Hanoi Old Quarter and drop at hotel to check in. Then you will get a chance to visit Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the nearby One Pillar Pagoda; the Presidential Palace; the Temple of Literature; West Lake. Afternoon, visit St. Joseph’s Cathedral, Hoan Kiem Lake before enjoy a traditional Water Puppet Performance – a unique Vietnamese Art form hailing from Southeast Asia’s wet-rice culture., End of the day is time for shopping at old quarter. Overnight in Hanoi. Meals : Lunch or Dinner . Accommodation : Hotels in Hanoi"},{"title":"Day 2: Hanoi – Mai Chau (130km, homestay)","description":"08:00 Pick up at your hotel and transfer to visit one of the most beautiful place in the North – Mai Chau Valley which takes around 160Km (4 hours).\n\nOn the way, we make a first stop at Hoa Binh Hydropower Plant which was built from 1979 to 1994. It is not only an important industrial construction but also an attractive sightseeing for visitors. Many valuable items such as: Ho Chi Minh statue on Tuong hill with 18 meters height, the traditional area keeping letters, memorial Vietnamese and Soviet experts sacrifice to built hydropower projects.\n\nOur next stop will be Giang Mo ethnic village which is set in a valley at the foot of Mo Mountain in Cao Phong District, 85km northwest of Ha Noi and 10km from Hoa Binh City. Visiting Giang Mo Village where you have a chance to see houses on stilts rested under the shadow of big trees and surrounded by paddy fields, discover the daily life of local Muong Minority and interact with them.\n\nFrom there, we take a short drive to reach to one of the most beautiful roads in Vietnam which is steep mountains in one side and amazing Hoa Binh Lake in the other side and called Halong bay on land with thousands of islands dotted on the lake. If you are lucky, you can see the fishermen working on the lake to catch fish, shrimp… Especially, we will stop at a stilt-house located on the bank of the lake for having a picnic lunch which will be prepared by our tour guide. Then take a short boat trip (1 hours) on the beautiful lake and immerge yourself in the pure nature of fresh.Meals: Breakfast, Lunch, Dinner . Overnight in a traditional stilt-house of a Thai family."},{"title":"Day 3 :MAI CHAU – NGHIA LO","description":"After breakfast, we depart for Nghia Lo via Son La. We will have stops on the way to take the wonderful photos from stunning mountains and landscape and visit Muong minority in Yen Chau and Moc Chau.Arrival Nghia Lo, if time permits, we will invite you to visit the tea farm in Suoi Giang town. Check in hotel and overnight in Nghi Lo city centre.\nMeals: Breakfast, Lunch, Dinner . Overnight in Nghia Lo city ."},{"title":"Day 4:NGHIA LO – TU LE - MU CANG CHAI","description":"After breakfast , we are ready for Lu Le Visiting & take photograph from Lim Mong, Lim Thai on the way.Having lunch on the way in local restaurant.After lunch, continue driving to Mu Cang Chai. You will be stop at La Pan Tan and Che Cu Nha Villages which having the best scenery about terrace fields.Arrive Mu Cang Chai, check in guest house and overnight at Local homestay in  Mu Cang Chai. Meals: Breakfast, Lunch, Dinner"},{"title":"Day 5: MU CANG CHAI – SAPA","description":"n the morning, we have a chance to visit the different and very colorful hill tribes in Muong Hoa, Muong Kim and Na Kim villages before keep driving to Tram Ton pass where you have a great chance to enjoy the fresh, cool air and stunning landscapes.Continuing down road to visit Silver waterfall in O Quy Ho before arrival Sapa town centre. Check in and free at leisure to discover Sapa by night.\nOvernight in Sapa town. Meals: Breakfast, Lunch, Dinner"},{"title":"Day 6: SAPA TREKKING TOUR","description":"09:00: The local tour guide will come to meet you at your hotel, she will introduce about the trip via the map and then we start doing one day trek to Sa Seng, Hang Da and Hau Thao villages where will give you a special atmosphere of peaceful villages in the mountain, those are visited by fewer tourists than the other villages.\n\nOur driver and tour guide will lead you from Sapa centre to the new road to discover Sapa market and meet the different hill tribes are trading here. After one hour visiting market, we continue our trip by driving to Sa Seng where we start trekking up hill. Along the way, you will have a great chance to view and enjoy the amazing scenery of Chapa vallay with its mountain side, river, terraced rice fields and villages located close together.\n\nKeep walking to Hang Da, a small but very beautiful village of Black Hmong people where you can stop to visit and hear your tour guide introduce more about their traditional culture and custom. Then you will be better understanding the culture of different minorities in Sapa.\nHave picnic lunch in a small port where you can view the wonderful rice paddy . After lunch time, we continue walking to Hau Thao, from this place you have a chance to see the panorama view of Muong Hoa valley and Hoang Lien Son mountain range. Our private van is ready to transfer you back to Sapa. Overnight in Sapa town. Meals: Breakfast, Lunch, Dinner"},{"title":"Day 7 : SAPA – Y TY","description":"On this day, we continue our amazing trip to Y Ty, one of the most beautiful destinations in Lao Cai province. From Sapa, we transfer you to Y Ty where you have a chance to see the starting point of Red river running to Vietnam from China and see the conjunction of Lung Po Stream joining to Red river.After lunch in Y Ty, we start trekking tour to visit Lao Chai 1 village of Ha Nhi minority, in this village, you will have a chance to explore the traditional culture and custom of hill tribe living in the house with the mushroom shape.Continue our trek to discover Phin Ho plateau with the height of over 2.000 m , enjoy the fresh and pure air and discover the diversity of plants.Get back to Y Ty centre for check in homestay. Overnight in Y Ty. Meals: Breakfast, Lunch, Dinner"},{"title":"Day 8: Y TY – MUONG HUM – BAC HA","description":"After breakfast with the host we say goodbye and drive to Muong Hum. Stop at Y Ty jungle where you can see a lot of ancient trees and in this jungle, the weather is always fogy and cool in all year round.\nSeveral stops on the way to take the beautiful photos then have lunch on the way before driving ahead to Bac Ha.Check in and overnight in Bac Ha town.Meals: Breakfast, Lunch, Dinner"},{"title":"Day 9: BAC HA COLORFUL MARKET – DRIVE BACK TO HANOI","description":"he markets in the Northern Vietnam are always the colorful meeting places for the hill tribes, spotlight for any Sapa Tours and of course, your unique Vietnam Tours experience. Minority people come down from the mountains to sell their products, or just for catching up on the latest news, gossip, drinking away troubles or seeking for lover.From your hotel, you also can see the people is coming to market from everywhere.After that, you will have time to take a walk around the market to see how local people business and enjoy the special atmosphere and you may try out your trading skills with the friendly local people.Have lunch in the local restaurant before drive back to Hanoi.\nArrival Hanoi around 19:00. Check in hotel and overnight in Hanoi. Meals: Breakfast, Lunch"},{"title":"Day 10: HANOI DEPARTURE (BREAKFAST)","description":"Fee time at leisure until our tour guide and driver transfer you to airport where you can continue your next destination. End of the trip"}]},{"name":"Vietnam Motorbike Tour from Hanoi to Hoi An, Da Nang on Ho Chi Minh Trail","duration":6,"travelStyle":["Bicycle","Group","Partially Guided","Holiday"],"oldPrice":0,"price":980,"summary":"\n\tThis Hanoi Motorbike Tour to Hoi An, Da Nang on Ho Chi Minh Trail within 6 days via Mai Chau, Phong Nha, Quang Binh & Hue is a good choice for those who want to experience riding on such a legendary road in a short time. On this tour, you’ll have special chances to discover the natural landscapes of mountains, forests, waterfalls as well as villages on the road sides and additionally enjoy local specialities at local restaurants.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129840_df0f7a49.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129840_df0f7a49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_f15376ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_a7eec988.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_c31119df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_9b1799f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_cfa35662.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_27b355f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_241f42e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_c747cd72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_f16627b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_7717c302.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_5793fe94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_970b90e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_f77a8c38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_e6d22069.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_59757c26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_d2f3cc44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129840_b51525b6.jpg"],"destinations":["Hanoi","Mai Chau","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi motorbike tour to Mai Chau","description":"Our motorbike tour will be started by leaving Hanoi on dyke roads toavoid the heavy traffic around 9.am , we ride our motorcycles west to Mai Chau, an area of beautiful landscape and home to the Thai ethnic minority. \nWe will motorcycle on Highway 6 passing extensive farming lands comprising a sea of paddy fields split by tree-lined roads punctuated by limestone karst scenery. After a light lunch in Hoa Binh Province, we cross Thung Khe, one of the most beautiful mountain passes in North Vietnam then descent to the mountain valley settlement of Mai Chau. After dinner we join performance, where you can dance and share a range of special liquors (rice wine) with the locals. Overnight in a house-on-stilts of the Thai people.\nSummary"},{"title":"Day 2: Mai Chau motorbike tour to Tan Ky (Nghe An)","description":"Motorcycle on a small, spectacular and paved trail along the Ma river until Cam Thuy town where we stop for lunch. Hit the Ho Chi Minh trail (now a newly built highway) all the way to Tan Ky town where we spend the night in a hotel.\n\nSummary"},{"title":"Day 3: Tan Ky motorbike tour to Phong Nha","description":"Ride on Ho Chi Minh Highway until Pho Chau where we stop to visit the HCM Trail victory monument which is in fact the real starting point of our HCM Trail ride. Motorcycle all the way to Phong Nha – Ke Bang, the biggest and also the most beautiful cave in Vietnam and Indochina and is now a UNESCO World Natural Heritage site.\n\nThe karst formation of Phong Nha-Ke Bang National Park has evolved since the Paleozoic (some 400 million years ago) and so is the oldest major karst area in Asia. Subject to massive tectonic changes, the park’s karst landscape is extremely complex with many geographic features of considerable significance. The vast area, extending to the border of the Lao People’s Democratic Republic, contains spectacular formations including 65 km of caves and underground rivers.\nSummary"},{"title":"Day 4: Phong Nha motorbike tour to Khe Sanh in Quang Tri","description":"Boating and exploring World Heritage site of Phong Nha where local civilians and military sheltered from incessant bombing during wartime. Then after having lunch, we will keep riding on Ho Chi Minh Trail and have short stop at Truong Son cemetary to pay respects to the soldiers who fought and died on the trail during the American War.\n\nContinuing west on highway 9, we will climb into the Truong Son foothills, pass the Rock Pile and stop at some villages and beautiful natural springs and waterfalls near the highway.\nApprox 5pm we arrive in Khe Sanh which was established as a forward base by General Westmoreland near Laos to secure highway 9.\nCheck in to hotel, free time at night\nSummary"},{"title":"Day 5: Khe Sanh in Quang Tri Motorbike Tours to DMZ & Vinh Moc Tunnels – Hue","description":"In this morning, we ride along highway 1 to Quang Tri town, visiting Long Hung Church and Quang Tri Old Citadel which was a battlefield in 1972 between North and South Vietnam for 81 days and nights. We ride along the coast from Cua Viet Beach to Cua Tung Beach a long stretch of beautiful and peaceful coastline.\n\nNext we visit the Vinh Moc tunnels and explore the Demilitarised Zone, stopping for lunch at the Doc Mieu Firebase. And then wee will keep on riding on Ho Chi Minh Trail via Dong Ha town, where we will stop by to take a look at Dong Ha market known as one of the most hassle and bustle markets in Central. Later on, we will ride directly to Hue and en route, our guide will stop by to show you more war relics before reaching Hue\nUpon arrival in Hue, if time permits, we will take a ride to visit Imperial Citadel and one of Royal Tombs then enjoy sunset on the bank of Perfume River\nCheck in to hotel, free time at night\n\nSummary"},{"title":"Day 6: Hue Motorbike Tours over Da Nang to Hoi An (150 Km – 5 hours of riding)","description":"In this morning, we will keep on riding along the coastal line via Hai Van Pass, where we could look down from the top to view the splendid beauties of Lang Co beach and ocean then time to refresh yourself by a cup of coffee before heading straight to Da Nang.\n\nUpon arrival in Da Nang, you will park your bikes somewhere nearby the Railway Station then our guide will take a taxi to get you to the hotel in Hoi An for a check-in. Free time on  your own\nAnd here is the time for our guide to say good bye to you. End of the trip\nAccommodation in Hoi An (Your own account)\nSummary"}]},{"name":"Amazing Vietnam Tours 9 Days : Full Board","duration":9,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2900,"summary":"In and around HanoiArrival in Ha Noi, meet your guide, then transfer to your hotel. O/N in Ha Noi.Start point\n Airport, Hanoi, Vietnam ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/157336_dc100618.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/157336_dc100618.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157336_16ba5241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157336_e87f05fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157336_3b783a8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157336_f0533a8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157336_9c0955de.jpg"],"destinations":["Hanoi","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: ARRIVE IN HANOI (D)","description":"Arrival in Ha Noi, meet your guide, then transfer to your hotel. O/N in Ha Noi."},{"title":"DAY 2: HANOI (B/L/D)","description":"Breakfast at hotel. This morning, you’ll visit Ho Chi Minh Complex, where you will see Ho Chi Minh’s Mausoleum, Humble House on Stilts and One Pillar Pagoda, the pagoda with the most unique architecture. Drive to the serene Temple of Literature, Hoan Kiem lake & Ngoc Son temple. Later enjoy a pedicab tour around the Old Quarter. This evening you will watch a performance of the famous Water Puppets, which have a history dating back thousands of years. O/N in Hanoi "},{"title":"DAY 3: HANOI – HALONG BAY (B/L/D)","description":"Have breakfast. Early morning you will travel to the ‘Jewel in the Crown of Vietnam’, Halong Bay. Board a junk boat for a relaxing cruise through the emerald waters and around the limestone islets of the Gulf of Tonkin. Enjoy the spectacular scenery as you have lunch on board. After your cruise you will return to Hanoi. O/N in Hanoi"},{"title":"DAY 4: HANOI - HOI AN (B/L/D)","description":"After breakfast, fly to Danang. Upon arrival transfer to the UNESCO World Heritage listed town of Hoi An, This evening partake in a cooking class where you can taste your own dishes for dinner. O/N in Hoi An."},{"title":"DAY 5: HOI AN (B/L)","description":"Have brekfast, starting a tour at the charming town of Hoi An on foot, visiting an old merchant’s home, the Japanese Covered Bridge, Hoi An Market and a local Chinese temple. This afternoon is free at your leisure to soak up the atmosphere of Hoi An at one of the many cafés along the Thu Bon River or relax at the beach. O/N in Hoi An."},{"title":"DAY 6: HOI AN - HO CHI MINH (B/L)","description":"After breakfast, you will fly to the cosmopolitan city of Ho Chi Minh city. Upon arrival you will explore the city with a visit to the French-style Central Post Office and the Notre Dame Cathedral, Reunification Palace & China Town. End the day at the lively Ben Thanh Market where you can enjoy some shopping. O/N in HCMC. "},{"title":"DAY 7: HO CHI MINH – CU CHI (B/L)","description":"Have breakfast. You have a hafl day to explore the amazing network of the Cu Chi Tunnels. The tunnels were used by the Viet Cong guerrillas for concealment, food and weapon storage as well as living quarters. You can even crawl through the tunnels if you are feeling brave. Then return to HCMC. O/N in HCMC."},{"title":"DAY 8: MEKONG DELTA – HO CHI MINH (B/L/D)","description":"This morning travel to Tien Giang & Ben Tre in the Mekong Delta. Life in the Mekong Delta mainly revolves around the river and many of the villages are only accessible by the canals. Explore the river by boat. Passing to Long, Lan, Quy, Phung islets, enjoy honey tea. Embark to Ben Tre, visit the coconut candy and rice paper factory. Get on a horse cart for the visit to the nicest rural village. Then enjoying fruits and Southern amateur music at local house. Relax on sampan through on of the small canals of Mekong river. Return to HCMC. O/N in HCMC"},{"title":"DAY 9: HO CHI MINH – DEPARTURE (B)","description":" Free at leisure till transfer to the airport for flight to back home. See you next trip!"}]},{"name":"Highlights of Vietnam - 11 Days","duration":11,"travelStyle":["In-depth Cultural","Family","Group","Fully Guided","Coach / Bus"],"oldPrice":1890,"price":1225,"summary":"Experience the very best exotic Vietnam has to offer, from Ha Long Bay to Ho Chi Minh City/Saigon","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153317_b1a862.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153317_b1a862.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_6c80a32e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_b5e297c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_a32935f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_4e5edeb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_519361e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_b12b51da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_5041ce05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_b19d81aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_d4941a9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_f26bdc3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_3dab5257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_9396dc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_8fdf706e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_86b3f22f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_6c5faa5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_f5e234fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_637136e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_d7a2e6fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_e0acc4ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153317_845705f8.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Hue","Hoi An","Can Tho","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Arrive in Hanoi","description":"You've arrived in Vietnam! Check in at your hotel and take some time to explore the bustling centre of Hanoi. There are plenty of stores and market stalls to peruse, and the city is also known for its nightlife and street food. Meet up with your tour leader and other travellers at the hotel in the afternoon.Start point\n Hotel, Hanoi, Vietnam 15:00 - 17:00"},{"title":"Day 2: Hanoi city tour","description":"Your full-day sightseeing tour of Hanoi starts with a visit to the Ho Chi Minh Complex. This is the current resting place of Ho Chi Minh, known as the father of modern-day Vietnam. Discover the Ho Chi Minh Mausoleum, One Pillar Pagoda, Presidential Palace and unusual Stilt House. The Temple of Literature will be your next stop. Constructed in 1070 in honour of Confucius, it served as the country's first university. Then it's onto the Vietnam Museum of Ethnology. Here, you can get an insider perspective on the lifestyles and customs of the 54 official ethnic groups that call Vietnam home. Hoan Kiem Lake and the island-bound Ngoc Son Temple will be the last stop for the day."},{"title":"Day 3: Hanoi - Ha Long Bay","description":"Embark on a cruise to iconic Ha Long Bay. Enjoy a traditional lunch on board while cruising through the beautiful canals. The first stop in Halong Bay is Sung Sot Cave. Return to the ship to enjoy happy hour at sunset, and learn more about Vietnamese cuisine during a live cooking demonstration. Dinner is served aboard the ship, after which you can relax on the top deck, try your hand at squid fishing or watch an Indochina movie before turning in for the night. Please note: Cruise itineraries and schedules are subject to change without pre-notice depending on the weather and operating conditions."},{"title":"Day 4: Cat Ba island - Hanoi - flight to Hue","description":"Wake up in Ha Long Bay and start your day with a refreshing Tai Chi lesson on the sundeck. After breakfast, hop onto a bamboo boat with a local and explore Luon Cave. Enjoy lunch and visit the verdant Cát Bà Island, before embarking to Hanoi for a flight down to Hue."},{"title":"Day 5: Hue city tour","description":"The city of Hue served as the centre of politics, culture and religion of unified Vietnam up until 1945. The famous 80 km-long Perfume River winds its way through the city centre. Cruising its length is a great way to see the city's main sights. This includes the well-known Thien Mu Pagoda, Imperial Citadel and the Royal Mausoleum of Emperor Tu Duc. The rest of the day is yours to explore Dong Ba Market at your leisure."},{"title":"Day 6: Hue - Da Nang - Hoi An","description":"Hop aboard the coach for a scenic drive along the coast from Hue to Hoi An. Stop along the way to drink in the beauty of the Marble Mountains topped with striking pagodas on each summit. Disembark in Hoi An and take the afternoon to explore the lovely coastal city at your leisure."},{"title":"Day 7: Hoi An ancient town - Free afternoon","description":"The ancient town of Hoi An boasts many historic sites. Encounter the Japanese Covered Bridge Pagoda and explore the pretty city streets. Visit the Sa Huynh Culture Museum to learn more about the innovative civilisation who established the port. See the Tran Family ancestral worship chapel in person. Learn about lantern-making up close and visit Phuoc Kien Assembly Hall, which honours die Goddess of the Sea. Take the afternoon to explore at your own pace."},{"title":"Day 8: Hoi An - Da Nang - flight to Can Tho","description":"Enjoy free time to visit the beach or do a last bit of wandering around Hoi An before embarking to Da Nang Airport. Board a flight to Can Tho, in the Mekong Delta region. The city is home to vast canal networks and floating markets. Use your free time this afternoon to visit the iconic Binh Thuy Ancient House. The century-old home has some marvelous architectural idiosyncrasies."},{"title":"Day 9: Cai Rang floating market - Ho Chi Minh City/Saigon","description":"Hop aboard a boat at the Ninh Kieu boat station. Cruise along the busy Can Tho waterway to Cai Rang floating market. This is the ideal place to shop for keepsakes and get some excellent photos. Next up, explore the lively An Binh indoor market. Then it's onto Rau Ram canal for a walking tour and a visit to a rice noodle workshop. Visit a Ba Cong tropical fruit garden where a local family will teach you about cultivation methods, before heading to Ho Chi Minh City/Saigon, where we will spend the night."},{"title":"Day 10: Cu Chi tunnels - Ho Chi Minh City/Saigon city tour","description":"The Vietnam/American War played a large role in shaping the Vietnam we know today. Pay homage to this tumultuous history by visiting the Cu Chi Tunnels. These tunnels acted as the refuge of guerrilla fighters during the war. Explore Ho Chi Minh City/Saigon. Iconic sights include the Notre Dame Cathedral, Post Office and the Presidential Palace. Wander the Ben Thanh Market and seek out souvenirs as dusk descends."},{"title":"Day 11: Ho Chi Minh City/Saigon: End of tour","description":"Your Vietnamese tour has come to an end. Exchange contact details with your fellow travellers and enjoy your last day in Ho Chi Minh City/Saigon before you head home.End point\n Hotel, Hồ Chí Minh, Vietnam 10:00"}]}]