[{"name":"Exploring Northern of Vietnam With 5 days 4 nights package","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":280,"summary":"Welcome  to Hanoi,  a  city  of  lakes  and  the  center  of  Vietnamese  culture.  This  Hanoi  stopover  tour  is designed  for  those  who  are  on  a  business  or  pleasure  trip to  the  charming  capital  of  Vietnam.  This specially-tailored  package  provides  an  overview  of  the  major  tourist  attractions  in  Hanoi  as  well  as  an orientation tour for visitors to get accustomed to Vietnamese culture in the first few days after their arrival in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/182849_b41cd03a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/182849_b41cd03a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_a9f8411e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_0fc3aefc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_4d409c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_519147ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_8be36b12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_09ddc7c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_41aeb974.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_55edb8b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_ee68e669.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_0f37116a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182849_106b62cb.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Pick up from Noi Bai Airport to Hanoi hotel","description":"- Arrive at Noi Bai international airport, welcome by your your driver. Transfer to your hotel in the city center. Overnight at the proposed hotel "},{"title":"Day 2: Hanoi City Full day (Breakfast/Lunch)","description":"- Have a breakfast before your trip.\n- 7:30-8:00Am Our guide pick you up from your hotel to enjoy a full-day tour of Hanoi and get a local's insight into Vietnam’s mythology, traditions and customs. Visit cultural and historical sites, such as the Mausoleum of Ho Chi Minh, as well as everyday locales such as the houses of the Old Quarter.\n-08:30: Following a pick-up at your hotel by your guide and driver, go to the Ho Chi Minh Complex to discover the heart of Viernam at “Uncle Ho’s” Mausoleum. Standing before the mausoleum are 79 cycad trees, symbolizing Ho Chi Minh’s 79 springs of life, while 2 bamboo ranges whistle in the wind to commemorate the former president and Father of the Nation.\n-10:00: See the nearby house-on-stilts and quaint One-Pillar Pagoda, built out of wood for the 11th-century Emperor Lý Thái Tông. Continue to the Enthnology Museum - a public museum exhibiting the ethnic groups of Vietnam. The mission of the Museum is scientific research, collection, documentation, conservation, exhibition and preserving the cultural and historic patrimony of the nation’s different ethnic groups\n-You will then visit the Temple of Literature, the site of Vietnam’s first university dating back to 1070 and originally built as a temple to Confucius. Inside you can see the stone steles mounted on the backs of turtles, which have the names of Vietnam’s best scholars inscribed. The temple highlights the importance that Vietnamese society place on education both now and in the past.\n-11:30: Next visit would be the Galary of Lacque Paiting Collection. The best of handicraft of the north of Vietnam. Then you would have lunch at Local restarant with the deep touch of the art of Hanoi Cuisine.\n-14:00: After the lunch. In the afternoon, explore the vibrant eastern sector of Hanoi, including Hoan Kiem Lake, Ngoc Son Temple, and Huc Bridge. Walking around the Old Quarter and mingle with the locals as they go about their hectic lives.\nEnd with a 30-minute Cyclo Tour around the Old Quater of Hanoi to have the best view of life of Hanoian."},{"title":"Day 3: Ha Noi – Ha Long Bay – Lunch - Titop Island – Surprising Cave – Sunset party – Dinner – Fishing (Breakfast/Lunch/Dinner)","description":"- 7:30 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n- 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise . Meet the captain , crew and join us for welcome drink as we tell you about life onboard.\n- Check into your cabin . Time to refresh and unwind.\n- Served a delectable lunch while cruising ahead to Ha Long Bay\n\nAfternoon Activities:\n- Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n- Back to the Cruise, We will take you to visit the Titop Island – swimming\n- Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n- Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n- After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\n\nEvening Relaxing:\nDinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom"},{"title":"Day 4: Tai Chi – Breakfast – KAYAKING – Cooking demonstration – lunch – Hanoi hotel (Breakfast/Lunch)","description":"Morning in the bay:\n- 6:30 – 6:45 Start your day with Tai Chi exercises or a photo hunt\n- Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in Hang Luon and and around the bay.\n- We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store .\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and more…\n- Join in the Cooking Class , teaching you how to make our specifically (Spring rolls) before an early lunch is served .\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina.\n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00"},{"title":"Day 5: Transfer from Hanoi hotel to Noi Bai Airport (Breakfast)","description":"Breakfast at the hotel. Free until transfer to Noi Bai airport for departure. End of  service."}]},{"name":"Authentic Vietnam tour 5D4N (Hanoi- Ninh Binh- Ha Long)","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":260,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Travelling to beloved Hanoi, you will not only be captivated by its ancient beauty but also feel the peaceful life here associated with rich of the nation. Besides, the trip will take you to visit Ninh Binh - the religious worship, boating, history and excavation learning and an optional choice for whose loves biking. \nHalong Bay is a perfect product of the Creator and a harmony of stone, water and sky. Visitors to Halong are certainly supprised by thousands of islands and islets in various shapes and looks, making an unique Bay. Let's go and enjoy ! ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177252_604d133b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177252_604d133b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_46ed83e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_0a802806.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_31080fa7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_56649fe2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_c6461b7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_b057ecc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_34111f94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_1efbf97a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_92971564.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_0db1e3d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_a9a9eee4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_657c72e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_d1c80b38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_144aca30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_c58596f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_74b4eecb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_496bf3b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177252_d4b23cba.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi arrival - water puppet show (no meal)","description":"Welcome to Vietnam ! The driver will pick up and transfer to hotel. The rest of day is your own at leisure. Enjoy water puppet show, discovery the beauty of this unique Vietnam traditional art.\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ninh Binh - Hoa Lu - Tam Coc (B/L)","description":"07:30 - 08:30 Get picked up by our tour guide and bus then depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes half way to relax and experience Vietnamese handicraft products such as lacquer wares, paintings, embroideries…\n10:30 Arrive at Hoa Lu, which is once depicted the ancient capital of Viet Nam, settled up in the 10th century.\n11:00 Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time.\n11:30 Visit the excavation area beside the Le Dai Hanh temple. You experience the vestiges of Royal Palaces ground dated back 10th century. Go back to the bus and drive to Tam Coc.\nCYCLING RIDE (optional): Those who love to explore real countryside images of Vietnam can proceed a 40 minute cycling ride along country lane (from Tam Coc to Bich Dong Pagoda, estimated time 40 minutes for 5km cycling 2 ways), experiencing the beautiful scenery of lush paddy fields. Finish the cycling ride at Tam Coc dock in time for a buffet lunch in restaurant.\n14:00 Board the sampan boats (2 people share a boat) in Tam Coc dock to drift down the river among the villages, mountains and lush rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai -Second cave, Hang Ba - Third cave\" to get a strange feeling. Boat returns to the dock for bus drive back to bungalow in Ninh Binh.\nOvernight in Ninh Binh."},{"title":"Day 3: Ninh Binh - Ha Long - Sung Sot cave (B/L/D)","description":"Have breakfast at bunalow. Then the driver transfer to Ha Long, drop off at Tuan Chau harbour at 11.00.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 5: Ha Long – Pearl farm – Hanoi (B/L)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel. \nOvernight in Hanoi.\n"},{"title":"Day 5: Departure (B)","description":"Have breakfast at hotel. You are free to go shopping unti the driver transfer to airport for flight back home.\n\nEnd of the service !"}]},{"name":"Hanoi 6 Days 5 Nights (Hanoi, Ha Long Bay)","duration":6,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":337,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Travelling to beloved Hanoi, you will not only be captivated by its ancient beauty but also feel the peaceful life here associated with rich of the nation. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140639_08586f88.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140639_08586f88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_e931b156.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_50ddf736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_328b9b83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_554e18f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_5e4a8577.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140639_f6b28b73.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrivel (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Hanoi.\nStart point\n Noi Bai international airport, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: : Hanoi - Sapa - Lao Chai and Ta Van Village (Breakfast, Lunch, Dinner)","description":"6:30 – 7:00 Tour guide pick you up at your hotel, departure to Lao Cai city.Travelling on new Highway Noi Bai, It will take around 5 hours. \n12:30. Arrival in Sapa town, enjoy lunch in a local restaurant. \n13:00: Bus will take you to the gate of Lao chai village start trekking to Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. \n17:00 Come back to Sapa Town, having dinner and Overnight Hotel in Sapa\n"},{"title":"Day 3: Sapa - Cat Cat village - Hanoi (Breakfast, Lunch)","description":"7:00 Have breakfast at hotel. \n9:00 Trekking from hotel to Exploring Cat Cat village of H'mong – a colonial French discovered area and a renowned resort to officials from the early twentieth century, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools. \n12:30 Enjoy a meal at a local restaurant in Sapa Town. \n15:00 Driver take you back to Hanoi. Have light dinner on the way back to Ha Noi \n21:00 End of tour at Hotel. Overnight Hotel in Hanoi.\n"},{"title":"Day 4: Hanoi - Ha Long Bay overnight on Cruise (Breakfast, Lunch, Dinner)","description":"7:45 - 8:30 Meet your tour guide at suggested places around Old Quarter for Ha Long Bay. \n12:30 Embark at Tuan Chau habor, Ha Long city. Transferred by tender to the Dragon Gold Cruise. Greeted by crew members followed by welcome drinks, get cruise briefing and check in cabin. \n13:00 Savor lunch on board while cruise heads to center of Halong Bay. \n15:00 Explore Sung Sot Cave, the biggest cave in Halong Bay which famous for its wonderful stalactites and stalagmites. \n16:00 Visit Titop Island for swimming or take a short walk to the top for some overview photos of Halong Bay \n18:00 Enjoy sunset while local wine and fruit is served \n18:30 Attending cooking lesson to make some spring rolls by yourself. \n17:00Having dinner on board, then free relax with other choices: Squid fishing, singing karaoke, relax on sundeck....Stay Overnight on Cruise in the middle of Halong Bay"},{"title":"Day 5: Ha Long Bay - Hanoi (Breakfast, Lunch)","description":"07:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n07:45 Join the kayak excursion \n09:00 Stop by Pearl Farm to study the culture pearl making process. \n09:30 Check out your cabin. \n10:30 Time for brunch while Cruise heads back to habor. \n12:00 Disembark habor. Say goodbye to Halong Bay, back to Hanoi \n17:00 Tour guide drops you back at your hotel. Overnight Hotel in Hanoi."},{"title":"Day 6: Hanoi City tour 1/2 Days - Departure","description":"Breakfast at the hotel \nOption1: Tuesday, Thursday, Saturday, Sunday – (Ha Noi City Tour - Ethnology Museum) \nConsidered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. \n07:45 - 8:30 Meet your tour guide . \n- Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. \n- Visit Ho Chi Minh's complex, the final resting place of Viet Nam's greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n- Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. Transfer to the airport for departure flight\n\n"}]},{"name":"Vietnam Adventure Tour 12 days","duration":12,"travelStyle":["Sightseeing","Group","Partially Guided","Moderate","Holiday"],"oldPrice":0,"price":1138,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the Sightseeing tour Vietnam Adventure Tour 12 days, you have a 12 days tour package taking you through Hanoi, Vietnam and 7 other destinations in Vietnam. Vietnam Adventure Tour 12 days includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146131_7bc87e4d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146131_7bc87e4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146131_bdb4ccbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146131_f9b26cd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146131_bee5099c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146131_0ecdd8f7.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Day 1 : Hanoi Arrival","description":"Arriving at Noi Bai airport in Hanoi, you’ll be met and driven to your hotel. Time for relaxing after the journey.\nWith time permits, you may have time for a leisure ride by small electric carts (or riskshaw) around the Hoan Kiem lake and the Hanoi Old Quarter. This bustling are of Hanoi is a maze of shopping streets and restaurants with a hotchpotch of architecture - traditional tube houses, religious buildings, artisans’ workshops and cottages, colonial houses and modern concrete edifices."},{"title":"Day 2 : Hanoi City And Bat Trang Pottery Village","description":"08:30 AM – Pick up from your hotel, we'll start the day with a visit to the excellent Ethnology Museum for an overview of Vietnam's 54 distinct ethnic groups and an enjoyable performance of traditional Water Puppetry (an art form unique to northern Vietnam) at the museum outdoor stage. You’ll have time for the Temple of Literature - Vietnam's first university, which was established in 1070 before lunch at KOTO restaurant.\nIn the afternoon, you’ll head to Bat Trang village – a premier ceramics centre 15 km northeast of the city centre. While the upper side is quite commercialized and focuses on glazed ceramic items, the riverside 'ancient' village leans more towards earthenware and pottery products. There’re opportunities to try your hand on making our own products, or wandering around its large ceramics market. \nThe day program includes a visit to a religious architecture; it’s advisory to wear long trousers/blouse (enough to cover your shoulders/knees)"},{"title":"Day 3 - Hanoi - Halong","description":"Morning pick you up at 8:00 AM from your hotel for transfer to Ha Long Bay. It’s about 160 km and driving time is approximately 3 hours and 30 munities.  \nOn the way, you have a plenty of chances to take photos of Vietnamese farmers working in paddy fields, see the local people trading and living in the countryside. Stop half way to visit a handicraft workshop of fine clothes and embroidered paintings.\nArrive in Ha Long City at 11:30 AM and check in aboard the booked junk right after the welcome drink is served. Start cruising while having lunch on board and enjoy the mighty bay view. Ha Long Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage sites whose formation dates back 500 million years, consists of around 2,000 karst islands and islets scattered over an area of 1,553 km2. The bay cruise will continue with up close sighting of Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island, a visit to Sung Sot Cave and swimming stop at Titov Beach. Relax to enjoy the bay view at sunset, have dinner after, go fishing at 09:00 PM and spend a night on board.\nDAY 3 : Early risers can enjoy the splendid yet tranquil view of the bay at the crack of dawn. Breathe the sea’s fresh air, feel the morning breeze and hear the sounds of birds above. Have breakfast and cruise to visit Human head shaped island and Tortoise Island. Continue to cruise into Bai Tu Long Bay to discover the adjacent bay of “The Little Dragon Bowing to His Mother” as it is named. Check out and have lunch on board while heading to shore. Disembark and transfer back to Hanoi. Free at leisure for your shopping time in Hanoi Old Quarter. Each street has its own name that is present for products are sold but nowadays, this typical is not remained exactly because products changes. You have an opportunity to stroll around the old streets, stop somewhere to enjoy street food and discover the corner by yourself.\nDinner at local restaurant & then check in hotel for leisure\n"},{"title":"Day 4 - Halong - Tam Coc","description":"6:30 - Coffee, tea and cakes will be served. Wake up smoothly while witnessing the silence of beautiful misty bay. A 30-minute Tai Chi session will be organized, energize your body and soul or just allow yourself some farniente time on a sunbath with a cup of coffee.   \nAbout 7.45am, we hop on bamboo boats to go visiting a secluded floating village surrounded by the mountains. We trace our way between numerous floating houses and small rowing boats that serve the everyday life as vehicle, itinerant shops, fishing utility, sometimes overnight shelter. \nBack on treasure before 9am, we start cruising back to the pier. From 9.30am, a brunch will be served. Take a last glance at the rocks, standing still as the eternal guardians of a kingdom, we are about to reach the pier. \n11:30 – Transfer from Halong to Ninh Binh. The driving takes around 5 hours, you’ll reach Tam Coc (known as one of the most scenic spot of the region) in the late afternoon."},{"title":"Day 5 : Tam Coc - Hoa Lu","description":"In the morning, we hop on bicycles for an easy-paced to the local pier for embarking on a rowing sampan for about one hour on a less travelled canal of the region. It goes through caves and along the border with the natural site of Trang An.\nAfterwards, you continue our cycling route through scenic rural landscapes in Tam Coc and have a closer look to the villages’ rural life with opportunity to stop en-route and help a local farmer in his daily work. Lunch will be served at one of the village’s houses.\nBack to your hotel in Tam Coc, the rest of day will be free for your family relaxing."},{"title":"Day 6 : Tam Coc - Cuc Phuong - Ha Noi - Da Nang","description":"Upon arriving at Da Nang International Airport, you will be greeted by your local tour guide and driver and afterwards transferred to your hotel. After a short rest, you’ll be taken for sightseeing of Da Nang City and visit the Son Tra Peninsular. For you to experience the local history, you will visit the Cham Museum, which is a great chance to dig down in the fascinating world of the Cham Kingdom. After a day of experiences there will be served dinner at a local Vietnamese restaurant, and after that, you will rest in your hotel in Hoi An"},{"title":"Day 7 : Danang - Hoi An","description":"Morning will be free at your leisure.\nIn the afternoon, at around 2:00 pm - our guide picks up from your hotel with bicycles; we’ll then set off towards Duy Vinh – the country side of Hoi An. The picturesque cycling route is highlighted with rice fields, local garden and market... Stop as often as you wish for taking photograph or some easy chat with locals. There’s also time for a visit to a local family who are making sleeping mats in traditional way or a local carving workshops nearby.\nAfter around 1 hour cycling, you’ll meet your water gear, let’s explore Cam Thanh coco palm forest in your own way by kayak or SUP (stand-up-paddle). The area is a unique mangrove ecosystem to Hoi An and the scenery is spectacular. The Coco palm forest provides the locals with products such as fish, shells and Nipa leaves which are commonly used as a roofing material for local homes. \nYou’ll back to the boat pier after 1-1.5 hours paddling. Cool down with some local snack before getting back to hotel"},{"title":"Day 8 : Hoi An Free and Fly to Ho Chi Minh","description":"The day will be free for strolling in the town, lazing on the beach, or whatever takes your fancy. You’ll spend the night in Ho Chi Minh"},{"title":"Day 9: Fly to Ho Chi Minh and Cu Chi Tunnels","description":"After morning pickup at your Ho Chi Minh City hotel, travel about 20 miles (30 km) to reach Cu Chi, a district of the city most famous for the 75-mile (121-km) network of underground passages built by the Viet Cong army. \nFollow your guide through this historic military site, now a war memorial park, which was once a key position for the Viet Cong during the Vietnam War (known as the American War in Vietnam). Learn how the tunnels provided shelter, supply and communication routes, medical treatment sites, and food and weapons storage. See booby traps that were built to capture intruders and dioramas that illustrate daily life in the tunnels. If you like, you can even crawl through parts of the narrow passageways. \nAfter your time in Cu Chi, return to the city for a traditional Vietnamese lunch served at a riverside restaurant. Then spend the afternoon visiting Ho Chi Minh City's top sights. Start your city tour at Reunification Palace, where in 1975, Viet Cong troops broke through the main gates and the party took control of the government, ending the long war. Inside the 1960s-style building, check out the official living quarters, meeting rooms and a military command center complete with old radio equipment and tactical maps from the war. \nA short walk from the palace, your guide shows you fine examples of French Colonial architecture, including Notre Dame Cathedral, the Central Post Office, Ho Chi Minh City Hall and Ho Chi Minh Municipal Theater, also known as the Saigon Opera House. Stroll toward the Saigon River along Dong Khoi Street and Nguyen Hue Boulevard to admire historic buildings and the ultra-modern Bitexco Tower, until recently the tallest skyscraper in Vietnam.\nWrap up your afternoon at Ben Thanh Market — the city’s central market and one of its most colorful areas. Marvel at mounds of goods, and practice your bargaining skills if you wish to purchase any items. \nOvernight in Ho Chi Minh City"},{"title":"Day 10 : Mekong Delta","description":"Pick up at your hotel in Ho Chi Minh city. Depart for Cai Be by car/van via Trung Luong Expressway. On arrival in Cai Be, set off for the Cai Be floating market by motor boats and watch the locals trading fruit and many other commodities on their vessels. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Then wander in small villages, visit fruit plantations, accompanied by traditional southern Vietnamese folk music. Afterwards, paddling through a series of small canals to experience the charm of the Upper Mekong Delta, where you can enjoy yourself with the nature. Lunch time is a good chance to get closer with the local and you will learn how to prepare special Vietnamese dishes. Food is cooked by yourself, and fresh river food is served in the heart of the garden. Cycle in the village path through orchards. Meet the local islanders to learn more about the local daily life in the Mekong Delta. Transfer to Can Tho. Overnight at hotel/homestay in Can Tho."},{"title":"Day 11 : Mekong Floating Market","description":"Breakfast at the hotel/homestay. Take a leisure boat trip to explore the picturesque tributaries of the Lower Mekong River (Bassac River) then visit to Cai Rang floating market which is the liveliest one in the whole of region. Walking trip to visit the fruit plantation and local noodle factory. Visit Binh Thuy communal house and Munir Ansay Pagoda - a Khmer pagoda, renowned for its unique structure. Have lunch and return to Ho Chi Minh City."},{"title":"Day 12 : Ho Chi Minh Depart","description":"Your time will be your own until your private car and driver arrives to take you to Tan Son Nhat airport for your departure flight.  End of our services."}]},{"name":"Northern Vietnam Escape: Sapa And Surrounds","duration":5,"travelStyle":["In-depth Cultural","Group","Fully Guided","Train & Rail","Coach / Bus","Sightseeing","Holiday"],"oldPrice":925,"price":740,"summary":"This Trip takes you out of the hustle of Hanoi and into North Vietnam's glorious national parks and UNESCO World Heritage Sites. Comfy overnight trains aren't just fun, they save you precious travel time, and will carry you through the jaw-dropping Ninh Binh province, the shimmering waters of Tam Coq and the rolling hills of Sapa, where you'll fall in love with the serenity and spectacular natural beauty of Vietnam, with included experiences like a boat ride through cave formations and and a local homestay showcasing an authentic side to this fascinating country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198426_b13bab64.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198426_b13bab64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198426_5ea65ddcdc25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198426_5ea65ddcdc25c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198426_5ea65ddcdc25e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198426_5ea65ddcdc25f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198426_5ea65ddcdc267.jpg"],"destinations":["Hanoi","Ninh Binh","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Hanoi to Ninh Binh","description":"Welcome to Vietnam's eroded and elegant capital Hanoi, with its gorgeous colonial buildings and intoxicating energy. For all its charms, we're headed out of the city to somewhere decidedly more peaceful...We've reached the UNESCO World Heritage site of Trang An. We'll be left speechless by the soaring limestone karst peaks set against vibrant greens. We'll visit the Ancient Capital of Hoa Lu - Vietnam's first centralised fuedal state from the 10th century - as well as the temples of the Dinh and Le dynasties whilst marvelling at the lush rice paddies. After a local lunch, we'll hop on a boat with our skilled rower, as she takes us on a tranquil journey through the winding rivers, natural caves and canals of Tam Coc. You've never seen natural beauty like this before, and this twisting ride is as mind-blowing as it is peaceful."},{"title":"Day 2: Ninh Binh to Overnight Train to Lao Cai","description":"This morning we'll take a bike ride through Tho Ha village, enjoying the dazzling greenery of the rural landscapes. Later today is your chance to engage in some agricultural activities such as catching crabs, fishing and transplating vegetables, before we return to the hamlet for a cooking class and lunch with a local family."},{"title":"Day 3: Overnight Train to Lao Cai to Sapa","description":"We've reached Lao Cai, the gateway to Sapa. After breakfast it's on to Cat Cat Village.Today is about enjoying the spectacular surroundings - discover cascading waterfalls and have your breath taken away by the terraced fields, vegetable patches and verdant hills. Continue to explore the breathtaking scenery by hiking to Muong Hoa Valley, home to the largest terraced rice fields in Sapa. Tonight, you'll get a real overview of the traditional customs and way of life with a local homestay, enjoying delicious local food and maybe some rice wine."},{"title":"Day 4: Sapa to Overnight Train to Hanoi","description":"Rise and shine, you don't want to miss a moment. Today you'll hike and ascend through the mountains taking in the views of the terraced rice and corn fields. Once arriving at Ta Phin Village you'll meet the Red Dzao and Black H'moug groups who live peacefully together in the village yet retain their distinctive cultures.We're heading back to Hanoi tonight on another overnight train..."},{"title":"Day 5: End Hanoi","description":"Our trip ends early this morning as we arrive at Hanoi station, a sharp jolt to the senses after all that serene nature. But this grand old capital has its own charms, and is just begging to be explored."}]},{"name":"10 days 9 nights Ha Noi – SaPa – Ha Giang","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":999,"summary":"Sapa and Ha Giang are two most amazing places in the North of Vietnam with different ethnic minorities and epic scenery. You will have opportunity to enjoy the amazing scenery, exploring local life and the culture of the hill tribe. Spectacular mountain views and the strong ethnic minority presence here makes it a can’t miss on your Vietnam holiday.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e3109.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e3109.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e30ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e3106.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e310b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197290_5e7c82f6e310e.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city.\n"},{"title":"Ha Noi Free (B)","description":"Have breakfast in hotel then Exploring Hanoi and discover the food, history, and culture by my self \nOvernight in Ha Noi.\n"},{"title":"Ha Noi – Sa Pa (B)","description":"You have your morning free to relax and explore the city\nThen, you are picked up at your hotel for a transfer to Sapa town by coach \nArrival in Sapa town. Check in a homestay or hotel and overnight in Sapa\n"},{"title":"Lao Cai – Sapa – Y Linh Ho - Lao Chai – Ta Van (B/L/D)","description":"After breakfast, You start trekking to Lao Chai (Black H'mong ethnic minority) and exploring the road down the hill, where is the views of the Muong Hoa valley and magnificent surroundings of mountains and rice terrace fields, then visiting Y Linh Ho Village. \nLunch on Lao Chai Village in a local family. After lunch, trekking to Ta Van Village (Giay people). Overnight in Ta Van Village, learn about their lifestyle, culture and customs as well as talk have a friendly chat to the Giay’s people.\n"},{"title":"Ta Van – Giang Ta Chai - Ban Ho (B/L/D)","description":"Have breakfast with local food. Leave Tavan village and trekking through the bamboo forest to Giang Ta Chai village (Red Dzao ethnic minority people). \nVisiting Rattan bridge and a Red Dzao’s family, you have lunch on footpath. Continuing trekking to Ban Ho village, arrive in Ban Ho village, you will have free time for relaxing and strolling in the village. \nHaving dinner and overnight in homestay with local people (Tay ethnic minority people).\n"},{"title":"Ban Ho – Nam Tong-Sapa – Lao Cai – Ha Giang (B/L)","description":"After breakfast, you enjoy the amazing sunrise in Ban Ho Valley.\nYou have short trek to Nam Tong Village inhabited by the red Daos tribe, discover their culture and tradition before descending to the Lavie water for the nice pictures. \n\nThen you are picked up form hotel and stranfer to Ha Giang, which is around 7 hours. Enjoy the breath-taking scenery of the mountainous region. Overnight in Ha Giang\n"},{"title":"Ha Giang – Quan Ba – Yên Minh - Dong Van (B,L,D)","description":"Your day today starts in the morning when you are picked up from your hotel for a driver on the mountain roads to Quan Ba town where you enjoy the incredible view of the Happy road below. The mountain road itself provides a lot opportunities for photos with magnificent view of rice fields, mountains and valleys. Your journey continues to Yen Minh Town in which you have lunch in a local restaurant.\nAfter lunch, you drive through the villages of Lung Cam in Sa Phin to visit a H’mong Village and the residence of the Vuong Family, still called “Palace of Hmong King.”\nYour dinner isserved in the town \nOvernight at hotel room or home-stay in Dong Van.\n"},{"title":"Dong Van – Meo Vac – Ha Giang (B,L)","description":"This is the day for adrenalin experience of the famous Ma Pi Leng Pass\nIn the early morning, you stroll around the old town and local markets in serene before starting the day. This is the day for adrenalin experience of the famous Ma Pi Leng Pass\n\nYou start by driving towards Meo Vac Town with a few stops along the way for you to admire the scenery and take some photos of the Ma Pi Leng pass.\nThen, drive through the Meo Vac Town to Yen Minh town where we have lunch at local restaurant. After that, you visit Lung Tam Village, a village of Hmong minority, where you learn how to make fabrics from locally grown hemp in Northwest Vietnam, learn about their lifestyle, culture and customs as well as have a friendly chat to the local people You arrive in Ha Giang in the late afternoon. \nOvernight in Ha Giang\n"},{"title":"Ha Giang – Ha Noi (B)","description":"Today, you are to return to Hanoi by coach. Upon arrival at the hotel, check in and take the rest after long day on road.\nOvernight in Ha Noi\n"},{"title":"Ha Noi – depart (B)","description":"Have breakfast. Free relax in Ha Noi.\nThen Transfer to the airport for your return flight home\n"}]},{"name":"10 days Ha Noi – Hoi An – Ho Chi Minh","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1160,"summary":"Take a 10-day Vietnam tour and uncover the best of Vietnam; from vivid Hanoi, relaxing Halong Bay, historical Hoi An to charming Ho Chi Minh City.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d514c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d514c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d5151.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d5152.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d5154.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d5156.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197445_5e82bfa1d5157.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately by the comfortable car to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city.\n"},{"title":"Ha Noi Sights (B,L)","description":"After a truly scrumptious breakfast, you will get ready for a full day viewing Hanoi's attractions. Your first stop is the Ho Chi Minh Complex, which includes the Mausoleum, Uncle Ho's former stilt-house residence, the Presidential Palace, the Ho Chi Minh Museum, followed by the Literature Temple, Vietnam's first University constructed in 1070. In the afternoon, explore the Museum of Ethnology, which contains an extensive display of life-size structures dedicated to Vietnam’s 54 ethnic minorities. Next, enjoy an hour-long cyclo ride winding through the narrow, chaotic streets of the Old Quarter – a must for any visitor to Hanoi. Afterwards you will enjoy a Water puppet show- the unique Traditional Art in the North of Vietnam."},{"title":"Ha Noi – Ha Long (B,L,D)","description":"Join group tour for 2 days and 1 night to visit Ha Long by cruise.\nOur shuttle bus picks up you at the hotel in Ha Noi old quarter then depart to Halong. This 4-hour drive will take you to Halong Bay, a World Heritage Site recognised by UNESCOin 1994. Located in the Gulf of Tonkin, Halong Bay includes some 1,600 islands and islets, forming a spectacular seascape of limestone pillars. Because of their precipitous nature, most of the islands\nare uninhabited and unaffected by a human presence. The site's outstanding scenic beauty is\ncomplemented by its great biological interest.\n\nUpon arrival in Halong bay, you board our Junk for an overnight boat trip. After lunch you begin our\nfantastic cruise in Halong Bay. The scenery is truly breathtaking and is continuously changing. This\nincludes a visit to Sung Sot Cave, round over Tuan Chau Island, Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island and a swim at Titov beach. Enjoy dinner on board while watching the sunset.\nOvernight on Cruise. \n"},{"title":"Ha Long – Ha Noi (B,L)","description":"After an early breakfast you continue the cruise to visit Man‘s Head island, Tortoise Island, Bai\nTu Long Bay, Toad Island and Bai Tho Mountain.\nAt noon, return to the shore and disembark from the cruise as our crew say farewell. \nGet on shuttle bus to get back to Hanoi.\nOvernight in Ha Noi\n"},{"title":"Ha Noi – Da Nang – Hoi An (B)","description":"Have breakfast at hotel.\nFree explore in Ha Noi then Pick up and transfer to take a flight to Da Nang. Guide and our car will pick you up and transfer to Hoi An Town\nCheck in hotel and overnight in Hoi An  \n"},{"title":"Hoi An – My Son (B,L)","description":"In the morning, you are picked up at your hotel for a transfer to My Son Holy Land by private car/van.\nMy Son Holy Land is a World Culture Heritage. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. \n\nArrival to Hoi An for lunch. After the relax, it is light excursion to go around tiny town of Hoi An for city tour: 400 years old Japanese Bridge, 300 years old Chinese temple, 200 years old Vietnamese former merchants' house. \nThen visiting: Ling Ung Pagoda with 27m high Buddha statue. Visiting and shopping at Han Market.\nOvernight in Hoi An Town\n"},{"title":"Hoi An – Ho Chi Minh (B)","description":"Have breakfast at hotel.\nFree explore in Hoi An Town then Pick up and transfer to take a flight to Ho Chi Minh\nCheck in hotel and overnight in Ho Chi Minh\n"},{"title":"Ho Chi Minh – My Tho – Ben Tre (B,L)","description":"Join Group Tour\nIn the morning:  You are picked up at hotel by Minivan 16 seats.Then transfer to Tan Cang Pier then Depart to Mekong Delta (My Tho - Ben Tre) by Luxury Speedboat. When on board, you enjoy a light breakfast of The Pat’ a Chou Cake & Seasonal Fruits and listening to the Vietnamese traditional music – “Don Ca Tai Tu”. Visiting: \n-\tRide to Phong Phu rowing boat dock by Lambro Tuk Tuk\nCruise to Riverside restaurant at Ben Tre Province. After that, we will serve you Vietnamese set menu lunch with delicious 7 courses, especially is Elephant Ear Fish (one very special dish in Mekong Delta), rice -paper served with fish sauce and other dishes. \nThen return and overnight in Ho Chi Minh\n"},{"title":"Ho Chi Minh Free (B)","description":"Have breakfast in hotel then Exploring Ho Chi Minh City and discover the food, history, and culture by my self \nOvernight in Ho Chi Minh\n"},{"title":"Ho Chi Minh – depart (B)","description":"Have breakfast. Free relax in Ho Chi Minh.\nThen Transfer to the airport for your return flight home\n"}]},{"name":"6 days Mekong Delta And Con Dao Island","duration":6,"travelStyle":["Eco","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1030,"summary":"A specially designed tour to experience the diversity of landscapes and culture from the bustling Ho Chi Minh city to peaceful Mekong Delta and pristine beach of Con Dao island.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735080.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735084.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735086.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735087.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198450_5ea1110735088.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Ho Chi Minh City arrive – Sai Gon Night Life On Vintage Vespa (D)","description":"Welcome to Vietnam!\nAt your arrival, you are warmly welcomed by our driver and transfer privately by the comfortable car to the hotel in Ho Chi Minh.\nAround 17:30 Join tour Sai Gon Night life on Vintage Vespa. It’s a chance to see many interesting landmarks in Saigon where most tourists do not know of.\nCross China Town to explore the most favorite shopping area in Saigon.\nVisit the stunning Flower Market which gives you a feeling more of a wholesale market than a shopping experience.\nEnjoy a dinner with local foods before exploring modern style architecture in Saigon such as: The New City Town, Bitexco Building, and sparkling Saigon Riverbank.\nOvernight in Sai Gon"},{"title":"Ho Chi Minh City – Mekong Delta (Ben Tre/ Vinh Long) (B, D)","description":"In the morning, you are picked up form hotel and transfer for the Mekong Delta.\nFirst you stop by Ben Tre, visit a local village located in the heart of the Northern branch of the river. From here, you boat trip on to reach Mo Cay which is famous for products made from coconut. You will take a ride or Xe Loi (motorized cyclo) on this green island abundantly covered with coconut plantations. Visit some farms to observe the manufacture of sweets and coconut brooms.\nThe highlight of trip is travelling on small rowing boat through canal surrounded by water palms to soak up the daily life of the delta. Then come to a traditional house, tasting of local specialties: coconut jam, honey tea and pollen. Local lunch will be served at a restaurant by the river Cai Cam (On your own budget).\nIn the afternoon, you will be transferred to Vinh Long and arrive at An Binh Island (“Peace Island”) to arrive a peaceful guest house. Free time to relax and then you will have chance to join in preparing the meal and dine with local people. Overnight at homestay."},{"title":"Mekong Delta – Con Dao (B)","description":"Wake up early in the morning, we hit to road to Can Tho. Upon arrival, we board a boat to visit the Cai Rang Floating Market. The view is spectacular with various gathering boats loaded with fruits and vegetables, as well as any other type of other stuffs.\nIf time permits, you take another visit to An Binh land market tour in front of Cai Rang, and take the opportunity to make an interesting comparison between the floating and land market.\nAfter that, our car will take you to the airport for flight from Can Tho to Con Dao\n(In case the flight Can Tho – Con Dao has been fully booked, the flight ticket will be replaced: HCM – Con Dao)"},{"title":"Con Dao Free (Meal: B)","description":"After breakfast, you relax on the beach swimming in the crystal clear sea, walking upon white sand beaches. Overnight in Con Dao Island"},{"title":"Con Dao Trekking (B)","description":"Around 8:00 am: You will walk to explore So Ray plantation through the forest at 260m height. There are many big trees as well as the home for rich fauna and flora species in the rain tropical forest. You will have opportunity see more 50 colorful butterflies around the trees and flowers in the forest.\nAt So Ray plantation, you learn about medicinal plants, rare and endemic trees. In 2002, Con Dao National Park has implemented reforestation programs, forest restoration after a typhoon damage in 1997 and planted many native fruit tree species to enrich food source for wildlife. Standing from the high position, you can view to the town, fresh lakes and Con Son bay with some small island: Bay Canh island, Bong Lan island, Tai island\nContinue the trekking to Ong Dung beach. On the way you can see ancient trees and some birds which are only found in Con Dao, such as: Imperal pigeon, Nicobar pigeon.\nAround 11:30am: End of trekking, you can hear clearly the sound from sea in Ong Dung bay. Ong Dung beach is the place for relaxing, swimming and snorkeling to explore the marine life with colorful reef fish, clams in the clear water.\nHave lunch at Ong Dung Ranger station. Around 2:00pm: Come back the town. On the way, you can explore more interest nature along the trail and visit the Ma Thien Lanh bridge.\nAround 3:00pm: Car drive you back to the hotel."},{"title":"Con Dao – Ho Chi Minh City – Departure (B)","description":"Breakfast at hotel. Free at your own leisure until the flight time back to Ho Chi Minh City (Saigon) to catch up with your connecting flight."}]}]