[{"name":"11 Day Best Vietnam From Hanoi - Halong Bay - Sapa - Hoi An and Mekong Delta in Ho Chi Minh city","duration":11,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":725,"summary":"11 Day Highlight Vietnam Hanoi - Halong Bay - Sapa - Hoi An and Mekong Delta in Ho Chi Minh city offering you the exact local images in North, Central and South of Vietnam. Through the trip, Vietnam will be on your eyes. From Halong Bay amazing view, Stunning terrace rice paddy fields in Sapa, Peaceful Hoi An old town, My Son holyland to Local life on water in Mekong river…and still have more and more strange things what offer you an incredible memory about Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/157281_74159b4c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/157281_74159b4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_acc64c49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_7157667d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_8c78954e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_97807ed2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_7307251c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_8ff177af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_05600dac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_ac1d0536.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_3457d98a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_4cf798b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_6d87061d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_5938ee87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_68f0f21c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_c48da8d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_aa1b6080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_f93b97cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_277706c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_a283bcc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_56fe4815.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_d32ed597.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_09865328.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_0d372e18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157281_25eb50f9.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival – Airport pick up – Hotel check in (Meal: No)","description":"Welcome you to Vietnam. Our driver will pick you up at Noi Bai airport and transfer you to the hotel in Hanoi old quarter.\nEnjoy welcome drink and check in the hotel.\nFree time to visit Hanoi old quarter to see the local life, taste the local street foods…\nOvernight at hotel in Hanoi\n"},{"title":"Day 2: Hanoi – Sapa – Ylinh Ho – Lao Chai – Ta Van village (Meals:B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n12km trekking through the terrace fields to local homestay from Sapa town.\n\n06:30-07:00 am: Shuttle bus will pick you up at the hotel and transfer you to the sleeper bus. There are the berth in the bus and you can take lying down during the bus riding and enjoy the sightseeing.\n12:30: Your local tour guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house.\n\nPlease note: Local people’s house in Sapa is very simple, but is warly by local emotion. The host provides the warm beds, emotional family’s atmosphere, very delicious meals, but all are simple and basic.\n"},{"title":"Day 3: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":"You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\nTrekking to see the further village and sceneries, through the Bamboo forest, terrace fields. You have more chance to see and experience teh local rural life in Sapa.\nGet back to Sapa town by shuttle bus. \nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:30: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi. Shuttle bus will transfer you back to your hotel/stay in Hanoi Old Quarter.\nOvernight at hotel in Hanoi\n"},{"title":"Day 4 : Hanoi free & easy (Meal : B)","description":"Hanoi old quarter is very interesting and makes you enjoyable. Exploring the norrow entrance on old streets. Tasting several Hanoian local foods. Visiting Train street and looking at the local daily life...\nOvernight at hotel in Hanoi.\n"},{"title":"Day 5: Hanoi – Halong Bay – Overnight on Cruise (Meals: B, L, D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sun-bathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting Sung Sot cave (Amazing cave) – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise \n"},{"title":"Day 6: Halong Bay – Kayaking – Hanoi - Night train to Da Nang ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\n\nEvening time: Driver will pick you up and transfer you to Hanoi train station for Night train to Da Nang. Train journey takes about 16 hours and you will experience the night on train, viewing the countryside along the way to Da Nang.\nOvernight on the train\n\n"},{"title":"Day 7: Da Nang arrival - Transfer to Hoi An (Meals: No)","description":"Upon arrival Da Nang train station, driver will pick you up and transfer to Hoi An.\nCheck in the hotel and have your own time visiting old town with Vietnamese, Japanese and Chinese architecutre, culture. You can also take this afternoon relaxing on the beach.\nOvernight at hotel in Hoi An\n"},{"title":"Day 8: My Son sanctuary 1 Day (Meal: B, L)","description":"08:00 - 08:30: Our bus and tour guide will pick you up at your hotel/stay in Hoi An. Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village, alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n09:45:Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4thto 15thcentury.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area, your guide will explain the history of the religious site which served as a burial place for the Cham monarch centuries ago.\n12:00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village.\n15:30: The boat trip will finish at Nguyen Hoang dock in the old town. You will be free to explore the old town or return to your hotel.\nOvernight at hotel in Hoi An\n"},{"title":"Day 9: Hoi An - Da Nang airport - Fly to Ho Chi Minh city (Meal: B)","description":"Today, you have a free day to exploring the ancient town. Tasting many delicious local foods.\nDriver will pick you up at the hotel and transfer you to Da Nang airport for flight to HCM city.\nReaching Tan Son Nhat airport in HCM city, meeting driver at the airport and going to the hotel in HCM city.\nOvernight at hotel in Ho Chi Minh city.\n"},{"title":"Day 10: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in HCM city"},{"title":"Day 11: Ho Chi Minh city – Flight out (Meal:B)","description":"Taking your leisurely time to visit Ho Chi Minh city by your own with destinations as: Ben Thanh Market, China town…Tasting and feeling the local foods, daily life…until the time to transfer you to Tan Son Nhat airport for your flight out. Trip ends."}]},{"name":"HCMC & Phu Quoc Experience","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":793,"summary":"\"Spend 2 nights in the modern capital of Ho Chi Minh City exploring its history, food and culture where modern and historical Vietnam meet. Then transfer to Phu Quoc Island where you are able to relax on this still hidden gem. Spend your time at ease next to the perfectly clear waters and ride around the island to find the perfect private beaches\n\"\t\t\t\t\t\t\t\t\t\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab806d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab806d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab8072.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab8074.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab8075.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab8077.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab8078.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab807a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab807b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197890_5e8efd0ab807d.jpg"],"destinations":["Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Arrival","description":"Arrive in Ho Chi Minh City. Transfer to accommodation. Check in. Overnight at hotel      "},{"title":"Leisure","description":"Breakfast at hotel. Overnight at hotel     "},{"title":"Transfer to Phu Quoc","description":"Breakfast at hotel. Transfer from hotel to Ho Chi Minh City Airport. Catch flight to Phu Quoc. Arrive at Phu Quoc Airport. Transfer from airport to Hotel & check in. Overnight in hotel      "},{"title":"Leisure","description":"Breakfast at hotel. Day and evening at own leisure. Overnight in hotel"},{"title":"Leisure","description":"Breakfast at hotel. Day and evening at own leisure. Overnight in hotel"},{"title":"Leisure","description":"Breakfast at hotel. Day and evening at own leisure. Overnight in hotel"},{"title":"Leisure","description":"Breakfast at hotel. Day and evening at own leisure. Overnight in hotel"},{"title":"Departure","description":"Breakfast at hotel. Transfer from hotel to Phu Quoc Airport. Catch flight to Ho Chi Minh City Airport. Arrive at Ho Chi Minh City. Catch connecting flight back home.       "}]},{"name":"19 Days through Vietnam from Hanoi to Ho Chi Minh City (FREE NEW SIM CARD)","duration":19,"travelStyle":["Adventure","Family","Private","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":1594,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/102686_c8d53a94.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/102686_c8d53a94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_deeb6e42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_bd9ce606.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_529f125b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_083c1304.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_43079355.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_7c98c65c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_d3ffc05b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_dc742def.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_4bd6ffc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_5d143453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_a3657295.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_4b0639e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_83ab1672.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_a6613102.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_191ccf66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_2aad6edd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_8c2f3c04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_3de7feb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_d6b93e2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_294ea757.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_5b499ff3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_164d4693.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102686_f6d38925.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Hue","Phong Nha-Kẻ Bàng National Park","Hoi An","Dalat","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"DAY 1: HA NOI ARRIVAL","description":"On arrival Ha Noi capital, we will see at the airport have private transfer to center for check in hotel. You have free time for leisure."},{"title":"DAY 2: HA NOI - HA LONG BAY","description":"(Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities)\n \n07.45 – 08.15 approx\n- Our guide will meet you at your hotel. The shuttle bus or private car pick up\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n- Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n \n12 – 12.30 approx\n- Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is served\n- Join us for a typical local lunch in the dining room or at the outdoor dining area. \n \nAfternoon\n- Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n- Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n- Heading back toward the sleeping area\n \nEarly evening\n- Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n- An authentic Vietnamese menu is served\n- After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"DAY 3: HA LONG - HA NOI","description":"(Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n \n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n \n07:00 – 08:00\n Local breakfast is served\n \n08:00\n- Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n- Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. \n \n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n \n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n \n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30\n "},{"title":"DAY 4: HA NOI CITY - TRAIN TO SAPA","description":"In the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\nAdd some options:\n15:30- 16:15: Enjoy Water Puppet Show or go sightseeing by Electric Car or Cyclo around Old Quarter in Ha noi\n17:00: End of City tour. The bus take you back hotel, you have free time for dinner.\n21:00: Our dirver pick you up at hotel. Transfer to train station, for Lao Cai. Stay overnight on Train, soft sleeper cabin (4 beds/cabin)."},{"title":"DAY 5: SAPA TREKKING","description":"( Lao Cai-Sapa- Lao Chai-Ta Van village)\n\n5.00: We will arrive at Lao Cai Train station in the early morning. Your tour guide will pick you up and take for 01hr drive to Sapa.\n\n6.00: The luggage is put in your hotel. Then, you have a good time to enjoy breakfast and take a shower in a local restaurant nearby. Taking a leisurely walk down the town to enjoy fresh air and make friend with friendly locals.\n       9.30: We start to make a tour to Lao Chai and Ta Van villages down in Muong Hoa valley. At there, we will be seen the fantastic scenes of the beautiful valleys towards Fansipan – the highest peak of Vietnam and Indochina. In addition, you also have a change to go through the villages of Black H’mong ethnic minority to learn the way of weaving and embroidering their clothes. Have a break in a local restaurant for lunch then keep going down to enjoy immeasurable rice paddy fields and continue going into the village where the Dzay ethnic people inhabited, named as Ta Chan village\n     15.30: You will be picked up by car to return Sapa for checking-in. The rest of the day, you will be leisure to explore the town (Dragon Mount, Orchid garden, the market…). Overnight in Sapa."},{"title":"DAY 6: SAPA TREKKING","description":"9.30: After having breakfast in the hotel, we will depart to visit Cat Cat and Sin Chai villages. At there, you surely enjoy comfortable feelings when trekking through lush rice terraces towards villages and learn the experiences of Black H’mong people for their daily life and traditional culture. Then, we will come back to Hotel.\n\n14.00: We continue taking a drive to Ta Phin village (12km from Sapa) where the Red Dzao people lived to get more helpful experiences about their culture, custom and even their daily life. Moreover, you also have a best choice of buying woven and textile brocades which are completely made by hand by local people. After that, you will have an interesting chance to come into one of the local family to experience the true life of the Red Dzao. \n\n16.00:  You come back to Sapa for a shower then you will proceed forward to Lao Cai City. Your dinner will be served in a restaurant close by the railway station. Final is to go on the board a night train to come back to Ha Noi. "},{"title":"DAY 7: HA NOI - HUE CITY","description":"05:00AM Arrive to Hanoi train station, our car take you to the airport. Have a breakfast at the airport by yourself.\n\n09:00am take the flight to Hue.\n\n10:10am arrive to Hue, pick up at the airport, transfer to Hue center. Early check in.\n\n12:00 start join half day Hue city tour with group: Hue Imperial Palace,Thien Mu Pagoda (400yrs old).\n\nFrom the pagoda, you will take a dragon boat on Perfume River. During that time, you will be relaxed in fresh cool wind and enjoy the beautiful sceneries on the way. We will spend 30 minutes for coming back to Hue City.\n\n16:30  Tour will be ended. Free time in Hue city and overnight in Hue."},{"title":"DAY 8: PARADISE CAVE","description":"In the Morning:\n\n6:30: Car and tour guide of Viet Nam Adventure tour will meet you at hotel and depart to Quang Binh. On the way, we stop for seeing La Vang Church where Virgin Maria appeared in 1798. We continue to go sightseeing Hien Luong Bridge, and Ben Hai River (Parallel 17 division from south to north of the country during 20 years from 1954 to 1973).\n\n11h30: We will have lunch at Phong Nha Restaurant.\n\n12h15: We will continue to make a trip to Paradise Cave to explore the charm of Asia's longest dry and beautiful than the Phong Nha Cave which is recognizing as Natural Wonders of theWorld with the beautiful of nature given chemical. From the historic Ho Chi Minh Road (former Ho Chi Minh Trail), you will pass on a path through crass forest for about four kilometers, then you climb 519 rocky steps, and you’re in... Heaven, it’s truly a Paradise.\n\n7:30 Pm: Tour will back to Hue and we will finish Paradise Cave tour. Spend overnight in Hue.       "},{"title":"DAY 9: HUE - HOI AN ANCIENT TOWN","description":"Breakfast at hotel until transfer to the train station, 10:35AM depart to  Hoi An town (3 hours).\n\nArrive to Hoi An, transfer to hotel ,after check in Hoi An hotel, free to visit ancient town, Japanese bridge, lantern road, Thu Bon river, use the offer bicycle to the beach…Overnight in Hoi An."},{"title":"DAY 10: MY SON HOLYLAND","description":"Morning: 8.00 – 8.30: our guide pick you up at your hotel and depart to My Son holy land - the world cultural heritage. \n10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on!\n12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air.\n13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends!\n "},{"title":"DAY 11: TRA QUE VILLAGE","description":"8:00    Our local guide will pick you up at the hotel’s lobby. After that, you will ride a bicycle to the home of a craftsman in the city. Here you will get a short introduction to the history, shape, and color of the lanterns as well as the many stages of making them. Especially, you will be shown how to decorate and make your own lanterns you can also keep it as a souvenir.\nFirst, you will say goodbye to your host to continue going to the vegetable village named Tra Que Village. Join the farmers as they prepare the land, fertilizing it with seaweed from the local lake. Watch and participate in raking, sowing, watering the greens, picking vegetables, and more. We will having lunch here. Finally, get back to Hoi An by bicycle. Overnight in Hoi An."},{"title":"DAY 12: DA NANG DEPARTURE - DA LAT","description":"Breakfast at hotel until car pick up and transfer to Da Nang airport.\n\nYou get to early flight in the morning (06:30am or 10:20am) to Dalat. After 1 hour flight, we transfer to Dalat city.\n\nFree time for walk around the lake, visit the market and enjoy local food there.    Overnight in Da Lat."},{"title":"DAY 13: DA LAT CITY","description":"8:30    We will pick you up at your hotel. Then, we will make a trip to discover Da Lat City. You have chance to enjoy the fresh space at Roll Bin Hill.\n\nNext, you will be experienced the cable car descending down 300meters. Through getting cable car, you can also enjoy the nice view of flowers, the endless vegetable field to visit Tuyen Lam Lake which is surrounded by pine forest. Tuyen Lam Lake looks as a paradise with Truc Lam Meditation Center. When visitors come here, you will be contemplated religious architecture which is located on a hilltop.\n\nThen, we will continue to visit Datanla Waterfall. You will try to ride elephant or roller coaster (extra pay) with magnificent sceneries.\n\nOn the way to return Da Lat City, we come to Bao Dai King’s Summer Palace who is the last emperor and unique cultural lifestyle of Vietnam through loyal decoration.\n\nAfternoon: Having lunch at local restaurant.\n\nAfter lunch, we will go Dragon Pagoda. This pagoda is one of tourist attraction in DaLat which is famous for enchasing work of arts.\n\nWe continue to Old Railway Station. This is recognized as a national historical monument in 2001 which was designed in the Art Deco architectural style by French architects Moncet and Reveron.\n\nAfter that, we proceed to one of the poetic beauty – spots in Da Lat which is recognized a national level beauty- Spots in 1998, The Valley of Love. When coming to Dalat, you never forget visiting this valley because of its romance and beautiful sight.\n\n The last destination is Hand embroidery picture gallery. This is famous for embroidered picture.\n\n4:00  Finish the tour and come back hotel.\n\nOvernight in Dalat."},{"title":"DAY 14: DA LAT COUNTRYSIDE - NHA TRANG","description":"08:30am Tour guide will see you at your hotel and start the tour with group, driver will take you to the countryside of Dalat to visit the farms: the Flower, vegetable farms. Take a walk along Mountain view. Visit Coffee plantations, enjoy Coffee. Special, silkworm farms and its factory. Take a walk to Elephant waterfall. Visit Linh An Pagoda - with big Buddha. Keep driving to countryside landcape. Crickets farm. Minority village with their traditions. Hand embroidery picture gallery.\n\n16:00 go back the hotel, and depart to Nha Trang by private car (3 hours drive). Stay overnight in Nha Trang."},{"title":"DAY 15: NHA TRANG BAY (4 ISLANDS)","description":"8:30    Our guide will pick you up at your hotel. We will proceed to Nha Trang harbor.\n\n9:00    We leave for Mun Island by boat (It takes 45 minutes for arriving Mun Island). You will have chance to observe the structure of salangane Island and enjoy snorkeling on the extraordinary coral reefs which are covered with the multicolored fishes.\n\n12:00  We continue coming to Mot Island. You have lunch with many delicious dishes and enjoy the floating bar here.\n\n14:00  We make a trip to Tam Island and take a rest at Tam Resort. At there, you cannot only enjoy the fruit party but also some fantastic water sports.\n\n15:45  We start to visit Tri Nguyen Aquarium. You will see the sea biology inside Neptune’s place with hundred of multicolored fishes.\n\n16:00  Coming back your hotel.\n\n20:00 Overnight train to Ho Chi Minh city. Overnight on train, soft sleeper – 4 beds cabin, aircon."},{"title":"DAY 16: HO CHI MINH ARRIVAL - CU CHI TUNNELS","description":"06:20am Arrive to Ho Chi Minh train station, drive to center, leave your bags at hotel, free to go to market for breakfast.\n\n08:30am Our tour guide see you at the hotel to start Cu Chi tunnels tour.\n\n60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\n\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out!\n\n   14:30           The bus back HCM. Stay overnight in Ho Chi Minh."},{"title":"DAY 17: MEKONG DELTA (MY THO - BEN TRE - CAN THO)","description":"7h30 a.m Our tour guide welcome you at Vietnam Adventure Tours office, then transfer to the City of My Tho by bus. During 1.5 hours bus drive to My Tho join activities of local people and enjoy nice scenery of green rice paddy fields. We visit Vinh Trang pagoda - biggest pagoda in Mekong delta. Continue going to My Tho, where we take a boat trip along Mekong River. During a boat cruise along Mekong River, you can see fish cages, floating houses on the river.\nThe boat take you to small canal, where is the place you totally escape from the busy town. The boat cruise in the coconut trees canal takes you to a coconut island in Ben Tre. We disembark and have a walk around the village. Stop at a local family to enjoy tropical fruit, taste honey tea, honey wine and listen to Vietnamese traditional music, performance by the villagers.\nContinue walking on the village’s road to coconut candy shop, learn how to make candy, show some handicraft made by coconut tree. Take a walk through village with two sides there are so many kind of fruits, flowers, trees, local houses, children in Mekong delta, take your time to have nice photos and enjoy nature scenery. Then, we head to the local restaurant. Lunch is set with special Vietnamese food at here. Enjoy lunch under tree shadow you will feel the life is so beautiful.\nAfter lunch you relax half an hour to walk around the village or biking, travel on the river to back the ferry, transit to the bus back Saigon, arriving in Saigon at around 4:30pm. Tour ends with the sweet memories."},{"title":"DAY 18: MEKONG FLOATING MARKET","description":"After breakfast, Taking a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to visit Cai Răng floating market, which are the liveliest in the whole religion.\n \nTake in the beautiful scenery and the daily activities of the locals who live along the Mekong canals and you will roam through the village, fruits garden to visit a rice husking mill and a rice noodles making shop… Back to the riverside for lunch. Back to Ho Chi Minh with a sweet memory.\n "},{"title":"DAY 19: HO CHI MINH DEPARTURE","description":"After having breakfast at hotel, you have relaxing time in Ho Chi Minh city until transfer to the airport for the flight back home. See you again!"}]},{"name":"From Hanoi: 3-Day Sapa Tour with Fansipan Peak Visit","duration":3,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":155,"summary":"Travel by express bus from Hanoi to Sapa on a 3-day tour. Explore Y Linh Ho village and take a cable car up to Fansipan Peak – the Roof of Indochina.\n*Highlights:\nTrek to Y Linh Ho village\nTake a cable car to the top of Fansipan Peak\nExplore the town of Sapa during your free time","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150747_738b91b0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150747_738b91b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_3dc711cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_267c3c6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_f148a758.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_e96b472d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_0c0e2968.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_427a272e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_94073126.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_87f697f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_758b64f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_d0feebd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_b8c68352.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_9f0116ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_a5206d43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_0a84224c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_467cbda2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_e64b7f73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_2ddeea06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_770b119c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_c319fb89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_e0e46265.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_f0cf2308.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_de2d5148.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150747_466c62aa.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Hanoi- Sapa","description":"Overnight on the sleeping bus at 9.30p.m-10p.m from Hanoi- Sapa "},{"title":"Day 2: SaPa – Y Linh Ho – Lao Chai – Ta Van ( B/ L/ D)","description":"5.00 - 6.30 Pick up you at  SaPa for breakfast and check in hotel ( if available)\n9.00 – 9h30 Begin 12 km of trekking, visit Y Linh Ho and Lao Chai village of the H’Mong minority. \n13.00 After lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay the our guide will lead you visit some house on stilts of ethnic.Here you have opportunity to experience their daily life, work and original custom, enjoy some green tea and taking with ethnic people.\n14.30 We return to main road Ta Van Village. Where the van will pick you go back the hotel.\n18.00 – 19.30 Enjoy your dinner in our hotel. \nAfter dinner you are free to explore the charm of Sapa by night, enjoy roasted corn, baked eggs beside charcoal fire or go shopping.\nEspecially on Saturday night, we highly recommend a stop at the love market which is one of unique cultures of ethnic minorities (H’mong, Dazo. Int Lao Cai in pacticular and Northwest of Vietnam in general.\nStay orvernight in Sapa Relax hotel or similar"},{"title":"Day 3: Sapa - Fansipan Peak – Ha Noi ( B/ L/ D)","description":"8.00: After breakfast in hotel, driver & tour guide take you to Cable Car Station and spend 20 minutes with cable car to enjoy the spectacular scenery.\n9.00: Reach the altitute of 2800 meters, you have a good time to see the view and take photos, visit pagoda the spiritual destinations and trek up to 600 steps you will reach the peak of Fansipan - the Roof of Indochina. ( Spend about 1,5 hours for hiking and taking photos).\n11.00: Come back to Cable Car Station and return to Sapa town, 12.30: Have lunch in the hotel\n13.30 - 15.45: Relax and discover Sapa town by yourself with some souvenirs, meet all group members at hotel to get ready for Hanoi by bus.\n16.00- 22.00: Arrive in Hanoi"}]},{"name":"Discover Ho Chi Minh City 5 Days 4 Nights","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":239,"summary":"The journey commences in the enterprising and energetic metropolis of Ho Chi Minh City with its populace speeding before heading to the watery landscape of green rice paddies, floating markets and riverside villages in the Mekong Delta. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140630_6987e96e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140630_6987e96e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_4cc75b52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_820b9245.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_4ad5b238.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_c6549720.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_fab665e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_17a8243a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_45eeba25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_5c912393.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140630_2ff4973c.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: Saigon arrival (No Meal)","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. Overnight in Saigon.\n \n"},{"title":"Day 2: Full day City Tour (Breakfast, Lunch)","description":"Morning: 08:00 am to noon time\nStart the trip for exploring the great atmosphere around of lively China town. Get into the rythm of this busiest and colourful scenes of Binh Tay market and Thien Hau Temple in the morning. We then visit the War Remnants Museum. Have lunch in the restaurant.\nAfternoon: 13:30 to 16:30 pm\nContinue the trip for visiting Reunification palace which was the residence of the President of South Vietnam until end of the war in April 1975. Continue seeing some impressive French colonial structures including Notre Dame Cathedral and the Old Central Post Office. After visiting the City Hall, take a break-time at Ben Thanh market where anything and everything is for sales. Return to District 1.Tour ends.\nOvernight in Sai Gon."},{"title":"Day 3: Cao Dai Temple and Cu Chi Tunnel (Breakfast, Lunch)","description":"Depart from the hotel at 8:00 am. Enjoy a morning drive through typical southern Vietnamese countryside to Tay Ninh province in the west of Ho Chi Minh City. We visit the incredible Great Temple of Cao Dai with its unusual and fanciful architecture, where all the major faith of the world blends together in a unique religious cocktail. Everyday at noon a ceremony is held, which is open to visitors.\nIn the afternoon we proceed to Cu Chi to visit the legendary underground network of tunnels built by the Vietcong during the American War. You will creep in to the tunnel to experience how the Viet Cong lived underground. Head back to Saigon at 17:00. Overnight in Saigon.\n"},{"title":"DAY 4: Mekong Detal Tour (Breakfast, Lunch)","description":"Pick up at hotel and departure for Mekong delta trip. This trip provides a look at a wide variety of the life and scenery of the Delta. On the way you can see green rice paddy fields stretching towards\nthe horizon. After 70km driving, we arrive in My Tho, a private boat trip takes us to Ben Tre. Walking on land and exploring local life and then we’ll visit the local coconut-candy workshop. Lunch at local restaurant.\nAfter lunch, we’ll enjoy the local tropical fruits, folk music  and see how they look after their honey bee farm. Afternoon, our boat takes us back My Tho where we meet our bus again for a 2 hour drive back Saigon. Overnight in Saigon.\n"},{"title":"Day 5: Sai Gon Departure (Breakfast)","description":"Breakfast at hotel then transfer to Tan Son Nhat airport for departure flight. End of trip!"}]},{"name":"Exceptional Hanoi Wandering Tour to Ninh Binh and Halong Bay","duration":4,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":529,"summary":"This trip provides a fantastic combination of the majestic splendour of Hanoi, the lush rice terraces and the ethnic diversity of Hanoi, the sublime beauty of Red River Delta and Halong Bay. This is an adventure to remember!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171020_7ded4b5d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171020_7ded4b5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_8fed9e63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_896ced71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_84168726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_f0662e7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_73030ca8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_7271588c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_a98b0712.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_6bc4c4d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_ddafc212.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_4211d4c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_3680b3c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_5fc65e6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_33818bfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171020_dcdef10c.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"DAY 1 – HANOI – VUON THI – NINH BINH SIGHTSEEING TOURS (-/L/-)","description":"Drive to Ninh Binh. Upon arrival, you will take delight in a scenic bicycle ride around paddy fields, pagodas, small villages and markets. A visit to Vuon Thi Village will offer you a chance to interact with local people by partaking in their daily activities. Discover the lifestyle, hospitality and friendliness of the Northern people when you prepare your lunch with a local family. Later, work alongside the farmers in the field and learn how water rice is cultivated. Surely be mesmerized by the soaring limestone cliffs while cruising on the Van Long Reservoir. Finally, continue to Ninh Binh for the night.\nON in Ninh Binh."},{"title":"DAY 2 – NINH BINH – BUT CAVE COMPLEX – WATER PUPPET PERFORMANCE – HALONG BAY (B/-/-)","description":"Take a morning drive to the boat landing for an unforgettable sampan ride through the But cave complex (2.5-hr cruise). Explore dry caves as well as the water caves. End the trip at Thung Nham dock. You will soak up the picturesque scenes of rice fields and the pastoral atmosphere through a visit to a small village known as the birthplace of water puppetry in the Red River Delta. Delight in watching a unique outdoor water puppet performance. The local artisans will then offer you a wooden puppet as a souvenir. Proceed to Halong Bay.\nON in Halong Bay."},{"title":"DAY 3 – HA LONG BAY CRUISE TOURS (B/L/D)","description":"Breakfast at your hotel, you will be free till your guide pick you up from Hotel to Halong Habour. \n13:30    Great lunch is served while cruising passing by islets.\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises\nOn Cruise."},{"title":"DAY 4: HA LONG BAY – BOAT CRUISE – HANOI (B/-/-)","description":"06:15     Tai Chi class on the Sun-Deck\n07:15    Have light breakfast with Coffee, tea, and bakeries on board\n07:45    Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00  Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00    Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45    Brunch is served.\nAfter brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n 11:45   Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina., then back to Hanoi."}]},{"name":"Vietnam - 13 Days","duration":13,"travelStyle":["Discovery","Adventure","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":750,"summary":"Viet Nam 13 days 12 nights from South to Noorrth  to explore the best Vietnam, from Southern to Northern. This combination will offer you vision of this beautiful country. On our program, we will bring you to the most highlighted destinations as Mekong Delta, Saigon, Cu Chi, Danang, Hoian, Hue and Ha Long Bay, Sapa\nLet’s stretch your mind and your legs on Vietnam itinerary 13 days 12 nights. Whether you like to make a discovery into the cultures, traditions or histories, Ethenic peoples. Asia Focus Travel arrange for you  enjoy by our unique way.\n","highlights":[],"imageCover":"https://www.tourradar.com/t/113293","images":["https://www.tourradar.com/t/113293"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang","Hoi An","Hue","Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Sai Gon (No Meal)","description":"Arrival Ho Chi Minh city\n\nWelcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. Overnight in Saigon.\nIncluded: Private car pick up at the airport transfer hotel, No meal"},{"title":"Day 2: Sai Gon - My Tho - Ben Tre (Breakfast/Lunch)","description":"Breakfast at your hotel.\nEnjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories. Overnight in Sai Gon \nIncluded: Shuttle bus, Local English speaking guide, Entrance fee, boat and Vietnam lunch "},{"title":"Day 3: Sai Gon City Tour - Cu Chi Tunnel (Breakfast/Lunch)","description":"Breakfast at your hotel.\nIn the morning, our guide will pick you up at your hotel and you are going to enjoy a city tour. Firstly, you get to the Reunification Hall, formerly known as the Presidential Palace. Then you take a visit to the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda, Chinatown and Binh Tay Market – the central market for the city and\none of the liveliest areas. \nAfter lunch, you get to visit the Cu Chi Tunnels – an immense network of connecting underground tunnels dating back the 1960s during the war against the American army;\n You get back the hotel for relaxation and you have a free evening at your leisure;\n You stay overnight in Ho Chi Minh City\nIncluded: Breakfast, Shuttle bus,Local English speaking guide, entrance fee, local restaurant\n\n"},{"title":"Day 4: Sai Gon - Da Nang - Hoi An (Breakfast)","description":"Breakfast at your hotel. You take a flight to Da Nang.\nWelcome to Danang City one of the major port cities in Vietnam. Upon arrival, transfer to Hoian ancient town and free for your own discovery. Stay overnight in Hoian. \nIncluded: Private car pick up and drop off at the airport.\n"},{"title":"Day 5: Hoi An - My Son Holy Land (Breakfast/Lunch)","description":"Breakfast at your hotel. \nPick up from 7:45 to 8:00 Am at your hotel. \nTake a car trip to My Son holly land, a cluster of abandoned and partially ruined Hindu Temples constructed between the 4th and the 14th century AD by the kings of Champa Kingdom .The temples are dedicated to the worship of the god Shiva, known under various local names, the most important of which is \"Bhadresvara\".  From the 4th to the 14th century AD, the valley at My Son was a site of religious ceremony for kings of the ruling dynasties of Champa, as well as a burial place for Cham royalty and national heroes.   Come back & stay overnight in Hoi an. \nIncluded: Shuttle bus, English speaking guide "},{"title":"Day 6: Hoi An - Hue City (Breakfast, Lunch)","description":"Breakfast at your hotel\n08:00 – 08:30: Departure to Hue Stop to visit and take pictures at: Lang Co Beach, Hai Van Pass “the clouds pass” to have a panoramic view on the Vietnam East Sea.\n10:30 – 11:00: Arrive in Hue. Have lunch. Then, we visit Tu Duc tomb, Thien Mu Pagoda, Citadel.\n15:30-16:00: Come back Hue city center.\n17:00 Check in hotel in Hue \nOvernight in Hue City "},{"title":"Day 7: Hue Free and Easy - Ha Noi (Breakast)","description":"Breakfast at your hotel.\nFree and Easy until The driver pick you up at your hotel transfer to the airport, take flight to Hue Noi \n•  Arrive in Hanoi. Our driver will pick you up from airport and transfer to hotel in Hanoi.\n•  Stay overnight in Hanoi.\n"},{"title":"Day 8: Hanoi – Sapa – Cat Cat – Sapa (Breakfast, Lunch, Dinner)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\nOvernight at the hotel \n"},{"title":"Day 9: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (Breakfast, Lunch)","description":"8:00 – Have breakfast at the hotel.\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\n"},{"title":"Day 10: Ha Noi City Tour (Breakfast, Lunch)","description":"Hanoi, located on the banks of the Red River, is one of the most ancient capital in the world, where travelers can find well-preserved colonial buildings, ancient pagodas, temples and unique museums within the city centre\nMorning : Have breakfast at hotel & ready for the trip at lobby.\nwe will pick you up from 7:45 – 8:45, depending where you stay.\n09:00 : Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:50 : Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique padoga in the world\n10:15 : Visit the Lacquer Paintings workshop – the biggest center in Ha Noi\n10:45 : Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45 : Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00 : Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45 : Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15 : Tour finishes. Back to hotel"},{"title":"Day 11: Ha Noi - Ha Long Bay (Breakfast, Lunch, Dinner)","description":"7.45-8.15: Pick-up at the hotel. (Note: this time applied for those who book our shuttle bus service)\n10.00: Having short break at stopover in Hai Duong Province.\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner Island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n15.00-16.30 PM\n• Do kayaking through the magnificent landscape with Limestone Mountains in Luon Cave, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\n• Back to Lavender Cruises and join sunset party\n• Pass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n• Join our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19.30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\n• Join squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke….\n• Or Laze yourself with our happy-hour drinks at the bar.\n• Overnight on Cruises\n\n"},{"title":"Day 12: Halong Bay - Ha Noi (Breakfast, Lunch)","description":"06.15: Morning exercises on the Sun-deck.\n07.15: Have breakfast with Coffee, tea and Bakeries on board.\n08.00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09.30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10.15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12.00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16.30 – 17.00 : Arrive in Hanoi. End of the trip!"},{"title":"Day 13 : Ha Noi Departure (Breakfast)","description":"Breakfast at hotel, free to shopping and The driver will pick you up at your hotel and drive to the airport for your flight back home. "}]}]