[{"name":"Vietnam Legend Family Holiday - 18 Days Trip","duration":18,"travelStyle":["Family","Adventure","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1874,"summary":"Legend Travel Group offers family holidays to explore the remarkable natural, cultural and historical wonders in Vietnam. You and your children will have great time together with relaxation moments combined exciting activities; from beach escapes to scenic and historic journeys. Your children will earn the deepest childhood impressions for years. It will be unforgettable trip for your family’s members.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02088309f21.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02088309f21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_e160da04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_b91b41f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_991fc659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_1ea6fc7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_887904ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_d81be543.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_c442edd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_e906f68c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_d7c0ac66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_a5cd0fce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_066cee9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_6b39674d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02080a801c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02080a8d023.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02080a95931.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02080a9b7da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02080aa8c62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e0208286e138.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e0208287e9bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02082884ec5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e0208288cb56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02084b4d102.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95503_5e02084b567ae.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An","Ho Chi Minh City","Mui Ne","Mekong Delta","Cai Rang","Can Tho"],"timeline":[{"title":"Hanoi Arrival","description":"You land in Hanoi, and this is where your family’s adventure begins! You will be welcomed and taken from the airport by our representative to your selected hotel in Hanoi. Free at leisure. Stay overnight in Hanoi.\nIf your arrival time is not too late, you could try options of Water puppet show and 1-hour tour on cyclo to visit Hanoi old quarter with your kids. \nDistance: Noi Bai airport - Hanoi city centre: 30 km or 45 minutes transfer.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Moon Garden (B/L)","description":"A day trip to Moon Garden, Son Tay will bring your family close to nature and local life.\nHere, your children will have chance to make friend with children here. Join some exciting activities like cooking, biking, farming, which help boys and girls gain more fun and knowledge.\nDrive back to Hanoi in late afternoon. Overnight in Hanoi\nDistance: Hanoi city center - Moon Garden: 30 km or 45 minutes driving.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay Cruise stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast on board, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Vietnam. Stay overnight on Boat.\nDistance: Hanoi central - Halong Bay: 180 km or 3.5 hours driving .\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi - Danang on overnight train (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight train to Danang.\nRemark: The Halong itinerary is subject to change upon cruise’s management.\nYou will have a small room at mini hotel for shower before train embarking.\nAs usual, the kids were very excited to sleep on the train. Anyway the restaurant is not available on train, just the “mobile” bar with limited menu. So, be sure to take plenty of snacks and fruit for train ride. We will prepare for your family a soft breakfast for next day morning with bread, butter and milk as well.\nDistance: Hanoi central - Train Station: 3 km or 10 minutes driving. \nThe cabin on train will be 4-berth sharing cabin with A/C. Private Bed."},{"title":"Da Nang Arrival - Hoi An ancient town","description":"Arrive in Danang Station at noon time, your family will be picked up and transferred to your selected hotel in Hoi An. (No meals served today)\nThis is a fantastic place that you could easily spend a week in. Great food, great cafes and dessert shops, many travelers get clothes and shoes made here. Even the kids got in on the act as they had some shoes custom made for them. They had their feet measured, then got to pick the style, pattern and color of the shoes. It was a lot of fun for them. Stay overnight in Hoi An Ancient Town.\nDistance: Da Nang station - Hoi An town: 35 km or 45 minutes driving\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An Ancient town free on leisure (B)","description":"You have the whole day to discover Hoi An on your own. This lively town was once a major port city and has a beautifully preserved Old Town Centre, a Heritage Site boasting traditional houses, temples and plenty of museums. The best thing to do in Hoi An is to walk around this part of town in the evening when the lanterns light up and you can enjoy the shops, restaurants and the magical atmosphere of this ancient place. The market is fun to wander through and doing a boat ride on the river is easy to arrange and worth it.\nStay overnight in Hoi An Ancient Town.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An Free on leisure (B)","description":"Another day at your own disposal with a spectacular option! If you so wish, we can arrange for your family the trip to Tra Que Herb Village Mountain and then take a cooking class. You’ll ride through the countryside Tra Que, where you learn about agriculture and the traditional Vietnamese Koker. In the class, you’ll learn how to cook specialties such as Tam Huu-rolls; Bahn Xeo pancakes and more! In the afternoon you will return by bicycle to Hoi An. The kids are always curious on making the food and eat it. Let’s try with them. It would be forever memories of their life.\nPhu Thinh Resort Hoi An or similar"},{"title":"Da Nang - Ho Chi Minh City by 1 hour of flight - Mui Ne Beach (B)","description":"Leave Hoi An for domestic flight to Ho Chi Minh City (called Saigon as well).\nUpon arrival in Tan Son Nhat Airport, you will be greeted and transferred to Phan Thiet directly, where is available one of the most beautiful white sandy beach Mui Ne.\nArrive in Mui Ne in the late afternoon; it is a bit tired day for you and your kids. That’s why the nice resort on the beach with lovely pool are must for your family. Check-in the room and free to enjoy the night of beach.\nDistance: Tan Son Nhat Airport - Mui Ne Beach: 220km or 5.5 hours driving.\nTien Dat Resorts Mui Ne or similar"},{"title":"Mui Ne Free on the Beach (B)","description":"You will have one more day to enjoy the bikini on beach, game with kids and local seafood.\nTien Dat Resorts Mui Ne or similar"},{"title":"Mui Ne Free on the Beach (B)","description":"Today you will be free for your own activities. The town boasts two interesting sites nearby: The sand dunes which are pretty much what they sound like, a seemingly endless expanse of desert-like sand. And the Fairy Spring, basically a shallow creek that runs through the sand dunes. It’s a lot of fun - especially for kids - to walk up it for a few miles, the whole time splashing, jumping, rolling and frolicking in the cool water and its deliciously goopy sand.\nTien Dat Resorts Mui Ne or similar"},{"title":"Mui Ne - Saigon by Road (B)","description":"It is time to say goodbye to the sea and wind to join the car return to Saigon. In order to keep your kids not disappointed of leaving beach, we are ensure to provide you the lovely hotel with pool, which is very attractive with kids.\nStay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City - Cai Be - Can Tho City (B, L)","description":"A cruise through the Mekong Delta is a must for any Vietnam tour and for your family as well. Starting from Ho Chi Minh City for for the 2.5-hour drive to the delta town of Cai Be.\nThe brilliant colors and bustling markets of the Mekong Delta will delight kids as well as adults.\nArrive in Cai Be at noon, then board the Mekong Cruise. A welcome drink will be given on arrival followed by an introduction to the ship and crew. Depart towards Cho Lach on the Tien Giang River and enjoy lunch on the upper deck while en route. Rest on the deck while the ship branches into the Cho Lach Canal for 30 minutes through the traffic of sand and rice barges, past fruit drying facilities and around wooden ship building yards.\nVisit a village on the banks of river Mang Thít, where you can appreciate the way of life here in the Delta. Visit the orchard or rice fields nearby. Back on board the Mekong Cruise a complimentary drink will be served, so why not sit back and enjoy the sunset overlooking the Mekong’s magical waterways.\nOvernight in Can Tho City.\nDistance: Saigon - Cai Be: 100km or 2.5 hours driving.\nIris Can Tho Hotel or similar"},{"title":"Cai Rang - Can Tho (B, L)","description":"A delicious breakfast will be served from 0630 whilst the boat cruises the Tra On floating market, the boat will then depart towards Can Tho. Upon arrival check out of your cabin and transfer onto a local boat to visit the Cai Rang floating Market, the nearby arroyos and gardens.\nCruise through the floating market which bustles with wholesalers on big boats. Here, during the early morning market hours, larger sized boats anchor and create lanes that smaller boats weave in and out of. The main items sold here are fruit and vegetables and every boat has a long upright pole at its bow from which samples of the goods for sale are hung. The waterway becomes a maze of hundreds of boats packed with mango, bananas, papaya, pineapple, and even floating pho vendors.\nReturn to land and have lunch in Can Tho.\nThis afternoon, spend time cycling around the quiet lanes and dirt paths of Can Tho. Biking is the perfect way to discover the countryside with your family. The roads are flat and the sites are amazing: cottage industries, small farms harvesting or planting rice, hidden temples and lots of friendly locals who will come out to greet you.\nThen, transfer to a small hotel in Can Tho. This cozy modern hotel is a comfortable place to stay after a long day. Overnight in Can Tho.\nIris Can Tho Hotel or similar"},{"title":"Can Tho - Ho Chi Minh City (B, L)","description":"After your breakfast, it’s time to resume the drive back to Ho Chi Minh City. The journey takes around 4-hours. And you’ll stop en route for lunch. Stay overnight in Saigon hotel.\nDistances: Saigon - Can Tho: 180km or 4 hours driving.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Saigon - Cu Chi Tunnel and half day city (B)","description":"Depart Ho Chi Minh City at 0800 in the morning for the drive to Cu Chi district. Leaving the city behind, the scenery changes to views of rice paddies, villagers drying noodles by the side of the road and other scenes typical to southern Vietnam. Arrive and start the visit of the famous Cu Chi Tunnels which consist of an incredible underground tunnel network constructed by Vietnamese resistance fighters (Viet Cong) during both the French and American wars. Start the visit with the Ben Dinh or Ben Duoc sections of the tunnel. Here you can imagine what it was like to be a guerrilla complete with Russian Carbine rifles and AK 47’s on display.\nReturn to Ho Chi Minh City for lunch.\nThis afternoon, our tour includes the Reunification Hall, formerly known as the Presidential Palace it was towards this modern building that North Vietnamese tanks seized on the morning of April 30 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. Continue to the Old Post Office, the Notre Dame Cathedral. The last stop is Ben Thanh - the central market for the city and one of its liveliest and most colorful areas. Stay overnight in Saigon hotel.\nDistance: Saigon - Cu Chi Tunnels: 75km or 1.5 hours driving.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City - Departure (B)","description":"Today is your last day in Vietnam. After breakfast, check your luggage to make sure you will not forget anything before leaving for home. Our guide and driver will escort you to the end of the trip at airport. End of services. Good bye and hope to see you very soon in Vietnam and Indochina."}]},{"name":"Explore the Cultural Heritage of Vietnam 3 days 2 nights","duration":3,"travelStyle":["Historical","Group","Partially Guided","Holiday"],"oldPrice":0,"price":293,"summary":"This tour is ideal for those who have just three days but want to discover as much of the cultural heritage of Vietnam as they can. It begins in the Hue, the old Imperial City, which served as Vietnam's capital under the emperors of the Nguyen Dynasty from 1802 to 1945. It then follows the scenic highway N1 from Hue to Hoi An via Da Nang, one of Vietnam's major international seaports. This trip finishes in the picturesque town of Hoi An, once one of Southeast Asia's major trading ports between the 17th and 19th centuries.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d588.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d588.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d58d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d58f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d591.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d592.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d594.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d595.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194187_5e4b86c25d597.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Arrive Hue (L/D)","description":"\nYou will either be collected from Hue airport or Hue station and taken to a hotel downtown. You will now have free time to explore your new surroundings until lunchtime. In the afternoon, you will embark on a private tour of Hue City including the Hue Citadel and the Forbidden Purple City, the Imperial Museum and the bustling Dong Ba market. In the evening, you will taste the finest in Hue cuisine at a local restaurant. You will spend the first night in Hue."},{"title":"Hue - Da Nang - Hoi An (B/L/D)","description":"\nAfter breakfast you will take a private boat, cruising along the romantic Perfume river heading out into the countryside. Thien Mu Pagoda will be the first stop of the day, and from here, you will have a great view of the Perfume river and surrounding area.\nNext up it’s back in the car to visit Minh Mang's tomb and King Tu Duc's tomb, followed by Lunch at a local restaurant. You will then begin the drive to Hoi An over Hai Van Pass. En route, you will stop in Da Nang for a visit to the Cham Museum and to explore the handicraft villages at the foot of Marble Mountain before arriving in the charming river town of Hoi An. You will have free time to explore the quiet streets, staying overnight in Hoi An."},{"title":"Hoi An - Da Nang Departure (B/L)","description":"\nIn the morning, you will enjoy a half day in Hoi An, taking in the beautifully preserved historical sites in the Old Town. Your tour will include a visit to the Chinese Assembly Halls, the Japanese Bridge, Phuc Kien Pagoda and Tan Ky House. Following the tour there will be free time to shop before your transfer to Da Nang airport for onward travel."}]},{"name":"Hanoi 3 Days 2 nights (Hanoi, Halong bay)","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":159,"summary":"Package tour 3 days 2 nights is the combination of historical value and daily value of locals’ lives. Within one package tour,Taking Hanoi package tour, you have the chance to visit Halong Bay, the most stunning bay in Vietnam and visit floating fishing villages. Not just an excursion, you can know more about Vietnamese culture, tradition, and values.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2eb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194083_5e47c3c21d2fa.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival - Street Food Tour Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.\n17:30 to 18:00 The tour guide will pick you up at your hotel to join with street food tour\nYou will have 3 hours to enjoy 5 traditional Vietnamese dishes and explore the small streets of Hanoi to explore the culture here\nVietnamese Beef Noodle Soup ( Phở Bò )\nGrilled Mince Pork ( Bún Chả )\nVietnamese Pan Cake ( Bánh Xèo )\nFruit Beam ( Hoa Qủa Dầm)\nEgg Coffee ( Cafe Trứng )\nOvernight in Hanoi \n"},{"title":"Day 2: Hanoi - Ha Long Bay (Breakfast, Lunch)","description":"8:00 - 08:30 Meet your tour guide ,start the trip to Ha Long Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board Dragon Cruise to start a wonderful time enjoying stunning landscapes of Ha Long.\nSavor lunch on board while passing beautiful islets of Stone Dog, Incense Burner, “Fighting cock”.\nVisit Thien Cung “Heavenly Palace” cave, the most beautiful cave in Ha Long Bay. \nStop at the harbor again to catch the bus to back Hanoi. \n20:00 Arrive back in Hanoi. \nOvernight in Hanoi \n"},{"title":"Hanoi City Tour - Departure (B,L)","description":"07:45 - 08:30 Meet your tour guide at your suggested places around Hanoi Old Quarter.\n- Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \n- Visit Ho Chi Minh complex, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n- Visit Temple of Literature constructed in 1070 dedicating to Confucius, sages and scholars. It was also the first university of Viet Nam once.\n\n12:30 Relax and have lunch at a local restaurant in Hanoi Old Quarter.\n- Explore daily life of traditional ceramics village of Bat Trang. Visit showrooms and see how they model the products. \n- Arrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians\nThe driver will pick you up at the hotel transfer to the airport to take flight for destination. End of Services\n"}]},{"name":"Hanoi Package Luxury Tour 4 Days 3 Nights","duration":4,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":480,"summary":"Visit Hanoi 4 days 3 nights is the best 4-day package tour which is highlighted with one night on Halong cruise. Whichever way you choose to experience Vietnam on this family holiday, a warm welcome from the local people is practically guaranteed as well as a cultural adventure that can be as active, relaxing or as downright exciting as you want it to be.\n•\tStaying at hotel in downtown. You can explore Hanoi easily\n•\tSpending 2 days on Halong Bay to explore many beautiful attractions such as Luon Cave, Titop Island, Sung Sot Cave (Surprising Cave).\n•\tJoining interesting activities on Halong bay such as kayaking, cooking class and more\n•\tHave your own leisure time to explore Hanoi – Vietnam Capital.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129850_38ad45ac.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129850_38ad45ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_27446779.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_77187745.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_dbe99908.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_ec3b6643.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_a299b6fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_6e82ad72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_cf491f13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_3fe44a30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129850_bc7b35e0.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi (Dinner)","description":"Upon arrival Noi Bai international airport, meet up our tour guide and tranfer to city centre for check in hotel ( Silk Path Hotel - good location and best quality) and then our guide take you visit Hoan Kiem Lake, Hanoi Opera House. Free shopping at Dong Xuan market, Hang Gai, Hang Dao, Hang Ngang with hundreds of specialty shops selling silk clothing, lacquerware, embroidered linens, furniture, bamboo, cooking utensil, take cyclo to see Hanoi with 36 streets and dinner with local food as Beef noodle or grilled pork and noodle"},{"title":"Day 2: Hanoi - Halong cruising - Bai Tu Long Bay ( Breakfast, Lunch and Dinner included)","description":"08:15 Transfer from Hanoi to Halong Bay (if the package is included transfer service).\n12:00 Arrive at Cruise'sLounge on Tuan Chau island\n12:45 Board the boat and start your journey. Enjoy welcome drinks during the itinerary and safety\nbriefing from Cruise Manager\n13:00 Let the vacation begin with a set lunch as the boat cruises towards the southeast of Halong\nBay, passing Fighting- Cock and Finger Islet.\n14:30\n15:15\nExplore Surprise cave, one of the biggest caves in Ha Long Bay with beautiful stalactites\nSwim or hike on Titov Island.\n16:00 Optional onboard activities traditional spa extra charge), sunbathing on board.\n17:30 Traditional Vietnamese cooking and fruit carving demonstration on sundeck (or in the\nrestaurant in case of inclement weather) while boat cruises to overnight anchorage area.\n19:30 Set menu dinner is served in the restaurant.\n21:00 Relax in your cabin or join our staff at the reception for squid fishing.\nOvernight on Cruises"},{"title":"Day 3: Halong Bay - Hanoi (Breakfast, Lunch included)","description":"06:15 Start your day with a Tai Chi lesson on the sundeck.\n07:00 Light breakfast is served. The vesel weighs anchor to cruise through more of Ha Long Bay.\n07:45 Visit Luon Cave area by bamboo boat\n09:00 Brunch is served in the restaurant while the boat heads back to the harbour.\n10:45 Disembark at Tuan Chau\n11:00 Get on the shuttle bus to Hanoi\n15:00 Arrive in Hanoi \nFree time for shopping \nOvernight in Hanoi ."},{"title":"Day 4: Ha Noi Departure (Breakfast)","description":"You have the morning free to relax before transferring to Airport by Private Car for your return flight home. Finish your unforgettable Hanoi & Halong Bay Trip with Asia Focus Travel. Good bye & see you again. "}]},{"name":"Halong Bay - Lan Ha Bay 3Days 2Nights Trip with 4Star Cruise - Kayaking and Cooking Class","duration":3,"travelStyle":["Boat","Group","Partially Guided","Holiday"],"oldPrice":0,"price":236,"summary":"Experience a relaxing 3-day adventure through Vietnam's most beautiful island locations. Explore the waters of Lan Ha Bay on a luxury ship. Take in awe-inspiring scenery and join in with a plethora of fun activities. Feast on delicious Vietnamese cuisine and unwind completely.\n\nHighlights:\n- Delight in astonishing natural wonders and UNESCO World Heritage Sites\n- Enjoy kayaking or taking small sampan boat around Lan Ha Bay and Ha Long Bay\n- Enjoy swimming in the crystal clear waters\n- Explore the cave known for a secret bomb-proof hospital\n- Relax on board your luxury cruise boat with island views\n- Take part in an on-board cooking class and learn traditional Vietnamese dishes","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/182766_f496d74b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/182766_f496d74b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_d4419c95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_aa2c323a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_4103e30e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_7cde0d92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_6bac7dbf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_b23f7ac6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_6be33462.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_85fd8dba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_7388184a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_5a8d085b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_d6a8210b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_07dacdae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_5d334ed7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_297e0583.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_6642f761.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_f6d034c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_e0c584df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_a6680815.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_c06658c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_6bc465e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_fce7b60a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_d800f93e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182766_945fd597.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi – Ha Long Bay - Lan Ha Bay (Lunch/ Dinner)","description":"09:15: Hotel or private address pick up with our shuttle bus. Short break half way\n12:00: Arrive Got Ferry Terminal, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin and set sail through Ha Long Bay while having time to admire the magical landscape go by. The Cruise Pass Da Chong Islet, where you can see a lighthouse built by the French over 100 years ago.\n13:00: A special lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through Islets of Con Vit\n15:30: The Cruise sails through Lan Ha Bay. The area is surrounding of extraordinary limestone karsts landscapes. You can start your journey to visit Dark & Bright Cave and islets by kayaking which is a wild and mysterious beauty in the middle of the World Heritage, enjoy swimming in the crystal clear waters of the Bay.\n17:30: Back to Cruise, drop anchor for staying overnight. Enjoy the complimentary sunset party on the sundeck with local wine and fresh fruits.\n18:30: Join Cooking class and enjoy happy hour with special drink menu.\n19:00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n21:30: Retire to your cabin or join the fishing excursion, watch a movie, have a drink at the bar, internet access or play exciting games. Overnight on board."},{"title":"Day 2: Ha Long Bay - Lan Ha Bay (Breakfast/Lunch/Dinner)","description":"06:00: Enjoy sunrise and admire the never ending miraculous scenery of the Bay. Practice an invigorating Tai Chi session on the sundeck.\n07:00: Light breakfast, coffee and tea served.\n08:00: Transfer to day boat for visit Viet Hai village. You will take the bicycle trip along the village path and go through rain forests and dark tunnel. Enjoy stunning scenery of rice fields on the way. Stop at the village to relax. Visit an ancient local house, made from straw, mud, bamboo…you will have chance to see the local life on a valley of local people.\n11:30: Back to day boat for visiting La Ha Bay. Lunch served on day boat.\n13:30: Visit Lan Ha Bay, free kayaking to discover bay by yourself and swimming in the blue water.\n- From October to May: Visit the Ba Ham Lake area situated in the middle of a narrow, rectangular area, with the all four sides enclosed by vertical cliffs (if the weather permit).\n- From June to September: Visit the Van Boi area, which is the heart of Lan Ha bay, there are a lot of white sandy and coral beaches.\n17:30: Return to Cruise, time for relax. Enjoy the complimentary sunset party on the sundeck with local wine and fresh fruits.\n18:30: Join cooking class demonstration (teaching you how to make our speciality, Spring rolls) on the cruise.\n19:00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n21:30: Retire to your cabin or join the fishing excursion, watch a movie, have a drink at the bar, internet access or play exciting games. Overnight on board."},{"title":"Day 3: Lan Ha Bay – Medical Military Cave - Hanoi (Light Breakfast/Brunch)","description":"06:00: Enjoy sunrise and admire the never ending miraculous scenery of the Bay. Practice an invigorating Tai Chi session on the sundeck.\n\n07:00: Light breakfast, coffee and tea served\n\n08:30: Arrive Gia Luan pier on Cat Ba island, our bus will take you to Medical Military (Quân Y) Cave located right at the main road of Cat Ba National Park, Medical Military Cave is a good place to visit and you will be surprised by the magnificent scale of a field hospital in the mountains.\n\n10:00: Back to our boat, relax before checking out\n\n10:40: Lunch is served on board\n\n12:00: Disembark at the Got Ferry Terminal by tender. Take our shuttle bus to return to Hanoi\n\n15:00: Arrival back at your hotel or home"}]},{"name":"Discover Can Cau and Bac Ha market 4 days 3 nights","duration":4,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":463,"summary":"This four-day tour takes you to two of the liveliest local markets in the Sapa area. Visiting the markets, your senses will be overwhelmed by sights, sounds and smells coming from the maze of stalls. You will meet people from many of the different ethnic groups in the area and learn about their cultures and traditional crafts. This amazing cultural discovery will all be set against the stunning back of Sapa's rice terraced mountains and sweeping valleys.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41292854387.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41292854387.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e4129285438b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e4129285438d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e4129285438f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41292854390.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41288305aa3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41288305aa4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41292854396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41292854398.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193389_5e41294e739d7.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Hanoi - Lao Cai - Bac Ha (L/D)","description":"\nOne of our English-speaking guides will collect you at your hotel in Hanoi around 7:30AM, and begin your drive towards Lao Cai, where we’ll be stopping for lunch.\n\nAfter lunch we head to the H’mong King’s house (King Hoang A Tuong), which was built by the French and Chinese in 1920, leading to a unique fusion of European and Oriental architecture, making for an incredibly grand structure.\n\nFrom here we begin our trekking by heading to a Flower H’mong community in Ban Pho Village. Their culture is named for the colourful and extravagantly decorated traditional outfits that they wear, often made by hand. It’s a truly fascinating culture that you’ll get to learn much about during your time here. Afterwards we continue our trek until we reach Na Hoi Village, where you’ll have dinner and stay the night with a local family. In total the trek is about 3 to 5 kilometres long."},{"title":"Can Cau Market - Trek Bac Ha (B/L/D)","description":"\nAfter breakfast in our homestay we’ll drive to Can Cau Market via Bac Ha Town. Although the market is smaller than some others in the regions, it is special in the sense that it has retained its local and authentic appeal.\n\nFew tourists actually come here, which is probably the reason for how it’s achieved this, and as such it makes for a great place to get a real feel for the local cultures of the region. Once you’ve had your fill exploring and perusing the many fascinating stalls, it’s time to trek from Ta Giang Pho to lay Thuy Ngai, which presents you with incredible views along the route as you’re surrounded by wild and beautiful natural landscapes and terraced rice fields. Along the way you’re sure to run into some people belonging to the Red Dao or Black H’mong ethnic groups. The trek is about 12 to 15 kilometres, and when you reach the end our driver will pick you up and take you back to Na Hoi Village for another night in the homestay."},{"title":"Bac Ha market - Sapa (B/L/D)","description":"\nAfter breakfast at the homestay, you’ll start the day by walking to Bac Ha Market. Here you’ll spend some time among the local people perusing the many enticing stalls. This is easily one of the most colourful markets in Northern Vietnam, and can look more like a festival or celebration than a simple market.\n\nIn fact, the whole area is positively alive with activity, which is only added to by the various animals like pigs, cats, buffaloes and horses scuffling around, all for sale of course.\n\nOnce you’re finished at the market, you’ll get an opportunity to relax your undoubtedly sore legs and feet on a cruise along the Chay River. As you float down it’s calm waters, you’ll get to simply sit back and take in the incredible views, and when you disembark, our driver will waiting to take you to Sapa for lunch.\n\nAfter lunch in Sapa we will head out on another trek through Muong Hoa Valley, which showcases what Sapa is most famous for, namely the amazing views of rice paddies rippling across the mountains. The trek is roughly 3 to 50 kilometres long, and afterwards we’ll head to our homestay in Tavan for dinner and an overnight stay."},{"title":"Sapa - Hanoi (B/L/D)","description":"\nAfter your breakfast on the fourth day, it’s time for your final trek, which will be roughly 3 to 5 kilometres long. We’ll make our way through the verdant valley in order to visit two villages, one inhabited by Black H’mong and the other by Dzay. In the Dzay Village we’ll enjoy lunch with a local Dzay family before being picked up and driven to Hanoi via Lao Cai. You’ll arrive at your hotel in Hanoi at around 6:30pm."}]},{"name":"All-Inclusive: Halong Bay 3 Days - 3 STAR CRUISES: Transfer, Meals, Kayak, Cave, Island","duration":3,"travelStyle":["Boat","Group","Partially Guided","Holiday"],"oldPrice":278,"price":250,"summary":"Halong Bay, “the bay where the dragon descends into the sea’“, is a spectacular seascape in the Gulf of Tonkin. More than 2,000 islands, islets and limestone formations rise from the emerald waters, remarkably shaped by wind and waves.\n\nThe best way to discover the natural beauty of the bay is onboard our newly built Ha Long cruise, designed to give you the best service you could possibly wish for.\n\nThe cruise combines charm and great comfort to meet the growing demand of travellers looking for luxurious cruises in the bay. The cruise was launched in 2013, brand new Ha Long wooden junk crewed by a professional loyalty and dedicated team, the newest luxury in Ha Long.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d8b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d96.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4d9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4da9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4daa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4dab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/195831_5e60b815e4dad.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi – Halong Bay – Halong Cruise (L/D)","description":"07:30 – 08:30 Our tour guide and bus pick you up at your hotel in Hanoi old quarter.\n08:30 Departure to Halong Bay for 3.5 Hours.\n10:00 Arrive in Hai Duong province, and have 20 minute short break.\n12:00 Arrive Tuan Chau harbor, Halong Bay.\n12:15 Welcome to Cruise and enjoy Welcome drink, Enjoy welcome drink get a brief introduction about cruise and safety guidelines. Check-in your cabin.\n12:30 Have Vietnamese seafood and vegetarian lunch, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\n14:30 arrival in Pearl Farm, kayaking through the village\n15:30 Continued exploration the bay.\n16:00 Visiting Titop Island\n17.30 Back Halong cruise and relax.\n18:00 Join cooking class guided directly by Chef of Cruise. You have chance to practice Vietnamese traditional dishes such as spring roll or famous cuisine of Vietnam.\n19:30 Time for dinner enjoying special BBQ seafood on the cruise.\n21:00 :Evening entertainments: play game on the cruise: cards game, chess, karaoke, squid fishing, and overnight on Cruise."},{"title":"Explore Halong bay (B/L/D)","description":"06:30 Early morning sun risers can enjoy Tai Chi lesson on sundeck.\n07:00 Morning view of bay’s landscape with a cup of tea or coffee. Have breakfast.\n08:30 Transfer by tender to smaller boat to visit Ho Dong Tien cave and explorer by kayak\n11:30 Back the daily cruise and have lunch.\n13:00 Enjoy kayaking to explore Trong Cave.\n14:30 Visit, swimming a pristine natural cave lapped by the turquoise water.\n15:30 Daily cruise take you back the Cruise for overnight.\n16:30 Arrive   Cruise to refresh and relax and make new friends from new group.\n19:30 Enjoy dinner on cruise.\n21:00 Evening entertainments: play game on the cruise: cards game, chess, karaoke, squid fishing, and overnight on the Cruise."},{"title":"Halong Bay – Hanoi (B/L)","description":"06:30 Early morning sun risers can enjoy Tai Chi lesson on sundeck. 07.00: Morning view of bay’s landscape with a cup of tea or coffee. Have breakfast.\n08:30 Arrive Sung Sot Cave (Amazing Cave) and joining with guide to visiting and explore the cave.\n10:00 Check-out and enjoy a fantastic cruise on the bay.\n11:00 Enjoy the lunch on cruise.\n12:00   Halong Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise. 12:30 Return to Hanoi by shuttle bus.\n14:30 Stopover in Hai Duong province to visit a ceramics workshop.\n16:00 Arrive in Hanoi end your trip."}]},{"name":"Super Save Package Hanoi 4 Days 3 Nights","duration":4,"travelStyle":["Coach / Bus","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":350,"summary":"\tAsia Focus Travel provide package tour 4 days 3 nights for clients has limited the time to visit Hanoi and this package you can visit Ho Chi Minh House and Ho Chi Minh's Mausoleum\n\tVisit to Buddhist Tran Quoc Pagoda on West Lake\n\tHa Long Bay and Ninh Binh \n\tDeparture everyday","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143320_fab0798c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143320_fab0798c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_3986eb44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_94a71395.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_d15cc72d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_fcbf29a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_2dcb96dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_2a425629.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_43354e68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_bcb84f64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_69f0e090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_c79da37b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_274114c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_9bd239ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_1f034d2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143320_1bcf1c84.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ha Long Bay ( Included: Breakfast, Lunch)","description":"8:00- 08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields\nto Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board our Halong Cruise and start cruising among limestone islands and photograph of\nstunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life.\nCruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n15:00 Visit Thien Cung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n16:15 Stop at the harbor again to catch the bus to Hanoi.\n20:00 Arrive back in Hanoi.\nOvernight in Ha Noi\n"},{"title":"Day 3: Hanoi - Ninh Ninh - Hoa Lu - Tam Coc (Included: Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\nDepart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \nLearn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. Overnight in Hanoi "},{"title":"Day 4: Hanoi City Tour - Departure (Included: Breakfast, Lunch)","description":"Our guide will pick you up between 07h45 and 08h30.\n(Please see PICK-UP TIMETABLE)\n08h30: Arrive Tran Quoc Pagoda – the oldest pagoda in Ha Noi built in the 6 th century.\n09h00 – 9h15: Visit Ho Chi Minh complex, you have a chance to see the embalmed body\nof Ho Chi Minh then walk around the garden to see 2 houses where he lived &amp; worked\nfrom 1954 to 1969. Then visit One Pillar Pagoda where worships the Godess of Mercy –\nIt is the most unique padoga in the world\n11h00: Continue visit Temple of Literature – the first university of Vietnam,\nestablished in the 11 century.\n12h30- 13:00: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese\ncuisine with 8 delicious dishes.\n14h:  Bat Trang ceramíc village to explore the daily life of the local &amp; learn about the\nprocess how to make a perfect product.\n15h45: Leave for Hoan Kiem Lake to visit Ngoc Son Temple, which honors General\nTran Hung Dao who defeated the invader in 13 th certury.\n16h15: come back to your hotel\nDepend your flight to arrange the driver to pick you up at your hotel transfer to the airport take flight to home or another destination. Tour finished."}]},{"name":"Highlight Hanoi Ha Long Bay 3 Days 2 Nights","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":150,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Travelling to beloved Hanoi, you will not only be captivated by its ancient beauty but also feel the peaceful life here associated with rich of the nation. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.\n\nHalong Bay is a perfect product of the Creator and a harmony of stone, water and sky. Visitors to Halong are certainly supprised by thousands of islands and islets in various shapes and looks, making an unique Bay. Each island in Halong Bay has its own shape, not just look like any islands of Vietnam's coastal area. Let's join our trip to explore a magnificent yet incredibly poetic Halong Bay.\n\nThe package tour Hanoi- Ha Long - Hanoi 3 days 2 nights is suitable for travelers who don't have much time and want to discover the beauty of Vietnam. Let's go !","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/185230_17481477.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/185230_17481477.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_e09900e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_e0a2ac90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_2ff03332.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_8fb95465.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_b998af21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_a5ac31e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_41ff40c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_61418442.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185230_def1889b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi arrival (no meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Ha Noi.\n"},{"title":"Day 2: Hanoi – Ha Long Bay 1 day (B/L/X)","description":"07:30 - 08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields to Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:30 Board our Dragon Cruise and start cruising among limestone islands and photograph of stunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life. Cruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n 15:00 Visit ThienCung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n 16:15 Stop at the harbor again to catch the bus to Hanoi.\n 19:00 Arrive back in Hanoi. Tour ends. Overnight at hotel in Hanoi.\n"},{"title":"Day 3: Hanoi city tour half day – Departure (B/L/X)","description":"Have breakfast at your hotel\n7:30 -8:00am Pick up at your hotel then start the trip by visiting Tran Quoc pagoda, a Buddhist relic and national heritage, lying on the WestLake. Visit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. Relax and have lunch at a local restaurant in Hanoi Old Quarter.\nThen the driver transfer to the airport for flight back home.\n"}]}]