[{"name":"Vietnam Luxury Honeymoon in Paradise - Halong Bay / Con Dao Island","duration":14,"travelStyle":["Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":6999,"summary":"The honeymoon phase always ends for everyone. But the memory between a romantic couple during this trip will last for a lifetime. Enjoy your first day leisure day in Hanoi, a modern and ancient, dynamic but laid-back city with a ton of choice for a newly-wedded couple such museums, Hoan Kiem lake, Old Quarter, etc. After getting through jet lag, spend a great time in Pu Luong retreat, getaway the pace of hustle-and-bustle, freshen up your mind and immerse in a breathtaking mountain pass. No more hassle in daily life, both of you will create the most wonderful memory in this fairyland. Then, pave the way for the next fascinating experience in Halong Bay cruise. Take a sip of champaign in the sundeck cruise in a majestic space there after a day joining interesting outdoor activities will be beyond your imagination. Move on to the next destination, Hoi An, considered as one of the most ideal paradises for couples. Wandering under the sky of lanterns and along with the block of the yellow street or taking a well-known eco-tour is favored not for nothing. Next, take an amusing day trip to Mekong Delta with a combination of boat trip and engagement in different daily local life activities. Later, your trip will end with the arrival to Con Dao island, great for savvy travelers to escape bustling life with miles of coastal roads, hiking trails and a wide range of outdoor activities.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136964_8f3c5b2d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136964_8f3c5b2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_a9b39b19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_add1c31e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_34fc6ad2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_4c3ae919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_5e93472f73fa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_5e93472f73fa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_5e93472f73fa3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136964_5e93472f73fa5.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Can Tho"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Welcome to Vietnam, upon arrival at Hanoi’s Noi Bai International Airport, you will be welcome by our representative holding a sign with your name and our company logo on it. Our representative will guide you through fast-track security and visa services. After obtaining your visa and collected your luggage, will lead the way to your awaiting guide and driver. You will be privately transferred to your luxury accommodations by our professional driver and an English-speaking guide. Stay right in the heart of the city next to the central Hoan Kiem lake, with the fascinating Old Quarter right at your fingertips, you can easily explore the city at your own pace.\n\n"},{"title":"HANOI LEISURE DAY (B)","description":"Today you have free time to explore the city at your own pace.\n\n"},{"title":"HANOI - PU LUONG (B/L/D)","description":"You enter Pu Luong Nature Reserve by road via a breathtaking mountain pass giving you a panoramic view of the whole valley. You arrive at your accommodation in time for a delicious lunch, followed by free time to explore the beautiful retreat, with its captivating panoramic views and tranquil setting.\n\nYou will be transferred to a suspension bridge over the Cham River, where you begin your walk in search of stunning water wheels. Get up close to each wheel and discover how water is moved from river to handmade bamboo aqueducts via simple constructions of all sizes. Arriving at a local fisherman’s house, you have a short rest to gear up for the bamboo river rafting with Dinh and his team. Float along the calm river and enjoy the views, in between learning how to paddle and steer your handcrafted rafts.\n\nArriving at scenic Tan Lap bridge, you disembark to be transferred back to Pu Luong Retreat for dinner.You enter Pu Luong Nature Reserve by road via a breathtaking mountain pass giving you a panoramic view of the whole valley. You arrive at your accommodation in time for a delicious lunch, followed by free time to explore the beautiful retreat, with its captivating panoramic views and tranquil setting.\n\nYou will be transferred to a suspension bridge over the Cham River, where you begin your walk in search of stunning water wheels. Get up close to each wheel and discover how water is moved from river to handmade bamboo aqueducts via simple constructions of all sizes. Arriving at a local fisherman’s house, you have a short rest to gear up for the bamboo river rafting with Dinh and his team. Float along the calm river and enjoy the views, in between learning how to paddle and steer your handcrafted rafts.\n\nArriving at scenic Tan Lap bridge, you disembark to be transferred back to Pu Luong Retreat for dinner."},{"title":"PU LUONG - HANOI (B/L)","description":"This is a common and easy walk around the most beautiful valley of rice terraces in front of the Retreat. We start to descend into the beautiful valley facing the Retreat where you walk around tumbling rice terraces. Then we will walk through small paths shrouded in vegetation to slowly reveal a picturesque Uoi village sitting at the base of a towering mountain. Your camera will not be able to sit still when you see the panorama view of the village from above.\nContinue walk down hill to Uoi village then on to Lan village. If time permits, we will visit a local family where we can learn about their traditional brocade weaving (not guaranteed). Walk through the rice paddies again to get back to the main road to the car pick-up point. You will be transferred back to Puluong retreat.\n\nPick up the car and return to Hanoi."},{"title":"HANOI - HALONG BAY (B/L/D)","description":"Have a hearty breakfast at the hotel. Today you will make your way out of the city to  the UNESCO World Heritage Site of Halong Bay. We leave the busy streets of Hanoi behind, bound for the serenity of Halong Bay where we'll board a traditional-style Vietnamese Junk boat. Get acquainted with the facilities on board as we set sail and cruise into the bay. Savour your first hours in Halong Bay on the sun deck and simply let your eyes wander over the breathtaking scenery. We arrive at Cua Van, one of the last remaining floating fishing village in Halong Bay which some families and fishermen still use as a base for their fishing and aquacultural activities. With a small bamboo boat rowed by locals, we have a look at the floating structures in this calm and secluded area to gain some insight into village life. If you prefer to be more active, rent a kayak (extra fee) and paddle around by yourself. This is the perfect way to freely move about and explore this part of the bay. The fishing village also hosts the Cua Van Cultural Center, operated by local residents to preserve and introduce visitors to the village’s history and culture. On display are many archaeological artifacts and photographs depicting life in Cua Van. By tender, we transfer to the nearby Tien Ong cave. The cave shows evidence of human civilization dating back to 10,000 – 8,000 BC. Fossil evidence also proves that the cave was part of the mainland continent ages ago before Halong Bay became the marine wonder it is today. Tien Ong cave reaches a depth of 50 metres and covers a total area of roughly 1,000 square metres. Follow our guide as we loop though and learn interesting details about this cavern. After returning to the boat, we sail to the overnight mooring area. During this time - the magical “blue hour” - Halong Bay reveals its true, magnificent beauty. Unwind on the sun deck with your favourite drink and be fully present in this moment. As we sail along, our chef demonstrates the preparation of popular Vietnamese dishes. You are welcome to join and practice along; remember these easy, but very tasty classic Vietnamese recipes and take them back home with you. After a bit of downtime, dinner is served. If you are still eager to learn more about Halong Bay, our on-board guide offers an enlightening presentation about the bay’s unique and intriguing insights after dinner. Alternatively, give yourself a try at squid fishing together with our staff - always an entertaining experience. While away the rest of the evening and treasure this special moment amidst the magical landscapes before falling into a restful slumber in the middle of Halong Bay where, once upon a time, sparkling jewels cascaded from heavenly dragons."},{"title":"HALONG BAY - FLY TO HOI AN (B/L)","description":"Rise early today to view the dawn at the Wonder of the Nature World with complimentary tea and coffee being served in the dinning room. A Tai Chi class is offered on the sun deck to awaken your mind and muscles. In the morning, we set sail to the small Ti Top Island. Formerly named Cat Nang, the island received a name change after former president Ho Chi Minh and the second man to orbit the Earth, Russian astronaut German Titov, toured Halong Bay together in 1962. Since the cosmonaut was so fascinated with this picturesque islet, Uncle Ho would rename the spectacle Ti Top Island to honour Titov and as a gesture of friendship between their two countries. One arriving at Ti Top, you can go for a refreshing morning swim on a sandy beach beneath towering rock formations. If you prefer to be a bit more active, climb 400 stone steps (which takes about 20 minutes) to the island’s top and be rewarded with stunning, panoramic views over the bay. There is also a viewing platform about half-way up with great vistas framed by lush greenery – perfect for photos. Back on board, you can take a shower and freshen up. Now is the time to enjoy the final moments of sailing as we head back to the harbour while a light brunch is served. Until we reach the pier, relax on the sun deck or in the dining room while savouring the last views of this iconic site. Back to the harbor and transfer to the airport to catch your flight to Danang. Board a flight to Danang and upon arrival, your English speaking guide will escort you to your hotel in Hoi An. Enjoy a scenic 40 minutes  transfer from Danang to Hoi An."},{"title":"LUSH GREEN HOI AN (B/L/D)","description":"Escape the old town and take backroads to the beautiful islands and villages surrounding Hoi An riding pillion on a vintage Vespa. Explore the magnificent countryside, meet local families and experience colourful village and riverside life in remote communities.\n\nDescription: Your journey off the beaten path begins as you zoom to an island boasting rural countrysides and ride along the river to an Ancestral House, then over a wooden bridge to a traditional boat builders yard. You then explore villages and zig-zag through the breathtaking scenery of rice paddies and farmland, stopping en route to learn from friendly families about mat weaving, local farming and how to make rice crackers and noodles. After enjoying a yummy snack, we ride towards the coast, along trails lined with white sand and pine trees before fueling up on organic drip-coffee at a village café and learn the art of coffee roasting. Next we stop at the top of Cau Cua Dai Bridge which offers us spectacular panoramic views of Hoi An, then over to the water coconut palm fringed trails to a delicious lunch in a picturesque setting before returning to the heritage town.\n\nHIGHLIGHT: ROMANTIC DINING ON THE BAMBOO RAFT\n\nEscape the city and spend an evening indulging on the bamboo raft will be placed on the surface of the Co Co river bank. We aim to provide a unique dining experience on the countryside environment with a romantic atmosphere during your stay. You will be served with fresh food and daily catch from the surrounding river, fresh local vegetables will be prepared as appetizers. Highlight: Take a romantic dinner on the bamboo raft by candlelight with your loved; Enjoy the BBQ dinner prepared for you by the professional chef; Panoramic views of the countryside of Hoi An."},{"title":"HOI AN - HO CHI MINH CITY (B)","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Hoi An to Ho Chi Minh City. Approximately flight time is one hour and 30 minutes. Upon your arrival, you will be transferred from the airport to your hotel in Ho Chi Minh City’s center.\n\nRest of the day is your leisure time to explore the city on your own."},{"title":"HO CHI MINH CITY - MEKONG DELTA (B/L)","description":"Boarding at Cai Be at noon. Welcome drink, Introduction to the ship and crew, check into the cabins. Departure towards Cho Lach on the Tien Giang river. Lunch while en route. Rest on the deck. The Bassac slips into the Chợ Lách canal, in the middle of the hustle and bustle of the river traffic, between markets and churches, a unique opportunity for a glimpse of the very varied life on the banks as well as on the water. By mid-afternoon, the Bassac casts anchor for a visit on shore. Be it on foot or by bicycle, be ready to discover a village in the delta while appreciating its peaceful scenery and life with simplicity.\n\nBoarding back, complimentary drink as a welcome back on board. Rest on the deck enjoying the sunset. The crew will serve dinner while the Bassac is cruising Mang Thit river. The Bassac sets anchor just downstream from Tra On for the night."},{"title":"CAI RANG FLOATING MARKET - CON DAO ISLAND (B)","description":"The boat departs at 06:00, as the ship passes by Tra On. The ship then departs towards Can Tho. The breakfast is available at 7:00.Arrival in Cần Thơ, transfer onto a local boat to visit the Cai Rang floating market, then a noodle factory and return to the Ninh Kieu pier.\n\nEnd of services by mid-morning on shore at Cần Thơ. Transfer to the aiport Can Tho then take flight to Con Dao.\n\nArrive at Con Dao. Pick up then check in the hotel."},{"title":"CON DAO ISLAND LEISURE DAY","description":"The day is your leisure time to explore the  island  on your own."},{"title":"CON DAO LEISURE DAY (B)","description":"The day is your leisure time to explore the island on your own.\n\n"},{"title":"CON DAO LEISURE DAY (B)","description":"The day is your leisure time to explore the island on your own.\n\n"},{"title":"CON DAO – HO CHI MINH BY FLIGHT - FLIGHT DEPARTURE (B)","description":"Have breakfast at the hotel and relaxing time before boarding a flight from Con Dao to Ho Chi Minh City then your flight departure.\n\n"}]},{"name":"Private Vietnam Classic Tour Package - 12 Days / 11 Nights","duration":12,"travelStyle":["Adventure","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":1180,"summary":"This 12-day tour is designed for first time travelers who wish to experience the highlights of Vietnam including the best of 3 regions: north, centre and south of Vietnam. The tour can be combined with extended nights or added more activities to your wish.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150917_53a9efb7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150917_53a9efb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_5e0fe17d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_beda788b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_c4f8abac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_ef4e0692.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_2e87c625.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_6cd9b90e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_0c64dbec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_7c7668ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_97728a21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_b23ceadd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_4440d05e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_5a089328.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_f929b5ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_ba7d8268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_754d3234.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_954bc73c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_06df2dda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_eec8b549.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_ee288c3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150917_fcf50253.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Mekong Delta","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you\n Meals: N/A\n Accommodation: Hotel in Hanoi"},{"title":"DAY 2: HANOI HALF DAY CITY TOUR","description":"Pickup at 08:00. We will spend a half day to visit the city. We start with visit to President Ho Chi Minh's mausoleum (Outside). We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university. The day ends with visit to Hoa Lo Prison.\n Meals: Breakfast\n Accommodation: Hotel in Hanoi"},{"title":"DAY 3: HANOI - HALONG BAY - NIGHT ON BOARD","description":"08h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break\n12h00: Arrive at Tuan Chau wharf – Break and photography time\n12h30: Board the Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the bay\n15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen.\n16h30: Enjoy kayaking or swimming (if the weather permits).\n17h00: Back on board and continue cruising.\n19h00: Dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner\n Accommodation: Night on board"},{"title":"DAY 4: HALONG BAY - HANOI - FIGHT TO DANANG","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nAirport transfer for late flight to Danang. Transfer to the hotel in Hoian upon arrival.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian\n"},{"title":"DAY 5: HOIAN - FREE DAY","description":"Free and easy day to explore Hoian town or swim at nearby beach.\n Meals: Breakfast\n Accommodation: Hotel in Hoian"},{"title":"DAY 6: HOIAN - MY SON TOWERS TOUR","description":"Pickup at the hotel at 7:50 am, we drive to visit My Son. The My Son temple complex is regarded one of the foremost Hindu temple complexes in Southeast Asia and is the foremost heritage site of this nature in Vietnam. It is often compared with other historical temple complexes in Southeast Asia, such as Borobodur of Java in Indonesia, Angkor Wat of Cambodia, Bagan of Myanmar and Ayutthaya of Thailand. Although badly damaged by bombing raids in the 1960s, the site still has more than 20 structures and was declared a UNESCO World Heritage Site in 1999.\nLeaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. Enjoy the beautiful views along the river. Arrive Hoian in early afternoon. Free time to explore Hoian ancient town.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hoian"},{"title":"DAY 7: HOIAN - HUE SCENIC TRAIN JOURNEY","description":"Free in the morning.\nIn the afternoon, transfer to the station for day train to Hue. Enjoy scenic view of Hai Van Pass on the way. Arrive Hue in late afternoon. Transfer to the hotel and enjoy free time.\nNote*: The train journey is part of a great local experience. Restrooms at either end of the carriages.\n Meals: Breakfast\n Accommodation: Hotel in Hue"},{"title":"DAY 8: HUE CITY TOUR - FLIGHT TO SAIGON","description":"08:00: Pickup at the hotel.\n\nToday, we will spend a full day touring Hue city. \n\nIn the morning: visit Old Imperial City, Flag Tower, Thien Mu Pagoda and Dong Ba bustling market. Lunch at the local restaurant. \nIn the afternoon: visit Royal Tombs of Minh Mang and Khai Dinh. We will also visit a Conical hat village and incense stick village\nThen airport transfer for late afternoon flight to Saigon. Transfer to your hotel for checkin upon arrival.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 9: SAIGON CITY + CU CHI TUNNELS TOUR","description":"Pickup at the hotel at 7:40, we head out of town to visit the Cu Chi Tunnels, which is an extensive underground network of approximately 200 kilometers of tunnels dug initially by the Viet Minh and then expanded by the Viet Cong. Here contains hospitals, plus accommodation and schools, and were used extensively for refuge and storage and also utilized as a military base for the Viet Cong close to Saigon.\nIn the afternoon afternoon, transfer to Saigon for half day city tour. Our city tour will help you to see the best of Saigon. We visit the historic Reunification palace and War Remnants Museum, followed by the architectural treats of French colonial Notre Dame Cathedral and the post Office. Free time at leisure or shopping at Ben Thanh Market nearby.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Saigon"},{"title":"DAY 10: SAIGON - PANORAMA MEKONG RIVER CRUISE","description":"Note*: depending on the cruise availability, you would do the Caibe – Can Tho or Can Tho – Caibe itinerary. We will keep you updated. \n07:10 – 07:30: Pickup at the hotel for Cantho – Caibe itinerary\n08:00 – 08:20: Pickup at the hotel for Caibe – Can Tho Itinerary.\nYou board your comfortable wooden Mekong Eyes cruise vessel around noon. After a refreshing welcome drink we show you our on-board facilities and your cosy cabin. As lunch is served, the Mekong Eyes Cruise starts cruising. Sit back and watch the fantastic scenery and the daily life of the Mekong people.\nIn the afternoon you can disembark for a guided leisurely stroll through a village and the surrounding fruit orchards or rice fields. Meet the friendly locals and taste the local produce and fruits.\nGet back on board and enjoy a drink at the bar or relax on deck as the sun sets over the magnificent water landscape of the Mekong river. The Mekong Eyes Cruise will anchor for the night. The day ends with a delicious on-board dinner. You stay overnight on board your floating hotel in the Mekong Delta.\n Meals: Breakfast/Lunch/Dinner\n Accommodation: Night on board"},{"title":"DAY 11: CAIBE/CAI RANG FLOATING MARKET - SAIGON","description":"Wake up well rested to the sound of the river and get ready for another exciting day of sightseeing in the Mekong Delta. At 6.30h the Mekong Eyes cruise vessel sets off for a sunrise cruise. Watch the locals go about their daily work drying exotic fruits and building ships on the wooden yards while enjoying an early breakfast.\nAfter breakfast, we will board a sampan boat to Cai Be or Cai Rang floating market, the region’s busiest and most lively markets. Marvel at the sheer abundance of exotic fruits, vegetables and skilfully handcrafted regional products. We will pull up to the boats for talking and bargaining with the merchants. We will also visit some of the local candy and cake making factories or boat through the green water landscape to see local houses, verdant orchards and ship-building yards.\nNote*: The floating markets in the Mekong Delta are no tourist markets but wholesale markets where produce of the Mekong Delta like fruits and vegetables are traded. For this reason the number of boats on the market fluctuates depending on harvesting seasons and market demand. Furthermore, modern wholesale markets are becoming more popular in Vietnam. This can result in decreasing numbers of boats being present on the markets.\n Meals: Breakfast\n Accommodation: Hotel in Saigon"},{"title":"DAY 12: SAIGON DEPARTURE","description":"Today, you are free till airport transfer for departure flight. Trip ends!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Summer idyll 15 days 14 nights","duration":15,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1394,"summary":"Take a summer adventure into the traditions and cultures of Vietnam with our Summer Idyll 15 Day Tour. Travel across the light dappled rice paddies and green rolling hills of Sapa. Float among the crystal blue waters of Halong Bay, the light reflecting off each impressive karst peak. Stroll around the charming Hoi An and see all the sights of Hanoi. Let us show you the beauty of Vietnam, illuminated by the summer sun.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558a3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e47645a558b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194056_5e4764541cf75.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An"],"timeline":[{"title":"Hanoi Arrival","description":"Your adventure begins when you step off the plane and into the warm, welcoming air of Hanoi. Your driver will meet you at the airport and you will be driven the Old Quarter, the hub of Hanoian culture. En route make sure to look out for the world’s longest mosaic as it snakes along the main road, its tiles glistening in the sun. As you reach the Old Quarter you will be immersed in the excitement of the swarming streets. The afternoon is yours to discover the magic of the city. If you arrive early, please feel free to come and visit our office in the Old Quarter. We will be happy to share some practical information with you."},{"title":"Hanoi City Tour (B/L/D)","description":"Today, you will visit the top spots in Hanoi to get a true feel for the culture and tradition that underpins this dynamic city. After breakfast in your hotel, you will be collected at 08:00 by your tour guide who will take you to the serene Tran Quoc Pagoda, the oldest Buddhist temple in Hanoi. It sits peacefully next to the glimmering waters of the lake, Tay Ho, and provides a moment of stillness in the energetic city.\nNext, you will visit the iconic Ho Chi Minh Complex where you can feel the gravity of Vietnam’s victory of independence. You will have the chance to view the legendary Ho Chi Minh in his final resting place and visit Ba Dinh square where the declaration of independence was read in 1945.\nAfter lunch, your cultural discovery will continue with a visit to Vietnam’s first national university, The Temple of Literature. The courtyards boast beautifully preserved traditional Vietnamese architecture and well-maintained gardens all decorated with ornate sculptures. Originally built and dedicated to Confucius in the 11th century, this complex honours some of Vietnam’s finest scholars and will leave you feeling inspired.\nAfter a day of cultural and historical discovery, you will be entertained by the amusing stories told in the water puppet shows. This unique form of entertainment takes a light-hearted look at life in rural Vietnam.\nYou will be able to relax after your first day with a night in a three-star hotel."},{"title":"Hanoi - Halong Bay (B/L/D)","description":"Today you will experience the awe-inspiring beauty of Halong Bay whose iconic karst peaks and azure blue waters are often shown as the pinnacle of Vietnam’s beauty. You will board the 08:00 shuttle bus to Halong Bay where you will board a cruise at midday. First, you will tour a collection of islands all named for the objects they depict. On the cruise, you will visit Oan islet, Teapot islet, Monster Face islet, Torch islet, Dragon islet, and Porcupine islet.\nHalong bay is not only popular for its collection of islands but also for the amazing caves that lurk beneath them. You will get to experience Amazing Cave whose impressive stalactites and stalagmites dance in the sunlight breaking in from above, casting shadows that will set your imagination running. After, you will venture to Luon Cave whose cavernous mouth opens up into a blissful oasis of still waters surrounded by towering karst walls. The protection from the elements makes this the perfect habitat for many different species of wildlife and plants.\nYour night will be just as magical as your day as you spend the night on board the boat."},{"title":"Bai Tu Long Bay (B/L/D)","description":"Welcome the new day with a Tai Chi class, a traditional activity that prepares the body and mind for the day ahead. Today, you will discover the hidden world of the Dark and Light Caves. First, you will pass through the low, dark mouth, its roof cobbled with worn stalactites. Then you will emerge into a pool of light as you enter the harbour created by the surrounding islands.\nThe afternoon will take you to see the incredible craftsmanship of the pearl farmers at the Halong Pearl Farm. Here you can learn about the processes involved in creating the stunning pearls and see the artisans perfecting each one meticulously.\nYou will have one more night to enjoy on board the boat."},{"title":"Ha Long Bay - Hanoi (B/L)","description":"\nYour Halong Bay cruise will climax with a visit to the beautifully formed Titop Island. The island sits like and emerald gem on the waters. Its conical shape makes a great viewpoint for the surrounding areas. From the peak, green forests roll down to the dusty white sand. It is the perfect place to end your cruise and take some amazing photos.\nYou will disembark the cruise at midday and you will arrive back in Hanoi at around 16:30 where you are free to explore and relax. You will spend the night in a three-star hotel."},{"title":"Hanoi - Mai Chau (B/L/D)","description":"\nToday, you will once again leave behind the hubbub of Hanoi and head into nature as you uncover the stunning vistas of Mai Chau and the local villages. Located only 130km outside of Hanoi, this peaceful valley will feel like a whole world away from Hanoi. The vast valley is a patchwork of green dotted with small Thai villages. Here you can see the women working fastidiously, weaving lengths of intricate textiles. You will experience local culture and hospitality as you have lunch with a local family and spend the afternoon discovering the nearby villages by bicycle.\nAfter a delicious local dinner, you will be treated to a traditional dance show, where the playful and artistic nature of the communities living here really comes to life."},{"title":"Mai Chau - Hanoi (B/L)","description":"After a nourishing breakfast, you will be ready for the day's hike to the 1000 Step Cave which is aptly named! The steps lead you up the steep incline to the summit where a cave with strikingly formed stalactites and stalagmites awaits you. This, however, is not your only reward as this is also one of the best vantage points to take in the stunning view of Mai Chau.\nAfter your descent from the cave, you will take a trip to the local market where you can see the amazing craftsmanship of the local people who make the colourful and intricate items on sale. It is amazing to discover the hard work and skill that is put into each and every item on offer. After another delicious local meal for lunch, you will return to Hanoi. You will arrive back in the city at around 18:30 where you will be free to relax."},{"title":"Hanoi - Hoi An (B)","description":"Today you will travel to the charming and well-preserved port town of Hoi An, a town that manages to capture the hearts of Vietnamese and foreigners alike. You will be collected from your hotel and taken to Hanoi airport for your flight to Da Nang. From here you will be driven down the stunning coastal road which divides the powerful green mountains and the clear, blue sea. Along the way, you will see the striking marble mountain whose five peaks represent each of the five elements. You can also see the artisans carving incredible marble creations in the Marble Carving Village."},{"title":"Free In Hoi An (B)","description":"Now you have four days free to discover the many amazing sights that Hoi An has to offer. Uncover the rich and diverse history in the ancient town. Here you can discover the influences of the multicultural tradesmen that once inhabited the town. Discover the splendidly ornate Phuc Kien Assembly Hall bought by rich Chinese traders and dedicated to the Goddess of the Sea in order to protect the sailors. Follow this up with a visit to the faithfully preserved ancient housed of Tan Ky and Phung Hung whose intricate and eclectic architecture beautifully demonstrates the Chinese, Japanese and European influences.\nTake a trip to the atmospheric My Son Sanctuary, a temple of Hindu origin that sits peacefully in the mountains. Time seems to have merged the striking stone pillars and the surrounding nature as the foliage has begun to wind its way up their trunks.\nChoose to float along the lazy river and take in the view of the town from the water as you visit the fishing village and try your hand at driving the unusual and impressive coconut basket boats through the rich agricultural patchwork of fields and rivers."},{"title":"Free In Hoi An (B)","description":"You are free today."},{"title":"Free In Hoi An (B)","description":"You are free today.\n\n"},{"title":"Free In Hoi An (B)","description":"You are free today.\n\n"},{"title":"Free In Hoi An (B)","description":"You are free today.\n"},{"title":"Hoi An - Hanoi (B)","description":"You will be collected in the morning and driven to Da Nang airport where you will take your return flight to Hanoi. Once back in the city, you will be collected from the airport and delivered to your hotel. The night is yours to enjoy. You will be free to make the most of your last night in this magical city."},{"title":"Hanoi Departure (B)","description":"Today you will have free time to drink as much of the Hanoian culture as you can before your homeward flight. Fit in one last flavoursome meal, one more rich Vietnamese coffee and buy any last souvenirs before we deliver you to Noi Bai airport for your journey home after your amazing adventure"}]}]