[{"name":"Best of North Vietnam - 7 days","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":486,"summary":"Best of Northern Vietnam tour will provide you the value experience; you will have a chance to enjoy the colorful markets of the hill tribes in Sapa as well as natural world heritage Halong bay as well as the capital city of Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150442_d035732d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150442_d035732d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_927a7f30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_a19e7766.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_ebc6e362.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_b834a996.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_7c5f6e40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_e6a81682.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_9752d429.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_4f3cef21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_8b19bb24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_0e4bfb56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_42e133dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_770a3408.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_6b41438d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_158eb4d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_2bf9773e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150442_7891c562.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day.\nNote*:\nThe hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied.\nPlease be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you\n Meals: N/A\n Accommodation: Hotel in Hanoi"},{"title":"DAY 2: HANOI CITY TOUR - OVERNIGHT TRAIN TO SAPA","description":"Today, we will spend a full day to visit the city. We start with visit to President Ho Chi Minh's mausoleum and residence. We also visit the famous One Pillar Pagoda nearby. Leaving the President's complex, we continue to visit the Temple of Literature (Van Mieu). Although several Van Mieu can be found throughout Vietnam, the most prominent and famous is that situated in the city of Hanoi, and was functioned as Vietnam's first university\nAfter lunch in a local restaurant, we go to the Museum of Ethnology, which is an excellent museum containing the ethnic costumes of the various minorities of Vietnam, as well as relics, tools and even full size replicas of their homes and buildings. \nBack to the hotel. Free till transfer to the station for overnight train to Lao Cai (for Sapa). Driver meets at your hotel in Hanoi at around 21:00 hrs and transfer to Hanoi train station. Overnight train trip to Lao Cai in shared sleeping compartments (sharing with other passengers in 2 lower & 2 upper berths per compartment). Train departs at approximately 22:00 hrs.\nNote*:\nLate checkout at the hotel is not included.\nOur tour guide will not accompany during the train trip\nTrain schedule is subject to change depending on availability\nPrivate compartments on request at surcharge.\nTrain journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages.\n Meals: Breakfast/Lunch\n Accommodation: Overnight train to Sapa"},{"title":"DAY 3: Y LINH HO - LAO CHAI - TA VAN VILLAGES TREKKING","description":"Sa Pa is a quiet mountain town and home to a great diversity of ethnic minority peoples. Most of the ethnic minority people work their land on sloping terraces since the vast majority of the land is mountainous. Their staple foods are rice and corn. Rice, by its very nature of being a labour intensive crop, makes the daily fight for survival paramount. The unique climate in Sapa has a major influence on the ethnic minorities who live in the area. With sub-tropical summers, temperate winters and 160 days of mist annually, the influence on agricultural yields and health related issues are significant. \n05:30 ~ 06:00: Arrive at Lao Cai Train Station. Pick up at the train station and transfer to Sapa. Early check in upon arrival is possible upon room occupancy (Surcharge applicable). Breakfast and Relax for a while to get ready for our full day tour. \n9.30am: Meet up your local guide and start trekking for 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. A 2 km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. On the way, we would have chance to learn about the local agriculture producing customs and daily lifestyle. We have lunch at a local family, offering you a worth chance to learn about the local house architecture, which is full of their daily life styles and exclusive custom. We will then get back to Sapa by jeep or motorbike\nMeals: Breakfast/Lunch/Dinner\nAccommodation: Hotel in Sapa"},{"title":"DAY 4: CAT CAT - SIN CHAI VILLAGES TREKKING - BUS TO HANOI","description":"08:30: Pickup at the hotel. We start a walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam. We enjoy picnic lunch by the side of the river, and trek for 6 km to Sin Chai village, which is located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way back to Sapa.\nYou are free to explore the town till bus transfer to Hanoi departing at 3:00pm. Arrive Hanoi at 9pm.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hanoi"},{"title":"DAY 5: HANOI - HALONG BAY - NIGHT ON BOARD","description":"08h00: Pick up from your hotel in Hanoi. Drive to Halong City through the paddy fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break\n12h00: Arrive at Tuan Chau wharf – Break and photography time\n12h30: Board the Cruise for departure. Welcome drink will be served\n13h00: Lunch is served while cruising through the bay\n15h30: Visit exciting Cua Van fishing village. The village is free of busy roads and streets, electric lights, houses and high rise buildings. Instead, there are only herds of little boats and rafts. You will have the chance to discover the traditional culture and customs of the fishermen.\n16h30: Enjoy kayaking or swimming (if the weather permits)..\n17h00: Back on board and continue cruising.\n19h00: Dinner is served.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch/Dinner\n Accommodation: Night on board"},{"title":"DAY 6: HALONG BAY - HANOI","description":"07.00: Coffee and tea will be served\n08.00: Continue cruising\n08h15: Visit splendid Sung Sot Cave\n09h00: Check out and enjoy a fantastic cruise on the bay, passing Dinh Huong Island, fishing villages, Ga Choi Island, Dog Island and Sail Island.\n09.30: Buffet brunch (breakfast/lunch) while cruising back through Halong Bay to the pier\n11h30: Arrive at the pier. Time to say goodbye to the crew.\n12.00: Return from Halong to Hanoi. Arrive Hanoi at about 17pm.\nNote*: the itinerary and activities on board would vary depending on the boat you choose. Please see the choice of boat in Hotel Inclusions.\n Meals: Breakfast/Lunch\n Accommodation: Hotel in Hanoi"},{"title":"DAY 7: HANOI DEPARTURE","description":"Free at leisure until our transfer is presented at your hotel and take you to Noi Bai International Airport for flight to for departure flight. Trip ends. \nNote*: depending on your flight schedule, we will arrange airport transfer accordingly (2.5 hours for domestic flight/ 3.5 hours for international flights)!\n Meals: Breakfast\n Accommodation: N/A"}]},{"name":"Highlight northern Vietnam Tour 7 days/6 nights","duration":7,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":514,"summary":"With the discovery tour Highlight Vietnam Tour 7 Days/6 Nights, you have a 7 day tour package taking you through Hanoi, Vietnam and  2 other destinations in Vietnam. Highlight Vietnam Tour 7 Days/6 Nights is a small group tour that includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/152786_f3d4ad83.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/152786_f3d4ad83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_4191ad25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_ba39a0fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_127d8fb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_2c75f22b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_81382a1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_ca0050c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_c006ff3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_add8317b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_36dd5939.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_e1e866d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_bf49f778.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_d7fd81cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_77253a27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_de1f5fae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_1d0f7a9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_d86dd679.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_8e3974b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_380d0615.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_6c22a123.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_3f9968ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_c401ead9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_4e89d1eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152786_10dcd0ef.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrive in Hanoi- Check in hotel","description":"Landing at the Hanoi Airport. Our guide welcomes and pick you up at the airport to your hotel.\nYou will check in 3-star-hotel and take a rest. "},{"title":"Day 2: Hanoi city group tour with puppet show - Overnight on train to Lao Cai ( Breakfast, Lunch)","description":"MORNING:\nHave breakfast at hotel & ready for the trip at the lobby OR the meeting points.\nOur guide will pick you up between 07h45 and 08h30.\n08h30: Arrive Tran Quoc Pagoda –  the oldest pagoda in Ha Noi built in the 6th century.\n09h00 – 9h15: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around the garden to see 2 houses where he lived & worked from 1954 to 1969. Then visit One Pillar Pagoda where worships the Godess of Mercy – It is the most unique padoga in the world\n11h00: Visit one of these\nVietnam Museum of Ethnology to learn about the culture of 54 ethnic groups living in Vietnam (Tuesdays – Thursdays – Saturdays & Sundays)\nBat Trang ceramíc village to explore the daily life of the local & learn about the process how to make a perfect product (Mondays – Wednesdays  – Fridays)\n12h30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes.\n13h30 – 13h45: Continue visit Temple of Literature – the first university of Vietnam, established in the 11 century\n15h45: Leave for Hoan Kiem Lake to visit Ngoc Son Temple, which honors General Tran Hung Dao who defeated the invader in 13th certury.\n16h15: Tour finishes. Back to hotel\n20h: Our guide will go to your hotel and take you to Train Station\nOvernight on train "},{"title":"Day 3: Sapa – Y Linh Ho – Lao Chai – Ta Van - Sapa( Breakfast, Lunch, Dinner)","description":"\nPick up at the train station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you\ncan have shower.\nStart the trip at 9:30 as below.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of\nthe Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of\nthe Dzay minority people. Lunch at a local family, it gives you a worth chance for you to learn about the local house\narchitecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Last trek is\nabout 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan..\n Breakfast, Lunch and dinner are all included. Overnight at the hotel in Sapa.\n Trekking level: 6/10\n 10Km trekking, 8Km driving from Tavan village back to Sapa"},{"title":"Day 4: Cat Cat & Sin Chai","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of\nthe stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the\ncolonial time in Vietnam. Enjoy picnic lunch by the side of the river, and then next 3 km to Sin Chai, the village located\nat the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning\nlandscapes before climbing up on the way a jeep to return to Sapa.\n Breakfast, Lunch and dinner are all included.\n Trekking level: 4/10\n 7KM trekking, 3Km driving from Cat Cat back to Sapa. Tourist bus to back Hanoi.\nOvernight 3 star hotel in Hanoi"},{"title":"Day 5: Ha Noi – Ha Long Bay – Lunch – Titop Island – Surprising Cave – Sunset party – Dinner – Fishing","description":"7:45 – 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n– 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise . Meet the captain , crew and join us for welcome drink as we tell you about life onboard.\n– Check into your cabin . Time to refresh and unwind.\n– Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n– Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n-Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n– Climbing up to the Top of the Island – take the best view ofHalong Bay in the Summer time.\n– Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n– After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\nDinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom"},{"title":"Day 6: Tai Chi – BreAkfast – KAYAKING– Cooking demonstration – lunch – your hotel","description":"Morning in the bay:\n– 6:30 – 6:45 Startyour day with Tai Chi exercises or a photo hunt\n– 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n– DO KAYAKING in 30-45 minutes.\n– 9:30am :We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store .\n– Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and more…\n– Join in the Cooking Class , teaching you how to make our specifically (Spring rolls) before an early lunch is served .\n– 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina.\n– Transfer to minibus or private and return to Hanoi\n– Arrival back at your hotel approximately 16:30/17:00\nOvernight at hotel in Hanoi"},{"title":"DAY 7: Return the Noi Bai airpot and fly back to your home( Breakfast )","description":"-Take a rest in your hotel.\n- Our Car will pick you up at your hotel and take you to the airport and say Goodbye. Ends Package tour"}]},{"name":"8 Days Immersed In The Beauty Of Northern Vietnam","duration":8,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":520,"summary":"Vietnam trips from Hanoi to visit Halong bay and Sapa. With the combo, visitors will have chance to visit two most famous destinations in the north of Vietnam. Discovering Hanoi capital with Old Quarter Streets, Night Market, Hoan Kiem Lake, Ho Chi Minh comples...,exploring Halong bay with limestone caves and islets....; then joining Sapa trekking tour.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/144530_ec8719aa.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/144530_ec8719aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_a2a0b99d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_21e93a44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_b9ae5271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_988e6068.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_6b8f5f35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_bd406485.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_12e282b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_11d68c02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_273f428f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_53e2ee79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_1b35c7f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_be5f09c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_b8120b02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_9bd8b421.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_42af6154.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144530_dd33dd3f.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Arrive Hanoi – Walking Old Quarter Street Food Tour (Dinner)","description":"-\tOur private car would pick you up at Hanoi Internatinal Airport and drop you off at your hotel in the city centre. \n-\tCheck in your hotel\n-\tEnjoy free time in Hanoi or Participate in the Hanoi Walking Street Food Tour to experience the Vietnamese local cuisine.\n-\tOvernight in Hanoi hotel\n"},{"title":"Day 2: Legendary Hanoi City Full-day Trip (Breakfast, Lunch)","description":"Have breakfast at hotel & ready for the trip at lobby.\n7:45 – 8:30: Tour guide pick up at hotel\n08:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world\n10:15: Visit the Lacquer Paintings workshop – the biggest center in Ha Noi\n10:45: Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45: Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00: Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45: Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15: Tour finishes. Back to hotel and overnight in Hotel in Hanoi.\n"},{"title":"Day 3: Hanoi - Halong Bay - Overnight on 3-star Cruise (Breakfast, Lunch, Dinner)","description":"7:45 – 8:15 : Shuttle bus and Tour guide of Cruise will pick you up at your hotel in Ha Noi old quarter.\n8:45 : Departure to Halong Bay for 3.5 hours.\n10:15: Arrive in Hai Duong province, and have 20-30 minute short break.\n12:00: Arrive to Tuan Chau Harbor. \n12:20: Welcome to Cruise and Enjoy welcome to drink and get a brief introduction about cruise and safety guidelines.\nCheck- in your cabin with Air-Conditioning.\n12:30: Enjoy a special lunch with Vietnamese traditional dishes, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\nAfternoon Activities:\n15:00: Visiting Sung Sot Cave (Surprising cave). \n16:00: Our cruise will take you to the Titop Island, It is noted for having a viewpoint at its peak which affords splendid views all around Halong Bay or you can enjoy your swimming on romance sandy beach.\n17:15: Come back to Cruise then take a shower, Relax on sundeck, sunset watching in comfortable lounge chairs while drinking a cocktail or reading a book in the most magical moment.\n18:00: Enjoy welcome sunset party and Cooking class. How to make fresh noodle roll, you can enjoy product which you make it. \nEvening Relaxing:\n19:00: Enjoy your dinner when sitting by overlooking sea view window in the night romantic Bay. \n20:30: Playing some sports games like: Squid Fishing, Singing karaoke, or playing puzzle game.\nOvernight on boat: Clean air- conditioning room.\n"},{"title":"Day 4: Halong Bay - Pearl Farm Visiting - Kayaking - Cruising back to Harbor – Hanoi (Breakfast, Lunch)","description":"6:00: Wake up in the early morning to see sunrise on sundeck.\n7:00: Morning view of bay landscape with a cup of tea of coffee. Have breakfast\n7:40: Start visiting Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.\n8:30: Do kayaking to explore Halong Bay\n10:00: Check-out and enjoy a fantastic cruise on the bay.\n10:45: Enjoy the lunch while Cruising back to Tuan Chau Harbour.\n12:00: Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise.\n12:30: Return to Hanoi by shuttle bus.\n14:30: Stopover in Hai Duong province for short break.\n16:30: Arrive in Hanoi end your trip.\n"},{"title":"Day 5: Hanoi Free and easy - Train to Sapa (Breakfast)","description":"Enjoy your free and easy day in Hanoi to explore the local traditional authentic beauties yourself.\n20:00 PM Pick up from Hotel to the train station to Sapa\n"},{"title":"Day 6: SaPa – Trekking to Y Linh Ho – Lao Chai – Ta Van( Breakfast, Lunch, Dinner)","description":"5:30 a.m Arrive in Lao Cai around, we will take 1 hour van ride uphill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces. Upon arrival Sapa town.\n7:00We have breakfast at the hotel. And relax about 2 hour, you can take a shower.\n9.00 - 9.30 Begin a short walk of 5km along mountain trail to visit Y Linh Ho village which is inhabited by black Hmong tribe and completely secluded from tourists, especially you are able to embrace raw Sapa culture and community by coming into some native houses to discover their own culture and custom as well as study how the local tribe make handicraft from natural materials such as: hemp, indigo…ect. Continuing to walk down MuongHoaRiver where you can take a rest or swim before trekking uphill to Lao Chai village where your picnic lunch will be served. \n13.00 After lunch, you will visit the Day and Red Dzao tribes of Tavan village, which lies in the middle of MuongHoa valley where excellent panoramas of rice terraced fields. \n15h00 – 15h30 There you will have dinner and stay over night at local house.\nAccommodation: Homestay in Sapa\n"},{"title":"Day 7: Ta Van – Giang Ta Chai – Su Pan – Sapa – Lao Cai ( 3-3,5 hours trekking) ( Breakfast, Lunch, Dinner)","description":"8.00:You have breakfast at the home stay before trekking about 8km towards the Red Dzaovillage of Giang Ta Chai. On the way you will trek up and downhill then through bamboo forest before arriving at the waterfall, Rattan bridge and Stream where you have short rest to swim and picnic lunch. \n14h30 Continuing to walk uphill about 2km to HauThao village where we catch the car to return to Sapa. You are free to discover Sapa town and Market before having dinner then being transferred to Lao Cai train station to catch the night train to Hanoi.\n"},{"title":"Day 8: Free and easy – Pick up to the Airport","description":"You have free time to relax after trip by yourself and enjoy the last day in Hanoi.\nPrivate car and driver will pick up from the Old Quarter to the Airport. Say goodbye.\n"}]},{"name":"Scenic Saigon Motorcycle Tour to Nha Trang via Mui Ne and Da Lat, Bao Loc","duration":5,"travelStyle":["Motorcycle Ride","Group","Partially Guided","Holiday"],"oldPrice":0,"price":780,"summary":"This Vietnam Motorbike Tour from Saigon to Nha Trang via Mui Ne, Da Lat within 5 days / 4 nights bring riders to explore all stunning beauties of Southern Vietnam. You will have a chance to visit almost the remote areas of central highlands Vietnam, also some famous attraction from Saigon up to Nha Trang. Especially, it is also the recommended motorcycle tour on the coastline of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e619ef.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e619ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e6dff6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6e74864.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ec16f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ec6e9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ecc02a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ed1093.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e05780bd8d20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ed9857.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ede99f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ee3a01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e057b6ee8837.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373777fd6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373968bd09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4373968bd0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4374566438d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189954_5e4374566438f.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Dalat"],"timeline":[{"title":"SAI GON MOTORBIKE TOUR TO LA GI: 150 KM (L,D – HOTEL STAY)","description":"We start the Saigon motorbike tour at 8:30. From the city center of HCMC, we hit the city roads to the northeast of Saigon to La Gi town. We will have some interesting visits of Minh Dam Army base, Thuong Chieu Monastery pagoda and Binh Chau hot water spring. After lunch, we will have great short motorbike ride on the coastal roads to La Gi. We’ll be at La Gi at about 4:30 pm."},{"title":"LA GI MOTORCYCLE TOURS TO MUI NE: 130 KM (B,L,D – HOTEL STAY)","description":"It’s short day ride but it’s surely the highlight of this short Saigon motorbike tour. We will have one of the best coastlines motorbike tours in Vietnam today. After breakfast, motorcycling up to the north along the coast to Mui Ne, we’ll pay more visits to Temples, colorful markets of local people and some interesting old towers of the Cham. We will be in Mui Ne at around 4:00 pm. Spend the rest time of the day at one of the most beautiful beaches in the world – Mui Ne."},{"title":"MUI NE MOTORBIKE RIDE TO BAO LOC: 160 KM (B,L,D – HOTEL STAY)","description":"After early breakfast in the hotel, we leave the town to visit the fairy springs, red canyons white sand dunes and some rustic villages who do fishing everyday to earn living or growing dragon fruits besides coffee plantation…. Then we continue motorcycle tour to the Central Highlands, along the way we will do more stops to visit the K’ho ethnic minority villages to learn about the culture of their wild life in the edge of the Central Highlands. We would arrive in Bao Loc after visiting Dambri waterfall (90 meters high). Overnight in Bao Loc."},{"title":"BAO LOC MOTORCYCLE TOUR TO DA LAT: 140 KM (B,L,D – HOTEL STAY)","description":"Start the motorbike tour to Da lat at about 8:30 am. It’s a short motorbike ride up to Da Lat but it offers a beautiful view of mountain and green plantation. We will see plenty of green tea farm, mushroom fields, vegetable and flower farm, coffee plantations and visit some villages who produce silk and learn how to make a good silk from silkworm. This must be another highlight of the motorbike tour central highlands Vietnam. We will be in Da Lat at 4:00 pm."},{"title":"DA LAT MOTORBIKE TRIP TO NHA TRANG: 150 KM (B, L)","description":"The last day of the Saigon motorbike tour start at 8:30 am, most of the ride is on sealed, smooth roads except some small “monkey bridges” just after Da Lat town however it offers one of the best coastline motorbike ride in Vietnam. We still do some stops to visit King Bao Dai’s palace or peaceful villages of the hill tribe along the way.\nThe 5 day enjoyable Vietnam motorbike tour will finish at around 4.30 PM in the coastal city of Nha Trang. Check in the hotel of your choice and then enjoy your relaxing time on the beach.\n"}]},{"name":"Vietnam in Your Eyes - 7 days Original Experiences","duration":7,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":438,"summary":"Welcom to Hanoi - the capital of Vietnam, get a feel of Hanoi's local culture while seeing the city's highlights and mingling with the locals by visiting some famous temples, pagoda, lakes,... Customers will have a great time to immerse in Hanoi Olf Quarter at night, walk through lots of local restaurant and enjoy street food tour with Vietnamese people.\nObserve stalactites in miraculous form inside Sung Sot Cave (Amazing Cave), one of the largest caverns in Halong Bay. Kayak around the scenic bay, go swimming at Ti Top Island, or even hike up for a panoramic view. You'll find plenty to do in this UNESCO World Heritage area, including cooking classes on board.\nFoot print in Sapa, one of the most famous destination in Vietnam with lots of ethinic group, enjoy freah food, meet local people, do trekking around villages and rice terraces,...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/152986_101fb641.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/152986_101fb641.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_63e00c0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_2245cd18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_6ed060d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_2876b237.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_0c949e8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_3e2dca8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_61e97f42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_48bd9499.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_c90fbc0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_c5facfc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_05500aff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_64c6e74c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_0a8396bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_894cbd2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_f0b89c50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_8612b77e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_3c1a75f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_b3693ef9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_b0a477fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_0ab97f31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_567f8560.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152986_7ebf055a.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi Arrival – Walking Old Quarter Street Food tour (Dinner)","description":"-\tOur private car would pick you up at Hanoi Internatinal Airport and drop you off at your hotel in the city center. \n-\tCheck in your hotel\n-\tParticipate in the Hanoi Walking Street Food tour by night to experience the Vietnamese local cuisine such as Bun Cha, Pho, Banh Cuon, Egg Coffee, Deserts,...\n-       Tour guide take you back to hotelm and take a rest\n-\tOvernight in Hanoi hotel"},{"title":"Day 2: Legendary Hanoi City Full-day (Breakfast, Lunch)","description":"Have breakfast at hotel & ready for the trip at lobby.\n7:45 – 8:30: Tour guide pick up at hotel\n08:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world\n10:15: Visit the Lacquer Paintings workshop – the biggest center in Ha Noi\n10:45: Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45: Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00: Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45: Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15: Tour finishes. It's time to enjoy dinner by yourself\n20:00: We pick you up and take you to Hanoi Railway Station and transfer to Sapa\n20:30: Check -in deluxe cabin and overnight on train to Sapa."},{"title":"Day 3: Hanoi - Halong Bay - Surprising Cave - Sunset Party - Cooking Class (Breakfast, Lunch, Dinner)","description":"8:00 - 8:30AM: Tour guide will pick you up at hotel and depart to Halong\n10:15: Arrive in Hai Duong province, and have 20-30 minute short break.\n12:00: Arrive to Tuan Chau Harbor\n12:20: Welcome to Cruise and Enjoy welcome to drink and get a brief introduction about cruise and safety guidelines.\nCheck- in your cabin with Air-Conditioning.\n12:30: Enjoy a special lunch with Vietnamese traditional dishes, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\nAfternoon Activities:\n15:00: Visiting Sung Sot Cave (Surprising cave). \n16:00: Our cruise will take you to the Titop Island, It is noted for having a viewpoint at its peak which affords splendid views all around Halong Bay or you can enjoy your swimming on romance sandy beach.\n17:15: Come back to Cruise then take a shower, Relax on sundeck, sunset watching in comfortable lounge chairs while drinking a cocktail or reading a book in the most magical moment.\n18:00: Enjoy welcome sunset party and Cooking class. How to make fresh noodle roll, you can enjoy product which you make it. \nEvening Relaxing:\n19:00: Enjoy your dinner when sitting by overlooking sea view window in the night romantic Bay. \n20:30: Playing some sports games like: Squid Fishing, Singing karaoke, or playing puzzle game.\nOvernight on boat: Clean air- conditioning room."},{"title":"Day 4: Halong Bay - Pearl Farm Visiting - Kayaking – Hanoi - Sleeping Bus to Sapa (Breakfast, Lunch)","description":"6:00: Wake up in the early morning to see sunrise on sundeck.\n7:00: Morning view of bay landscape with a cup of tea of coffee. Have breakfast\n7:40: Start visiting Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.\n8:30: Do kayaking to explore Halong Bay\n10:00: Check-out and enjoy a fantastic cruise on the bay.\n10:45: Enjoy the lunch while Cruising back to Tuan Chau Harbour.\n12:00: Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise.\n12:30: Return to Hanoi by shuttle bus.\n14:30: Stopover in Hai Duong province for short break.\n16:30: Arrive in Hanoi and we will prepare a small hotel where you can take a shower and take a rét before getting sleeping bus to Sapa\n21:30: Tour guide and bus pick you up at hotel and transfer to Sapa Town."},{"title":"Day 5: SaPa arrival – Trekking to Y Linh Ho – Lao Chai – Ta Van (Breakfast, Lunch, Dinner)","description":"5:30AM: Arrive in Lao Cai around, we will take 1 hour van ride uphill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces. Upon arrival Sapa town.\n7:00AM: We have breakfast at the hotel. And relax about 2 hour, you can take a shower.\n9.00 - 9.30: Begin a short walk of 5km along mountain trail to visit Y Linh Ho village which is inhabited by black Hmong tribe and completely secluded from tourists, especially you are able to embrace raw Sapa culture and community by coming into some native houses to discover their own culture and custom as well as study how the local tribe make handicraft from natural materials such as: hemp, indigo…ect. Continuing to walk down MuongHoaRiver where you can take a rest or swim before trekking uphill to Lao Chai village where your picnic lunch will be served. \n13.00: After lunch, you will visit the Day and Red Dzao tribes of Tavan village, which lies in the middle of MuongHoa valley where excellent panoramas of rice terraced fields. \n15h00 – 15h30: There you will have dinner and stay over night at local house.\nAccommodation: Homestay in Sapa with local people"},{"title":"Day 6: Ta Van – Giang Ta Chai – Su Pan – Sapa – Sleeping Bus to Hanoi ( Breakfast, Lunch)","description":"8.00:You have breakfast at the home stay before trekking about 8km towards the Red Dzaovillage of Giang Ta Chai. On the way you will trek up and downhill then through bamboo forest before arriving at the waterfall, Rattan bridge and Stream where you have short rest to swim and picnic lunch. \n14h30 Continuing to walk uphill about 2km to HauThao village where we catch the car to return to Sapa. You are free to discover Sapa town and Market before having dinner then being transferred to bus station to catch the night bus to Hanoi."},{"title":"Day 7: Hanoi departure","description":"4:00AM: Hanoi arrival, take a rest at bus staion in Hanoi.\nEnjoy your free time in Hanoi before departure time. \nIt's time to say goodbye and thanks for using our service!"}]},{"name":"Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau","duration":10,"travelStyle":["Motorcycle Ride","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1310,"summary":"This Saigon Motorbike Tour to Dalat, Nha Trang, Mui Ne, and Vung Tau is the perfect way to discover not only evergreen Mekong Delta and romantic highlands city of Dalat but also the Southern part boasting the stunning sunny beaches in Nha Trang, Mui Ne and Vung Tau where you have chance to sit back and relax.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c3579fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c365826.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581504fb8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505501a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581503543e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815049fc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505b2da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581505fd60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e05815066398.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581506d182.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c36b570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c371135.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c376cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189955_5e0581c37c6be.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Dalat","Mui Ne"],"timeline":[{"title":"ARRIVAL – HO CHI MINH CITY (-/-/-)","description":"Upon landing at the airport at around 15:05, you’ll be welcome then escorted to your hotel for a check-in. The rest of time, you’ll be free to explore Saigon by night.\nOvernight at hotel."},{"title":"HO CHI MINH CITY MOTORBIKE TOUR TO MEKONG DELTA (B/L/-)","description":"In the morning, our motorbike tour will be started from your hotel in Ho Chi Minh City Saigon Motorcycle tours and depart to Can Duoc Market – a stunning rural market (40 km). The scene changes from bustling streets with buildings and noise to peaceful rice paddles with cottages and small houses on the way – in the open air of “steel horses”.\n\nThen take a rural route to My Loi Ferry. Some stops en route to see farmers working on paddy fields. Cross Vam Co river by the ferry then ride to Go Cong then Tan Hoa (25km). Have some stops en-route to visit an incense workshop, through some remote villages and reach Tan Thanh beach for seafood lunch. Then continue riding from this Mekong Delta beach to My Tho(45km), the heart of the Mekong Delta.\n\nArrive My Tho, stop by the bank of Tien Giang River. Take a boat trip on Mekong River to Phoenix Island where local handicrafts and sweets from coconut are being produced. Enjoy fresh seasonal fruits and traditional live music and songs performance. Take a short ride to a typical local house to taste some homemade honey-tea.\n\nProceed by small sampan boats through the small canals and side arms of the river to observe the Tiengiang motorbike tours daily life along the river banks with a stop and short leisurely walk at the Turtle Island. Ride through Rach Mieu suspension-bridge for a breath-taking view of the Upper Mekong and transfer to Ho Chi Minh city (70 km). The trip ends at your hotel.\n\nSummary:\nDistance: 190 km\nMeals: Lunch"},{"title":"HO CHI MINH MOTORCYCLE TOUR TO BAO LOC – LAM DONG (B/L/D)","description":"Leave all chaos of Saigon behind, we’ll keep rolling the wheels to the Central Highlands and stop in the K’ho ethnic minority village to learn the culture of their wildlife at the edge of the Central Highlands. Arrive in Bao Loc after visiting Dambri waterfall – about 90 meters high then Tam Chau tea plateau & Linh Quy Phan An pagoda. Overnight in Bao Loc.\n\nBảo Lộc is a city of Lâm Đồng Province in the Central Highlands region of Vietnam. Bảo Lộc is famous for its registered trademark: B’lao tea. As of 2003, the town district had a population of 151,915. The district covers an area of 229 km2.\n\nMeals: Breakfast, Lunch, Dinner\nOvernight at hotel in Bao Loc"},{"title":"BAO LOC MOTORBIKE TOUR DALAT ( 140 KM – 5 HOUR RIDE) (B/L/D)","description":"Leaving Bao Loc for Dalat, visit the green tea farms, the cascade waterfall, Pongour, mushroom farms, silkworm villages, and silk processing chains, coffee plantations, mushrooms, vegetable, and flower farms, visit the highlights of the city like Crazy House, Flower Market, Dragon Pagoda. Arrive in Dalat around 5 pm.\n\nĐà Lạt, the capital of Lâm Đồng Province in southern Vietnam’s Central Highlands, is centered around a lake and golf course and surrounded by hills, pine forests, lakes, and waterfalls. Known as the “City of Eternal Spring” for its distinctive temperate climate, Đà Lạt was developed as a resort by the French in the early 1900s, and many reminders of its colonial heritage remain.\n\nMeals: Lunch, Dinner."},{"title":"DA LAT OFFROAD MOTORBIKE TOUR TO BUON MA THUOT VIA LAK LAKE ~ 200 KM (B/L/D)","description":"After having breakfast at hotel, we’ll jump on our iron horses then keep riding to Buon Ma Thuot via Lak Lake. On the way, you can take a quick visit at the crazy house, travel along the country road to see the entire agriculture farm such as vegetable farm, greenhouse flower farm, coffee plantation, a visit of silkworm factory, rice wine making and elephant waterfall.\n\nArrive at Lak Lake with a visit to the “Jun” Minority Village (M’Nong). Crossing the Lak Lake by boat to Lieng minority village, with many opportunities of taking pictures of people farming and fishing\nOvernight at hotel in Buon Ma Thuot."},{"title":"BUON MA THUOT OFFROAD MOTORCYCLE TOUR TO NHA TRANG ~ 210 KM (B/L/-)","description":"Today, we say goodbye to the land of Coffee – Buon Ma Thuot to ride straight to Nha Trang. On the way, you have half an hour trekking to the top of the Elephant rock mountain, back on the road again, on the back of the motorbikes you will have opportunities to observe the panorama view of rice paddy field along the road, and then, a quick visit to the Ede Minority Village.\n\nOne more waterfall name: Dray Nao waterfall between Lak Lake and Nha Trang, Descend along the Phoenix Pass (affect by Agent Orange) and a visit the Hot spring, the brick-making factory, 20 km ride along the beach will lead you to the most Charming beach in Vietnam: Nha Trang beach then check in at hotel.\nOvernight at hotel in Nha Trang."},{"title":"NHA TRANG SIGHTSEEING TOUR (B/L/-)","description":"08h30: Pick up at hotel & transfer to Cau Da harbor.\n09h00: Take a boat trip to visit Bays in Nha Trang, which includes 19 big & small islands with imposing beauty.\n10h00: Visit Hon Mun’s Preservation Area of Oceanic creatures. On this island, you will be steeped in the transparent cool water & diving to explore the coral reefs having been formed for 200 years with many kinds of precious fishes.\n12h00: Come to Hon Mot Island for lunch on the boat. After having lunch, you may engage in a dancing & singing performance with many other visitors all over the world meanwhile enjoy free fruits & grape wine.\n13h30: Arrive at Hon Tam Island, visit the statue of My Nhan Ngu & participate in sporting events in the water like Jeski, Gliding, volleyball….(Pay for yourself)\n15h00: Visit fishing Village to learn more about their daily local life & get on the small bamboo boat to floating rafts.\n16h00: Get back to Cau Da pier & transfer to hotel.\nOvernight at hotel in Nha Trang."},{"title":"NHA TRANG MOTORBIKING TRIPS TO MUI NE CAPE (B/L/-)","description":"After having breakfast at hotel.\n\n8h00: Our motorbike tour will start leaving to Mui Ne, on the way we will stop by Ca Na and some other beautiful beaches to take a break as well as photos or if needed, you can jump on the sea to soak up yourself.\nUpon arrival in Mui Ne, we’ll check-in at hotel then ride to a local restaurant for lunch. This afternoon, we will ride our bikes to visit Fishing villages, Hong Stream, Golden Sand Dunes and Flying Sand Dunes, right here you can engage some optional outdoor games to make funs by yourself such as skating on sand or flying a kite…\n\nLast stop is at Bau Sen – a vast sand dune which has inspired numerous photographers for many years\nThe rest of time, you could take a bath on Mui Ne beach and view sunset.\n\nOvernight at hotel in Mui Ne"},{"title":"MUI NE MOTORBIKE TOUR TO VUNG TAU VIA PHAN THIET (B/L/-)","description":"Breakfast at your hotel & check out. Back on our “steel horses” and we will keep riding along the coastal paved road, passing quiet pine forest of Loc An and we arrive Binh Chau hot spring, take a mud bath and relax on Hot Spring Lake. Having lunch at a local restaurant en-route.\n\nIn the afternoon, we’ll keep on riding to Phuoc Hai hamlet, we will be impressed by the beautiful scenery, especially the sections of road straddled by mountains and beaches then Minh Dam historical mountain and Long Phuoc Tunnels before reaching Vung Tau.\nUpon arrival, you’ll check in at hotel and relax by yourself.\n\nOvernight at hotel in Vung Tau."},{"title":"VUNG TAU MOTORBIKING TOURS BACK TO SAIGON – DEPARTURE (B/L/-)","description":"Breakfast at your hotel & then you’ll be at leisure on the beach or hanging around Vung Tau city till the time to ride back to the Tan Son Nhat airport in Saigon for a flight home."}]},{"name":"Vietnam Beach Paradise - Halong Bay/ Mui Ne","duration":9,"travelStyle":["Beach","Group","Partially Guided","Holiday"],"oldPrice":1476,"price":797,"summary":"Mui Ne is listed in 20 idyllic beaches among Asia and results as the perfect place for adventurers who can enjoy activities such as kite-surfing, windsurfing or sand-boarding on its very famous sand dunes. Besides that, you can leisure on your own cruising in Halong Bay and explore the islands surrounding.These treasures of Vietnam is a perfect getaway for people who want to enjoy beach holiday in Asia. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136938_38cf44aa.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136938_38cf44aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_9d61a992.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_a1abc1a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_bcbaf105.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_1136ea5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_d25cc736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_1a60594f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_6de35b26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_5c595a79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_908b3e3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_a1c6c500.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_9b66a61b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_b052b6d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_68d3bca1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_d8b71ef8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136938_5ec1c83c.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Mui Ne"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival to Vietnam. Your private driver will meet you at the airport and transfer you to the hotel. Check-in to the hotel and have some rest after the flight. Remaining part of the day is at your leisure. You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day by yourself return to the hotel for a relaxing sleep. "},{"title":"EXPLORE THE LANDING DRAGON - HALONG BAY - SHARING CRUISE/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise at 7:30 am. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat.\nOvernight on cruise\n(Meals: breakfast, lunch, dinner)"},{"title":"MORNING RISE IN VIETNAM'S MOST FAMOUS BAY (B/L)","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites or at the floating village. From here, you will sail back to the main harbor and return to Hanoi (around 16:30-17:00). Drop at hotel in Hanoi. Free at your leisure time.\n(Meals: breakfast, lunch)"},{"title":"ESCAPE FROM CITIES' HUSTLE WITH BA VI ECO TOUR (B/L)","description":"08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive your Mr Duoc’s house with a welcome drink. 10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place that to enjoy beautiful scenery of the village. This Tea Plantation plays important role in providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea. Mr Duoc is a veteran in Vietnam War and the owner of a large tea farm. He also is an expert in handling the raw tea leaves, he will introduce you how to make a good green tea before selling. You will have great time listening to the host’s stories of his life in Vietnam war and enjoying the tea with green lentils or lotus seeds that made by his family. 11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you will have great time to enjoy lunch with food you done. 12:30: Have lunch with the host’s family and short break after lunch. ( Meals: breakfast, lunch)\n- Back to your hotel and ready for pick up to the airport for flight to Ho Chi Minh City - "},{"title":"DISCOVER THE FASCINATING CU CHI TUNNEL AND TRANSFER TO MUI NE (B)","description":"Have breakfast and check-out from the hotel. Depart for Cu Chi tunnel at 8:00 am, the trip will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time exploring the remaining area and tunnel systems which includes the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon at 14:00, to pick your luggage up at the hotel and short break. Transfer from Ho Chi Minh city to Mui Ne beach! \nOvernight in Mui Ne\n(Meals: breakfast)"},{"title":"IT'S TIME FOR THE BEACH - MUI NE LEISURE (B)","description":"Have a leisure day exploring Mui Ne beaches or just relax at your resort.\n(Meals: breakfast)"},{"title":"BEACH TIME IS NEVER ENOUGH - MUI NE LEISURE (B)","description":"Have a leisure day exploring Mui Ne beaches or just relax at your resort.\n(Meals: breakfast)"},{"title":"LEISURE TIME IN MUI NE AND TRAVEL BACK TO HO CHI MINH CITY (B)","description":"Leisure day on the beach – Then we will transfer you back to Ho Chi Minh City in the afternoon by private vehicle.\nOvernight in Ho Chi Minh City \n(Meals: breakfast)"},{"title":"BIGGEST FAREWELL AND WARMEST THANK YOU - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones. Later, proceed for departure and board your flight back home.\n(Meals: breakfast)"}]}]