[{"name":"Sapa Adventure (3 destinations)","duration":5,"travelStyle":["Hiking & Trekking","Adventure","Attraction-Based Hikes","Group","Fully Guided","Holiday"],"oldPrice":0,"price":350,"summary":"Northwest Vietnam is a captivating mix of dramatic mountainscapes, crisp fresh air and colourfully-clothed hilltribes. Set on the slopes of a beautiful emerald green valley, Sapa is the heart of this unique piece of Vietnam. Travel to this peaceful land and meet resplendently dressed ethnic minorities at the local market, visit neighbouring villages and hike through iridescent rice terraces, witnessing how the current of life has bubbled along here for centuries. This five-day trekking adventure is full of opportunities to be immersed in traditional hilltribe culture and cuisine, while relishing the striking landscapes of Sapa and its surrounds.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142925_e01ebbe9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142925_e01ebbe9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_fc16cdf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_125df01e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_f897a922.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_b7bbcc5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_17612158.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_8678e59e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142925_a255c720.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. A welcome pack containing a welcome letter, your trip itinerary, a Sapa information sheet and feedback card will be waiting for you at your hotel. Please ask your hotel's reception for the Intrepid welcome pack upon arrival. In any free time, dive into the barrage of bikes, boulevards and bustling life that characterise Hanoi. Take time to explore the French colonial architecture that decorates the tangled laneways, indulge in a decadent Vietnamese coffee while people-watching from street-side cafes, or step back in time on an exploration of the Old Quarter. This evening you will be picked up by your local guide from your Joining Point Hotel (see below), or from an alternate hotel located in Hanoi's Old Quarter (advised prior to departure), between 6.30pm-7pm. Your guide will first take you for an included dinner and to explain more about the Sapa region. After dinner, you'll be transferred to the train station, where your guide you will give you your tickets for the return train journey. Say farewell to your local guide before you board the overnight sleeper train bound for Lao Cai (departing approximately 9.30pm, approximately 8 hours journey time). The train journey is unaccompanied, and you may be sharing with locals or other travellers."},{"title":"Day 2: Sapa Trek","description":"You’ll be met on arrival into Lao Cai in the early morning (approximately 6.00 am), and meet your local driver. Your driver will be picking up several other passengers travelling on to Sapa. Transfer to Sapa by minibus (approximately 1 hour), passing through dramatic scenery along the way. You have a free morning to relax and explore this fascinating hillside town. If the weather is feeling generous, enjoy unhindered views out towards the giant staircase of rice terraces that cascade down the side of the mountains. Otherwise, delight in the enigmatic mists that often shroud the Sapa hillsides. In the afternoon, begin a guided 2-3 hour moderate trek down to the hilltribe villages of Cat Cat, often taking a paved path and passing a waterfall. The villages are home to the H'mong people who originated from China about 300 years ago. The H'mong people are easily recognisable by their dark-blue or black clothing. The dye is made from the indigo plant, which is native to the area. H'mong women wear long aprons with embroidered waist-coats and have their hair rolled up into a turban-like hat, while the men wear a black skullcap. You are likely to encounter local H’mong traders, who are often described as persistent and aggressive in their sales techniques. Please respect that this approach is usually the result of the competitive nature of business, and only purchase items if you wish too. In the late afternoon, return to Sapa to spend the night in a hotel."},{"title":"Day 3: Sapa Trek","description":"This morning after storing you main luggage at your Sapa hotel, set off on a six hour guided trek (approximately 12 - 15 kilometres). Pass along buffalo paths and trails, as well as through several hilltribe villages and resident minority groups such as Red Zao and Tay people. This is a spectacular walk, winding through stunning scenery and elegant rice paddy terraces. Be sure to watch your footing here as there can be uneven slopes, muddy patches, and rocky inclines. The idyllic countryside scenes are like something out of a storybook, and you will encounter some of the friendliest people you could ever hope to meet. Stop for a picnic lunch along the way, and finally spend the night in the home of a Zay family in Ta Van Village. Perhaps take some time to explore the village after you arrive, wandering down to see the locals paddling in the Mua Huon River and the Hmong guys cruising around on their motorbikes. You’ll enjoy an included meal of delicious Vietnamese dishes for dinner tonight, prepared by your hosts."},{"title":"Day 4: Sapa/Overnight Train","description":"After a hearty, energy-giving early breakfast, set off on a 2-3 hour walk to Su Pan Village. Today’s trek is shorter, but the scenery is still beautiful. Take the road to Giang Ta Chai village of the Red Dzao minority via the paths between terraces and through bamboo forests. Walk past waterfalls where buffalo might cool themselves from the heat and cross a suspension bridge. Be sure to take it all in and make the most of the last of your time in these incredible surroundings. Cross Muong Hoa River, then head up to the mountain to visit the last village of the trek – Su Pan. Maybe grab a quick bowl of pho before meeting up with your vehicle for the 30 minute drive back to Sapa. Arriving in Sapa, you have a free afternoon to explore the town. Maybe get a massage to sooth trek-tired muscles, check out the local market selling produce, herbal remedies, and (very fresh) meats, pick up any Hilltribe crafts you might have had your eye on, or sit back with a drink while you look over the misty mountains. You will be picked up from your Sapa hotel between 5-5.30 pm today by a local driver. You’ll then be transferred back to the to the Lao Cai train station this afternoon (approximately 1 hour). You will have some free time for an optional dinner before you board the overnight train to Hanoi. Boarding commences approximately 7.30pm for an 8.30 pm departure (journey time approximately 8 hours)."},{"title":"Day 5: Hanoi","description":"Your adventure ends upon arrival at Hanoi train station in the early morning (around 5am). The rest of the day is free for you to soak up the grace of this dynamic city that's the epitome of modern Vietnam."}]},{"name":"Vietnam - North to South 10 days (incl. 1 free data sim card + entry to the Artinus 3D Art museum)","duration":10,"travelStyle":["Adventure","Family","Private","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":712,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Snorkel in Halong Bay","Explore the emerald waters of Luon Cave","Float down the Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100047_2ec113.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100047_2ec113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b16df848.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_34e6c5f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b9415985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_953b1eba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_9d8320c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_78e32f0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_eefbb66f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_0e0f7c74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_a92e17ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_87d21746.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_4f997422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_c6b69a1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_1c01c8ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_d9f08c2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_98998448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_d3dda285.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_b44453ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_bb361da8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_83a2b202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_7a5e76ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_efc3ed13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_281e6007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100047_90a6e012.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1 HA NOI ARRIVAL","description":"Meal not included\nOn arrival Ha Noi capital, we will see at the airport have private transfer to center for check in hotel. You have free time for leisure.\nOvernight in Hanoi."},{"title":"Day 2 HA NOI – HA LONG","description":"Meal included: Breakfast, Lunch,Dinner\n(Your hotel – Tuan Chau marina – Halong bay – Lunch– Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities)\n07.45 – 08.15 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n– Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n– Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is served\n– Join us for a typical local lunch in the dining room or at the outdoor dining area.\n\nAfternoon\n– Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n– Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n– Heading back toward the sleeping area\n\nEarly evening\n– Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n– An authentic Vietnamese menu is served\n– After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…Overnight on cruise"},{"title":"Day 3 HA LONG - HANOI","description":"Meal included: Breakfast, Lunch\n(Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\nLocal breakfast is served\n\n08:00\n– Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n– Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n\n09:00\nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30 – 17:00.\n\nOvernight in Ha Noi"},{"title":"Day 4 HA NOI CITY TOUR - DA NANG ARRIVAL BY TRAIN","description":"Meal included: Breakfast, Lunch.\nIn the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\nFree time in the afternoon until 06:30PM\n06:30PM: Private car pick up to train station, take train to Da Nang.\nOvernight on train - soft sleeper, air condition, 4 berth/cabin."},{"title":"Day 5 DA NANG ARRIVAL – HOI AN ANCIENT TOWN","description":"Meal not included.\n12:00PM: Arrival Da Nang train station, transfer to Hoi An Town\nAfternoon: You are free to discover the ancient town: Japanese Bridge, lantern road, traditional tailor shop, enjoy the specialities. Besides, you can view sunset at Cua Dai beach.\nSpend overnight in Hoi An."},{"title":"Day 6 MY SON HOLLYLAND – TRADITIONAL VILLAGE","description":"Meal included: Breakfast, Lunch\n8.00 – 8.30: our guide pick you up at your hotel and depart to My Son holy land - the world cultural heritage. \n10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on!\n12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air.\n13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends!\nOvernight in Hoi An."},{"title":"Day 7 HOI AN – DA NANG – HO CHI MINH CITY ARRIVAL","description":"Meal included: Breakfast.\nAfter breakfast, you are free until airport transfer. You take a flight to Sai Gon. On arrival Ho Chi Minh City, we will see at the airport and transfer to center for checking in hotel. You are free time for leisure. Spend overnight in Sai Gon."},{"title":"Day 8 MEKONG DELTA (MY THO & BEN TRE)","description":"Meal included: Breakfast, Lunch\n8.00am depart to My Tho city, 1.5 hours drive.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people.\n• The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake.\n• The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree.\n• Having lunch at local restaurant. After lunch, we will freetime for biking, walking.\n• 3.00 Back Saigon. On the way, we will stop at vinh Trang Pagoda. 5pm get back to Saigon.\nStay overnight in Ho Chi Minh"},{"title":"Day 9 CU CHI TUNNEL 1/2 DAY","description":"Meal included: Breakfast.\n08:30 We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\n14:30 The bus back HCM.\nSpend overnight in Ho Chi Minh."},{"title":"Day 10 HO CHI MINH DEPARTURE","description":"Meal included: Breakfast\nAfter having breakfast at hotel, you have relaxing time in Ho Chi Minh city until transfer to the airport for the flight back home. See you again!"}]},{"name":"Vietnam Adventure Tour","duration":9,"travelStyle":["Independent","Custom","Partially Guided","Holiday"],"oldPrice":2253,"price":1802,"summary":"\tDiscovery Nomads offers truly independent tours. No tour guides, no group leaders: Experience the freedom of solo travel where you have the time to go where you want to go, meet who you want to meet, and do what you want to do. Discovery Nomads organises 4 star hotel accommodation, comfortable and fast transportation by train or plane, sightseeing tours with local guides, and activities where you'll get to skip those long lines!\n\tWith Discovery Nomads, you get to travel in style independently, see the famous sights you've read about, and order additional services while still having the freedom to do what you want.\n\tTake a trip along the coast of Vietnam, from bright Hanoi and stunning natural beauty of Halong Bay to the imperial capital of Hue, azure beaches of Da Nang and the chaotic Saigon.","highlights":["Explore Vietnam from North to South","Cycle the streets of Hanoi","Cruise Halong Bay exploring floating villages","Discover the iconic Thien Mu Pagoda","Relax on sandy beaches of Da Nang","Enjoy Ho Chi Minh City by night","Guaranteed departures"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d319b95.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d319b95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d327b50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d329bd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d32b907.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d32e5fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d33054e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/84954_5e31d4d333978.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1 Hanoi","description":"Arrive in Hanoi before 12 PM. Enjoy an evening tour of Hanoi's food hotspots, explore the historic and lively old quarter and sample traditional Vietnamese cuisine and delicacies."},{"title":"Day 2-3 Hanoi/Halong Bay","description":"Today you will enjoy a full day boat trip along Halong Bay. The epic landscape of Halong Bay has beckoned dreamers to Hanoi for centuries. Experience the majestic bay in 1-day while on board a traditional Chinese boat, and visit the magical grottoes that have charmed visitors for years."},{"title":"Day 3-5 Hue","description":"Flight to Hue. On Day 4 explore the Imperial Citadel, visit the tombs of King Khai Dinh and Ling Minh Mang and relax on the Perfume River and at a beautiful pagoda temple​."},{"title":"Day 5-7 Hoi An","description":"Private transfer to Hoi An (120km). Stop at Marble Mountains, see Da Nang Beach, a famous beach of Vietnam, visit the Hai Van Pass and Lap An lagoon, drive along the Sea Cloudy Pass. On Day 6 visit the spectacular Ba Na Hills on a full-day trip. See the exquisite Linh Ung pagoda, cross the famous Golden Bridge, visit the large Buddha, take a leisurely climb up Chua Mountain and explore ancient wine cellars."},{"title":"Day 7-9 Ho Chi Minh City (Saigon)","description":"Transfer to Danang and flight to Saigon. Explore the largest city in Vietnam with its open-air concerts, flickering neon lights and crowded markets. Visit Notre Dame, City Hall, stroll through the colonial streets or go to Ben Thanh Market. On Day 9 enjoy a day trip to Mekong Delta, visit Vinh Trang Pagoda, the largest Buddhist temple in Tien Giang Province, enjoy boat cruising through a beautiful river and a delicious local lunch in a restaurant."}]},{"name":"The Best of Vietnam","duration":11,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":875,"summary":"Start in Ho Chi Minh City and end in Hanoi! With the Discovery tour The Best of Vietnam, you have a 11 days tour package taking you through Ho Chi Minh City, Vietnam and 6 other destinations in Vietnam. The Best of Vietnam includes accommodation, an expert guide, meals, transport and more.","highlights":["Crawl through the immense network of underground tunnels in Cu Chi","Delve into the culture of Hue with unique food and culinary insights","Relax on a boat ride of the Mekong Delta, the ‘rice bowl’ of Vietnam"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101726_1bda2c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101726_1bda2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_e6c19669.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_d7b02cc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_03109460.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_2350c273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_a90126cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_078ad999.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_f2ae2807.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_96b849a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_61d52351.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_a0f591ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_2889352c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_adfea764.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_73581f2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_a217698b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_ddf4b6a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_8750cb8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_418f7cdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_9d0d3f16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_18bec1bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_b0ed1c9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_8db2d80c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101726_41648934.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Saigon","description":"Welcome to Saigon  Vietnam! \nUpon arrival, transfer from Tan Son Nhat airport to the center of Saigon then check-in at hotel. At leisure to relax and get rid of jet lag. Overnight in Saigon. \nMeal: Nil \nPlease note: Hotel check-in time is around 14.00. "},{"title":"Day 2: Saigon City Tour - Cu Chi Tunnel (B/L)","description":"We start the city tour at the Reunification Palace, the witness of the fierce Vietnam War ended in 1975. The grand building today is a Museum and Hall of official receptions. Nearby the Palace are the colonial-styled Central Post Office and the Notre Dame Cathedral, built between 1877 and 1883 and one of the citys major landmarks. Our last stop this morning will be War Remnants Museum. \nLunch will be served at local restaurant. \nIn the afternoon, we drive overland to Cu Chi Tunnels, an incredible underground network constructed by Vietnamese guerrillas to protect the region against the American attacks during the Vietnam War. We can even crawl a part inside the tunnel, visit their infirmary, kitchen.... to discover how people had survived hereby. \nBack to your hotel later on. Overnight in Saigon \nMeal: Breakfast at hotel, Lunch at local restaurant. "},{"title":"Day 3: Saigon - Mekong Delta - Saigon (B/L)","description":"This morning, we leave Saigon for My Tho, in the heart of Mekong delta with visit to the beautiful Vinh Trang pagoda on the way. Upon arrival, we will take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh  a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit& honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy& observe the pastoral life as you roam through the fruit plantation and village. Overnight in Saigon \nMeal: Breakfast at hotel, Lunch at local restaurant. "},{"title":"Day 4: Saigon - Danang - Hoi An Ancient Town (B)","description":"Moring transfer to airport for your onwards flight to Danang. \nUpon arrival, picked up from Da Nang airport to your hotel in Hoi An to drop off luggage. \nTogether with our guide in Hoian, well walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, visit ancient houses and Trading Houses, pagodas and stroll into the market located by Thu Bon river, where we may find out the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. \nOvernight in Hoian \nMeal: Breakfast at hotel "},{"title":"Day 5: Hoi An - Tra Que vegetable village - Hoi An (B/L)","description":"Depart from your hotel and ride bicycle in 30 minutes to Tra Que herb village. Take a short stroll around the vegetable garden and listen to the history of the village. Then join gardening activities in preparing the land, fertilizing with seaweed, raking the ground, sowing, watering, picking vegetables... Enjoy foot soak before getting to preparing lunch with a local family. Join cooking with Tam Huu spring roll, Banh xeo - a local pancake of people in Viet Nam middle region ... After your morning excursions and lunch, you learn how to harvest and wrap the vegetables. Bid farewell to your host family before riding back to the hotel.\nOvernight in Hoi An. \nMeal: Breakfast at hotel, Lunch at Tra Que vegetable village. "},{"title":"Day 6: Hoi An - My Son - Hoi An - Hue (B)","description":"Breakfast at hotel, we will then depart from Hoian to My Son, where you can discover the hidden treasure of the Cham culture that once rightfully developed in the location of present Central Vietnam. Thanks to the mystery and construction secrets of the Cham towers hereby, My Son had been also designated by UNESCO as one of the five World Heritages in Vietnam. \nDrive back to Hoi An for your onward bus transfer to Hue. \nOvernight in Hue \nMeal: Breakfast at hotel "},{"title":"Day 7: Hue City Tour - Street Food - Flight to Hanoi (B/L)","description":"Being recognized by UNESCO as the 1st Cultural World Heritage for Vietnam, Hue is highlighted by the old royal architectural works and the most traditional Vietnamese lifestyle. This morning, we will discover the charm of the city from the Royal Citadel, Forbidden City. Move on to the colorful Dong Ba market where you can see many of ingredients for making Hue local food, and explore the local business life. \nThe best way to explore local culture is through its unique cuisine. Around noon time, we shall embark on a special street food tour to discover another side of Hue. Our journey start from Sticky rice dumplings on a fried dumpling (Ram It) or Filtered tapioca dumplings (Banh Loc) to the well-known Hue beef vermicelli soup (Bun Bo Hue). The street food tour stops at a small restaurant serve Sweet soup (Che), a scrumptious local delicacy made of tapioca and various local ingredients. Or, if sweet soup is not your style, a Vietnamese coffee with condensed milk awaits. \nHeading straight to Hue airport for your onward fligth to Hanoi. Overnight in Hanoi. \nMeal: Breakfast at hotel, Lunch at local restaurant. "},{"title":"Day 8: Hanoi City Tour (B/L)","description":"Breakfast at hotel.\nIt is your day to visit the Capital of Vietnam today. Let's start from the Ho Chi Minh Mausoleum, his simple house-on-stilts and the One-Pillar pagoda near Ba Dinh Square, where the most solumn ceremonies of Hanoi take place. Go on to Tran Quoc pagoda and the Temple of Literature, the very first high school of Vietnam Scholars. \nAfter lunch at local restaurant,, we will visit Hoan Kiem Lake - the heart and soul of Hanoi. \nIf today is Tuesday, Thursday, Saturday or Sunday, move on to MUSEUM OF ETHNOLOGY. This superb museum showcases the depth of Vietnamese cultural diversity with an astounding collection of 15,000 artifacts gathered from throughout Vietnam. Maps, displays and dioramas are labeled in Vietnamese, French and English. Displays portray a typical village market, the making of comical hats and a Tay shamanic ceremony; videos show the real thing. You can also check out a traditional Black Thai house reconstructed in the museum. There's also a Centre for research and conservation where scientists from all over the world study traditional Vietnamese cultures. \nIf today is Monday, Wednesday or Friday, depart for Bat Trang ceramic village which is about 20 km away from Ha Noi, this is pottery village with a half- millenary historic development. \nBack to your hotel in Hanoi later on to relax. Overnight in Hanoi. \nMeal: Lunch at local restaurant. \nPlease note: Ho Chi Minh Mausoleum closes on Monday and Friday "},{"title":"Day 9: Hanoi - Halong Bay/ Lan Ha Bay - Overnight Cruise (B/L/D)","description":"If you wish to see how the Hanoi people rise and shine in the morning, wake up early and run to a lake close by your hotel, you can join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi quan, jogging, martial arts, classical dance and so on. After breakfast at the hotel, we will head to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006, and check-in our overnight boat. Enjoy a trip on Halong with stops to visit caves or to swim and enjoy the sunset on the sea. Dinner with fresh seafood! Overnight onboard. \nMeal: Breakfast at hotel, Lunch and dinner on board. \nPlease note: The program may change due to the weather without notice. "},{"title":"Day 10: Halong Bay/ Lan Ha Bay - Hanoi (B/Br)","description":"Morning wake up with a taichi-quan or yoga exercises guided by the crew before having breakfast whilst your boat goes on between Halong islets. Return to the Wharf to be back to Hanoi by shuttle bus at midday. Arrive in the city around 3-4pm. Overnight in Hanoi. \nMeal: Breakfast and brunch on board. "},{"title":"Day 11: Hanoi Departure (B)","description":"After breakfast, free at leisure for relax or shopping (your own arrangement) before transferring to the airport for your onwards flight back home. End of service. \nMeal: Breakfast at hotel \nPlease note: Hotel check-out time is around 12.00. "}]},{"name":"10-Day Relaxing from Ho Chi Minh city to Hanoi with Phu Quoc island & Halong Bay (FREE 1 DATA SIM CARD)","duration":10,"travelStyle":["Adventure","Private","Fully Guided","Discovery","Holiday"],"oldPrice":0,"price":868,"summary":"\n\tGuaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!\n","highlights":["Explore Ho Chi Minh City","Visit the Unicorn Island in Vietnam","Experience the local wine in Dinh Cau Temple"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100045_7a0513.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100045_7a0513.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_72359cc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_f05a366c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_ef00d434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_37d91ed8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_4223ce85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_8fa6642c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_52a893c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d0f675ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_b8b1267f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_08516ee7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_e26b993f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_e274ebed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_c185ea5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_bb8f029d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d63ccee4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_d21e12bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_543f1058.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_48861994.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_1bed04aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_f0cc72ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_2ae929b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_7b2eed1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100045_bf9a4a77.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Phu Quoc Island","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 HO CHI MINH CITY ARRIVAL","description":"Meal not included\nOn arrival Ho Chi Minh City, our car pick you up at the airport and drive to Ho Chi Minh city center. You have free time for leisure.\nSpend overnight in Ho Chi Minh city."},{"title":"Day 2 CU CHI TUNNELS AND HO CHI MINH CITY TOUR","description":"Meal included: Breakfast, Lunch.\n08:30 We depart to visit Independence Palace, also known at the Reunification palace, was built on the sight of the former Norodom palace. The Independence palace is a widely known landmark of Ho Chi Minh City and was designed by the architect Ngo Viet Thu. It was the sight of the end of the Vietnam/American war in 1975, as a North Vietnamese army tank crashed through the gates. The tank is still located at the Independence Palaces’ property.\nContinue seeing the beautiful structures from the French Colonial times such as the Notre Dame Cathedral, the historic Central Post Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast display of the both the Indochina wars. In courtyard massive military vehicles are for exhibition as well as tiger cages for the visitor to get a feel on how it was to be a prisoner during wartimes. In the museum building itself, each floor will represent a separate theme from the war and the war crimes committed towards the Vietnamese people.\nWe drive from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\nSpend overnight in Ho Chi Minh city.\n"},{"title":"Day 3 MEKONG DELTA (MY THO – BEN TRE)","description":"Meal included: Breakfast, Lunch.\nDeparture 7:45 AM\nAn unforgettable way of seeing the Mekong Delta to drive along the provincial roads down on the Southern region of Vietnam through paddy rice field, pine-apple plantation, orchard and small hamlets (2 hours drive)\nAfter arrival in My Tho, you will ride on a local motor boat along Dragon Island, Unicorn Island, Phoenix Island, Turtle Island and stop at the famous Unicorn Island. While at the Unicorn Island, you will take a short trek and go for a rowing boat trip. You will also enjoy tropical fruits in an orchard, natural pure honey at a bee farm and traditional music.\nFrom there, you will continue your motor boat trip to Ben Tre province to visit Mekong people handmade coconut candy. Then change to a small motor boat and travel along the lush, green canals, and stop at Mien Tay restaurant to enjoy Vietnamese lunch and bicycle riding around the village. 03:00PM transfer by bus to Can Tho city.\nSpend overnight in Can Tho."},{"title":"Day 4 CAN THO – CAI RANG FLOATING MARKET","description":"Meal included: Breakfast\n7:00 AM After breakfast, take the morning boat trip to visit the Phong Dien floating market which is at its busiest at this time of day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Visit a second floating market (Cai Rang). Break for lunch. \n2:00 pm Bus will drive you to Rach Gia.\n05:00pm Arrive in Rach Gia, you are free to enjoy the peaceful landscapes in Rach Gia.\nSpend overnight in Rach Gia.7:00 AM After breakfast, take the morning boat trip to visit the largest floating market in Can Tho (Cai Rang) which is at its busiest at this time of day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Walk through the fruits garden, see the process of noodles making. Break for lunch. Return to Ho Chi Minh City.\n2:00 pm   Change to public bus will drive you to Rach Gia city.\n05:00pm   Arrive in Rach Gia bus station, transfer to the hotel, you are free to enjoy the peaceful landscapes in Rach Gia.\nSpend overnight in Rach Gia."},{"title":"Day 5 HYDROFOIL FROM RACH GIA TO PHU QUOC ISLAND","description":"Meal included: Breakfast, Lunch, Dinner\n8:00am Hydrofoil from Rach Gia ferry to Phu Quoc island.\n10:30am Arrived to Phu Quoc ferry, transfer by van to hotel, check in.\n12:30 Have lunch at local restaurant, check in\n14:30 Star for Eastern island:\n-Pepper garden, be captivated by word of “itsy-bitsy teeny weeny peppercorns” of patient growers\n-Ham Ninh ancient village, enjoy fresh seafood (personal charge)\n-Tranh Stream: waterfall is beautiful in Phú Quốc.\n-Hung Long/ Phap Quang Pogoda located on high hill, overlook to town\n-Back to Duong Dong town, stop at a Sim wine distillery, taste the local wine\n-Dinh Cau Temple, the savior of local fishermen\n-Have dinner at local restarant\nBack to hotel. Spend overnight in Phu Quoc."},{"title":"Day 6 SAO BEACH OR SNORKELING TOUR","description":"Meal included: Breakfast, Lunch, Dinner\nAfter breakfast, start to explore:\nOption 1: Excursion tour\n8g00: transfer to the South of island and visit:\n-Fish sauce workshop: learn about the fish sauce production and enjoy the unique aromatic flavor of Phu Quoc fish sauce\n-Have lunch\n-Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments.\n-Coconut prision: which was built in 1949-1950 by the French colonists to jail those considered specially dangerous to the colonist government\n-Sao beach – one of the most beautiful beach in the South East of Phuquoc island. Relax and swimming, have lunch here\n-Have dinner at local restarant\nOption 2: Snorkeling tour\n8g00: transfer to the South of island and visit:\n-Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments.\n-Then, go to pier, get on board for snorkeling and fishing. The snorkeling set is ready for you to enjoy the colorful life of coral reef and of the fish under water. Have lunch on board\n-Go back to pier and transfer to Sao beach – one of the most beautiful beach in the South East of Phuquoc island\n-Back to hotel\n-Have dinner at local restarant.\nSpend overnight in Phu Quoc."},{"title":"Day 7 PHU QUOC - HANOI","description":"Meal included: Breakfast\nHave breakfast at hotel, free at leisure, check out and then transfer to Phu Quoc airport. Take a flight to Ha Noi. \nArrive in Hanoi, our driver will pick you up at airport to hotel. After checking hotel, you have more freedom to sightseeing fantastic landscape nearby. Some places recommend is visit Ho Chi Minh Mausoleum and Museum, One Pillar Pagoda, Ethnology museum, Military Museum or Fine Art museum, Hoan Kiem lake, Ho Tay,...\nSpend overnight in Ha Noi."},{"title":"Day 8 HANOI - HA LONG BAY","description":"Meal included: Breakfast, Lunch, Dinner\n(Your hotel – Tuan Chau marina – Halong bay – Lunch– Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities)\n07.45 – 08.15 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n– Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n– Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is served\n– Join us for a typical local lunch in the dining room or at the outdoor dining area.\n\nAfternoon\n– Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n– Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n– Heading back toward the sleeping area\n\nEarly evening\n– Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n– An authentic Vietnamese menu is served\n– After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 9 HALONG BAY– HANOI","description":"Meal included: Breakfast, Lunch.\n(Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\nLocal breakfast is served\n\n08:00\n– Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n– Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n\n09:00\nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30. \nStay overnight in Ha Noi."},{"title":"Day 10 HA NOI DEPARTURE","description":" \nMeal included: Breakfast\n \nBreakfast at hotel, free time for leisure. Our car transfer you from hotel to the airport, take the flight back home. See you again."}]},{"name":"Northern Vietnam Escape: Sapa And Surrounds","duration":5,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":925,"price":786,"summary":"This Trip takes you out of the hustle of Hanoi and into North Vietnam's glorious national parks and UNESCO World Heritage Sites. Comfy overnight trains aren't just fun, they save you precious travel time, and will carry you through the jaw-dropping Ninh Binh province, the shimmering waters of Tam Coq and the rolling hills of Sapa, where you'll fall in love with the serenity and spectacular natural beauty of Vietnam, with included experiences like a boat ride through cave formations and and a local homestay showcasing an authentic side to this fascinating country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/174598_a9b23131.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/174598_a9b23131.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_c72822ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_6cda423d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_254d4b38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_d5baaf0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_955d4a1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_b3b95338.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_7651a2b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_002196cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_b2c0bad9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_e21138dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_bfdf6060.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_1c6dc3d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_e7b9465b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174598_bd8f413d.jpg"],"destinations":["Hanoi","Ninh Binh","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Hanoi to Ninh Binh","description":"Welcome to Vietnam's eroded and elegant capital Hanoi, with its gorgeous colonial buildings and intoxicating energy. For all its charms, we're headed out of the city to somewhere decidedly more peaceful...We've reached the UNESCO World Heritage site of Trang An. We'll be left speechless by the soaring limestone karst peaks set against vibrant greens. We'll visit the Ancient Capital of Hoa Lu - Vietnam's first centralised fuedal state from the 10th century - as well as the temples of the Dinh and Le dynasties whilst marvelling at the lush rice paddies. After a local lunch, we'll hop on a boat with our skilled rower, as she takes us on a tranquil journey through the winding rivers, natural caves and canals of Tam Coc. You've never seen natural beauty like this before, and this twisting ride is as mind-blowing as it is peaceful."},{"title":"Day 2: Ninh Binh to Overnight Train to Lao Cai","description":"This morning we'll take a bike ride through Tho Ha village, enjoying the dazzling greenery of the rural landscapes. Later today is your chance to engage in some agricultural activities such as catching crabs, fishing and transplating vegetables, before we return to the hamlet for a cooking class and lunch with a local family."},{"title":"Day 3: Overnight Train to Lao Cai to Sapa","description":"We've reached Lao Cai, the gateway to Sapa. After breakfast it's on to Cat Cat Village.Today is about enjoying the spectacular surroundings - discover cascading waterfalls and have your breath taken away by the terraced fields, vegetable patches and verdant hills. Continue to explore the breathtaking scenery by hiking to Muong Hoa Valley, home to the largest terraced rice fields in Sapa. Tonight, you'll get a real overview of the traditional customs and way of life with a local homestay, enjoying delicious local food and maybe some rice wine."},{"title":"Day 4: Sapa to Overnight Train to Hanoi","description":"Rise and shine, you don't want to miss a moment. Today you'll hike and ascend through the mountains taking in the views of the terraced rice and corn fields. Once arriving at Ta Phin Village you'll meet the Red Dzao and Black H'moug groups who live peacefully together in the village yet retain their distinctive cultures.We're heading back to Hanoi tonight on another overnight train..."},{"title":"Day 5: End Hanoi","description":"Our trip ends early this morning as we arrive at Hanoi station, a sharp jolt to the senses after all that serene nature. But this grand old capital has its own charms, and is just begging to be explored."}]},{"name":"Sapa Adventure: Hard Trekking for 6 days 5 nights","duration":6,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":398,"summary":"This six days hard trekking trip offers a chance to explore the most stunning area of Sapa district which is under protection of Hoang Lien Son nature reserve. Trekking from 6 to 7 hours every day you will follow foot paths up and down mountains, through forest, terraced rice paddies, crossing river and water streams by suspension bridges… from village to village of different ethnic minorities including H’mong, Zao, Tay, Xa Pho,.. paying visit to local homes, witnessing daily life activities and especially village home staying will bring the interesting insight of local life.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/148895_71aeb739.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/148895_71aeb739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_e368c8bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_8433e7dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_36c691a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_f4ac64cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_c3e22a2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_7c1333a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_dcfcda78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_2f9e7f67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_7deea5c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_0b0b16f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_679e3502.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_a27fd77e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148895_25e1cbec.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Take overnight train from Hanoi to Lao Cai","description":"Day 1: Take overnight train from Hanoi to Lao Cai\nBe ready at your hotel lobby at 8:00PM, our tour guide will meet and pick you up for a short transfer to Hanoi Railway Station to take the overnight train to Lao Cai City.\nOvernight on train"},{"title":"Day 2 : Sapa - Y Linh Ho - Lao Chai - Ta Van - Homestay ( B,L,D)","description":"Day 2 : Sapa  - Y Linh Ho - Lao Chai - Ta Van -  Homestay ( B,L,D)\nPicked up at Lao Cai Station upon your early arrival for over an hour drive uphill in a shared mini van to Sapa. After freshen up and Breakfast in a local restaurant, transfer 6km along the main road to a beautiful spot where your village trek begins\nThis part offers spectacular scenery of the highest part of Hoang Lien Son mountain range and in a nice day, Fansipan Peak can be seen. Crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. Here you will pay visiting to some H’mong families, watching them doing their daily works. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai, a large village of the H’mong and then following the river bank to Ta Van of the Zay people, paying visiting to local homes, village schools… you will enjoy much your cultural discovery of local ethnic peoples as well as breathtaking scenery of the Muong Hoa Valley. Tonight you will enjoy a home stay in Ta Van Village for an unique life experience. \nNight 2: Overnight at homestay in Ta Van Village"},{"title":"Day 3 : Ta Van - Giang Ta Chai - Su Pan - Ban Ho ( B,L,D)","description":"Leaving Ta Van village after Breakfast and following the foot path uphill, you will pass through impressive terraced rice paddies on the hill slopes before getting through a bamboo forest, a huge waterfall to Giang Ta Chai village of the Red Zao peoples. Walking around the village you will meet many women with their embroidery work to make their traditional dresses, occasionally you can see the blacksmiths making farming tools and even hunting riffles. Passing the Muong Hoa river again and then trek uphill to Su Pan village passing the rocks field with unique carving which is believed to be the messages of the ancient peoples. In this village you will see the special technique to build houses on the steep rocky land. From Su Pan trekking downhill for an hour, Ban Ho valley will opens wide in your sight. Arriving to Ban Ho of the Tay late in the afternoon, check in the spacious local house built on stilts for Dinner and Home stay. \n\nNight 3: Overnight at homestay in Ban Ho Village"},{"title":"Day 4 : Ban Ho - Nam Toong - My Son ( B,L,D)","description":"After Breakfast we spend an hours walking to explore Ban Ho, a large village of the Tay peoples who live on spacious wooden houses built on stilts and very well organized before ascending uphill to Nam Toong village of the Red Zao. The trail of this part is really steep but the higher you reach to, the more stunning scenery will open in your sight. The village locates on the top of a hill and almost isolated and the houses are rudimentary but the peoples are very welcoming. After Nam Toong, the trail winds its way up and down hill slopes for an hours to Nam Keng and My Son, the two small villages of the Xa Pho ethnic whose population is only about 4000 in Vietnam. Most of the Xa Pho are still living the most primitive way basing on forest gathering, hunting and practicing slash and burn agriculture. Every family here built a small house on stilts away form their living house to avoid catching fire for store their food and valuable property. You will stay overnight in this village.\nNight 4: Overnight in homestay"},{"title":"Day 5 : My Son - Thanh Phu - Sapa ( B,L,D)","description":"Wake up early for fresh air watching local life before Breakfast. The amazing thing here is watching children walking some kilometers up and down hill to school and it seems that they enjoy their school hours very much! Leaving this poor village, walking downhill to the river for a crossing and then uphill again to Thanh Phu, another Tay village where you will spend about two hours wandering around the village before Lunch. In the afternoon, continue trekking for few hours along the way back which offers panorama view of Ban Ho valley before picked up and drive back to Sapa by jeep. Check in hotel and your evening is free. \n\nNight 5: Overnight at basic hotel in Sapa Town"},{"title":"Day 6 : Sapa free day - Take a sleeper bus to Hanoi ( B,L)","description":"Today is set free for your own plan to explore Sapa town. Our recommend is to take a walk to Sapa market, where you can meet tribal ethnic peoples such as Black H’mong, Red Zao, Zay… from nearby villages come every day selling their farming, gathering products: Vegetable, bamboo shoot, mushroom… and of course handicrafts for souvenir. Continue walking the steps from the market to the church and then onto the top of Ham Rong Mountain where you can visit an orchid garden and a small museum about ethnic peoples of the Northwest.\nPicked up in the afternoon at about 3PM by mini van and head to bus departure point, tka ethe bus to get back Hanoi at around 10PM."}]},{"name":"Essence of Northern Vietnam 8 day","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":574,"summary":"This itinerary is an in-depth exploration of the culture, people and landscapes of northern Vietnam. Leaving the graceful boulevards of Hanoi behind, we explore rural Mai Chau and the amazing limestone landscape of Tam Coc, by bike and by boat. We continue to Sapa and take a step back in time to visit remote hill tribe villages surrounded by rolling green hills and mountain streams overlooked by dramatic limestone karsts. The trip's grand finale is at Halong Bay. We'll stay overnight on a comfortable junk boat, with island visits, delicious food, swimming, sunbathing and kayaking. A perfect end to our showcase of the cultural and scenic charms of northern Vietnam!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/167919_49d44894.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/167919_49d44894.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_28f2fedb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_8c83ff31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_ad577e4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_cd13604a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_57e81fd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_305218f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_a8398cd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_b52c1dad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_2a00bb6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_d90422e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_970f35d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_4ec21439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_fdb7044e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_672652c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_209af090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_4ea23b45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167919_da8a9a73.jpg"],"destinations":["Hanoi","Ninh Binh","Mai Chau","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Half day City tour","description":"Half day Hanoi city tour (by car or by motorbike – upon client’s interest) - Routes can change subject to client’s interest.\nBegin the first day of the trip with a tour of Hanoi. Depart from the hotel at 08:30 for a visit to Vietnam’s first university: the Temple of Literature. Founded in 1076, Quoc Tu Giam was established within a temple to educate Vietnam's royalty, mandarins and members of the elite.\n\nContinue with a visit to the iconic One Pillar Pagoda, one of Vietnam’s most iconic temples. Nearby is the mausoleum of the historic father figure of modern Vietnam, Ho Chi Minh, and his modest house on stilts. (Sites are viewed from outside; closed Mon and Fri and from Jun-Aug)\n\nWrap up the morning with a visit to the picturesque West Lake and its sixth century Tran Quoc Buddhist Pagoda.Tran Quoc Pagoda is regarded as the most ancient pagoda in Hanoi with its history line of more than 1,500 years.\n\nHave lunch at an authentic Vietnamese Restaurant. Free time at leisure for rest of the day.\n\nOptional: We introduce two one-of-a-kind traditional performances which are found nowhere else than in Vietnam. You can choose one of below options:\n\n- Water Puppet Show where puppets are performed on water stage with folk music, presenting ancient tales, folklores and daily life in Vietnamese countryside.\n\n- Tu Phu (Four Palaces) Show - a very unique show about ritual of spirit practiced in the Vietnamese indigenous religion with music, colors and lively dance performance. The Four Palaces Shows take place on Thursday and Saturday every week.\n\nIf you're interested in the shows, please contact our travel consultants to book.\n\nMeals: Lunch\nAccommodation: Hotel in Hanoi"},{"title":"Day 2: Hanoi – Ninh Binh – Hoa Lu & Tam Coc","description":"In the morning, our driver and tour guide pick you up at your hotel then depart for Ninh Binh.\nArrive in Hoa Lu Ancient Capital, visit two temples of King Dinh Bo Linh and King Le Hoan.\n\nThen our driver will transfer you from Hoa Lu to Tam Coc to have lunch in a local restaurant in Tam Coc and enjoy famous specialties of Ancient Capital area.\n\nIn the afternoon, Take a 5 minute walk to the wharf and start the 2 hour boat trip to visit 3 caves: Hang Ca (First Cave), Hang Hai (Second Cave) and Hang Ba (Third Cave). Each cave owns an unique scenery which will dazzle you as you get in.\n\nAfterwards, cycle for an hour to Bich Dong Pagoda and sight see beautiful scenic pagodas, lush paddy fields, mountains, river and caves. Then get on bus and our driver will take you back to Hanoi. When arrive in Hanoi, you will be dropped-off at your hotel. The rest of the day is at leisure\n\nOptional: Hanoi Walkie Foodie Tour\n\nYou will join in a walkie foodie tour. We will take you to go inside the small lane and alleys inside the Hanoi Old Quarter and show you how real Hanoians live, work and eat. By far our most popular tour, this tour is great fun and perfect way to discover some of the lesser known dishes that the locals lover to eat. From Bun Bo (Sauteed Beef Rice Vermicelli), Banh Cuon (Steamed rice rolls), “Banh Mi” and end with unique Ca Phe Trung (Egg Coffee) which will round off our four courses perfectly. Local life, local stories; local food and local drink tasting. It's the little things that make all the difference in your travel experience!\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Hanoi"},{"title":"Day 3: Hanoi – Mai Chau - Road transfer","description":"In the morning, pickup at your hotel and head to Mai Chau by van with a short break along the way.\nMid day, arrive in Mai Chau, enjoy welcome drink. Then enjoy traditional lunch in village (vegetarian available).\n\nIn the afternoon, bicycle ride with your tour guide, see farmers working in fields, locals weaving scarves and visit surrounding peaceful villages. Then you will have free time for bicycling, walking, shopping\n\nLate afternoon, return to the accommodation.\n\nOptional: Enjoy dinner with Thai’s traditional dance and drink the traditional liquor “ruou can”: 20USD/person\n\nOvernight in the communal stilt house or Valley View Bungalow\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Mai Chau"},{"title":"Day 4: Mai Chau – Hanoi – Night train to Lao Cai","description":"After breakfast, go with local tour guide to visit more remote rural villages Na Meo and Na Mo villages to understand more about their culture and customs. Mid day, back to the home stay for lunch and check-out. Free time for shopping and relaxing.\n15:00 – 15:30 Say goodbye to the family to get on the bus to drive back to Hanoi (3.5 ~ 4 hours drive). Arrive in Hanoi, drop you off at your hotel.\n\nFree time till picked up at hotel for transferring to train station for night train to Lao Cai.\n\nMeet at your hotel in Hanoi at around 20:00 hrs and transfer to Hanoi train station. Overnight train trip to Lao Cai in shared sleeping compartments (sharing with other passengers in 2 lower & 2 upper berths per compartment). Train departs at approximately 21:15 hrs.\n\nNotes:\n\n-\tOur tour guide will not accompany during the train trip\n\n-\tTrain schedule is subject to change.\n\n-\tPrivate compartments on request at surcharge.\n\n-\tTrain journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages complete the local experience.\n\nMeals: Breakfast, Lunch\nAccommodation: Overnight on train"},{"title":"Day 5: Lao Cai – Road transfer to Sapa – Y Linh Ho - Lao Chai - Ta Van","description":"Arrive in Lao Cai Train Station at around 05:00. Then take an one hour bus ride up hill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces that make Sapa famous with travelers. Early check in is possible when you arrive if the room available (with surcharge).\n9.30am: Meet up your local guide and start trekking. The first part is on the road but we soon turn to the right and walk on a small path down the valley to Y Linh Ho village settled down by the Muong Hoa River and from here to the Black H’mong village of Lao Chai. Black H’mong is one of the biggest minority groups in the Sapa area. They have their own language and wear traditional indigo blue clothing. The H’mong peoples have just recently changed their living way from sifting style into the sedentary one. So there are still a lot traces of the past time can be seen: rudimentary houses, stone wall around homes… After this you continue to Ta Van village (1.200 m) to visit Zay people. Zay is a fairly small minority group of about 38.000 people who live mainly in the mountains in Northwest Vietnam.\n\nAfter visiting Ta Van village the car will return you to Sapa. Free at leisure the rest of the day. Overnight at Sapa Hotel.\n\nMeals: Breakfast, Lunch\nAccommodation: Hotel in Sapa"},{"title":"Day 6: Cat Cat - Sin Chai - Sapa - Hanoi - Road transfer","description":"In the morning, have breakfast at the hotel and then check out.\nTake a walk down to the South-west of Sapa (around 3 km) to visit Cat Cat Village of the Black H’mong, one of the more well-known ethnic village of Sapa. Relax at the foot of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam.\n\nEnjoy picnic lunch by the side of the river, and then continue trekking to 3 km to Sin Chai Village, located at the foot of Fansipan Mountain - “the Roof of Indochina”, where you enjoy a stunning landscapes of the mountain.\n\nThen come back to the main road to be transferred to Sapa town on a jeep for 3km.\n\n15:00 - 15:30 Driver will pick you up & transfer 5 hours to Hanoi.\n\nMeals: Breakfast, Picnic Lunch\nAccommodation: Hotel in Hanoi"},{"title":"Day 7: Hanoi - Halong Bay - Overnight on cruise","description":"Halong Bay is listed by UNESCO as a World Natural Heritage and voted as a Wonder of Nature by the New7Wonders Foundation. You will have a night staying in this world famous bay.\nAfter breakfast in Hanoi, depart the capital for the 3hr 30mins drive to Halong Bay. Arrive to Halong City’s jetty (around noon) and proceed with check-in formalities. After a welcome onboard, lunch will be served while cruising towards the bay. In the afternoon, enjoy some sightseeing, on-board activities (depending on each boat’s itinerary) or just spend some time relaxing on the vessel. Towards the end of the day the boat sets anchor for the night among the karst formations. Dinner is served on board.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Cruise in Halong Bay"},{"title":"Day 8: Halong Bay – Hanoi","description":"Wake up the next morning at sunrise, you are invited to practice Tai Chi on the sun deck. Enjoy the feel of the early morning salt water scent and bask in the early sun rising from behind the mountains. Continue sightseeing in the wonderful bay, enjoy brunch on board while cruising back to mainland. Arriving at the harbor, you will be picked up for transferring back to Hanoi.\nDrop off at your hotel in Hanoi (owned arrangement)\n\nMeals: Breakfast, Brunch\nAccommodation: Hotel in Hanoi is not included"}]},{"name":"Hanoi Stopover 3 Nights plus 1 Night on Paradise Elegance Cruises","duration":5,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":166,"summary":"Spend 3 nights in 4* Quoc Hoa Premier Hotel Hanoi\n1 night on super brand new luxury Cruises!\nHanoi City Tour full day trip\nFree Round trip transfers\nUnique Water Puppet Show\nCooking & Tai Chi demonstration included","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100261_6391df23.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100261_6391df23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_4d239e9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_7f52f8ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_5717fe29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_ed57027c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_79d0c6f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_51c6eddd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_a85c28e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_1999735e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_bbe6e1f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_6ebdddf4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_2a59fdd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_f7b9f9ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_ff831245.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_cf55184a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100261_7d0bfb12.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. "},{"title":"Day 2: Hanoi - Paradise Elegance (B, L, D)","description":"7:30 am to 8:30 am: Pick up at Hotel \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00 pm reach Tuan Chau International Port and prepare for boarding\n12:15: Transfer to Paradise Elegance\n12:30: Welcome drink, cruise information and check-in\nSpa samplers\n13:00 - 14:30: Lunch at Le Marin Restaurant\n14:30 - 16:00: Cruise and sightseeing along Halong Bay\nEnjoy an afternoon spa treatment at Paradise Spa*\n16:00: select from\n- Visit Sung Sot Cave (1 hour) or kayak near Luon Cave area (1 hour)\n- Afternoon Tea at Le Piano Bar and spa treatment at Paradise Spa*\n17:00 - 18:30: Happy Hour at Le Piano Bar with music\n17:30 - 19:00: Anchor at Coconut Tree Island for overnight stay\nCooking demonstration at L’Odyssée Sundeck\n19:00 - 22:00: Dinner at Le Marin Restaurant\n21:00: Mixology at L’Odyssée Sundeck*\nLive music at Le Piano Bar"},{"title":"Day 3: Paradise Elegance - Hanoi (B, L)","description":"07:00: Tai Chi at L’Odyssée Sundeck\n07:00 - 08:00: Light breakfast, coffee & pastries at Le Piano Bar\n08:00: Visit Ti Top Island (1 hour)\nStay on board to relax or enjoy a spa treatment at Paradise Spa\n09:00: Breakfast Buffet at Le Marin Restaurant\nPassing by Thien Cung and Dau Go Cave and the Fighting Cock Islet\nBill settlement and check out\n10:30: Return to Tuan Chau Marina\n10:45 - 12:00: Light snacks at Paradise Suites Hotel\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: Arrive Hanoi. Check in  Hotel. Overnight in Hanoi.\n*payable"},{"title":"Day 4: Hanoi City Tour full day (Optional)","description":"Today, you are free for leisure and walking around Hanoi by yourself!\nOr you can join: Hanoi City Tour full day with lunch (50 US$/ Per Person)\nWe shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). \nStay overnight at the Hanoi"},{"title":"Day 5: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]}]