[{"name":"Ride to explore 4 UNESCO World Heritage Sites","duration":14,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":2995,"summary":"We have designed this tour for those who want to combine a back roads biking adventure with visits to many of Vietnam' most noteworthy sites. The tour visits four of the seven Vietnamese UNESCO World Heritage Sites. Hoi An Ancient Town, the Hue Citadel, and Phong Nha Cave are on the nine day biking portion of the tour, which begins in Ho Chi Minh, then to Dalat. From there, it rolls down to the coastal plain, and then meanders up, down and along roads, paths and trails to Phong Nha. Visits to the beautiful Paradise and Dark caves in this area show why UNESCO chose to add it to its list. An overnight cruise on the fifth site, Ha Long Bay, is an excursion which all visitors to Vietnam should experience. This tour will give a broad cross-section of the culture, geography, and ancient and modern history of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/113736_b3502a97.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/113736_b3502a97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_ee432e24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_3b987e4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_6bcb93be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_32998dbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_5bb43455.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_23308a9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_0cd92778.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_80f4fab6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_97fc3f6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_5410fe06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_e4e022e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_b5f3e7f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_3e01544a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_d576a973.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_a7219900.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_f2a9b764.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_07b2fd85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_ee8bd81a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_b2b18fb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_13cdc340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_8c3f6faa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_b7e5e3b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113736_cbc385fb.jpg"],"destinations":["Ho Chi Minh City","Dalat","Quy Nhon","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Cu Chi tunnel","description":"Depart from HCMC: 7:30 am and a transfer by vehicle out Saigon as to avoid the heavily traffic of Saigon. The ride will begins in rural villages. We start cycling on through rice paddy before we cross river to ride dirt track along river and passing fruit gardens and rubber plantation. Especially, we ride pass a villages making rice paper in countryside far way from Cu Chi tunnels. Enjoy lunch at nice restaurant in rural village before we explore Cu Chi tunnels. Have a transfer back to Saigon in the afternoon."},{"title":"Day 2: Dalat","description":"You will have an early morning flight to Dalat, our team will meet you at Lien Khuong airport for first day of cycling. Then a 20 minute by vehicle will take you rural village. We will bike along back roads through rural villages, ride past real countryside of the highlands, pepper and rubber plantations, pine forest."},{"title":"Day 3: Nha Trang","description":"After breakfast, a transfer takes you to countryside for today cycling. The back roads through valley, pine forests, breathtaking views to the peak which is about 1500m above the level sea allow you to challenge yourself. Then we ride 29 km down the pass of Hon Giao. Stop for lunch at restaurant by river at Suoi Loi village. In the afternoon, we take easy bike ride to explore villages by river, ride pass sugar cane farms, rice paddy fields on paths through beautiful countryside of Khanh Vinh and keep cycling onward to Dien Khanh village before you have a short transfer to city of Nha Trang in late afternoon."},{"title":"Day 4: Qui Nhon","description":"The distance between Nha Trang to Quy Nhon is very far and there is not enough time for you to ride all the ways. Our bike guide will cut off some and choose the best for your riding today. Check out the hotel at 7:00 am, then relax on vehicles for an hour to Van Gia town ship where you start biking on back roads through local hamlets and fishing villages, ride pass school, local markets before you bike on trails to Co Ma Pass. Your lunch will be served at local restaurant by the beach. Another transfer by vehicles to Tuy Hoa’ countryside after lunch gives you a nap. Then you can ride you bicycle on your own space pass sweet potato field, tapioca fields, rice paddy and fishing villages. Depending on your cycling ability and time, our guide could figure out and would tailor make a short route or long routes as to be at the hotel before dark. "},{"title":"Day 5: Quang Ngai","description":"In the morning, we will have a 30 minutes transfer by vehicle to back roads by the lake near fishing village as to avoid heavily traffic in town. Ride on small concrete country roads by the lake to Cat Tien. Then we continue cycling on coastal roads to De Ghi. In the afternoon, we ride pass shrimp farms along coastal roads, and travel the homeland of coconut of Tam Quang before an hour and half to go by vehicles to Quang Ngai city."},{"title":"Day 6: Hoi An","description":"We check out the hotel and go to My Lai memorial by our vehicles. Right here, our team will set up and double check all bikes. After your visit the memorial, just jump back to bikes to explore villages of My Lai before we reach to Sa Ky, then Chau O. Transfer to Tam Ky town for lunch. The highlight of today is unique routes in the afternoon. Explore traditional villages, see water buffaloes on rice paddy, money bridges and wooden boat factories and have a ferry crossing with local to Hoi An."},{"title":"Day 7: Hoi An","description":"There is no cycling today so you could spend your own time on swimming at your hotel, explore Hoi An acient town, doing some shopping."},{"title":"Day 8: Hue","description":"Option 1: An opportunity for you to challenges the Hai Van Pas after an hour driving from Hoi An. Take a little time to warm up your body before we bike uphill to the peak of Hai Van Pass. Right here you could see the big difference of condition of weather. You are also can see many old American bunkers on the peak of Hai Van Pass. Then cycle down hills to restaurant by the Lang Co beach for lunch. Then travel by off roads to the oceanic country roads. Keep riding onward through fishing villages, traditional residential architecture of houses and the ancient burial-ground of Hue.\nOption 2: Our vehicles take you to the peak of Hai Van Pass, after taking photos and admire particular scenery with different weather at the peak. Then we ride down the pass to Lang Co beach. In the afternoon, we ride on small concrete paths through fishing villages by huge lake, rice fields, and removed villages of Tu Hien, Thuan An seaside rural dist before we ride on A/C van to Hue city."},{"title":"Day 9: Dong Hoi","description":"The distance from Hue to Dong Hoi is too far to bike all the ways. So we leave hotel a bit earlier at 7:00 am for a visit the Purple citadel of Hue. Then a very short transfers you by van/bus to rural village to start the ride. Today’ ride is very easy because we ride on flat smooth country back roads and some parts are opened air and some parts through villages, passing vegetable fields, remote villages with many old pagodas and temples. We will have lunch at Cua Viet beach. In the afternoon, we continue cycling to on beautiful coastal roads to Cua Tung. We end up our today’ ride here for 2 hours driving on A/C van to Dong Hoi"},{"title":"Day 10: Phong Nha National Park","description":"Biking distance from Dong Hoi to Phong Nha is not very long but many single tracks through young forest, smooth country road along mountainous areas are unique and particular scenery. We can leave hotel a little bit late. In the morning we explore fishing villages of local on paths along ocean, and some paths of the jungle near mountain range. In the afternoon, we ride on hilly back roads through rubber plantation and ride paddy of west Ho Chi Minh trails before we reach to river. Then we enjoy mountain views and riding on footpaths along river to Phong Nha"},{"title":"Day 11: Phong Nha National Park","description":"In the morning our team will accompany with you by vehicle to Paradise cave. Spend an hour and half to explore this cave before lunch serving by river. Then we jump off the zip lines to enjoy mud bath, return by kayaking for another exploration of Phong Nha cave by boat."},{"title":"Day 12: Hanoi","description":"After having breakfast, we depart at 7:00 am from Phong Nha by vehicles to airport of Dong Hoi. It takes around an hour and half to get to the airport by shortcut. Our guide will meet at Noi Bai airport and you will be taken to hotel for check in. Relax and explore Ha Noi city by your own in the evening."},{"title":"Day 13: Halong Bay","description":"Halong Bay is one of the most amazing natural wonders and its natural beauty with thousands of islands including; beaches, caves, fishing villages on the bay. You are picked up at your hotels at 7:20 am then you enjoy 3 hours on driving by vehicle to Ha Long. Get on board at 11:30 am. Get on board and enjoy welcome drinks. Your guide will make a cruise briefing before we check in cabin then the cruise will start it journey by this time you having a delicious Vietnamese lunch. The cruise will sail to Bai Tu Long Bay, passing the towns of Hon Gai and Cam Pha, Oan Lagoon, Monster Head and Teapot Islets and Thien Canh Son Cave.  you will visit and explore the well-hidden Co Cave (known as  Thien Canh Son Cave) where you can  hiking to the middle of the mountain to see the wild and mysterious beautiful cave, contemplate numerous  sparkling  stalactites  appear  like 'hanging  lamps’  inside  the  Cave. After you explore of the cave, you return to the boat and enjoy sunset party on board. The cruise will drop an anchor in the calm water surrounded by islets in Cong Dam. Your diner will be served shortly. There are many activities on boat, entertainments, live music and dancing bar that you can join with another travelers. Overnight n cruise."},{"title":"Day 14: Hanoi","description":"Today is the special an opportunity you could admire sunrise on the Sundeck with complimentary tea & coffee are served before you have breakfast. You will have a bamboo sampan rowing boat taking you to Vung Vieng floating fishing village. You are also visit to Pearl Farm to see how natural pearls are created. Then return to Paloma Cruise for your leisure or join one of the following optional activities: Sunbathing, traditional massage etc. Your lunch is on board while the cruise coming back to Hon Gai Dock around 11:45 am. You will return to Hanoi by van/bus around 4:30pm. Tour End!"}]},{"name":"Grand Vietnam Package Tour - 14 Days","duration":14,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1545,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95677_9eaa10ec.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95677_9eaa10ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_f214ed17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_7cc1e25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a60e4658.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a60eba2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a60f3147.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a6111335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a61182cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a8ef300c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a8f0e81f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a8f15f60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019a8f1e183.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019aafb58d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019aafbffb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019aafc4f43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad415a95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad4204cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad424fca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad429c3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad42ef7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad433fac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad438a80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019ad43d9ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95677_5e019b13362aa.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Bakhan Village - Hanoi Airport Fly to Hue City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h30. Arrive Hanoi Airport for Hue City`s flight. Arrive Hue City in the evening. Transfer to hotel & check in. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “China Beach,” with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"My Son Sanctuary half day Tour & free go shopping (B, L)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch. In afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Leave Hoi An to Saigon/City Sightseeing - Cu Chi Tunnels. (B, L)","description":"Fly to Ho Chi Minh City, Saigon, Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means “Big Market.” Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. After Cu Chi Tunnels. You`ll be back to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable Vietnam Highlight Package Tour with Legend Travel Group. Good bye & see you again!\nAirport transfer included!"}]},{"name":"Vietnam Discovery - 13 day tour from Hanoi","duration":13,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":899,"summary":"Vietnam Allure Travel is one of  the most amazing way to experience Vietnam!\nRoute: Hanoi - Halong Bay - Cat Ba island - Ninh Binh - Tam Coc - Hoi An -Fishing vilage -  Ho Chi Minh City - Mekong Delta - Cu Chi tunnels. \n You’ll discover crazy Hanoi, experience the stunning Ha Long Bay, stay on Freedom island, go kayaking, crab fishing with traditional fisherman, soak up fascinating local culture, learn to cook delicious Vietnamese food, relax on beautiful beaches, party the night away and much more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295948.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295948.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e8719029594c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e8719029594e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295950.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295952.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295955.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295956.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295957.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197632_5e87190295959.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ninh Binh","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Tour Begins","description":"We’ll pick you up from the airport and take you to the Hotel in Old Quarter of Hanoi. Rest of the time is to recover from your flight and chill out.\n\nStay overnight at hotel in Hanoi ( Meal included: No)"},{"title":"Discover Hanoi by city tour and rickshaw","description":"Discover what makes the chaotic capital of Vietnam so special in a CITY TOUR with Rickshaw Tour and evening street food tour.  Experience the bustling streets, fascinating culture and delicious street food.\n\nStay overnight at hotel in Hanoi ( Meals included: B – L – D)"},{"title":"Halong Bay overnight Boat","description":"We’ll depart early for our amazing 3 Day / 2 Night Boat trip to the stunning natural wonder of Ha Long Bay. We’ll cruise on beautiful emerald green waters on our traditional Vietnamese ‘junk’ boat through towering limestone islands topped with rain forest. We’ll go explore Ha Long Bay by kayak then spend the night on the boat under the stars.\n\nStay overnight on boat ( Meal included: B – L – D)"},{"title":"Cat Ba island - Freedom island stay","description":"Continue soaking up the natural beauty of Ha Long Bay throughout the day before arriving at Freedom island! Chill out in a hammock, play some beach volleyball or just relax on the beach.\n\nStay overnight on the island ( Meals included: B – L – D)"},{"title":"Halong Bay & Ninh Binh homestay","description":"We’ll goodbye Halong Bay and then head south to the beautiful countryside of Ninh Binh, a landscape of endless rice paddies and epic limestone mountains. Check in to our unique and amazing local homestay and watch the sunset whilst relaxing in our private  bungalows for the evening.\n\nStay overnight in bungalow ( Meals included: B – L )"},{"title":"Ninh Binh & Overnight train","description":"Today we explore the best of the amazing Ninh Binh. We’ll take a bike ride through the countryside before boarding a local row boat and cruising a network of rivers and caves. After some lunch we’ll tackle the iconic 450 steps of the Dragon Mountain Viewpoint for sunset. We’ll then freshen up before boarding the overnight train south to Hoi An.\n\nStay overnight in 4 berth soft sleeper train ( Meals included: B – L )"},{"title":"Arrive in Hoian","description":"We’ll arrive early morning in Danang then be transferred by private vehicle  to Hoi An, one of the most beautiful and fascinating towns in Vietnam. You’ll have time in the afternoon to chill out, do some shopping or even get some clothes made. We then head out and experience some of Hoi An’s amazing nightlife!\n\nStay overnight in hotel in Hoian center ( Meal included: No )"},{"title":"Hoi An,Coconut Forest - Basket Boat Tour with Crab Fishing","description":"Be guided through coconut forest groves by traditional fishermen while you try your hand at some crab fishing. \n\nStay overnight in hotel in Hoi An center ( Meals included: B – L)"},{"title":"Fly to Ho Chi Minh City","description":"Check out from hotel in Hoian. Be transferred to  Danang we catch a 1 hour flight to the southern city of Ho Chi Minh City.\n\nStay overnight in hotel in Ho Chi Minh city center ( Meal included: B – )"},{"title":"Mekong Delta – overnight in Can Tho","description":"We’ll explore the incredibly lush green beauty of the Mekong Delta by boat, learn first-hand how the locals live, visit local villages and experience daily life on the Mekong. We then stay overnight in the Delta.\n\nStay overnight in bungalow in a local homestay in Can Tho center ( Meals included: B – L- D)"},{"title":"Floating Market – Back Ho Chi Minh city and leisure","description":"Today we’ll explore more of the Mekong also visiting Floating Market before making our way back to Ho Chi Minh city. Rest of the day is leisure\n\nStay overnight in hotel in Ho Chi Minh  city ( Meals included: B – L)"},{"title":"Cu Chi tunnels","description":"Do a trip to the Cu Chi Tunnels. A fascinating network of underground tunnels used as supply routes, hideouts and living quarters by guerrilla fighters during the Vietnam War. We’ll arrive back to Ho Chi Minh City.\n\nStay overnight in hotel in Ho Chi Minh  city ( Meals included: B – L)"},{"title":"Check out. Tour ends.","description":"Your amazing 13-day adventure comes to an end. You can either check out and take an international flight home, stay on longer in Vietnam or continue your travels in other destinations in Asia.\n\nGoodbye!"}]},{"name":"Vietnam Homeland from South to North","duration":15,"travelStyle":["Adventure","Family","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":1019,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/103734_2dcab784.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/103734_2dcab784.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_08bacac1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_0b1b1df2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_7763fc1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_25d4c805.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_a98148d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_ad1658f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_caf43606.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_fa5d1601.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_595a269d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_c8ac8eed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_df1ab8be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_a45a6ce6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_be6c503c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_19caf5c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_e726e4b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_459c2371.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_2259a2e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_6cbac1f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_a0a41300.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_ac4d2d88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_947f38d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_a3d563dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/103734_837e0c5d.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Phu Quoc Island","Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1 HO CHI MINH ARRIVAL ( No meals )","description":"\nOn arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You are free time for leisure."},{"title":"Day 2 Half day cyclo tour city tour (Meal: B, L)","description":"Cyclo in SaiGon (Option 1)\n• 8.00am or 2.00pm Explore Ho Chi Minh City’s historic by the local transport, and experience the city as it was before the war. Visits the War Remnants Museum – it displays old military equipment and other related items from Vietnam War. The Reunification Palace, Notre Dame Cathedral and General Post Office which are beautiful examples of architecture from the French colonial period. Enjoy Vietnamese food.\n• 12:00pm or 06:00pm go back hotel.\nCyclo in China Town (Option 2)\n• 8.00am or 2.00pm Explore Ho Chi Minh City’s historic Chinatown, named Cho Lon, by the local transport. Feel the hustle and bustle of street vendors selling a mixture of herbs for traditional medicine. Snake your way down tiny alleys on the agile vehicles, passing many small, family-run businesses. Come in the 250-year-old Lady Thien Hau Temple (God of the Sea). Then you have time for shopping at Binh Tay Market. Enjoy Vietnamses local food at our restaurant.\n• 12:00 or 18:00 go back your hotel."},{"title":"Day 3 CU CHI HALF DAY (Meal: B)","description":"08:30 We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\n14:30 Back to Saigon.\nExtra option: Visit Ho Chi Minh city at night by motobike or by tricyclo in 3 hours. Enjoy local food street (+45 usd/client).\nSpend overnight in Saigon."},{"title":"Day 4 Hcm - My Tho - Ben Tre - Can Tho (Meal: B, L)","description":"8:00 Am Begin the trip. It takes for one and half hours by bus to drive from Ho Chi Minh to My Tho City.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people.• The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake. • The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree.• After lunch, you have freetime for biking, walking.Next journey is Can Tho. Spend overnight in the hotel (or family home-stay with dinner can be arranged on request). Overnight in Can Tho"},{"title":"Day 5 Can Tho - Cai Rang Floating Market (Meal: B)","description":"After having breakfast, you have chance to take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river, visit Cai Răng floating market which are the liveliest in the whole Can Tho City. Your experience will be full fill when you go and see how vermicelli’s soup is made. Wander around the village and meet the friendly local people and see a “Monkey bridge” – A bridge was built by only one stem of bamboo. Visit the orchard garden. Make a stop for lunch (your own account).\n2pm taking bus from Can Tho to Rach Gia. Overnight in Rach gia\n\n"},{"title":"Day 6 PHU QUOC - EASTERN ISLAND (Meal: B, L, D)","description":"8:00 AM: We will take a boat to Phu Quoc\n10:00 am: Arrive in Phu Quoc. After chek in hotel\n11:30: Have lunch at local restaurant. Make a Phu Quoc Tour.\n14:30 Start for Eastern island:\n-Pepper garden, be captivated by word of “itsy-bitsy teeny weeny peppercorns” of patient growers\n-Ham Ninh ancient village, enjoy fresh seafood (personal charge)\n-Tranh Stream: waterfall is beautiful in Phú Quốc.\n-Hung Long/ Phap Quang Pogoda located on high hill, overlook to town\n-Back to Duong Dong town, stop at a Sim wine distillery, taste the local wine\n-Dinh Cau Temple, the savior of local fishermen\n-Have dinner at local restarant\nBack to hotel. Spend overnight in Phu Quoc.\n"},{"title":"Day 7 SAO BEACH - HAM NINH VILLAGE OR SNORKELING TOUR (Meal: B, L, D)","description":"After breakfast, start to explore:\nOption 1: excursion tour\n8g00: transfer to the South of island and visit:\n Fish sauce workshop: learn about the fish sauce production and enjoy the unique aromatic flavor of Phu Quoc fish sauce\n Have lunch\n Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments.\n Coconut prision: which was built in 1949-1950 by the French colonists to jail those considered specially dangerous to the colonist government\n Sao beach – one of the most beautiful beach in the South East of Phuquoc island. Relax and swimming, have lunch here\n Have dinner at local restarant\n\nOption 2: snorkeling tour\n8g00: transfer to the South of island and visit:\n Pearl Farm. You may be able to witness how oyster shells are cut open to retrieve pearls and how these pearls are bored, strung or placed on silver or gold ornaments.\n Then, go to pier, get on board for snorkeling and fishing. The snorkeling set is ready for you to enjoy the colorful life of coral reef and of the fish under water. Have lunch on board\n Go back to pier and transfer to Sao beach – one of the most beautiful beach in the South East of Phuquoc island\n Back to hotel\n Have dinner at local restaurant.\nSpend overnight in Phu Quoc.\n"},{"title":"Day 8 PHU QUOC - HA NOI (Meal: B)","description":"Have breakfast at hotel, free at leisure, check out and then transfer to Phuquoc airport to take a flight to Hanoi.\nWhen arrive in Hanoi. You have more freedom to sightseeing the landscapes nearby such as visit Ho Chi Minh Mausoleum and Museum, One Pillar Pagoda, Ethnology museum.\nSpend overnight in Hanoi."},{"title":"Day 9 Hanoi - Halong (Meal: B, L, D)","description":"Your hotel – Tuan Chau marina – Halong bay – Lunch – Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities\n07.45 – 08.15 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n– Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n– Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n– Check into your cabin. Time to refresh and unwind – Set sail as lunch is served\n– Join us for a typical local lunch in the dining room or at the outdoor dining area.\n\nAfternoon\n-Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named aSurprising.\n-Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n-Heading back toward the sleeping area\n\nEarly evening\n-Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n-An authentic Vietnamese menu is served\n-After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…\n"},{"title":"Day 10 Halong - Hanoi (Meal: B, L)","description":"Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\nLocal breakfast is served\n\n08:00\n-Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n-Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n\n09:00\nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30"},{"title":"Day 11 HANOI CITY (Meal: B, L)","description":"In the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\nOvernight in Ha Noi."},{"title":"Day 12 Hanoi - Sapa By Bus – Cat Cat Village (Meal: B, L, D)","description":"6:30 am : Our bus picks up at the meeting point and depart to LaoCai, on the highway running from Noi Bai – Lao Cai 245Km with less than 5 hours. You have the opportunity to enjoy the beautiful scenery on the both sides of this road.\n12:00 : Arrival Sapa, Enjoy lunch at local restaurant then Trekking to Catcat village, the village of H‘mong tribe in the valley, which remains very generally uncorrupted outside forces. Excellent views of the valley, the magnificent limestone and paddy fields of H‘mong village and panorama of the village. Enjoy some visits to local families and reach their customs. After the village down into the valley, The village is surrounded by flowery valley and deep-green pines. The rocks near the river and waterfall provide a marvelous place for picturesque photos and sunbathing during good weather. Walking back Sapa for Dinner and free time in the evening for discovering beautiful town, see ethnic people activities and life in Sapa. Overnight in sapa.\n"},{"title":"Day 13 Trek To Lao Chai Ta Van (Meal: B, L)","description":"After Breakfast in the hotel, we take a bus to Lao Chai village, a village of Black H‘mong. Short trek down to river to visit hill tribe house to see their living style and the local woman made their handicraft clothes. Further on along the trail, the Tavan village where Dzay people staying can be seen. Visit the village and reach their customs and colorful from black Hmong and red DZAO people. Lunh in local restaurant, after that we continue up and down to rice paddy field , it is one of best view place in sapa and walk through bamboo forest, relaxing in waterfall to have a swimming and a panorama of Giang Ta Chai village. Then getting back Sapa town.\nOvernight in Sapa."},{"title":"Day 14 Bus Sapa - Hanoi (Meal: B)","description":"7:00 am: our bus pick you up at your hotel to get back to Hanoi.\n12:30 Arrival Hanoi. Free time\nOvernight in Hanoi."},{"title":"Day 15 HANOI DEPARTURE (Meal: B)","description":"Relax in hanoi until your flight back home. The car transfer you to the airport 3,5 hours before your flight. See you again!"}]},{"name":"Southern Vietnam Family tour to Mekong Delta, Da Lat, Nha Trang","duration":11,"travelStyle":["In-depth Cultural","Private","Fully Guided","Holiday"],"oldPrice":0,"price":1320,"summary":"The vast alluvial Mekong river delta as the largest rice basket of Vietnam will offer you a great deal to enjoy: friendly and warm local people, special food and beautiful scenery. With the visit to the romantic city of Dalat and the stunning beach of Nha Trang, you will experience the cultural flavours and delights of Vietnam with your family members","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130041_2f99152b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130041_2f99152b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_591f7cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_c8b02b88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_5314ce19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_97bbcff0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_06f78591.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_62e31f3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_2c9b89a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_de2050ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_2ba6a2dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_089f9332.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_16cae88b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_6c61e717.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_6550e360.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_3db3e476.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130041_00200c9f.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Can Tho","Dalat"],"timeline":[{"title":"Day 1: Ho Chi Minh city arrival","description":"Welcome to HCM city which is formerly named as Saigon and nowadays becomes the Vietnam’s financial hub. The city is not only known as the most important economic center in Vietnam, but also has some very imposing colonial architecture which belies in fascinating past. On arrival, you’ll be picked up and transferred to the hotel for check- in and tour briefing. If time permits, take an orientation walking tour around and a chance to acclimatize ourselves. Free evening.\nOvernight in Saigon."},{"title":"Day 2: Ho Chi Minh city Tour","description":"Enjoy a full day to explore this frenetic city with lunch at a local restaurant. Start with a visit to Saigon’s China Town, then learn about traditional Vietnamese medicine at the FITO Museum and browse through the amazing array of goods at Ben Thanh Market.\n\nStop for lunch then continue on the city tour with a visit to the War Remnants Museum and former Presidential Palace. Finally, stop at the Notre Dame Cathedral and the Old Post Office to admire the city’s French colonial architecture before finding the way back to hotel to conclude the day.\n\nOvernight in Saigon."},{"title":"Day 3: Ho Chi Minh city-Tay Ninh-Cu Chi","description":"Excursion to Tay Ninh to visit the spectacular Cao Dai temple, the Cathedral of the religion of the same name. This sect, originating in Vietnam, draws freely from other philosophies of Christianity and Confucianism. The architecture of the cathedral is stunning, neither Eastern nor Western. You can attend the main ceremony at Noon (Remove your shoes before entering). Lunch at a local restaurant.\nContinue to visit Cu Chi, where the Viet Cong confused the Americans through a miracle of primitive technology. The guerrillas escaped from their enemies through a maze of resistant bomb tunnels that span nearly 200 km. Most of these tunnels are too narrow for Western visitors, who usually, rapidly become claustrophobic. Thus, a small portion of the labyrinth has been enlarged to give tourists a glimpse of the site. Transfer back to Saigon later this afternoon and spend the rest of day at your leisure.\nOvernight in Saigon."},{"title":"Day 4: Ho Chi Minh city GROUP TOUR to Cai Be-Vinh Long-Can Tho","description":"Rise up early today and after having breakfast, travel 105 km south to Cai Be, the gateway to Mekong delta. On arrival, embark on a boat to cruise along the Mekong River visiting the floating markets, where you can admire displays of fruits and vegetables.\n\nExplore islands, stopping at the family factories where you can see how the delicious coconut candies, popcorns, poprice and so on are prepared. Enjoy your lunch with the special local fish “elephant ear” in a bonsai garden or in an old house.\n\nAfter lunch, continue your trip by a small sampan ride through the shady canals to Vinh Long. You will cross over the parkway many small boats carrying the local products such as fruits, vegetables and fish. Parkway in orchards, tasting tropical fruits. In the late afternoon, transfer by road to Can Tho, the center of the Mekong Delta. Can Tho is also named as the Capital of the West, located at the edge of Hau Giang, arm the southern Mekong. Dinner.\n\nIn the evening, after dinner it’s advisable to stroll on the Ninh Kieu docks, bordering the river.\n\nOvernight in Can Tho."},{"title":"Day 5: Can Tho GROUP TOUR back to Ho Chi Minh City","description":"Morning boat trip to the floating markets of Cai Rang, then continuation to the discovery of small channels through the islands covered with lush flora. Cycle the parkways and paths through orchards (optional), tasting the tropical fruits. After lunch, travel back to Saigon.\n\nOvernight in Saigon."},{"title":"Day 6: Ho Chi Minh City – Dalat","description":"7:30 am, drive away from the city bustle heading uphill to Da Lat, nicknamed the “City of Eternal Spring,” admiring the rice paddies, vegetable patches, tea plantations & pine forests and gently sloping hills that you’ll pass along the way. Prized by the Vietnamese for its mild climate, Dalat, nestled in the mountains, was the site of the summer residence of Vietnam’s last emperor, Bao Dai. Stop in Bao Loc city for a quick lunch before reaching Da Lat at around 14.30.\nOn arrival, pay your first visit to Chua Linh Phuoc to admire its amazing architecture and huge collection of Buddha statues which are artfully carved in every details. Then, transfer to Trai Mat nearby where you’ll board a 30-minute train ride toward to Dalat’s crémaillere (cog railway) train station which becomes one of the city symbols. Established by the French in the early 20th century, the railway linked Dalat to Thap Cham before ceasing operation in 1964 due to Viet Cong attacks. You’ll admire the Art Deco aesthetic of the station.\n\nTransfer to the hotel for check in and refreshment. Evening is free for your own exploration. Overnight in Da Lat."},{"title":"Day 7: Dalat Sightseeing Tour","description":"Morning: Breakfast at hotel. 8:00 am pick up for a visit to Datanla and Prenn waterfalls, two of the many famous waterfalls in Dalat. Then visit Truc Lam Buddhist Meditation Monastery and the Robin hill by cable car (expenses excluded). Visit the Palace of Bao Dai (the last king of Vietnam,) then back to the hotel for lunch.\n\nAfternoon: This afternoon you may choose just to enjoy your time at leisure or join us for an optional tour that focuses on Dalat’s agricultural production. We’ll stop at the local market and then a Green House Farm where you’ll learn about how the flowers and vegetables are grown. Next, transfer to Trai Ham Da Lat, a coffee farm where the special local weasel coffee produces.\n\nCoffee was introduced in Vietnam after the French invasion at the 1800s and nowadays it becomes popular nationwide. However, weasel coffee is special and it’s not affordable for everyone. Don’t miss the chance to try its special taste when you are in Da Lat.\n\nHome hosted dinner with a local family. Overnight in Dalat"},{"title":"Day 8: Dalat – Nha trang Beach Tour","description":"Breakfast at hotel. 8:00 AM, depart from Dalat to Nha Trang. Stop along the way to visit Ngoan Muc Pass, one of the most beautiful mountain pass in Vietnam. Visitors have chance to see a panoramic view from the foot to the top of the mountain pass.  Next visit Pok’long Garai Cham Tower. Arrive in Nha Trang about 1:30 PM.  Check in at hotel and free time to visit Cho Dam or Vinpearl Land amusement park.\n\nOvernight in Nha Trang"},{"title":"Day 9: Nha Trang Beach Relaxation","description":"Breakfast at hotel. Pick up at hotel at 8:00 AM to go to the dock at Nha Trang port. Start the journey to visit four beautiful islands. Tri Nguyen Aquarium on Mieu Island is the first place to visit, many sea species of Nha Trang/Khanh Hoa province make a small ocean world there.\nThe next point is Hon Mun island, where you will have the opportunity to swim and snorkel in the most beautiful coral reefs in Vietnam.  Free snorkeling equipment is provided. We then continue to Hon Mot and then  Hon Tam.  We will stop here to swim, sunbathe or buy souvenirs before we head to the floating fishing village to see the daily activities of the local fishermen. We will return to the pier around 3:30 PM. Then, transfer back to the hotel.\n\nOvernight in Nha Trang."},{"title":"Day 10: Nha Trang Ho Chi Minh city","description":"Breakfast at hotel. 8:00 AM, departure from hotel to Ho Chi Minh City. Check in at the hotel. Free time at your own leisure.\n\nOvernight in Saigon/ HCM City."},{"title":"Day 11: Ho Chi Minh city Departure","description":"Free at leisure until transfer to the airport for your onward flight "}]},{"name":"Discover Vietnam 14 Days 13 Nights","duration":14,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1259,"summary":"From the busy streets of Saigon to the beauty of Hoi An and Halong Bay, spending two weeks in Vietnam gives you the chance to see most of the country’s top destinations without having to rush from one location to the next.\nBelow, we’ve planned a two-week travel itinerary for Vietnam that covers both of the country’s major metropolises, the beautiful central Vietnamese city of Hoi An and fun day trips to Halong Bay and the Mekong Delta and Ha Giang is High in the north of Vietnam is a place where the road winds through jaw-dropping canyons and breathtaking mountain passes. The Ha Giang loop is a dream come true for adventures travellers craving the open road. Pack your gear, charge your batteries, and prepare for an adventure.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00734.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00734.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df0073b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00740.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00741.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00743.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df00745.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df0074a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c9050afe18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df0074b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c904a97d2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194951_5e5c92df0074d.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Ho Chi Minh arrival (No Meal )","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in SaiGon. After checking into the hotel, the rest of the day is yours to enjoy. SaiGon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture\nOvernight in hotel in Sai Gon.\n"},{"title":"Ho Chi Minh - Cai Be Floating Market Full Day (B,L)","description":"Breakfast take a way\nPick up at your hotel in Ho Chi Minh City  at 6:15 to 6:45 depart for Cai Be by car/van via Trung Luong Express Highway.  On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Then wander into the small villages and visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk music.\nKeep cruising to experience the charms of the Upper Mekong Delta, where you can immerse yourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese dishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax in the hammocks to get back your energy.\nCycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn more about the local daily life in the Mekong delta. Take a boat ride back to Cai Be and meet your bus for the trip back to Ho Chi Minh City.\n"},{"title":"Ho Chi Minh City and Cu Chi tunnel (B,L)","description":"AM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\n Start our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon.\nOvernight in Sai Gon \n"},{"title":"Sai Gon - Da Nang - Hoi An by Flight (B)","description":"You are free until the driver pick up and transfer to airport to take flight to Da Nang, the private car pick up transfer to Hoi An.\nOvernight in Hoi An.\n"},{"title":"My Son 1/2 day (B,L)","description":"07.30-08.30am :Pick up at your hotel in Hoi AN and drive to My Son Sanctuary. Nestled in a wide valley between two mountain ranges, My Son Sanctuary was the site of many Cham Temples. Used for religious ceremonies by the Kings of the Champa Dynasty, it is also believed to be a burial site of Champa Royalty. The My Son temples complex is one of the foremost examples of Hinduism in South East Asia and is one of the most important heritage sites in Viet Nam. Though the complex has been ravaged by time and war, we can still see many majestic ancient ruins of the temples here.\n12.00: Leave My Son for return journey\n13.00: Get back to Hoi An town by Boat & enjoy Light lunch on Boat.\nAfternoon free and easy to discovery Hoi An by yourself \nWe will travel up the Thu Bon River by motorized boat, stop en route to visit the Traditional Kim Bong Carpentry Village before returning to Hoi An centre.\n14.30: End of service at the Boat Station ( in old Town)"},{"title":"Hoi An - Ba Na Hill (B,L)","description":"Morning (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n08:45 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness.\nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion.\n11:45 am: Have lunch in restaurant (buffet lunch).\nAfternoon: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The“Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:30 pm. Drop-off at hotel.\nOvernight in Hoi An\n"},{"title":"Hoi An - Da Nang Hanoi by Flight (B,L)","description":"You are free until the driver pick up and transfer to airport to take flight to Hanoi, the private car pick up transfer to hotel for check in.\nOvernight in hotel in Hanoi. \n"},{"title":"Ha Noi - Ha Giang (B,L,D)","description":"6:00-6:30 Pick up at your hotel in Ha Noi and depart for Ha Giang by Van.\nYou will have a short break with some photo opportunities along the way.\n12:45 -13:15 Have lunch in local restaurant.\n14:00 Leave Ha Giang City for Quan Ba Mountain town. On the way you can take some photos of the magnificent views of the rice fields, mountains and valleys.\n15:30 Stop at Heaven Gate, enjoy the fresh air & see the panorama of Tam Son Town from above, afterwards we start to trekking down along the the path to a tranquil village  where you will be welcomed by local Tay families. The Village is on top of the mountain which is knows for its rich culture characters : tradition costume , festival, brocade, cuisines and rammed - earth house is under Sa moc tree forest and natural fresh water lake….\n16:00 Spend time to rest and freshen up before trekking around the village.\nYou can discover the rammed earth house of Black Dao which surrounded by terraced paddy fields.\n19:00 You will have a local delicious dinner in one of the local homestays.\n"},{"title":"Quan Ba – Yen Minh – Meo Vac – Ma Pi Leng – Dong Van(B,L,D)","description":"6:30-7:00 Have breakfast, enjoy the fresh air of breathtaking mountains, check out from the homestay and be ready for the next experience - continue your journey to Meo Vac.\n12:00 Enjoy lunch in Meo Vac.\n13:00 We keep going to Dong Van to conquer Ma Pi Leng Pass. It is one of the most beautiful Rocky Mountains, unique landscape and famous place in Ha Giang. You will have chance to stand on the steep cliffs of Nho Que River, a green river which flows from China and through Vietnam for about 46 km. Standing on Ma Pi Leng’s top point and outstretch your arms, you'll seem like you're flying into the skies. Indeed, the harmonious beauty of ground, sky, and mountainous scenes may steal the heart of any tourists.\n15:30 Trekking  to visit the small dotted village where H`mong people live with extraordinary mountainous landscapes.  From here, we will enjoy the incredible view of winding Happy road below.\n17:00 Check in at the Hotel / Homestay in Dong Van Town.\n19:00 Have dinner and enjoy the nightlife of the local people there.\nOvernight in Dong Van\n\n"},{"title":"Dong Van – Hmong King palace -Hanoi (B,L)","description":"If you are here on early morning Sunday you have chance to experience the very exciting and Colorful Dong Van market, where a dozen tribes living in the surrounding area, and traditionally dressed, come to sell their goods…\n08:30 After breakfast, start a new day to Dong Van rocky highland Geopark\nThis place is unique combination between Geoheritages and cultural heritages. It not only is sculpture product, a historical rocky page of the nature present to human people but alsocontain values of biological diversity, tourism, fossils...Especially, the cultural of community 17 ethnic groups on Dong Van karst plateau Geopark \nOn the way you will visit the Hmong King`s Palace. This is one of the most special, cultural and historical monuments in Dong Van, the Vietnam war, and life of the ethnic people.\n12:30 – 13:00 Enjoy lunch in local restaurant right next to peaceful stream then back to Ha Giang\n16:00 Return to Ha Noi\n22:30 Arrive back in Ha Noi.\nOvernight in Hanoi\n\n"},{"title":"Ha Noi- Ha Long Bay- Surprising cave- Titop island (B,L,D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on cruise\n"},{"title":"Ha Long – Pearl farm – Hanoi (B,L)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off back your hotel.\nOvernight in Hanoi \n"},{"title":"Hanoi - Ninh Binh - Hoa Lu - Tam Coc","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\n Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi.\nOvernight in Hanoi \n"},{"title":"Hanoi departure (B)","description":"Have a breakfast at your hotel.\nFree time and easy until departure time, the driver takes you to the airport for your flight.\nEnd of services!\n"}]},{"name":"Vietnam Adventure 15 days 14 nights","duration":15,"travelStyle":["Sightseeing","Family","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1726,"summary":"Over 15 days, you’ll have the opportunity to delve a little deeper to parts of Vietnam where very few people go. Some of the highlights include visiting endangered primates in the beautiful Trang An, exploring one of the largest caves in the world, a scenic drive along the Hai Van pass made famous by the show Top Gear, sampling some of the world’s best coffee, tackling rapids while white water rafting and a cruise through canals of the Mekong Delta to name just a few. This trip certainly packs a punch!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/106718_3c209700.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/106718_3c209700.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_aeeb21ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_61649064.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_5e41066349c33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_73328290.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_2bc8114c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_e96ad32d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_83da49bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_9c8b95a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_e2474c9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_439bb2b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_e1de002d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_c62c0f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_a3fc22cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_e38c285e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_50ed1fbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_e032c1e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_8c091b88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_f2b403f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/106718_5e1c0c93.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Dalat","Mui Ne","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HA NOI - HA LONG BAY - NINH BINH (L/D)","description":"After breakfast, you will go to Halong Bay, an iconic beauty spot and UNESCO World Heritage Sites. We embark on a sailing boat for an exploration of Halong Bay. This exciting 4-hour cruise provides a fantastic view of the  bay which is dotted with some 3,000 limestone islands rising amazingly from the clear and emerald water. The limestone karst formations are littered with beaches, grottoes and beautiful caves. Along the way we will anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath towering cliffs. After your, exploration of the Ha Long Bay, we will transfer you to Ninh Binh, taking in the beautiful scenery on the way.. Arrive in Ninh Binh and check in hotel. Dinner and overnight  in Ninh Binh\nAccommodation:\thotel in Ninh Binh\nMeal:\t\t\tLunch in local restaurant "},{"title":"NINH BINH – NIGHT TRAIN TO DONG HOI (B/L/D)","description":"Today, You will have a chance to visit the Ha Long Bay of the land. About 150 kilometres from the famous Vietnamese bay where hundreds of islands form a natural wonder is another equally as impressive landscape. This one, known as Trang An, is nowhere near the coast, though. The mountains are connected by rice paddies, not water. After enjoying a delicious lunch, we will take a boat up the beautiful river fed by natural springs and through caves that cut their way through amazing limestone karst mountains to visit an Ancient 10th Century pagoda and temple. After time visit Pagoda and Temple, it a great fun to take a bike for your further exploration to Thung Nham Bird Garden. It is a quiet biking route on flat road & dams with a very nice scenery of mountains & local villages.The round trip is about 10km long.\nWe will have dinner and a shower in central Ninh Binh town before boarding the overnight train to Phong Nha­Ke Bang National Park.\n\nAccommodation:\tNight train \nMeal:\t\t\tLunch & Dinner in local restaurant \n"},{"title":"PHONG NHA NATIONAL PARK (B/L)","description":"Phong Nha­Ke Bang is one of the largest National Parks in Vietnam. Home to a huge amount of wildlife, breathtaking scenery, crystal clear rivers and immense cave systems. A documentary by National Geographic has given this area much attention with the discovery of the world’s largest cave, Son Doong, here in the early 1990’s. Our first stop is Eight Lady Cave. The site where eight women who were working on Route 20 highway died from a bomb attack that caused a massive rock to seal off the exit trapping them inside. We then move to Paradise Cave, one of the most beautiful caves in Phong Nha National Park with more than 30-Km cave system of hundreds incredible rock formations.\nAfter lunch we visit the awesome Dark Cave by zipline or for the slightly less adventurous, kayaks. With only a head torch for light, we navigate our way in the darkness to the mud baths. Soak up in the goodness and be left with baby­smooth skin and what’s a mud bath without a classic mud fight! Afterwards take a refreshing dip in the lake and wash all the mud away.\n\nAccommodation:\tHomestay in Phong Nha\nMeal:                       Lunch at local restaurant\n"},{"title":"PHONG NHA NATIONAL PARK (B/L))","description":"After an activity packed day yesterday, today is free for you to cycle around & explore the town, check out the local life by the river or just chill out. We will take you on a short but bumpy ride through the villages to homestay.\n\nAccommodation:\tHomestay in Phong Nha\nMeal:\t\t\tBreakfast at homestay \n\t\t\t       Lunch at local restaurant"},{"title":"VINH MOC TUNNEL – THIEN MU PAGODA (B/L)","description":"Vinh Moc is a tunnel complex in the Demilitarized Zone (DMZ). The tunnels were built to shelter families from the intense bombings of the area during the American war. Over 600 people lived and 17 babies were born in these tunnels between 1965 and 1972. After lunch we will visit the Mine Action Visitors Centre in Dong Ha. This centre looks at the effects of the war that still happens today, even after hostilities ended in 1975. After this you will arrive in Hue, discover Thien Mu pagoda which rests on the banks of the perfume pagoda. This is the tallest pagoda in Vietnam, its 7 tiers reading up high into the sky, each story representing a step in enlightenment.\nOvernight in a hotel.\nAccommodation:\thotel in Hue\nMeal:\t\t\tBreakfast at hotel\n\t\t\t        Lunch at local restaurant"},{"title":"HUE CITY TOUR AND BEACHES (B/L)","description":"After breakfast, our tour guide will accompany you to the Imperial Citadel. The majestic architecture, built by Gia Long, has faced destruction over the years during the fierce conflicts which took place here. It is the scars on these buildings that tell the stories of the battles fought here. \nContinue your trip into past as you visit Minh Mang Tomb, the final resting place of the 2nd emperor of Vietnam. This tomb is special in the way its architecture blends in seamlessly with its surroundings and landscape (Minh Mang was a staunch believer in Confucianism). Hop back on the bus and we head to the local beach to enjoy some lunch and some cocktails as we swim and enjoy the sunset… This spot is a real hidden gem\nAccommodation:\thotel in Hue\nMeal:\t\t\tBreakfast at hotel\n\t\t\t        Lunch at local restaurant"},{"title":"HAI VAN PASS – HOI AN (L/D)","description":"Depart Hue in the morning as ride motorbikes all the way to Hoi An. With many stops along the way, taking in beautiful beaches, coastline and the breathtaking Elephant Springs. Make sure you have packed your swimming gear as this is a great place to relax, swim and enjoy lunch for a couple of hours. The journey then heads South to take in some breathtaking views as we ascend the famous Hai Van Pass where we will stop at the top to see some French and American bunkers, the remnants of war times past. This road, made famous by the Top Gear motoring programme is a site not to be missed..\nAccommodation:\tHotel in Hoi An\nMeal:\t\t\tLunch & Dinner at local restaurantl"},{"title":"HOI AN OLD QUARTER (B/ L)","description":"Depart from your hotel and ride bicycle in 30 minutes to Tra Que village. Take a short stroll around the vegetable garden and listen to the history of the village. You will have chance to take the picture coconut mangroves and take a traditional basket boat ride that includes some crab fishing. Finish up with a fresh coconut by the side of the river. Finish the trip with some free time to explore the Old Town’s thousands of tailor shops, art galleries and riverside market or simply kick back on the beach.\nAccommodation:\tHotel in Hoi An\nMeal:\t\t\tBreakfast at hotel\n\t\t\t        Lunch at local restaurant"},{"title":"HOI AN – BUON ME THUOT (B/L)","description":"Option 1: Take a night bus from Da Nang to Buon Me Thuot in day 8.\nOption 2: Take a flight from Da Nang to Buon Me Thuot on the early morning.\nWe’ll take you for a local Vietnamese breakfast before exploring Buon Ma Thuot, the coffee capital of Vietnam! Vietnam is actually the world’s second biggest exporter of coffee so we head directly for the famous Trung Nguyen coffee village where you can taste their famed weasel coffee! \nAfter lunch, you will visit the famous waterfalls of D’ray Nur  on the Krong Ana River, which is particularly impressive and photogenic during the rainy season. Visit an Ede Ethic minority Village (near the falls) to explore the Ede’s Matriarchal Society. \nOvernight in homestay.\n\nAccommodation:\tHomestay in Buon Me Thuot\nMeal:\t\t\tBreakfast at hotel\n\t\t\t        Lunch at local restaurant\n"},{"title":"YOKDON NATIONAL PARK - DALAT (B/L)","description":"Wake up early for special day, we will check out around 06:30 am. We join with the team from the National Parks Elephant Conservation project and meet the elephant caretakers at first light to track the roaming elephants through the jungle.Go to the forest with the elephant caretaker to take the elephant home for elephant washing (30 minutes), elephant feeding ( banana & sugar cane). Especially, ride elephant (1 hour) to cross the S’repok River!.\nWe head back to Buon Ma Thuot to enjoy a local specialty lunch before boarding our mini­bus to Da Lat, arriving in time for dinner of your choice\nAccommodation:\thotel in Da Lat\nMeal:                       Lunch at local restaurant"},{"title":"ADVENTURE IN DA LAT (B/L)","description":"Today, we have 2 options for you to explore Dalat.\nOption1: One of the best ways to explore all Dalat’s beauties, canyoning is the combination of sightseeing and plenty outdoor activities.\nThe tour gives you chances to discover charming scenery pictured with waterfalls, hills, pine forest and other attraction. You will be fully equipped with best quality tools to overcome challenges of wilderness. After all, you will get the achievement of excitement, courage and strength.\nOption 2: Strap in for some adventure with our professional white water rafting crew and head to the river for the safety briefing before our guides take us for a thrilling adventure through the Da Lat countryside. Re­ fuelling at a village restaurant, we then head for a coffee farm where we can taste the famed weasel in front of panoramic views of the coffee fields. Sit down for a local dinner in Da Lat and enjoy the town.\n** White water rafting is seasonal depending on water levels. We do make alternative arrangements. Please double check with our team when booking**\nAccommodation:\thotel in Da Lat\nMeal:\t\t\tBreakfast at homestay "},{"title":"DA LAT - MUI NE (B/L)","description":"Last time for you in here, you can relax in your hotel or walking around city to visit Dalat flower garden and Crazy house. Have lunch on the way go to Mui Ne. \nArrival Mui ne, you will visit the white sand dunes which located by a lake. you can walk up the hill to feel the cool air or can go up by a 4 wheels adventurous car. after that we go ahead to mine, and see the fishing village, take some beautiful pictures and we you at your hotel.\nAccommodation: Hotel in Mui Ne\nMeal: Breakfast at hotel\nLunch at local restaurant"},{"title":"MUI NE HO CHI MINH CITY (L/D)","description":"A lazy morning with breakfast around the pool is welcomed before we head out to Ho Chi Minh City. Have lunch on the way. \nArrival Ho Chi Minh, visit Ben Thanh market is a large marketplace in central Ho Chi Minh City, Vietnam in District 1. The market is one of the earliest surviving structures in Saigon and an important symbol of Ho Chi Minh City, popular with tourists seeking local handicrafts, textiles, áo dài and souvenirs, as well as local cuisine. Then, you can walk around Nguyen Hue Street – Walking street in Ho Chi Minh to enjoy the atmosphere in here.\nAccommodation: Hotel in Ho Chi Minh\nMeal: Lunch at restaurant"},{"title":"MEKONG DELTA (B/L)","description":"We head for the Mekong Delta, aptly known as Vietnam’s food bowl. Today is all about food, we check out local fish farms and fish markets by boat, meet a local fruit farmer at his house where we can relax and enjoy some of the local fare. Check out the coconut farms and watch them make the famous local coconut candy (seriously addictive!). After lunch we take a bike around 1hour – 1 hour 30 min to explore town before comeback Ho Chi Minh city.\nAccommodation: hotel in Ho Chi Minh\nMeal: Breakfast at hotel\n         Lunch in local restaurant"},{"title":"HO CHI MINH CITY DEPARTURE (B)","description":"There are no activities planned for the final day so youre able to continue the rest of your journey at anytime. If youre still not ready to leave, why not extend a few more nights and discover more of what the city has to offer!\nAccommodation: hotel in Ho Chi Minh\nMeal: Breakfast at hotel\n       "}]}]