[{"name":"Acrossing Vietnam 10days/9nights","duration":10,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1403,"summary":"Highlights of trip:\n\n  Visit some of the most popular sites in Vietnam.\n  Luxury junk cruise on the legendary Ha Long Bay.\n  Exploring Sapa is a small market town that has been a gathering spot for many local hilltribes for nearly 200 years. Hmong and Dao people, among others, still come here to conduct trade, socialize, and attend an ephemeral “love market,” where young men and women choose one another for marriage\n  Discovery the poetic city Hue & the ancient town Hoi An.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114392_31256e56.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114392_31256e56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114392_3cee3981.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114392_853913ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114392_102b2b8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114392_4231b4e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114392_38bc665e.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1 : Hanoi arrival – (D)","description":"When arriving, welcome at the airport and transfer to your selected hotel.\nTake a rest after the flight.\nEarly in the evening, join a water puppet show, a distinct Vietnamese art in which a split-bamboo screen obscures puppets which stand in water and are manipulated using long poles hidden beneath the water.\n\n\nDinner at a local restaurant. Overnight in Hanoi."},{"title":"Day 2: Hanoi city tour – Lao Cai .Overnight on Train (B,L)","description":"After breakfast, In the morning Have breakfast at your hotel\n\n\n7:30 -8:00am Pick up at your hotel then Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the WestLake.Visit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n\n\nRelax and have lunch at a local restaurant in Hanoi Old Quarter.\n\nIn the afternoon: \n\nIf Tuesdays/Thursdays/Saturdays or Sundays: Visit Temple of Literature constructed in 1070 dedicating to Confucius, sages and scholars. It was also the first university of Viet Nam once. \nArrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians. \n\n\nIf Mondays/Wednesdays or Fridays: Explore daily life of traditional ceramics village of Bat Trang. Visit showrooms and see how they model the products. Arrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians. Come back to your hotel. Dinner on your own. \n\n\nPick up at your hotel at 19h30 – 20h15 and transfer to Hanoi train station catch the night train to Lao Cai (Train time: SP7/20:35 – SP1/21:10 – SP3/21:50). \n\nOvernight on Train"},{"title":"Day 3: Lao Cai –Sapa –Lao Chai –Ta Van –Giang Ta chai village (B/L/D) –Joining tour","description":"05:30 – 06:00\tPick up at Lao Cai train station by our staffs for a drive to Sapa by bus.\n\n07:00 \tHave breakfast and relax at hotel. If hotel has available room, you can check in early, if not you join in tour first.\n\n\n09:00\tOur guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van and Giang Ta Chai villages. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12kms.\n\n\n17:00\tWhen you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.\n\n Dinner and Overnight in Sapa."},{"title":"Day 4 : Sapa –Cat Cat Village – Hanoi .Overnight on Train (B/L/D) –Joining tour","description":"Have breakfast at hotel.\n\nOur guide takes you to visit Cat Cat village of Black H’mong people. You have a chance to visit a waterfall and the hydroelectric power station built by the French, see the life of local through their houses, their handicraft products\n\n\nBack to Sapa town and have lunch on restaurant. You are free and easy to discover Sapa town on your own.\n\n\nTransfer from hotel to Lao Cai train station. Have dinner at the restaurant, near the train station before getting on the night train to go back to Hanoi. \n\nOvernight on the train."},{"title":"Day 5 : Hanoi – Ninh Binh –Bai Dinh Pagoda –Trang An (B/L)","description":"Arrive in Tran Quy Cap station at 5:00am early morning .Our driver take you to hotel ( You have 1 room for take shower and have breakfast from 5:00 -8:00 ) before starting to Ninh Binh.\n\n\n08:30 Tour guide picks you up at suggested places around Hanoi Old Quarter\nDepart for BaiDinh pagoda and Trang An eco-tourism site. Have short break en-route to free your legs. Arrive in Buddha Sanctuary place of BaiDinh pagoda, the biggest one in Vietnam.\n\n\n12:30 \tHave lunch in a restaurant with local special dishes including goat meat. Leave for Trang An eco-tourism attraction. You will be amazed by neglected area while having a boat trip through cave chains: Sang Cave, Toi Cave, Ba Giot Cave, Sinh Cave…experiencing mysterious views of the so-called “Ha Long Bay in land”\n\n\n19:30 Back in Hanoi, get dropped off at your morning address. Overnight in Hanoi"},{"title":"Day 6: Hanoi – Halong Bay (B/L/D) –Joining tour","description":"7:45 – 8:30 Meet your tour guide at suggested places around Old Quarter for Ha Long Bay.\n\n\n12:30 Embark at Tuan Chau habor, Ha Long city. Transferred by tender to the Viet Beauty Cruise.\nGreeted by crew members followed by welcome drinks, get cruise briefing and check in cabin.\n\n\n13:00 Savor lunch on board while cruise heads to center of Halong Bay.\n\n\n15:00\tExplore Sung Sot Cave, the biggest cave in Halong Bay which famous for its wonderful stalactites and stalagmites.\n\n\n16:00\tVisit Titop Island for swimming or take a short walk to the top for some overview photos of Halong Bay\n\n\n18:00 \tEnjoy sunset while local wine and fruit is served\n\n\n18:30\tAttending cooking lesson to make some spring rolls by yourself.\n\n\n19:00 \tHaving dinner on board, then free relax with other choices: Squid fishing, singing karaoke, relax on sundeck….Overnight on Cruise"},{"title":"Day 7: Halong bay – Hue by Train (B/L)","description":"06:30 Start your morning with the Tai Chi class up in sundeck\n\n\n07:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board\n\n\n08:00 Visit Me Cung Cave (Maze Cave) with layers of fossillized shells which present the history formation of Halong Bay.\n\n\n09:00 Stop by Pearl Farm to study the culture pearl making process.\n\n\n09:30 Check out your cabin. Time for brunch while Vietbeauty cruise heads back to habor.\n\n\n12:00 Disembark habor. Say goodbye to Halong Bay.On the way back to Hanoi. Our driver pick up  then transfer directly  station catch train to Hue. Overnight on Train."},{"title":"Day 8 : Hue city full day (B/L)","description":"Arrival in Hue. Guide and driver take you to have breakfast then transfer to take a boat for a cruise on the gentle Huong River passing Dong Ba market and visit Thien Mu pagoda on the riverbank and  Emperor Minh Mang’s tomb, reminiscent of the Ming tombs in Chinese pavilions, ponds and gardens is known for its perfect harmony between architecture and its natural environment. It began to be built during his reign (1820-1841) and was completed only in 1843, two years after his death by his successor Thieu Tri.\nLunch at a local restaurant.\n\n\nIn the afternoon, visit the conical hats and incense stick making village.\nDiscover Emperor Khai Dinh’s mausoleum, which is unique among the royal tombs in Hue, Vietnam. Where other royal tombs are expansive and invite respectful reflection, The Nguyen Emperor Khai Dinh built his final resting place to be monumental in style and bombastic in execution.\n\n\nOvernight in Hue."},{"title":"Day 9: Hue –Danang – Hoian (B/L ) 100km -2hoo","description":"After breakfast, transfer to Da Nang through Hai Van Pass and through the picturesque fishing village of Lang Co.\n\n\nWhen arriving in Da Nang, visit the Cham Museum and Marble Mountain,  (Ngu Hanh Son) is about 8km southeast of Da Nang City. This is a cluster of five marble mountains lying close to the sea. That is why, it is dubbed Hon Non Nuoc, which means Mountain and Water in Vietnamese.\n\n\nContinue to the riverside town of Hoi An, an important trading port during the 17th and 18th centuries and officially listed as a World Heritage Site.\n\n\nLunch in a local restaurant.\n\n\nIn the afternoon, walk around Hoi An ancient town and exploring its treasures :\nQuan Cong temple – the brave and loyal Chinese General.\nPhuc Kien pagoda, This is the most well-known assembly hall in the ancient town.Fukjianese were Chinese traders who first came to Hoi An in great number, at least in the XVII century. That was the reason why all above mentioned gods were worshipped in this pagoda after the collapse of the old pagoda.\nThe Japanese Bridge, Hoi An’s signature landmark used widely as an emblem of the town. It was built by Japanese merchants in the 16the century\n\n\nTan Ky ancient house, the most popular of Hoi An’s old houses.\n\n\nHoi An port, the World Heritage listed by Unesco.\n\n\nDinner on your own. Overnight in Hoian."},{"title":"Day 10 : Hoian – Danang Airport (B)","description":"After an early breakfast, transfer to Danang Airport. End of services !\nAirport. \n\nEnd of services !"}]},{"name":"Northern Vietnam adventure 8D7N (Hanoi to Hoi An)","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":475,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/180464_0434c1ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/180464_0434c1ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_10e7d7ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_52aa475f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_494560c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_3be80417.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_c77c78fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_28ac5877.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_671cdf9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_5004005a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_0cc4f471.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_5be79d6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_5b8a343f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_abb7f696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180464_eeffd064.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi arrival (no meal)","description":"Welcome to Hanoi ! You will be greeted by the driver, then transfer to hotel for check in.\nThe rest of day is your own at leisure.\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ha Long - Sung Sot cave (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 3: Ha Long Bay- Hanoi- night train to Hue (B/L)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi. \nYou are free until the driver transfer to Hanoi station, take night train to Hue. Overnight on the train."},{"title":"Day 4: Hue arrival- Culinary tour half day (D)","description":"The driver will pick ip and transfer to the hotel. You relax here.\n06:00 pm: Cyclo pick up you at hotels in focus at your hotel.\n06:20 pm: The tour guide will take you to “HANG ME restaurant”, located on Vo Thi Sau street to enjoy there specical cakes of Hue (Beo, Nam, Loc cakes...).\n07:15 pm: Cyclo take you to “HEN ISLAND” to enjoy clam dishes such as clam rice, clam noodles.\n08:00 pm: After enjoy Hen island’s foods, you will continue the culinary trip to Dinh Tien Hoang street to enjoy favorite cakes “BANH KHOAI - NEM LUI” (Hue specialities spring rolls). You will have chance to enjoy sweet soup of Hue and also purchase special products souvenir such as: sesame candies, conical hats, sour shrimps, long dress (Ao Dai), Minh Mang wines.\nAt the end, cyclo take you around streets to admire some romantic places at night such as Imperial Citadel, Truong Tien bridge, Perfume River…\n09:30 pm: Ending tour. Cyclo take you back to the hotel.\nOvernight in Hue."},{"title":"Day 5: Hue city tour (B/L)","description":"MORNING: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conical Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nAFTERNOON: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue."},{"title":"Day 6: Transfer Hue to Hoi An (B)","description":"Have breakfast at the hotel and then move to Hue.\nThe rest of the day is yours to explore the stunningly preserved Old Town and soak up the rich local history. Tonight head out and experience the lively local atmosphere!\nOvernight in Hoi An."},{"title":"Day 7: Tra Que village - cooking class (B/L)","description":"08h00: Tour guide picks you at your hotel lobby. Then ride a bicycle to Hoi An's colourful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients to be used in the cooking lesson later. So make sure your camera is handy.\n10h00: Continue to Tra Que herb village. Welcome drink for a rest and walk through the market gardens where local famers work on their fields using traditional methods of hundreds of years ago.\n11h00: Working together with the chef. Learn the traditional ways of preparing  and cooking Vietnamese food. The chef shows you how to cook . After the lesson, enjoy what you have cooked.\n13h00:  Back to the hotel\nOvernight in Hoi An."},{"title":"Day 8: Hoi An- Da Nang transfer- Departure (B)","description":"No activity is planned today. You are free until the driver transfer to  Da Nang for flight back home. You also extend the trip in Da Nang.\nEnd of the service !"}]},{"name":"Discovery Hanoi, Halong, Catba, Lan Ha Bay and Ninh Binh 6 days 5 nights","duration":6,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":430,"summary":"Take 6 days 5 nights to discocery Hanoi, Ha Long Bay, Cat Ba national park, Lan Ha Bay and Monkey island, Ninh Binh, Tam Coc with 6 days 5 nights you have a chance to visit many beautiful places.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187688_8db75b6e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187688_8db75b6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_09238083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_b4bf08c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_b56265a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_02f32372.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_e4e1ef84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_f0b67d32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_79bb08c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_21632c25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_e74ae8d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187688_5a00dc24.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Ha Noi.\n"},{"title":"Day 2: Hanoi - Ha Long Bay (B,L,D)","description":"7:45 to 8:00  Pick-up at hotels departure to Ha Long Bay with stopovers for  refreshing en route.\n12:00 Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n14:30 Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16:00 Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18:00 Come back to cruise later to enjoy sun set party and cooking class with fresh spring roll.\n19:00 Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20:00 Join the fishing excursion or singing karaoke, have a drink or dancing at the bar, \nOvernight on board\n"},{"title":"Day 3: Ha Long Bay - Cat Ba National park, Cat Ba town (B,L,D)","description":"6:00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n7:00 Your breakfast will be ready in quite bay.\n8:00 Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n8:30 Start doing kayaking paddle explore by your own way around the bay\n10:00 Check out your cabin, ready for housekeeping clean cabin to welcome new group\n11:00 Lunch is serve onboard\n12:00 Our guide will take you to speed boat passing the bay to Gia Luan Harbor\n13:00 Our local tour guide take you to visit Cat Ba National Park  is a tourist attraction to millions of domestic and oversea visitors. Coming to the Park, travelers not only could worship the beauty of landscapes, seascapes\n15:00 Keep moving to visit Trung Trang cave has an ecosystem in mysterious darkness, home to many species of creatures such as bats, birds, insects and reptiles. The lighting system is very limited to preserve the characteristics of the ecological environment in the cave. \n16: 00 Get on the bus to Cat Ba town check in hotel. Free time \n19:00 Have dinner in your hotel, overnight in hotel\nOvernight in Cat Ba \n"},{"title":"Day 4: Lan Ha Bay - Monkey Island - Ninh Binh City (B,L,D)","description":"7:30 Start the morning with breakfast served at hotel\n8:30 Our driver will pick you up from your hotel to Beo Harbor get on the boat to visit Monkey Island is a very beautiful. This island has 2 beautiful beaches for swimming and there is mountain for go up to take nice pictures of Lan Ha bay with thousands of islets around.\n11:00 Lunch in hotel, then check out your room\n12:30 Get on the bus departure to Ninh Binh, say goodbye Amazing Cat Ba Island\n17:30 Arrive Ninh Binh, check in hotel\nOvernight in Ninh Binh\n"},{"title":"Day 5: Hoa Lu - Tam Coc - Hanoi (B,L)","description":"7:00 Have a breakfast at bungalow \n9:30 Check out and the driver will pick you up at your hotel transfer to join with a group \n10:00 Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century.\n12:30 Arri7:00 Have a breakfast at bungalow \n9:30 Check out and the driver will pick you up at your hotel transfer to join with a group \n10:00 Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century.\n12:30 Arrive Tam Coc, relax and enjoy lunch in a nice restaurant nearby.\n13:30 Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi.\n16:00 get on the bus back to Hanoi \n18:00 to 18:30 Arrive Hanoi, drop you off at the hotel. \nve Tam Coc, relax and enjoy lunch in a nice restaurant nearby.\n13:30 Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi.\n16:00 get on the bus back to Hanoi \n18:00 to 18:30 Arrive Hanoi, drop you off at the hotel. \n"},{"title":"Day 6: Hanoi City Tour - Departure (B,L)","description":"07:40 - 8:30 Meet your tour guide .\nStart the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university. \nLeave for a legendary Hoan Kiem lake and Ngoc Son Temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians. \n16:00 Arrive back in your hotel. Free and easy until my driver pick you up at your hotel transfer to the airport. End of services\n\n"}]},{"name":"A Jouney to Forbidden Wildlife in Central Vietnam","duration":6,"travelStyle":["In-depth Cultural","Adventure","Local Living","Group","Partially Guided","Historical","Holiday"],"oldPrice":0,"price":1401,"summary":"Central Vietnam is not only famous by the Golden Bridge. This is also a land endowed with nature's wild landscapes, natural architectural works with historical value. Besides, Bach Ma National Park is located next to the ancient capital - Hue is a perfect place for those who love to explore nature. Son Tra Peninsula, also known as the green lung of the city.  This trip will take you to visit other aspects of the land famous for a more adventurous style with a Jeep, mingling with locals and the bustling life with scooters. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186127_32122a6f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186127_32122a6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_58629c18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_2fb40914.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_73e0c045.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_bb54a2d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_8075855f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_fcd0e7ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_600a7938.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_b71e2f26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_5c35b550.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_156a5edd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186127_77b7c60c.jpg"],"destinations":["Hoi An","Hue"],"timeline":[{"title":"Day 1: DA NANG ARRIVAL – HOI AN – ROMANTIC SUNSET DINNER ON CRUISE","description":"You will be welcomed at Danang airport and transferred to your hotel in Hoi An for check in. (Check in time after 14:00pm).  At 16:30 We will pick you up to the pier for your two-hour Romantic Sunset Dinner Cruise on the rivers of Thu Bon and Hoai. This river cruise is all about relaxation and showcasing the stunning Hoi An river culture and the beauty of the setting sun on the waterways.  \n \nAt 16:45 The Captain and crew will greet you as you step onto the boat. Once on your deck, our hostess will escort you to your private table. A welcome cocktail and an amuse-bouche are served upon boarding, setting the scene for the unforgettable evening ahead. Don’t forget to have your camera in hand to take nice photos as the sun going down behind the mountain and all fishing activities on the river while cruising on Thu Bon river. \n \nAt 17:00 Start cruising. Chef will prepare a 5-course meal “live” and your every wish will be catered to by the cheerful staff. A great way to start your evening is by watching the boat cast off from outside observation deck and it is also a fabulous opportunity to make your best wishes by lowering floating candle lantern into the river from the boat. Upon your return to the pier, the crew will wish you farewell.   Nice background music Guide will drop you off at hotel. Overnight in Hoi An. "},{"title":"Day 2: HOI AN – VESPA TOUR ADVENTURE – WALKING TOUR THROUGH ANCIENT HOI AN – DA NANG","description":"Have breakfast at hotel. \nSetting off from the ancient town, guests will take the river aboard a local bike ferry and head into the morning of Cam Kim island’s fishing port, stopping at a traditional boat builders yard before setting off to explore the relaxing island villages. Zig-zagging through breathtaking scenery of rice paddies and farmland, taking stops along the way to learn from friendly local families the art of mat weaving, farming and how to make (and eat) the perfect banh dap (rice cracker). Riding into a small village we stop at a local café to fuel up on local drip-coffee, gearing up for an adrenalin pumping 300 metre bamboo bridge river crossing to the opposing landscape of the sea-board side of the island making our way to Duy Hai market and harbour. Here, the local ferry crossing takes guests to the water coconut palm fringed Cam Thanh and beyond to Tra Que Fishing Village for a fish cracker stop, before our final seafood lunch destination on the shores of the beautiful Ha My beach.  \n 2\n  \nAfternoon, your guide will show you around the old town. You'll start a walking tour with numerous places of interest: the 400-year old Japanese Covered Bridge, the Phuc Kien Assembly Halls, a museum and the colorful local market. Following the narrow lanes, you walk along tiny streets with houses influenced by Chinese, Japanese, French and European architectures. \n \nAfter your walking tour, your time will be at leisure to wander around or go shopping. Drive to Da Nang for your overnight.  Overnight in Da Nang. "},{"title":"Day 3: DA NANG – BACH MA NATIONAL PARK BY JEEP – HUE FORMAL CAPITAL (B/L)","description":"Have breakfast at hotel. \n08:30: Pick up at hotel by Jeep and transfer to Bach Ma National Park about 70km to the South of Hue City. This kind of vehicle embraces the freedom, inspires discovery spirit, encourages the toughness and most of all brings sense of self actualization. Jeep by itself is not simply the mean of transportation but represents the new way of travel. Travel along National Highway 1A and pass through beautiful landscapes of rice fields, mountains scenery and bamboo ranges, stop at Cau Hai lagoon for sight seeing and taking picture. On arrival Bach Ma National Park Visitor centre, you will take an overview of the park at the centre before transferring to the summit of the mountain on the distance of 20km more. Upon arrival the summit you will visit Hai Vong Dai by trekking there and catch the panorama of Lang Co Beach, Cau Hai Lagoon with spectacular sights. On cool day the summit is covered by cloud as paradise.  Having lunch at restaurant. After lunch, keep trekking and walking through the forest on path to reach Five Lakes where you can swim on pure water of these romantic pools. You will stop at Lake No. 5 to take a rest, soak in cool water of the lake.  After that, you continue trekking to Do Quyen waterfall, a beautiful and majestic waterfall of the national park. Do Quyen waterfall is about 300m in height. From the top of the waterfall, you will have a good view of water falling to the rocks, see the forest below and clouds on the sky. Especially, you can get to the foot of the waterfall by passing more than 600 steps. Despite a hard trip, it will be a good idea for those who want to challenge themselves. The beauty of the waterfall viewed from its foot is worth your effort. Don’t forget to take some photos to show your friends that you have been here. 16:00PM: Return Hue city after the trip.  Enjoy special dinner at Royal Park Restaurant with Hue Royal formality. You are served with royal  delicacies in such a royal atmosphere with guards and female maidens serving around. Overnight at hotel in Hue. "},{"title":"Day 4: HUE – THUY BIEU VILLAGE – FISHING ACTIVITIES – WATCHING SUNSET ON TAM GIANG LAGOON – HUE","description":"Have breakfast at hotel. \nTake a boat trip to Thuy Bieu Eco-Village. Thuy Bieu is the cradle of Hue culture. The village is surrounded by a corridor of natural and cultural attractions. To the north, south and west is Perfume River and to the east is a stunning backdrop of low hills, including Vista Hill. The French figuratively put it “Belvedere”, this place allows you to contemplate panoramic view of Hue and Perfume. Visit the Thien Mu pagoda – the symbol of Hue city., then continue cruising to Thuy Bieu Village – famous for Thanh Tra fruit.  Visit the garden – house, ancient ancestral temple and communicate with local people. Visit joss paper making family to know more about a traditional custom of Vietnamese people and know why they use joss paper, also known as ghost money,  for the died people. Visit paper painting family to see the countryside painting art of the young local artists. Have lunch at local house with Hue traditional specialties. Relax by steeping your foot in medicinal herb water – a traditional therapeutic practice.  Return back to the pier and get ready to Tam Giang Lagoon.  \n 3\n  \nOur car will drive through Thanh Ha Pottery Village and visit the forgotten Old town of Bao Vinh where once was the center of trading in late 17th and 18th century in Central Kingdom of Nguyen Lords. The car also drives on the countryside road; you can see water buffalos, cows, river fishing and farming activities… Photo stop on the way and visit Thu Le Temple where Vat Thu Le (old traditional Wrestling festival Thu Le Village) is held every 6th January in lunar calendar.  Visit Bao La handicraft village and experience with local people to learn how to make simple products from bamboo like baskets, fan… or more complicated products like lanterns, fishing tools.  Cycling/walking around peaceful and ever green village, meet children who ride on their buffalos (you can ride on buffalos if you want) or visit the village school to share your happiness or unused things to kids.  Visit one of traditional local house to learn their lifestyle, worshiping tradition, then go to their garden to watch how they harvest water melons, sweet potatoes, cassava, pumpkin, green beans… which depending on seasonal crop. Reach Ngu My Thanh Village, have welcome tea before walking tour around fishing village to meet with children and local people. Boat cruise around Tam Giang Lagoon and learn about sustainable aquaculture development, the method of raising, catching and preservation of lagoon aquaculture. Try yourself to row a sampan boat, or walking on the lagoon to catch fishes, shrimps, clams, snails… Enjoy dinner on boat in the middle of the Lagoon. You will find yourself very relaxing and peaceful. Watching beautiful sunset and try some steamed or roasted seafood and local foods. At 19:00 say goodbyes with local people and drive back to Hue. Drop off at your hotel.  Overnight at hotel in Hue. "},{"title":"Day 5: HUE – DA NANG – SPOTTING WILDLIFE OF MONKEY MOUTAIN – SPA – DA NANG (B/L/D)","description":"Have breakfast at hotel. \nPick up from hotel and transfer to the city Da Nang. At our meeting point, you will change to a Jeep. The Jeep will drive you along the coast, head north to Son Tra Peninsula. Son Tra is a perfect Get-a-way from Danang City exploring the narrow jungle roads by jeep or hike through the Jungle in search for some exclusive wildlife. Still largely covered with dense rainforest it gives a home to the rare Red Shanked Doucs. A primate which is a common find up in the trees of the Son Tra Jungle but elsewhere in South East Asia quite difficult to spot. Have several stops to make sure that you will not miss any special moment. Drive on the forgotten road and visit the former heliport of the US Army where helicopters used to supply goods to US soldiers, pick up the corpses and send to the USA aircraft carriers before sending home. Getting down the mountain to visit Linh Ung Pagoda, the pagoda features a white statue of the Goddess of Mercy, it is now a ‘must visit’ in Da Nang City. You will have chance to take a swim at Tien Sa Beach (angels landing), one of the most calm and relaxing beaches in Danang! Lunch and dinner at a local restaurant. Return back to your hotel for relaxing. Enjoy your last memorable minutes in central Vietnam by Spa package: One 60-minutes Vietnamese massage for 2 persons  Overnight in Da Nang."},{"title":"Day 6: DA NANG – DEPARTURE","description":"Check-out hotel (before 12:00 PM – noon time). Free at leisure.  Transfer to the airport in Da Nang for leaving flight. End of services. "}]},{"name":"North And Central Hightlight Of Vietnam 9 Days Adventure With Halong Bay - Sapa Trekking - Paradise Cave - Zipline - Cham Island Snorkeling","duration":9,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":699,"summary":"If you love Vietnam by its hidden beauty, this is the right trip for you. This 9 day trip is an adventure holiday covering Hanoi - Sapa - Halong Bay - Dong Hoi - Danang - Hoi An with collection of hiking, kayaking, biking, zipline and snorkeling, etc. . ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186682_06c3df64.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186682_06c3df64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_34e5e10b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_1c88fe29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_740bb3ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_81b58f9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_2ea77413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_569c6759.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_5caf1227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_8247c046.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_68ee4a83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_d49c0c43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_d491f980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186682_4c874890.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An"],"timeline":[{"title":"DAY 1: WELCOME TO HANOI - VIETNAM!","description":"Your trip begins with arrival in Vietnam. \nUpon arrival, please go to custom desk as your first point of entry into the country and\npresent these documents for visa upon arrival. After collect visa and luggage,  Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag.Or You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area\nOvernight in Hanoi Hotel\nMeal: None\n"},{"title":"HANOI - SA PA - ETHIC CAT CAT VILLAGE (B/L/D)","description":"6.30 – 7.00: Pick up from your hotel in Hanoi Old Quarter , get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costumes of H’mong, Dzao, Tay ethnic People. Our tour guide will inform short information to you before checking in then enjoy the set menu lunch with Vietnamese cuisine.\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, go trekking down to the valley bottom to the waterfall - Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk up hill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. Free at leisure until 19:00 Have dinner and overnight in hotel with night activities.\nOvernight in Sapa Hotel\nMeal: Breakfast, Lunch and Dinner"},{"title":"Y LINH HO - LAO CHAI - TA VAN - MUONG HOA VALLEY - HANOI (B, L)","description":"7.30 – 8.00: Have breakfast at hotel, check out the room and prepare light pack for trekking. (Big luggage keep in hotel store)\n8.00: A short trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Our bus picks you up at Ta Van Bridge to get back Sapa.\n12.30 - 13.30: Have lunch in the hotel.\n13.30 - 14.45: Relax and leisure on your own, have shower in the public bathroom in the hotel if you want.\n14.45 - 15.00: Meet all group members at hotel to get ready for Hanoi.\n15.30: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: We say goodbye to you at your hotel in Hanoi Old Quarter. Finish the trip to Sapa Tour 2 Days 1 Night by Bus\nOvernight in Hanoi Hotel\nMeal: Breakfast, Lunch"},{"title":"JOURNEY TO PARADISE ON EARTH - HALONG BAY CRUISE (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise. Take a route most scenic to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \n\t\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\n\t\nOvernight on cruise\n"},{"title":"HALONG - HANOI - TRAIN TO DONG HOI (B/L) - TRAIN 20:00 05:30","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. \nLater, transfer to the station and take the overnight train to Dong Hoi.\nOvernight on Train/ share sleeping cabin( each cabin for 4 persons)\nMeal: Breakfast, Lunch "},{"title":"PARADISE CAVE - ZIP-LINE - DARK CAVE - KAYAKING - SWIMMING(B/L)","description":"05:30 AM Our driver and Guide will pick you up at the station and transfer you to the hotel for the breakfast.\n08:00AM pick up from hotel go to Phong Nha Ke Bang national park.\n09:00\nVisit Paradise Cave.\nParadise Cave is first discovered in 2005 by the British Cave Research Association, It’s a largest and most beautiful cave in the Phong Nha Ke Bang National Park area by British spelunkers. It is said that the cave's beauty is reminiscent of an imperial palace and very well resented with easy access, great walkways, and excellent feature lighting which made it extra special.\nTaking the electrical car from the parking to the foothills of the cave (2km).\nAdmire countless stalactites with different shapes.\n11:30 Lunch at a restaurant with local specialties from the people here processing.\n13:00 Continue the journey to visit the Chay River - Dark Cave\n13:30\nGetting near to the cave entrance by 400 meters long zip-lining with 10 meter high or by kayaking for those who get fear of high places.\n15 meters swimming to the cave on the cool water will wake you up. At the end of the cave, mud bath is the most interesting spot that once you get dipping into it, you will not want to get out of it anymore.\nSwing, mini-ziplines with obstacle course are waiting for you on Chay river. Swimming in cool blue water is one of remarkable experiences in your life - must be in your bucket list.. You will have a very interesting experience when take part in this cave.\n16:00 - 16:30 Vehicle transfer you back to Phong Nha town or Dong Hoi City.\nOvernighgt in Dong Hoi \nMeal: Breakfast, Lunch "},{"title":"DONG HOI -TRAIN TO DANANG/ HOI AN - HAI VAN PASS- LANG CO BEACH 0800 13:30 (B)","description":"After breakfast, you will tranfer to Train station to go Danang - passing Hai Van Pass and Lang Co beach with 6 hours.\nUpon to Danang, transfer to your hotel in Hoi An. \nIn the afternoon, you can take a walk to explore the Ancient Town on your own including the Japanese Bridge, Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture, Phuc Thanh Pagoda – the oldest pagoda in Hoi An built in 1454 with Chinese bonze. Hoi An is also famous for shopping includingg tailoring shops, handmade shoes, handbags.\nOvernight in Hoi An Hotel\nMeal: Breakfast"},{"title":"CHAM ISLAND SNOKERING (B/L)","description":"“Cham Island is located of the coast of Hoi An and is a beautiful and fun getaway. We will start the day at Cua Dai Beach to embark on a speed boat toCham Island. After a short 40 minute ride you will arrive at Cu Lao Cham, a large island that consists of several small islands about 25 nautical miles off the coast. The island has a plethora of beautiful coral reefs and stunning scenery along with about 3.000 residents living at Lang and Huong beaches. The living reef around Cham Island offers some of the best opportunities in Asia to see exotic fish in their natural habitat.”\n08:00AM Pick up at hotel ( Hoi an city) to Cua Dai harbor. Relaxing in fresh cool wind , you will enjoy the beautiful landscape on a Hoi An Green speed boat to Cham Island.\n08:30AM Arriving at Lang Beach.Visiting the Marine Protected Area, The Boat Shelter, Hai Tang pagoda, Traditional fishing Village.\n10:00AM Swimming and snorkeling.\n11:30AM Staying at Bai Chong or Ong Beach ecological zone, swimming, taking time to enjoy a sea food lunch.\n14:00PM Packing luggage for return trip to Hoi An\n14:30PM Seeing you off at your hotel and finish your trip\nOvernight in Hoi An Hotel\nMeal: Breakfast, Lunch"},{"title":"DAY 9: HOI AN - DEPARTURE BACK HOME (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Discover Hanoi, Halong, Cat Ba and Ninh Binh 6 Days 5 Nights","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":430,"summary":"With 6 days 5 nights you can join with package to visit Ha Long bay, Cat Ba island, Ninh Binh with Hoa Lu and Tam Coc back to Hanoi.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db041280d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db041280d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db042dba1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0433c2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db043982f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db043f54e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0445283.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db044aefb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0450b64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0456737.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db045c253.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0462008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0467a84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db046d6ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db04733c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db0478fc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187485_5e02db047ef36.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Hanoi Arrival Meal)","description":"Well come to Ha Noi, our driver meet and transfer you to downtown. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. \nCheck in hotel. Free and easy to discover Ha Noi by yourself \n"},{"title":"Hanoi - Ha Long Bay (Breakfast, Lunch, Dinner)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board \n"},{"title":"Ha Long Bay - Pearl Farm - Cat Ba National Park, Trung Trang Cave - Cat Ba (Breakfast, Lunch)","description":"Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the\nisland on the bay (accept winter time have no sunrise)\nYour breakfast will be ready in quite bay.\nOur cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\nStart doing kayaking paddle explore by your own way around the bay\nCheck out your cabin, ready for housekeeping clean cabin to welcome new group\nYou will have short cooking class fresh Vietnamese spring roll.\nLunch is serve onboard\nOur guide will take you to speed boat passing the bay to Gia Luan Harbor\nOur local tour guide take you to visit Cat Ba National Park is a tourist attraction to\nmillions of domestic and oversea visitors. Coming to the Park, travelers not only could\nworship the beauty of landscapes, seascapes\nKeep moving to visit Trung Trang cave has an ecosystem in mysterious darkness, home to\nmany species of creatures such as bats, birds, insects and reptiles. The lighting system is\nvery limited to preserve the characteristics of the ecological environment in the cave.\nGet on the bus to your hotel on Cat Ba Island, check in hotel then free time\nHave dinner in your hotel, overnight in hotel"},{"title":"Cat Ba - Ninh Binh (Breakfast, Lunch)","description":"Breakfast at the hotel. Free and easy in Cat Ba .\n11:30 Have a lunch \n12:30 the shuttle bus pick you up at your hotel transfer to Ninh Binh \n17:30 Arrive Ninh Binh, check in hotel \nOvernight in Ninh Binh "},{"title":"Hoa Lu - Tam Coc - Hanoi (Breakfast, Lunch)","description":"Breakfast at your hotel, free time \n9:00 the driver pick you up transfer to Hoa Lu to join with group to visit Hoa Lu which was once depicted the ancient capital of Viet Nam, settling up in\nthe 10th century.\n- Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old\ntime.\n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground\ndated 10th century.\n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\n14:00 Board the sampan boats in Tam Coc going along river among the villages, mountains and\nrice fields. Passing through 3 caves &quot;Hang Ca - First cave, Hang Hai - Second cave, Hang\nBa - Third cave&quot; to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi\n18:00 to 18:30 Drop you off at your hotel \nOvernight in Hanoi \n\n"},{"title":"Hanoi City tour and Departure (Breakfast, Lunch)","description":"This morning you will visit the Tran Quoc Pagoda. This 1,400 year old temple features ten tiers enclosed by gardens, including a bodhi tree grown from a cutting of the original Buddhist tree under which Buddha sat. Stroll around Hoan Kiem Lake where you’ll see the Tortoise Tower perched on the water. Enjoy a half hour cyclo tour through Hanoi’s the Old Quarter. The cyclo is a historic mode of transportation in the cities of Vietnam where a cyclist leads you while you sit in a canopied seat affixed to the front. Next, visit the One Pillar Pagoda, situated on a pillar made of a single stone, in the midst of a lotus pond. This pagoda was built by a 9th century emperor who saw it in a dream and regarded this as divine inspiration to recreate the structure in his vision.\nYou'll pass by the Ho Chi Minh Mausoleum before visiting the highlight of this day - The Temple of Literature. This ancient university was erected almost a millennium ago and has hosted many of the most prominent scholars through Vietnamese history. The site features many gardens, pools, buildings, and ancient trees whereVietnam’s  best and brightest studied under the guidance of Confucius teachings.\nTour finish at 16:00 to 16:30.\nMy driver will pick you up at your hotel transfer to the airport to take the flight back to home\nEnd of services "}]},{"name":"Mekong River(Sai Gon) To Red River Delta(Ha Noi) 8 Days","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":510,"summary":"Vietnam is a small yet majestic country, offering travellers an exciting mix of adventure and culture. The country’s captivating natural wonders span from the mountainous north and the fertile plains of the Mekong Delta, to the magnificent Halong Bay. With an intriguing history spanning back over 4,000 years, including occupations from both the Chinese and French, the country’s architecture and cuisine is a fascinating testament to cultural diversity.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159239_c9a4df0d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159239_c9a4df0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_d7623745.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_4020670f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_d770b391.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_91f5d170.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_8150c80e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_cd90625d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_adbcb331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_dbb7437d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159239_8f94fb06.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Halong Bay","Hanoi"],"timeline":[{"title":"Ho Chi Minh City Arrival","description":"Upon arrival, please go to custom desk as your first point of entry into the country and\npresent these documents for visa upon arrival. After collect visa and luggage, meet driver at the airport and transfer to hotel for check in and take a rest.\n\n\n"},{"title":"Mekong Delta - Floating Village - Ben Tre Coconut Village (B/L)","description":"Time: start 07:45AM - 8.00AM – return 17.30 – 18:00\nItinerary:\nStart from Ho Chi Minh City and depart to My Tho. Continue on to the harbor, where you’ll board a boat to explore the Delta region. During the cruise on the Tien River you’ll see the Phoenix, Unicorn, Dragon and Tortoise islands, and fishing villages, stilt houses and fruit plantations along the river. Stop at one of the islets for lunch in an orchard garden.\nAfterwards, you’ll continue on your sightseeing tour of the attractions of Ben Tre. A sampan ride will take you along the natural canals in the shadows of water coconut trees. You’ll get a real sense of the charm and tranquility of the area. Stop to visit a coconut fudge family business, taste some of their products and buy your favorite candies in the workshop. Savor fresh fruits as you sip honey tea and enjoy Southern Vietnamese folk music performed by locals.\nTake the bus and back Ho chi Minh City.\n\n"},{"title":"City Tour And Cu Chi Tunnel Full Day (B/L)","description":"We start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war. \nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish. \nReturn to Saigon and end the trip. \nPlease take notes: the Notre Dame Cathedral have been being restored (UNTIL 2022), so the guests just visit outside\n\n"},{"title":"Ho Chi Minh Fly To Hanoi (B) - Flight Included","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Hanoi. Upon arrival, transfer to your hotel."},{"title":"Hanoi Full Day Sigtseeing And Water Puppet Show (B/L)","description":"The colonial capital city Hanoi is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago.\n\nAM: 7.45 – 8.15: Free pick up at your hotel. Then visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West lake (In the pagoda’s garden stands a Bồ Đề (Bodhi) tree, which is attached to a past story. In 1959, on one visit to Vietnam, Indian Prime Minister Razendia Prasat offered the Pagoda a bodhi tree as a gift. The plant was grafted from the holy bodhi tree where Sakyamuni sat in zen (meditation) position and achieved enlightenment in India 25 centuries ago) \n\nLunch at local restaurant.\n\nPM: After lunch proceed to visit the Ethnology Museum (apply on Sun, Tue, Thu &Sat), the Literature Temple, see Vietnam’s first university, constructed in 1070 - it’s gardens and well-preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters, and the beauty of Ngoc Son temple. At the end, journey through Hanoi’s Old Quarter, where you’ll then have a chance for some shopping and exploration. \n\nThen enjoy traditional Water Puppet Show\nBack to your hotel for overnight stay\n"},{"title":"Hanoi - Halong Bay Overnight Cruise (B/L/D)","description":"- 7:45 - 8:30: Our guide will meet you at your hotel. The shuttle bus or private car pick up. Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta. \n   - 12:00 – 12:30 Arriving Tuan Chau Marina .Welcome aboard the cruise. Meet the captain, crew and join us for welcome drink as we tell you about life onboard.\n   - Check into your cabin. Time to refresh and unwind.\n   - Served  a delectable lunch while cruising ahead to Ha Long  Bay\nAfternoon Activities:\n  -  Explore the Surprising Cave – the most beautiful cave in Ha long Bay. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites.\n  - Back to the APRICOT Cruise, We will take you to visit the Titop Island – swimming\n  - Climbing up to the Top of the Island – take the best view of Halong Bay in the Summer time.\n  -  Continue cruising to the quiet area while enjoy beautiful seascape on the way.\n   - After that, come back to the boat, enjoy the Sunset Party on sundeck (free wine & fresh fruits).\nEvening Relaxing:\n   Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board: Clean air – conditioned rooms with private washroom\nMeals: Breakfast, lunch, dinner"},{"title":"Ha Long - Kayaking - Cooking Class - Bus to Hanoi (B/L)","description":"Morning in the bay:\n- 6:30 – 6:45 Start  your day with Tai Chi exercises or a photo hunt\n- 7:00 am: Have breakfast on board while the boat starts cruising to the Natural Preservation Zone.\n- DO KAYAKING in 30-45 minutes.\n- 9:30am: We board the cruise again .Take time to refresh and relax before checking out. Bags can be left in luggage store.\n- Continue your cruise pass through the Bay, passing Ba Hang fishing village, Dog Islet, and         more…\n- Join in the Cooking Class, teaching you how to make our specifically (Spring rolls) before an early lunch is served.\n- 11: 30 – 12:00 Disembark at the harbor, Tuan Chau Marina. \n- Transfer to minibus or private and return to Hanoi\n- Arrival back at your hotel approximately 16:30/17:00\nNote: The itinerary above maybe changes by the effect of weather or different seasons\nMeals: Breakfast, lunch"},{"title":"Good bye Vietnam - Hanoi Departure (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Hanoi Vacation with 2 Nights on La Regina Royal Cruises 5*","duration":6,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":167,"summary":"Sail on Bai Tu Long Bay and Halong Bay\nSpend 03 Nights in Quoc Hoa Premier Hotel 4* in Hanoi\nDiscover Halong Bay and spend 2 Nights on La Regina Royal\nFree Kayaking to explore tunnel caves\nExcellent service with well trained team\nSpend full day to visit Trang An and Bai Dinh Pagoda ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161950_63088cb7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161950_63088cb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_f70bf8a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_f53dc7c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_e0d55f46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_63e0472d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_a010284e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_7f4fdecb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_c94b7e11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_49e22614.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_12a19aca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_39fad878.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_ce6876c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_5580eb3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_edd54148.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161950_f57d2c47.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Airrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - La Regina Royal Cruises","description":"8:00-8:30 Pick up at hotel in Hanoi Old Quater\n12:45 Check in aboard with Welcome Cocktail from crew member while manager introduce the safety briefing and the boat cruising forward to the Bai Tu Long bay.\n13:15 Let your vacation start with a delicious lunch set menu in restaurant\n15:30 Visiting Vung Vieng floating fishing village, one of the biggest village in HaLong Bay, you will have chance to learn about the living of fishermen and feel free with some option activities: bamboo boat or kayaking\n17:30 - 19:00 Enjoy your time with the beautiful sunset on the bay and join “Happy Hour” – 30% Discount off all drinks onboard\n18:30 Cooking class on sundeck with the Deep Fried Spring rolls, one of the unique flavor of Vietnamese food.\n19:30 Dinner will be served on sundeck.\n21:00 Feel free to relax on boat, join Squid fishing at the area of Reception deck or singing karaoke on sundeck."},{"title":"Day 3: Halong Bay - Bai Tu Long Bay Cruises","description":"06:30 Start your day with the Taichi on sundeck.\n07:00 – 8:00 Breakfast serve in dining room.\n8:45 Move to Day Cruise. Free time to relaxing and enjoy beautiful view of Lan Ha Bay\n9:30 Enjoy kayaking at Cong Do area which is one of the most beautiful area on Bai Tu Long Bay\n12:00 Lunch is served in the restaurant\n13:15 Enjoy Fishing Tour with local people\n15:00 Back to the La Regina Royal Cruise\n17:30 - 19:00 Enjoy your time with the beautiful sun set on the bay and join “Happy Hour” – Get a discount 30% of all drinks\n18:30 Cooking class on sundeck with the Deep Fried Spring rolls, one of the unique flavor of Vietnamese food.\n19:30 Dinner will be served on sundeck.\n21:00 Feel free to relax on boat, join Squid fishing at the area of Reception deck or singing karaoke on sundeck."},{"title":"Day 4: La Regina Royal Cruises - Hanoi","description":"06:30 Start your day with the Taichi on sundeck.\n07:00 Light breakfast serve in dining room.\n07:45 Discover Thien Canh Son cave where located on top of mountain, contain the long history of geological value and the natural beauty. Recommend you bring camera and wear sport shoes for hiking.\n9:00 - 9:30 Back to the main boat for relaxing and check out at the reception, please put all your luggage at the outside of your cabin door, crew member will help to bring luggage on land.\n09:30 Brunch is served in the restaurant while the boat heads back to the harbor.\n11:00 Disembark at the harbor\n12:00 Leave Halong Bay for Hanoi.\n15:30 - 16:00 Arrive Hotel in Hanoi. Check in and stay overnight in Hanoi"},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOr you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Vietnam Family Cycling Holiday","duration":10,"travelStyle":["Discovery","Adventure","Group","Fully Guided"],"oldPrice":0,"price":1410,"summary":"Feel the wind in your (helmet-covered) hair on this exciting family cycling adventure through Vietnam. This two-wheeled trip will take you on a journey down country lanes and over spectacular mountain passes, through wildlife-filled natural landscapes, fishing villages, ancient ruins, and some of the region’s liveliest cities. There’s plenty to see off your bike too: Crawl through the Cu Chi tunnels, cruise the turquoise waters of Nha Trang, relax on the golden sand of Mui Ne beach and walk through the charming streets of Hoi An.  With the perfect balance of activities and free time, this trip is bound to get the blood pumping and the family bonding.  To complete this trip, it is important that you and your family are both confident and competent in riding a bicycle.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/169741_a53ffa50.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/169741_a53ffa50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_6b37bfc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_02108abc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_c7a76f48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_b22e54e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_80913821.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_99d6ecd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169741_ddfc4e32.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Dalat","Quy Nhon","Hoi An"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Ho Chi Minh City, Vietnam. Because this trip doesn’t spend much time in Ho Chi Minh City, why not arrive a day or two early to see the sights? Ho Chi Minh City has a dynamic atmosphere and a French influence. Perhaps head to Pham Ngu Lao Street to see the local open-aired market, visit Vinh Nghiem Pagoda or one of the amusements parks.\nAccommodation: Le Duy Grand Hotel "},{"title":"Day 2: Ho Chi Minh City","description":"After breakfast, head out of the city to the town of Hoc Mon (approximately 1 hour) where you’ll embark on a 30 km ride through the rural countryside to the Cu Chi Tunnels. Stop for lunch at a local cafe then visit the impressive expansion of tunnels. The location of the tunnels was of significant strategic importance: they're at the end of the infamous Ho Chi Minh Trail. Initial construction started in 1948 when the Viet Minh required somewhere to hide from French air attacks, and by 1965, the tunnel complex was estimated to consist of 200 km of tunnels. It included, hospitals, schools, meeting rooms, kitchens, and sleeping quarters. Today, the Vietnamese government have preserved approximately 75 km of the Cu Chi tunnels as a memorial park, and in some areas the tunnels have been widened and low powered lights installed so that tourists can now fit through the complex. After your visit, jump in the minivan to Thu Dau Mot for a cooking class with the famous Mrs Cam Van and her students. Ms Cam Van is a renowned chef, who has published nearly 40 culinary books and hosted her own TV cooking show for many years. Eat the fruits of your labour for dinner! \n\nRiding distance: 30 km/18 miles\nAccommodation: Le Duy Grand Hotel "},{"title":"Day 3: Mui Ne","description":"After breakfast, head out of Saigon by bus to Long Phuoc (1 hour) and then swap four wheels for two and start cycling towards the coast. Hit the backroads and head through tropical fruit and rubber plantations, also passing some small fishing villages, as you make your way closer to the coast finishing your ride in time for lunch. Then drive approximately 3 hours to Mui Ne, a tranquil white sand beach where you can witness our first sunset over the South China Sea. Settle into your accommodation tonight in nearby Phan Thiet (30 mins).   \n\nRiding distance: 35 kms/21 miles\nAccommodation: Ocean Dunes Resort"},{"title":"Day 4: Dalat","description":"Today your riding takes you to Dalat. The route will have the occasional climbs as you pass through coffee and tea plantations as well as flower gardens and pine forests.  The support bus will pick you up before the road climbs steeply to the mountain town of Dalat. Dalat is one of Vietnam's most delightful cities and is a perfect base to explore this region. With an appealing Swiss-French feel, along with pleasant lakes, palaces, pine tree-covered hills, flower gardens and pagodas, Dalat is often called the 'city of eternal spring' for its temperate climate. \n\nRiding distance: 35 kms/21 miles\nAccommodation: La Sapinette Hotel "},{"title":"Day 5: Nha Trang","description":"It’s a 2-hour drive to Khanh Vinh through pine forest and paddy fields. This area is home to small villages inhabited by the ethnic minority people of the central highland. Jump back on your bike and follow rural villages all the way to a town just outside of Nha Trang before continuing by bus to the centre of town for approximately 1.5 hours. \n\nRiding distance: 35 kms/21 miles\nAccommodation: Stella Maris Hotel"},{"title":"Day 6: Nha Trang","description":"Today you’ll swap your bike for a boat as you head out to explore the nearby waters. This excursion is often the highlight of the trip for many travellers as you’ll get to snorkel in the turquoise waters and feast on a fresh seafood buffet for lunch. You can enjoy this rest day by lazing in a deck chair or simply go for another swim.\nAccommodation: Stella Maris Hotel"},{"title":"Day 7: Quy Nhon","description":"Today’s cycle is one of the most breathtaking stretches of road you’ll ride – the highway hugs huge granite cliffs and looks out across the deep blue sea. Following parts of the Reunification railway, you’ll enjoy scenery of islands, lagoons and sand dunes. Your destination today is Quy Nhon. The city is filled with long stretches of beach and relaxed boulevards, and as it’s pretty undiscovered by visitors, is a great place to get an authentic slice of coastal life. \n\nRiding distance: 35 kms/21 miles .\nAccommodation: Seagull Hotel"},{"title":"Day 8: Hoi An","description":"Leaving Quy Nhon we travel over the Thi Nai Peninsula and Nhon Hoi Bridge, the longest sea bridge in Vietnam. The coastline features secluded bays, sand dunes and beaches with colourful fishing boats bobbing on the South China Sea. From the bridge we cycle until Tan Thang before catching a ride all the way to Hoi An. Upon arrival in Hoi An you will have some free time to relax, have a swim in the pool or head into Old Town for a wander. \n\nRiding distance: 35 kms/21 miles\nAccommodation: Hoi An Riverside Resort & Spa "},{"title":"Day 9: Hoi An","description":"This morning your leader with take you on a walking tour of the town, which used to be a busy port for the Cham people before the river silted up. There’s also a strong Chinese influence, and you’ll see it as you walk past the pagodas and assembly halls. For lunch learn how to prepare White Rose Cake. White Rose cake is basically a rice paper dumpling with meat. This hands-on experience is one the whole family will enjoy! Afterwards we take a 25-kilometre ride into the surrounding countryside, to cycle to nearby Cua Dai Beach.\n\nRiding distance: 25 kms/15 miles\nAccommodation: Hoi An Riverside Resort & Spa "},{"title":"Day 10: Hoi An","description":"With no activities planned for today, if you have time perhaps you and your family would like to join the My Son Discovery with Urban Adventures. This 5-hour day tour takes you through beautifully tranquil green valleys to the ancient crumbling ruins of My Son, one of Vietnam’s most important historical sites. Enjoy a traditional Aspara dance demonstration and meet a friendly local family who will teach you how to make a delicious snack. Find out more at urbanadventures.com."}]},{"name":"Trekking through Nature Reserve 5 Days( Mai Chau - Pu Luong Nature)","duration":5,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":650,"summary":"Mai Chau and Pu Luong become great destinations for a few day trips from Hanoi for \" Off The beaten path\".","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193689_5e46733124873.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193689_5e46733124873.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e46733124877.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e46733124879.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e4673312487a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e4673312487b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e4673312487d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e4673312487e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193689_5e4673312487f.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. \nUpon arrival, please go to custom desk as your first point of entry into the country and\npresent these documents for visa upon arrival. After collect visa and luggage, Your private guide and driver  will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag.Or You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. "},{"title":"HANOI - A COUNTRY WAY TO MAI CHAU AND TOUR(B/L/D)","description":"08.00: Travel onto Mai Chau by private car. The journey is approximately 3.5hrs, with wonderful scenery including rice paddies and green mountains. A short break along the way is included.\n12h00: Arrive in Mai Chau. Welcome drink with tea, followed by an appetizing lunch. The fresh, tasty dishes on offer include local vegetable, ingredients and flavors such as green bean, black mushroom, fish and chicken cooked in Thai ethnic minority style.\nAfter lunch, start the first discovery to the interesting surroundings and ethnic minority tribes with a walk to Thái villages of Pom Coong and Lac and explore Chieu Cave (1000 step up) on the top side of the moutian for parorama view.\nBack hotel/ homestay for a relaxing time.\n19h00: Complement your experience by sampling delicacies from the local region during dinner time with local family. "},{"title":"MAI CHAU - TREKKING TO PU LUONG NATURE OVERNIGHT BAN HANG(B/L/D)","description":"After saying farewell to the Mai Chau host we start from late morning for a gentle 7-hour trek  with 14-16km by treking through small paths shrouded in vegetation to slowly reveal a picturesque village sitting at the base of a towering mountain  home to a Thai ethnic minority. you weave between roads and farmland, villages and wild fields, ponds and rivers, mountains and open land. Savor the ever-changing scenery as you trek to a beautiful spot to enjoy a simple picnic lunch. After enjoying delicious food, we keep going for 2 more hours to Hang Village where we spend the night with local Thai families in their traditional stilted houses, and have the chance to stroll around the village before dinner. "},{"title":"BAN HANG BEATEN TRAIL TO KHO MUOMG VILLAGE(B/L/D)","description":"The trek is a little harder day today, as we trek uphill into the Pu Luong range, passing through a number of small hamlets and minority villages en route. After 4 hours of gentle ascent, we will then descend to the village of Kho Muong, a village of Thai ethnic minority people, where we spend the night in local homes. \nTrek: Approx. 7 hours, uphill trail and a gradual descent. \nMeals: Breakfast, Lunch, Dinner. \nOvernight: Traditional stilt house."},{"title":"KHO MUONG TREK TO PHO DOAN MARKET - DRIVING BACK TO HANOI - END TOUR.","description":"This morning our final day of trekking takes us along the Pu luong mountain range where we will enjoy lovely views of the tropical forest valley, rice fields and waterwheels until we reach the small market down of Pho Doan where we stop for lunch. After lunch we will meet our car and return to Hanoi (approximately 4 hours), Arriving back in Hanoi around 17:30 PM, where you trip ends.\nTrek: Approx. 3 hours, moderate descent. \nMeals: Breakfast, Lunch, \nOvernight: N/A."}]}]