[{"name":"Sapa Adventure","duration":5,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Group","Fully Guided","Holiday"],"oldPrice":0,"price":327,"summary":"Northwest Vietnam is a captivating mix of dramatic mountainscapes, crisp fresh air and colourfully-clothed hilltribes. Set on the slopes of a beautiful emerald green valley, Sapa is the heart of this unique piece of Vietnam. Travel to this peaceful land and meet resplendently dressed ethnic minorities at the local market, visit neighbouring villages and hike through iridescent rice terraces, witnessing how the current of life has bubbled along here for centuries. This five-day trekking adventure is full of opportunities to be immersed in traditional hilltribe culture and cuisine, while relishing the striking landscapes of Sapa and its surrounds.This Short Break Adventure is a ‘join in’ group departure, which means for some portions of this trip, such as at the homestay, you may join-in with other travellers who have booked on a different style of trip, or through other companies.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108804_cbfe262e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108804_cbfe262e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_03ed85c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_27b46c11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_932413a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_504e4bc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_6fbee6c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_acfa5b2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_228caa15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_d33d8fcb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108804_9b40e851.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Cat Cat Village"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. A welcome pack containing a welcome letter, your trip itinerary, a Sapa information sheet and feedback card will be waiting for you at your hotel. Please ask your hotel's reception for the Intrepid welcome pack upon arrival. \nIn any free time, dive into the barrage of bikes, boulevards and bustling life that characterise Hanoi. Take time to explore the French colonial architecture that decorates the tangled laneways, indulge in a decadent Vietnamese coffee while people-watching from street-side cafes, or step back in time on an exploration of the Old Quarter. \nThis evening you will be picked up by your local guide from your Joining Point Hotel (see below), or from an alternate hotel located in Hanoi's Old Quarter (advised prior to departure), between 6.30pm-7pm. Your guide will first take you for an included dinner and to explain more about the Sapa region. After dinner, you'll be transferred to the train station, where your guide you will give you your tickets for the return train journey. Say farewell to your local guide before you board the overnight sleeper train bound for Lao Cai (departing approximately 9.30pm, approximately 8 hours journey time). The train journey is unaccompanied, and you may be sharing with locals or other travellers.\nAccommodation: Overnight sleeper train"},{"title":"Day 2: Sapa Trek","description":"You’ll be met on arrival into Lao Cai in the early morning (approximately 6.00 am) by a local driver. Your driver will be picking up several other passengers travelling on to Sapa. Transfer to Sapa by minibus (approximately 1 hour), passing through dramatic scenery along the way. \nYou have a free morning to relax and explore this fascinating hillside town. If the weather is feeling generous, enjoy unhindered views out towards the giant staircase of rice terraces that cascade down the side of the mountains. Otherwise, delight in the enigmatic mists that often shroud the Sapa hillsides.\nIn the afternoon, begin a guided 2-3 hour moderate trek down to the hilltribe villages of Cat Cat, often taking a paved path and passing a waterfall. The villages are home to the H'mong people who originated from China about 300 years ago. The H'mong people are easily recognisable by their dark-blue or black clothing. The dye is made from the indigo plant, which is native to the area. H'mong women wear long aprons with embroidered waist-coats and have their hair rolled up into a turban-like hat, while the men wear a black skullcap. You are likely to encounter local H’mong traders, who are often described as persistent and aggressive in their sales techniques. Please respect that this approach is usually the result of the competitive nature of business, and only purchase items if you wish too. In the late afternoon, return to Sapa to spend the night in a hotel.\nAccommodation: Hotel"},{"title":"Day 3: Sapa Trek","description":"This morning after storing your main luggage at your Sapa hotel, set off on a six hour guided trek (approximately 12 - 15 kilometres). Pass along buffalo paths and trails, as well as through several hilltribe villages and resident minority groups such as Red Zao and Tay people. This is a spectacular walk, winding through stunning scenery and elegant rice paddy terraces. Be sure to watch your footing here as there can be uneven slopes, muddy patches, and rocky inclines. The idyllic countryside scenes are like something out of a storybook, and you will encounter some of the friendliest people you could ever hope to meet. Stop for lunch along the way, and finally spend the night in the home of a H'Mong family in Ta Van Mong Village. Perhaps take some time to explore the village after you arrive, wandering down to see the locals paddling in the Muong Hoa River and the Hmong guys cruising around on their motorbikes. You’ll enjoy an included meal of delicious Vietnamese dishes for dinner tonight, prepared by your hosts.\nAccommodation: Homestay"},{"title":"Day 4: Sapa/Overnight Train","description":"After a hearty, energy-giving early breakfast, set off on a 2-3 hour walk to Su Pan Village. Today’s trek is shorter, but the scenery is still beautiful. Take the road to Giang Ta Chai village of the Red Dzao minority via the paths between terraces and through bamboo forests. Walk past waterfalls where buffalo might cool themselves from the heat and cross a suspension bridge. Be sure to take it all in and make the most of the last of your time in these incredible surroundings. Cross Muong Hoa River, then head up to the mountain to visit the last village of the trek – Su Pan. Maybe grab a quick bowl of pho before meeting up with your vehicle for the 30 minute drive back to Sapa. Arriving in Sapa, you have a free afternoon to explore the town. Maybe get a massage to sooth trek-tired muscles, check out the local market selling produce, herbal remedies, and (very fresh) meats, pick up any Hilltribe crafts you might have had your eye on, or sit back with a drink while you look over the misty mountains. \n\nYou will be picked up from your Sapa hotel between 5-5.30 pm today by a local driver. You’ll then be transferred back to the to the Lao Cai train station this afternoon (approximately 1 hour). You will have some free time for an optional dinner before you board the overnight train to Hanoi. Boarding commences approximately 7.30pm for an 8.30 pm departure (journey time approximately 8 hours).\nAccommodation: Overnight sleeper train"},{"title":"Day 5: Hanoi","description":"Your adventure ends upon arrival at Hanoi train station in the early morning (around 5am). The rest of the day is free for you to soak up the grace of this dynamic city that's the epitome of modern Vietnam."}]},{"name":"Essential Vietnam","duration":11,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":880,"price":792,"summary":"As you slink from old-world Hanoi through ancient Hue, past historic Hoi An and to beachy Phan Rang and bustling Ho Chi Minh City, you'll quickly realise that the Vietnamese know a thing or two about delicious food. Pho, banh mi, rice paper rolls – oh my! You’ll be bowled over with the number of offerings on this 11-day Essential Vietnam tour, from north to south. Not only will you be eating, you’ll be cruising, riding, relaxing, exploring and enjoying all of the Vietnamese hospitality. It sure is a damn tasty slice of this South East Asian nation, so there’s only one thing to say: Viet-nom.We cover a lot of distance on this trip, including on overnight trains. Accommodation and amenities are shared and basic, but the experience of rubbing shoulders with the locals makes it all worthwhile. For more about what this experience is like, see our blog post here: https://www.intrepidtravel.com/adventures/what-to-expect-on-an-overnight.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/16391_d9f309.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/16391_d9f309.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_47a578a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_0a581995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_febfd114.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_f610dd5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_69db665d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_13a1b27c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_54d6ac9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_3ef76f3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_e59c7db3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/16391_aee4268e.jpg"],"destinations":["Hanoi","Cat Ba Island","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. This adventure kicks off with a group meeting at 6 pm. Because this trip doesn’t spend much time in Hanoi, why not arrive a day or two early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded boulevards or relax in a public park with some delicious street food (spring rolls inside rice paper rolls, anyone?). Museum-wise, you could visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum. Tonight, maybe grab some food at a roadside stall and a fresh bia hoi, watching the motorbikes zoom by with your new mates.\nAccommodation: Hotel"},{"title":"Day 2: Cat Ba Island","description":"Travel by bus and ferry (approximately 3.5 hours) to Cat Ba Island, the largest island in the UNESCO-listed Halong Bay. With thousands of little limestone islands scattered around, this area is one of those quintessential Vietnamese scenes in which bright green water is dotted with traditional junk boats and limestone karsts. Take a cruise around Lan Ha Bay with a super cool rice paper roll workshop on the boat, then get up close and personal with this other-worldly landscape by kayak. The best thing about cruising by kayak is that you can help out the environment on your way. You can choose to have a net beside your boat to catch any plastic you may come by, and later on, take part in a plastic brick making activity. Stay overnight on Cat Ba Island and enjoy a dip at one of the beaches and a cold beer.\nAccommodation: Hotel"},{"title":"Day 3: Hanoi - Overnight Train","description":"Wake up to the morning scenes of Cat Ba and the emerald bay and enjoy some free time at the beach. Go for a swim, kick back with a book or take a stroll along the sand. The best thing is, it’s up to you! In the afternoon, head back to Hanoi and jump on the overnight train to Hue (approximately 12 hours). This may be your first time on an overnight train in Asia and trust us, the first time is always special. It's definitely an experience.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hue","description":"Arrive in Hue, the former imperial capital of Vietnam. You have today free to do as you please. You can easily spend a couple of hours exploring Hue’s massive walled citadel and the Forbidden Purple Palace that's enclosed within it. Perhaps jump on board a dragon boat and enjoy a cruise up the Perfume River to visit the Thien Mu Pagoda. You could also check out Dong Ba Market, which offers locally made goods, fresh produce and some tasty street food. This is a good place to try the dishes that Emperor Nguyen used to feast on: the banh khoai royal rice. If you like being on two wheels then maybe cycle out to one of the royal tombs such as the tomb of Emperor Tu Duc (one of the most excellent remaining examples of its kind), or set off on an optional motorcycle tour of the sights in Hue and some surrounding villages. Tonight, head into the home of a local family and enjoy a prepared dinner. You’ll be chatting and laughing over your chopsticks in no time!\nAccommodation: Hotel"},{"title":"Day 5: Hoi An","description":"Continue along the coast to Hoi An by private bus (approximately 3 hours). Once in Hoi An, your leader will take you on a walking tour of this unique town which has been influenced over the years by Europe, China, Vietnam and Japan. The town was a major trading port from the 17th century onwards, and its old-school flavour is written all over its architecture. For a small town, it's pretty lively in places. In others, it's chilled out. The tour will take you down the streets that are being restored and look a lot like they did 100 years ago or more. You'll check out a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. After your leader-led walk, you’ll surely be hungry. Lucky thing is that we’ve got you covered. Enjoy a banh mi lunch after your tour – a crusty French baguette filled with delicious pork and other fillings.\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"Enjoy a free day in Hoi An. Maybe wander to the Central Market and browse the paintings, woodwork, ceramics and lanterns. Hoi An is also famous for its talented tailors, so if you’ve been wearing the same shirt every day (who hasn’t), why not hit one of the same-day tailors and get yourself something new? Or, if you're still feeling adventurous, hire a bicycle and tour the surrounding countryside, or take a ride to the coastline for an afternoon on the South China Sea – this is one of the best ways to travel in and out of town.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An - Overnight Train","description":"Lucky you, it's another free day in this historic haven. You could take a trip out to the My Son temples (World Heritage-listed beauties that reflect the rich cultural traditions of the Cham civilisation), hop on a cruise along the Thu Bon River or get some sun with a trip to the nearby Cua Dai Beach. Afterwards, board your overnight train. This one's going to Phan Rang, a great beach town on the central coast (approximately 8 hours).\nAccommodation: Overnight sleeper train"},{"title":"Day 8: Phan Rang","description":"Arrive in Phan Rang early this morning for two full days of relaxation. With perhaps the best weather in Vietnam, Phan Rang is a low-key coastal city where swimming and seafood take priority. There may also be an opportunity to hit up some awesome snorkelling spots or hire a surfboard or paddle-board – as if the shimmering waters of the South China Sea aren’t enough. Ask your group leader for details when you arrive. Phan Rang’s vibe is more beach beers than beach bars, so slow down and take it easy because this is meant to be a holiday, isn't it?\nAccommodation: Hotel"},{"title":"Day 9: Phan Rang - Overnight Train","description":"Phan-tastic – another day to soak up the sun, catch up on your favourite book, and enjoy a day of swim, sunbake, eat, repeat. Keep in mind there's one last overnight train to catch tonight, but that just means that you’ll wake up in another cool place tomorrow! Later in the evening, swap the deck chair for a bunk bed and buckle up for the 7-hour journey to Ho Chi Minh City.\nAccommodation: Overnight sleeper train"},{"title":"Day 10: Ho Chi Minh City","description":"Arrive in Ho Chi Minh City very early (approximately 4 am) and transfer to your hotel, then leave your gear in a day room at the hotel. Formerly known as Saigon, Ho Chi Minh City is a whirl of sights and sounds. You can still see the French influence in the top-notch baguettes and coffee on offer. Compared to the north the food is spicier, sweeter and more varied. Perhaps take advantage of the early morning by checking out the markets and tucking into a bowl of pho with the local traders. Your leader will let you know the best places to check out during your free time. Well worth the visit are the Reunification Palace and War Remnants Museum. Included for today is a local experience with uni students called Ca Phe Bet, which literally translates to ‘coffee on the flat ground’. Enjoy some coffee and a snack in one of the many parks. Tonight, why not get your group together for a meal and some drinks on Pham Ngu Lao Street?\nAccommodation: Hotel"},{"title":"Day 11: Ho Chi Minh City","description":"With no planned activities today, you can depart at any time. If you would like to spend some more time in Ho Chi Minh City, we don’t blame you! We’re happy to organise additional accommodation (subject to availability). The Cu Chi Tunnels are an interesting day trip nearby, plus the city is a great springboard to head down to the Mekong Delta or to Phu Quoc Island. Ask your group leader for more recommendations or, better yet, book an Urban Adventures tour! Find out more at urbanadventures.com/destination/ho-chi-minh-city-tours."}]},{"name":"Vietnam Explorer","duration":17,"travelStyle":["Discovery","Adventure","Group","Fully Guided"],"oldPrice":1535,"price":1382,"summary":"Become a Vietnam Explorer as we travel north from Ho Chi Minh City to Hanoi covering all the highlights and hidden gems this incredible country. Get a cultural insight into its not too distant past, visit the sand dunes of Mui Ne, stunning beaches, breathtaking caves and national parks and finish off with a private island getaway in Halong Bay. The perfect amount of time to spend in this amazing country.","highlights":["Explore the hidden gems of the incredible Vietnam","Learn to make a lantern and cook traditional dishes","Discover the historic Hue - country's former capital","Enjoy yoga classes, outdoor cinema and massages","Cruise the emerald waters of Ha Long Bay and relax"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/104688_6efd8ed2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/104688_6efd8ed2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_90498f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_278b0316.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_500ff204.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_d6d0f589.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_14dfed25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_13757933.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_4ac46b00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_1fc72737.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_2d450d60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_da19a5cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/104688_10b70ae6.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 - Airport Pick Up","description":"Today is arrival day; feel free to arrive any time. You will be picked up from the airport by one of our drivers, who will be waiting for you. Then head to the hotel where your group leader will be waiting for you. Get excited to meet your new travels buddies for dinner and drinks in the evening."},{"title":"DAY 2 - CITY ORIENTATION & WAR MUSEUM","description":"Spend the day getting to know your new surroundings & indulge in culture & history with a walking tour of the city, before visiting the National War Museum. Tonight we head north to our first coastal destination, Mui Ne."},{"title":"DAY 3 - MUI NE","description":"This afternoon, you will get to try your hand at sandboarding down the picturesque dunes of Mui Ne, visit the Fairy stream and enjoy the beautiful scenery in open top style jeeps. We’ll finish the day off with some delicious dinner and a night out on the beach town!"},{"title":"day 4 - Explore Mui Ne","description":"Spend the morning relaxing by the pool and exploring the town. In the afternoon, we hop on a bus to Nha Trang and spend a night roaming around the markets or enjoy dinner and drinks with a beach view."},{"title":"day 5 & 6 - ninhvana beach hideaway","description":"We leave Nha Trang early morning & will have a spot of breakfast before we jump onto our shuttle bus to spend the next two nights in Ninhvana. This epic spot is a backpackers paradise. It is up to you how you spend your time. You can choose from paddle boarding, kayaking, bike tours, guided trekking, and yoga classes. Facilities also include 2 swimming pools, beach volleyball courts, outdoor cinema & a basketball court. The perfect hideaway."},{"title":"day 7 - TRAVEL DAY","description":"Enjoy a leisurely morning & make the most of the inclusions of this magical place. We head back to Nha Trang late afternoon & arrive in time for our night bus to Hoi An. You should feel relaxed & raring to go for the next leg of our adventure after your time at Ninhavna."},{"title":"day 8 - hoi an","description":"We arrive early morning into Hoi An, drop our bags to our hotel, and enjoy a complimentary breakfast on arrival. As they prepare our rooms we head out to join a traditional Hoi An lantern making class where we learn how to make our own miniature lanterns. The afternoon is free for you to relax after a long journey, or you can explore the town’s markets & tailors."},{"title":"DAY 9 - BAMBOO BASKET BOAT TRIP","description":"Start the day with a bike tour around Hoi An old town and lunch at the locals family home. Then spend the afternoon crab fishing with the locals as we explore the 7 hectare water coconut woods in traditional bamboo basket boats. The late afternoon is free to chill or explore the lantern filled streets."},{"title":"DAY 10 - HAI VAN PASS","description":"An adventure filled day as we leave Hoi An in open-top Jeeps & hit the Hai Van Pass, featured as the ‘Top Gear Experience’ it’s the perfect way to travel to Hue. Stop for a spot of lunch (included) and enjoy a nice swim in the sea before heading off again. On arrival to Hue we check into our new hotel & head into town for dinner and a few drinks in the evening."},{"title":"Day 11 - IMPERIAL CITY & cooking class","description":"Today it’s time to explore the historic imperial city of Hue. We head off to the Royal Palace where we take in the history of the nation`s former capital city before joining a local cooking school to learn how to make some traditional Vietnemese dishes. After we’re full of delicious food, we then head over via bus to the small town of Phong Nha, where we arrive early evening & just in time to enjoy a few drinks in one of the local bars."},{"title":"Day 12 - PHONG NHA NATIONAL PARK","description":"Paradise Cave is a UNESCO World Heritage site, & is famous for being one of the longest cave systems in the world at 31 km. We spend the day exploring the caves, which are situated inside Phong Nha National Park. In the evening we jump on an overnight bus to Hanoi."},{"title":"day 13 - hanoi","description":"We arrive early morning into Hanoi & head straight to our hotel to check in. As the rooms are still being prepared, we check out a local cafe and experience how to make traditional egg coffee which is a famous drink in Hanoi. In the early afternoon, we’ll visit the famous Hanoi train street and have the rest of the afternoon free for you to chill or explore the city on your own."},{"title":"day 14 - Ha long Bay","description":"We leave early by bus & boat to head to the famous Castaway Island in Ha Long Bay. Once checked into our beachside accommodation, we enjoy lunch with the most amazing view before an afternoon of watersports & an evening of beach partying."},{"title":"day 15 - Ha long Bay Boat trip","description":"We spend our full day aboard a traditional junk boat cruising through Ha Long Bay. During the trip we stop off to kayak through ancient caves & a network of lagoons whilst looking out for monkeys, before relaxing on the boat during the afternoon with plenty of swim stops."},{"title":"day 16 - Travel to hanoi","description":"After a few big nights on our private island, we enjoy another lay in before enjoying our last beachfront lunch, before making the journey back to Hanoi where we check in to our accommodation for our final night together as a group."},{"title":"day 17 - chilled check out","description":"It's time to say goodbye to one another as everyone heads off on their separate ways. Whether you’re continuing around Southeast Asia, or heading to the airport to go home, your Group Leader will help you to get you where you’re going."}]},{"name":"Explore Vietnam","duration":11,"travelStyle":["Discovery","Group","Fully Guided","Holiday"],"oldPrice":0,"price":850,"summary":"Get a taste of adventure in Vietnam on an 11-day experience bought to you by Lonely Planet and Intrepid. This escapade from north to south takes you from French-influenced Hanoi to heaving Ho Chi Minh City on a journey that balances local guidance with freedom to explore independently. Discover the countryside around Hue by bicycle, kayak between limestone karsts off the coast of Cat Ba Island and chill out in seaside Phan Rang. Let an expert local leader show you around this vivacious nation so you can see the real Vietnam.Some travellers find the pace of this trip quite fast as we are covering a lot of destinations in a short amount of time. If you would like a more relaxed pace with more time to explore, you might like to consider a longer trip (see trip code TVRN on our website) or adding additional days in Hanoi and Ho Chi Minh City before or after your Lonely Planet Experience.","highlights":["Explore Halong Bay for yourself","Swim on Ti Top Island Beach","Take an overnight train to Hanoi","Visit Vietnam's southeast coast"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/62555_b1a862.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/62555_b1a862.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_c9abbd2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_a7ca143a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_78270b4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_4294c91d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_ed8038bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_c76b38c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_1b4f1ce2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_bcd47b39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_bb0c0919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_5b1f343f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_344782c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_6e780c73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_39d78821.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_82b96673.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_b3ae9317.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_5ebf5418.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62555_753d45e6.jpg"],"destinations":["Hanoi","Cat Ba Island","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm tonight. If you happen to arrive early, take the day at your own pace and wander the Old Quarter admiring the city’s French-colonial architecture and manicured parks, or simply enjoy some street food. Better yet, consider booking the Hanoi Highlights Urban Adventure with an expert local guide to introduce you to the city and its sites, including the Temple of Literature, the Hoa Lo Prison museum and Hoan Kiem Lake. Head to urbanadventures.com/destination/hanoi-tours for more information.\nAccommodation: Hotel"},{"title":"Day 2: Cat Ba Island","description":"An early start is necessary to get the most out of your day. Take a 7.30 am bus ride and ferry transfer to the steep karsts and tiny beaches of Cat Ba Island, arriving before midday – you’ll have a quick stop to stretch your legs en route. The largest of all the islands in World Heritage-listed Halong Bay, charming Cat Ba will be your base for exploring the limestone cliffs and turquoise water that define this area. Get acquainted with this stunning spot with an afternoon cruise around the bay, enjoying lunch on the boat while floating past the karsts covered in emerald-green foliage. Later, get closer to the water and explore on a kayak, perhaps stopping at one of Cat Ba’s many beaches for a swim. Stay overnight on Cat Ba Island and enjoy the sunset with a cold beer.\nAccommodation: Hotel"},{"title":"Day 3: Hanoi – Overnight Train","description":"Wake up in paradise and enjoy some free time lazing on the beach. Maybe go for a swim, kick back with a book or take a stroll along the sand. In the afternoon, head back to Hanoi. Hopefully you’ll have some time to grab dinner with the group before boarding an overnight train for a 12-hour journey to Hue later on. Although conditions are basic, overnight trains are the best way to travel long distances and brush shoulders with the locals. Most trains have a dining carriage which serves simple food, but some travellers like to take some fresh bread, cheese, fruit and other snacks for the journey.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hue","description":"As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past and is a curious mix of bustling streets and tranquil settings. Packed with historic monuments, Hue is also perfectly located to explore the surrounding countryside, which features stunning scenery, quaint villages and the peaceful Tam Giang Lagoon. The bustling Dong Ba Market offers a plethora of goods and foods to see and sample, and it's a good place to try some of the specialities that graced the Nguyen emperors' banquet tables, such as the banh khoai – a royal rice cake. You have a free day to explore, which you could easily spend exploring Hue’s massive walled citadel and the Forbidden Purple Palace enclosed within. Perhaps jump on board a dragon boat and enjoy a cruise up the Perfume River to visit the Thien Mu pagoda, or cycle out to one of the Royal tombs such as the tomb of Emperor Tu Duc. Otherwise, set off on an optional motorcycle tour of the sights in Hue and some surrounding villages.\nAccommodation: Hotel"},{"title":"Day 5: Hoi An","description":"Continue on your journey and travel to the World Heritage-listed town of Hoi An, where on arrival, your leader will take you on an orientation walk around town. The city was a major trading port with the west from the 17th century onwards, and has various architectural influences from Europe, China and Vietnam. Today, the city is being restored and looks exactly like it did over a century ago. The rest of the day is free for you to do some optional activities or soak up the ambience of the place. You may like to wander Hoi An Market and the street stalls selling paintings, woodwork, ceramics, lanterns and much more. It’s also famous for its talented tailors who can make beautiful items to order within 24 hours, so be sure to check that out!\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"Enjoy a free day to further explore Hoi An. Perhaps take a cruise up the Thu Bon River or learn the secrets of cooking delicious Vietnamese dishes. Visit some of the main art galleries or simply wander around the beautifully restored Chinese shop houses. There’s also the option of cycling around the surrounding countryside – a truly relaxing way to get off the beaten track and see rural Vietnam up close. Your leader will be able to suggest activities to help you get the most out of your time.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An – Overnight Train","description":"Make the most out of another free day in Hoi An. Perhaps do some of the activities you couldn’t fit into your schedule over the past couple of days, or go pick up your fresh threads from the tailors. There’s also Cua Dai Beach nearby – the perfect place to rest up before continuing on your way. This evening, board another overnight train bound for Phan Rang. Remember, it’s always a good idea to have some snacks and a book on hand.\nAccommodation: Overnight sleeper train"},{"title":"Day 8: Phan Rang","description":"Arrive in Phan Rang early this morning for two days of beachside bliss and relaxation. With arguably the best weather in Vietnam, Phan Rang is a low-key coastal city where swimming, snorkelling and seafood take priority. While you’re here, look out for banh can and banh xeo – egg, squid, shrimp and vegetables cooked into a pancake. Delicious!\nAccommodation: Hotel"},{"title":"Day 9: Phan Rang – Overnight Train","description":"Take a break with another day in Phan-tastic Phan Rang. You could squeeze the sand between your toes and grab some rays on the beach, or take a quick ride out to Dinh Cape – one of the most picturesque bays and stretches of sand in the area. Otherwise, perhaps ask your leader where you can get a massage to really get your zen on. Keep in mind that there’s your overnight train journey waiting for you this evening, so get outside and enjoy all that Phang Rang has to see, and eat! Tonight’s overnight train journey will take approximately 7 hours and drop you right into bustling Ho Chi Minh City.\nAccommodation: Overnight sleeper train"},{"title":"Day 10: Ho Chi Minh City","description":"Arrive in Ho Chi Minh City very early this morning and transfer to your hotel. Today you’ll have plenty of free time to explore Vietnam’s largest city. Ho Chi Minh City has a busy atmosphere and many French influences. In your free time, it’s recommended to visit the Reunification Palace and the War Remnants Museum. There’s also the historic Dong Khoi Street, and the chaotic markets of Ben Thanh and Cholon (Chinatown). Ho Chi Minh City has a different style of cuisine to its northern counterpart Hanoi, so be sure get out for restaurant meals and street food with your travel crew. Your group leader has all the best people in the right places, so they’ll know of some delectable places to eat, for any budget.\nAccommodation: Hotel"},{"title":"Day 11: Ho Chi Minh City","description":"With no planned activities today, you can depart at any time, provided you comply with the hotel’s internal check-out times. As we don’t spend much time in Ho Chi Minh City on this tour, why not stay a few extra days to make the most of your time here? You could take a day trip to the renowned Cu Chi Tunnels, where you can witness the strategic underground labyrinth that helped the locals during the Vietnam war. Ask your leader for more recommendations or book in on an Urban Adventure. Find out more at urbanadventures.com/destination/ho-chi-minh-city-tours. If you would like to spend more time in Ho Chi Minh City, we’ll be happy to organise additional accommodation (subject to availability)."}]},{"name":"Treasures of Vietnam","duration":8,"travelStyle":["Historical","Group","Fully Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1350,"summary":"Discover the spirit of Vietnam on a trip from south to north, taking in all the attractions in between. Explore Vietnam's fast-paced Ho Chi Minh City, wander the ancient Vietnamese streets of Hoi An and bask in the undeniable charm of Hanoi. Experience Vietnam's beautiful landscapes, delicious cuisine and the renowned friendliness of the Vietnamese people. Top it all off with an overnight cruise on mystical Halong Bay and you won't ever want to leave.This is an ambitious itinerary aimed at covering the main highlights of Vietnam in a short time. Be sure to book additional days in Ho Chi Minh City or Hanoi if you want more time to explore these cities","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/62415_2e50c16d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/62415_2e50c16d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_2a2a6511.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_b48de532.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_5ce96b0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_d23504ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_f8341413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_0d213947.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_a8c7fac1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_5177af7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_21136ffc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_f2c5de83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_5bc6f9e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_92a1375d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_66713791.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_fdd88a47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_52129616.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_89372d77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62415_c8b4add7.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Ho Chi Minh City, a French-infused city with a dynamic atmosphere. If you arrive early, perhaps head to Pham Ngu Lao Street to see the local open-aired market or visit Vinh Nghiem Pagoda. Your adventure begins with a welcome meeting at 6 pm where you will meet your tour leader and fellow travellers.\nAccommodation: Hotel"},{"title":"Day 2: Ho Chi Minh City","description":"Start your tour of Ho Chi Minh City with a visit to the Reunification Palace. Formerly known as the Presidential Palace, it was the site of South Vietnam's surrender at the end of the war. Next, head over to the War Remnants Museum where you’ll see old military equipment including an F5A fighter and a UH1-Huey helicopter. Finally, you’ll tour the famous Cu Chi Tunnels. This former Viet Cong stronghold provides an insight into the resourcefulness and tenacity of the Vietnamese people, as well as underground life during the Vietnam War.\nAccommodation: Hotel"},{"title":"Day 3: Hoi An","description":"Say goodbye to Ho Chi Minh City and fly to Danang (1 hour 30 minutes). From here you’ll make your way to My Khe Beach, a beautiful spot which lies against a backdrop of the Marble Mountains. This location was significant for both the Americans and the Vietnamese during the war. Enjoy a visit to the Marble Mountains to explore its caves and pagodas. Access is via rock hewn staircases or for a fee of VND40,000 you can use the elevator. After your visit continue to Hoi An where you’ll stay for the night (approximately 30 minutes by private minibus).\nAccommodation: Hotel"},{"title":"Day 4: Hoi An","description":"Your leader will take you on a walk around Hoi An’s Old Town today. The city was a major trading port from the 17th century onwards, and has various architectural influences from Europe, China and Vietnam. Today the city is being restored and looks exactly like it did over a century ago. The tour will take you to a historic house, the Japanese Covered Bridge, a Chinese assembly hall and a museum. The rest of the day is free for you to do some optional activities or soak up the ambience of the place. You may like to wander the street stalls selling paintings, woodwork, ceramics, lanterns and much more. Hoi An is also famous for its talented tailors who can make beautiful items to order within a few hours.\nAccommodation: Hotel"},{"title":"Day 5: Hanoi","description":"This morning, transfer to the airport and fly to Vietnam’s charming capital of Hanoi (1 hour 30 minutes). You’ll be taken on a guided half-day tour of Hanoi, visiting major sites such as the Temple of Literature, One Pillar Pagoda and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. The tour will also include lunch at the KOTO cafe, an amazing project which provides vocational training for disadvantaged young people. You’ll have some free time this afternoon. Hanoi is a strangely quiet city compared to its southern counterpart. Escape from the noise by visiting the various parks and lakes, or hire a bike and cycle around town for the best view of the city.\nAccommodation: Hotel"},{"title":"Day 6: Halong Bay","description":"Travel by private minibus to the famous Halong Bay (approximately 4 hours), one of Vietnam's most spectacular natural wonders. Once you arrive at the bay, you’ll take a long, slow cruise through the area, exploring the beautiful green waters and amazing Surprise Cave. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. You may also have the opportunity to go swimming from Ti Top Island beach. You’ll spend the night on the boat. The traditional junk-style boat has twin-share cabins with air-conditioning and private facilities. There's also a dining room and bar where you’ll enjoy all of your meals, including fresh seafood for lunch and dinner.\nAccommodation: Overnight boat"},{"title":"Day 7: Hanoi","description":"Head back to Hanoi by private minibus (approximately 4 hours). This afternoon take in a unique water puppet performance. This evening is free for you to explore this delightful city. Why not relax at a cafe or stop for a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter?\nAccommodation: Hotel"},{"title":"Day 8: Hanoi","description":"After breakfast, you are free to leave at any time, as there are no activities planned today. If you would like to spend some more time in Hanoi, we’ll be happy to organise some additional accommodation for you (subject to availability)."}]},{"name":"Cycle Vietnam","duration":15,"travelStyle":["Bicycle","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":2185,"summary":"More than 30 million Vietnamese can't be wrong - handle-bar height gives you the best view of Vietnam! Our cycling tour through this mesmerising country provides opportunities to meet the locals and experience their culture in a way that wouldn't otherwise be possible. So come with us and get active as we travel from Hanoi to Ho Chi Minh City, down country lanes and over spectacular mountain passes. And, of course, all the exercise gives you the perfect excuse to indulge in delicious Vietnamese cuisine.To complete this trip it is important that you are both confident and competent in riding a bicycle.","highlights":["Visit the Ho Chi Minh Mausoleum","Admire the lush panorama of the Mai Chau valley","Take a stroll through fields of rice","Discover the wacky architecture of Hang Nga Crazy House"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1847_b889931e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1847_b889931e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a6d5f7ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_f4bc262f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_4db36211.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_50ef9cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_57336d3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_c8978dea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_8dfd2c5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a24e5567.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_7af2e663.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_a004c89d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_eab6c881.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_efe1f959.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_4732d2d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_145350bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_0180e8a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_e90a61f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1847_da080c7a.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Hue","Hoi An","Quy Nhon","Dalat","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure officially begins with a welcome meeting at 6pm tonight. You can arrive at any time during the day, as there are no activities planned until this important meeting. Please look for a note in the hotel lobby or ask the hotel reception where it will take place. We'll be collecting your insurance details and next of kin information at this meeting, so please ensure you have all these details to provide to your leader. \n\nIf you are bringing your own bicycle with you on the trip, you need to assemble it to check for any damage in transit before the welcome meeting. \nIf you have arranged for the hire of a bicycle, your leader will assist you in preparing the bike before your first cycling activity.\n\nIf you arrive with some time to spare then work your legs with a walk around Hanoi’s charming shaded boulevards and a squat on a short street-corner stools for a bia hoi (freshly brewed draught beer) in the Old Quarter.\n\nNotes: If you can't arrange a flight that will arrive in time, you may wish to arrive a day early so you're able to attend. We are happy to book additional accommodation for you (subject to availability). If you're going to be late, please inform the hotel reception or your travel agent in advance. \n\nRiding distance: none\nAccommodation: Hotel"},{"title":"Day 2: Hanoi","description":"This morning you’ll get the chance to explore the Vietnamese capital by bike on a guided ride through the city (approx. 22kms). \n\nHanoi is made for exploration by bike, so this is the perfect place to get to grips with Vietnamese street life and traffic. You’ll ride through parks, around lakes, and down tree-lined boulevards and visit iconic sights such as the Ho Chi Minh Mausoleum complex, which includes the Buddhist temple One Pillar Pagoda and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. \n\nThere’s also time to explore the vibrant Old Quarter, an architectural museum where blocks of ochre buildings give off the air of a 1930s provincial French town. In these ancient ’36 Streets’ discover an amazing selection of shops that sell everything from souvenirs to exquisite silk clothing, jewellery, beautifully embroidered tablecloths, wood carvings and lacquerware - it's a bargain hunter's paradise. \n\nYou’ll have some free time this afternoon. Perhaps take a walk around the beautiful Hoan Kiem Lake, with the reflection of modern office buildings, old Buddhist temples and the tangle of ancient streets in its still surface, or maybe dive into culture at the Vietnam Fine Art Museum or The Vietnamese Women’s Museum. Top off the day with a steaming bowl of fresh Pho from a hole-the-wall eatery – the street food in Hanoi is not to be missed!\n\nRiding distance: approx. 22kms/14 miles, mostly flat with approx. 40m/130ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 3: Mai Chau","description":"Saddle up this morning as your cycling adventure kicks into first gear. Leave Hanoi behind and travel by bus to Hoa Binh (approximately 2 hours). When you arrive you’ll jump on your bike and cycle 38 kilometres to Cao Phong, through small ethnic Thai villages, enjoying the tranquility of the paddy fields and interacting with the local people. Limestone peaks climb in the background and banks of green line the road, and you’ll take regular stops to admire the view across the lush valleys. After arriving you’ll take a short 30-minute bus ride for the next section, stopping for lunch at Man Duc. \n\nAfter you fuel up, the bus will take you to the Da River Reservoir. Stretch your legs again cycling along the Da River, passing spectacular karst cliffs, through paddy fields, and admiring the lush panorama of the Mai Chau valley on the way (approximately 19 kilometres). The peaceful town of Mai Chau is situated in a stunningly beautiful valley surrounded by verdant green mountains and is famed for its breathtaking scenery and friendly hilltribe peoples. Tonight you’ll enjoy local hospitality in a simple stilt-house homestay in the village of Poom Coong. Your amicable hosts will cook up a fabulous home-cooked meal, and there may even be a chance to sample some of the local rice wine produced in the region.\n\nRiding distances:\nRide 1 -  approx. 38kms/24 miles, uphill with approx. 330m/1080ft of elevation gain.\nRide 2 - approx. 19kms/12 miles, mostly downhill with approx. 80m/260ft of elevation gain.\nAccommodation: Homestay"},{"title":"Day 4: Ninh Binh","description":"This morning you farewell your homestay hosts and cycle from Mai Chau to Mai Hai, and then on to Co Luong (approx 50kms). You’ll ride through more paddy fields and test your riding skills (or suspension) with the shallow potholes that can be found on the road. Pass farmers riding atop their load drawn by lumbering water buffalo, ride through small towns and wave to friendly locals on your way through picture-perfect Vietnam – lush green fields, towering limestone mountains, tranquil waterways and charming historic sites. \n\nA bus trip then takes you along the Ho Chi Minh Road with a lunch stop before Ninh Binh. If you arrive in Ninh Binh with time (and energy) to spare you can take a 36 km cycle around the surrounding area. This is a wonderful chance to see everyday rural life in action as well as take in the beautiful countryside.\n\nRiding distances\nRide 1 - approx. 49kms/30 miles, mostly downhill with approx. 195m/640ft of elevation gain.\nRide 2 - approx. 36kms/22 miles, mostly flat with approx. 50m/165ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 5: Ninh Binh - Overnight train","description":"This morning you’ll cycle from Ninh Binh to Tam Coc, when you’ll really have the opportunity to soak up one of Vietnam’s most spectacular views – limestone karst peaks thrusting out of serene rice paddies, the sounds and views of the river, which winds through the fields and has boats parading up and down its length.  You will also cycle to Hoa Lu, the ancient capital of Vietnam under the 10th-century Dinh Dynasty, the remains of which can be seen in the lasting beautiful archways and temples. Here you’ll take a lunch break at the Dinh or the Le Temple. Today’s cycling is approximately 50 kilometres. Then it’s back on the bus to return to your hotel, where you can use the day room to take a shower and freshen up. After an early dinner you’ll transfer to Nam Dinh for an overnight train to Hue.\n\nNotes: On the overnight train to Hue (approximately 12 hours) conditions are basic, but it is a true Intrepid experience and the best way to travel long distances like a local. Sleeper trains typically have four berth compartments (occasionally six berth depending on seasonal variations and group configuration), which have bench seats that convert into sleeping bunks. A sheet, pillow and blanket are provided, although some travellers prefer to bring their own sleeping sheet. On occasion, passengers of different genders will be required to share a compartment and there will be occasions where you'll be sharing with local travellers or travellers who are not part of your group. Most trains have a dining carriage serving simple food, but some travellers take the opportunity to stock up on fresh bread, cheese and fruit prior to departure.\n\nRiding distance: approx. 52kms/32 miles, undulating with approx. 195m/640ft of elevation gain.\nAccommodation: Overnight sleeper train"},{"title":"Day 6: Hue","description":"Arrive in Hue and hop back in the saddle to begin your exploration of the former imperial capital of Vietnam. Hue holds the treasures of Vietnam's royal past and is a curious mix of bustling streets and tranquil settings. Today you will ride (approximately 16 kilometres) through the fields to visit many of Hue's remarkable sites, including temples, bunkers, tombs, ruins, pagodas and spectacular scenery. \n\nOn your cycle you will visit the Imperial Citadel, including the Forbidden Purple City. The latter was almost totally destroyed during the Vietnam War's Tet Offensive, but the foliage-covered ruins are still atmospheric and the gaping holes left by bombs give an idea of the destruction wreaked upon the country during the war. The itinerary is flexible and you have ample time for stops along the way to admire the sites. Later, kick back in a cafe or restaurant. Hue’s cuisine is considered by many Vietnamese as the best in the country, and is influenced both by its imperial heritage (small dishes and a focus on aesthetic presentation) as well as its strong Buddhist heritage, reflected in the high proportion of vegetarian restaurants in the region. The bustling Dong Ba Market offers a wealth of goods and foods to see and snack on. It's a good place to try some of the local specialities that graced the Nguyen emperors' banquet tables, such as the ‘banh khoai’, Hue's answer to the pancake.\n\nRiding distance: approx. 16kms/10 miles, flat with approx. 12m/40ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An","description":"Today will be big on riding and big on spectacular views. Leaving Hue, you will do some mountainous riding (approximately 85 kilometres in total) as you conquer the Hai Van (Ocean Cloud) Pass on the way to the tropical south and the laidback town of Hoi An. The pass is a stunning stretch of highway the winds through the Truong Son mountain range for about 20 kilometres (10 kilometres each way), with views across the Bay of Danang to the south. It is 500 metres about sea level and the up/down slope ranges from 5-10%, and there will be plenty of well-earned breaks along the way to take in the views, snap some photos, and rehydrate. After the rewarding vistas on the cycle in, you’ll also be spoiled with the town of Hoi An – with lantern-lit streets, vibrant markets, skilled tailors, artisan shops, ancient houses, colourful temples and beautiful smiles, it’s a Vietnamese wonderland. Recently declared a World Heritage site, Hoi An is being beautifully restored and preserved, with parts of the town looking exactly like they did more than a century ago. This makes its streets of low tiled buildings perfect for strolling. Take the evening to soak up the atmosphere, or just rest your legs at a local restaurant after a day’s riding.\n\nRiding distances:\nRide 1 - approx. 56kms/35 miles, flat with approx. 55m/180ft of elevation gain.\nRide 2 - approx. 30kms/19 miles, significant uphill & downhill with approx. 576m/1890ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 8: Hoi An","description":"This morning you leader with take you on a walking tour of the town, which used to be a busy port for the Cham people before the river silted up. There’s also a strong Chinese influence, and you’ll see it as you walk past the pagodas and assembly halls. On your tour you’ll take in a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. The afternoon is free for you to do whatever takes your fancy. For those who love to shop then Hoi An is a mecca, with much to browse and buy. There are original paintings, handcrafted woodwork, ceramics, embroidery, lanterns and more. If you want to get some new threads then the town is also famous for its tailoring – pick a fabric and a design and it’ll be ready the same day. If you feel like keeping active then there are the options to take a 15-20 kilometre ride into the surrounding countryside, to cycle to nearby Cua Dai Beach, or to take a stroll through fields of rice, sesame, banana and peanuts.\n\nRiding distance: none\nAccommodation: Hotel"},{"title":"Day 9: Quy Nhon","description":"Continue south, down scenic Highway One on the road to Quy Nhon, one of the routes that is less visited by travellers, past paddy fields, wheat drying for Beer Hoi, and locals playing chess to Phu.\n\nClimb back on the bikes to cycle to the coastal city of Quy Nhon (approx. 45kms). The city is filled with long stretches of beach and relaxed boulevards, and as it’s pretty undiscovered by visitors, is a great place to get an authentic slice of coastal life.\n\nRiding distance: approx. 44kms/27 miles, undulating with approx. 255m/840ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 10: Nha Trang","description":"Today’s cycle is approximately 95 kilometres, but it is one of the most breathtaking stretches of road you’ll ride – the highway hugs huge granite cliffs and looks out across the deep blue sea. \n\nFollowing parts of the Reunification railway, you’ll enjoy scenery of islands, lagoons and sand dunes. Join the scooter riders on the waterfront promenade as you arrive in the idyllic coastal town of Nha Trang, once referred to as the 'Cannes of the Orient', and whose sandy palm-lined beach and island-dotted bay still make a pretty idyllic picture. Here there’s consistently good weather, a vibrant nightlife and excellent diving.\n\nRiding distances:\nRide 1 - approx. 75kms/47 miles – lightly undulating with approx. 165m/530ft of elevation gain.\nRide 2 - approx. 19kms/12 miles - lightly undulating with approx. 140m/460ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 11: Nha Trang","description":"Today you’ll swap your bike for a boat as you head out to explore the nearby islands. This excursion is often the highlight of the trip for many travellers, as you’ll get to know some of the locals and indulge in the beauty of the place. Starting on the main boat, you’ll then take a small basket boat to shore and visit a fishing village, snorkel in the turquoise waters and feast on a fresh seafood buffet for lunch. You can enjoy this rest day by lazing in a deck chair, going for another swim or perhaps taking a mud baths to soothe away sore muscles.\nAccommodation: Hotel"},{"title":"Day 12: Dalat","description":"Head up through the Bidoup-Nui Ba Pass into the cooler climes of the South Central Highlands (approximately 65 kilometres), where some of the country's best fruits, flowers and coffee beans are grown. The road is winding and steep but if you're fit and ready for a challenge, you may want to conquer the whole mountain on your bike. If you're not so physically inclined, take it easy and flag a lift from the bus. Whichever way you choose to get to the top, you'll still be treated to magnificent views once you reach the summit. After a short photo stop here, you will descend to Dalat. One of Vietnam's most delightful cities, Dalat is a perfect base to explore this pleasant region. With an appealing Swiss-French feel, along with pleasant lakes, palaces, pine tree-covered hills, flower gardens and pagodas, Dalat is often called the 'city of eternal spring' for its temperate climate.\n\nRiding distances:\nRide 1 - approx. 57kms/35 miles, lightly undulating with approx. 160m/530ft of elevation gain.\nRide 2 - approx. 15kms/9 miles, lightly undulating with approx. 110m/360ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 13: Phan Thiet","description":"This morning you’ll take a city tour of Dalat, making the journey to Bao Dai's striking regal summer palace. He was the final emperor of the Nguyen dynasty, and the last to rule Vietnam until 1945. You’ll then discover the wacky and weird architecture of Hang Nga Crazy House. Echoing Gaudi's unconventional designs, and described as a 'fairytale house', explore the twisted tree roots, cave shaped hallways and animal themed rooms of this surreal guesthouse. Drop by the train station and the central market before continuing to Di Linh, where tea is the main industry and there are large plantations in the surrounding hills. After lunch, pedal down the forest-lined Gia Bac Pass, then cycle along from Malam to Phan Thiet and it's beautiful beaches.\n\nRiding distances:\nRide 1 - approx. 22kms/14 miles, mostly downhill with approx. 85m/280ft of elevation gain.\nRide 2 - approx. 45kms/ 28 miles, mostly downhill with approx. 30m/100ft of elevation gain.\nAccommodation: Hotel"},{"title":"Day 14: Ho Chi Minh City","description":"You’re on the home stretch now and it’s time for one last cycling splurge. Before heading for the big city, take in the views along the beach on your ride to Lang Long. After a picnic lunch, keep cycling (approximately 55 kilometres) to Cu Bi. From there it’s goodbye to your two-wheeled friend as you take the support bus the final leg to Ho Chi Minh City. Here daily life plays out on the streets and the dynamic atmosphere is a fascinating blend of old and new, East and West. Maybe spend the final night of your Vietnam adventure exploring the food stalls at Ben Thanh market or cheers to yourself and your new friends with a few glasses of street-side beer hoi.\n\nRiding distance: approx. 56kms/35 miles, approx. mostly flat with hill at the end, approx. 125m/410ft of elevation gain\nAccommodation: Hotel"},{"title":"Day 15: Ho Chi Minh City","description":"Your Cycle Vietnam adventure comes to an end today. There are no activities planned and you are able to depart the accommodation at any time. If you are sticking around then there are plenty of things to see and do in and around Ho Chi Minh City. \n\nRiding distance: none"}]},{"name":"Cycle Northern Vietnam","duration":8,"travelStyle":["Bicycle","Group","Fully Guided","Discovery"],"oldPrice":0,"price":1125,"summary":"More than 30 million Vietnamese can't be wrong - handle-bar height gives you the best view of Vietnam! Our one week cycling tour through the north of this beautiful country provides opportunities to meet the locals and experience their culture in a way that wouldn't otherwise be possible. So come with us and get active as we cycle from Hanoi to Halong Bay, down country lanes and through spectacular mountain scenery. And, of course, all the exercise gives you the perfect excuse to indulge in delicious Vietnamese cuisine.To complete this trip it is important that you are both confident and competent in riding a bicycle.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130151_2a456349.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130151_2a456349.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_db7463f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_6eaa628d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_9748ab64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_fd586cf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_ca733c2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_263cae82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_9fb5c9e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_442b618e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_b0a77083.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_29b431e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_9131af3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_1faea484.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_4b3b1e2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_0ea6a080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_72c48912.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_9fae3f51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_5e23cece.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_0253dcd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130151_a6b3ebef.jpg"],"destinations":["Hanoi","Mai Chau","Cat Ba Island","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure officially begins with a welcome meeting at 6pm tonight. You can arrive at any time during the day, as there are no activities planned until this important meeting. Please look for a note in the hotel lobby or ask the hotel reception where it will take place. We'll be collecting your insurance details and next of kin information at this meeting, so please ensure you have all these details to provide to your leader. \n\nIf you are bringing your own bicycle with you on the trip, you need to assemble it to check for any damage in transit before the welcome meeting. \nIf you have arranged for the hire of a bicycle, your leader will assist you in preparing the bike before your first cycling activity.\n\nIf you arrive with some time to spare then work your legs with a walk around Hanoi’s charming shaded boulevards and a squat on a short street-corner stools for a bia hoi (freshly brewed draught beer) in the Old Quarter.\n\nNotes: If you can't arrange a flight that will arrive in time, you may wish to arrive a day early so you're able to attend. We are happy to book additional accommodation for you (subject to availability). If you're going to be late, please inform the hotel reception or your travel agent in advance. \n\nRiding distance: none"},{"title":"Day 2: Hanoi","description":"This morning you’ll get the chance to explore the Vietnamese capital by bike on a guided ride through the city (approx. 22kms). \n\nHanoi is made for exploration by bike, so this is the perfect place to get to grips with Vietnamese street life and traffic. You’ll ride through parks, around lakes, and down tree-lined boulevards and visit iconic sights such as the Ho Chi Minh Mausoleum complex, which includes the Buddhist temple One Pillar Pagoda and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. \n\nThere’s also time to explore the vibrant Old Quarter, an architectural museum where blocks of ochre buildings give off the air of a 1930s provincial French town. In these ancient ’36 Streets’ discover an amazing selection of shops that sell everything from souvenirs to exquisite silk clothing, jewellery, beautifully embroidered tablecloths, wood carvings and lacquerware - it's a bargain hunter's paradise. \n\nYou’ll have some free time this afternoon. Perhaps take a walk around the beautiful Hoan Kiem Lake, with the reflection of modern office buildings, old Buddhist temples and the tangle of ancient streets in its still surface, or maybe dive into culture at the Vietnam Fine Art Museum or The Vietnamese Women’s Museum. Top off the day with a steaming bowl of fresh Pho from a hole-the-wall eatery – the street food in Hanoi is not to be missed!\n\nRiding distance: approx. 22kms/14 miles, mostly flat with approx. 40m/130ft of elevation gain, well paved roads"},{"title":"Day 3: Mai Chau","description":"Saddle up this morning as your cycling adventure kicks into first gear. Leave Hanoi behind and travel by bus to Hoa Binh (approx. 2 hrs). When you arrive you’ll jump on your bike and cycle 40 kms to Cao Phong, through small ethnic Thai villages, enjoying the tranquility of the paddy fields and interacting with the local people. Limestone peaks climb in the background and banks of green line the road, and you’ll take regular stops to admire the view across the lush valleys. After arriving you’ll take a short 30-minute bus ride for the next section, stopping for lunch at Man Duc. \n\nAfter you fuel up, the bus will take you to the Da River Reservoir. Stretch your legs again cycling along the Da River, passing spectacular karst cliffs, through paddy fields, and admiring the lush panorama of the Mai Chau valley on the way (approx. 20 kms). \n\nThe peaceful town of Mai Chau is situated in a stunningly beautiful valley surrounded by verdant green mountains and is famed for its breathtaking scenery and friendly hilltribe peoples. Tonight you’ll enjoy local hospitality in a simple stilt-house homestay in the village of Poom Coong. Your amicable hosts will cook up a fabulous meal, and there may even be a chance to sample some of the local rice wine produced in the region.\n\nRiding distances: \nRide 1 - approx. 38kms/24 miles, uphill with approx. 330m/1080ft of elevation gain.\nRide 2 - approx. 19kms/12 miles, mostly downhill with approx. 80m/260ft of elevation gain"},{"title":"Day 4: Pu Luong National Park","description":"This morning you farewell your homestay hosts and cycle from Mai Chau to Mai Hai, and then on to Pu Luong National Park (approx 46kms). You’ll ride through more paddy fields and test you riding skills (or suspension) with the shallow potholes that can be found on the road. Pass pineapple farms and farmers riding atop their load drawn by lumbering water buffalo. Ride through small towns and wave to friendly locals on your way through picture-perfect Vietnam – lush green fields, towering limestone mountains, tranquil waterways and charming historic sites. This is a wonderful chance to see everyday rural life in action as well as take in the beautiful countryside.\n\n\nRiding distance: approx. 46 kms/29 miles, flat for the first 20kms/12 miles then a gradual climb for 17kms/10 miles, with approx. 540m/1770ft of elevation gain"},{"title":"Day 5: Cuc Phuong National Park/Tam Coc","description":"Today - over 2 rides - you’ll cycle from Pu Luong to Cuc Phuong National Park, Vietnam’s first and largest national park, opened by Ho Chi Minh himself, one of the most important conservation sites in the country, and home to a diverse range of flora and fauna. \n\nToday’s riding is beautiful as you cycle through some of Vietnam’s most spectacular views, riding in between limestone karst peaks thrusting out of serene rice paddies. Cycle approx. 20kms then board the support vehicle to miss the busiest of the traffic before it's back on the bikes for another 28km leg to a well-earned lunch. From there we reboard the support vehicle and cruise all the way to Tam Coc. Todays riding is undulating but definitely worth the effort.\n\nRiding distances:\nRide 1 - approx. 21kms/13 miles, downhill for 10kms, then mostly, approx. 70m/230ft of elevation gain.\nRide 2 - approx. 28kms/17 miles, flat, approx. 10m/30ft of elevation gain."},{"title":"Day 6: Cat Ba Island/Halong Bay","description":"Enjoy one final early morning ride through the beautiful green scenery of the Ninh Binh Province, riding (approx. 30kms) through the verdant rice field paddy scenery and along the banks of the duck-filled Hoang Long river to the opulent Bai Ding Buddhist Temple.\n\nHere we bid farewell to our cycling support team and transfer by minivan then ferry (approx. 4hrs) to Cat Ba Island, and on to Lan Ha Bay, part of the spectacular World Heritage site of Halong Bay. This is one of Vietnam’s most beautiful places, a secluded bay of emerald waters dotted with sandstone islands and caves. As well as being part of Ha Long Bay, Lan Ha Bay has the additional attraction of numerous white-sand beaches. where you'll stay the night in a secluded property right on the water's edge. If you are feeling energetic and would like to explore there is a walking trail for a short walk around the island – it’s worth it for the view alone! Dinner is included tonight.\n\nRiding distance: approx. 28kms/17 miles, downhill for 5kms then flat with approx. 50m/160ft of elevation gain."},{"title":"Day 7: Hanoi","description":"Grab a kayak and drift by towering limestone islands dotted with green foliage, paddling away from other tourists across the turquoise water and through the caves of Lan Ha Bays. Following the kayaking board the boat and cruise the Bay before we head back to Hanoi (approx. 5 hours travel time), arriving in the early evening. \n\nPerhaps head down to the markets for some last-minute souvenir shopping or pay a visit to one of the city's many fascinating museums, such as the Fine Art Museum, Women's Museum or Museum of Ethnology. Toast the end of this active adventure with an optional farewell group dinner.\n\nRiding distance: none"},{"title":"Day 8: Hanoi","description":"Your Cycle Vietnam adventure comes to an end today. There are no activities planned and you are able to depart the accommodation at any time. If you are sticking around then there are plenty of things to see and do in and around Hanoi. \n\nRiding distance: none"}]},{"name":"Vietnam At Glance","duration":6,"travelStyle":["Discovery","Group","Fully Guided","Holiday"],"oldPrice":0,"price":650,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the Discovery tour Vietnam At Glance, you have a 6 days tour package taking you through Hanoi, Vietnam and 2 other destinations in Vietnam. Vietnam At Glance includes accommodation in a hotel as well as flights, an expert guide, meals, transport.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/174796_ff4bf6c7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/174796_ff4bf6c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_79a1bb15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_0d2b76fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_b34da4f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_169009e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_1cdaf559.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_01c92e4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_580c60bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_7ceda1d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_5812ecb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_cb08e212.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_0a0e2040.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_e377169b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_0d81bdeb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_2c0ea05f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_1f552538.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_c1663687.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_559dea1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_b8bc0969.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_e78efb9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_bc34f1e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/174796_9463b03b.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Meals: NA/Accommodation: Hotel in Hanoi\nYou will be picked up at Hanoi Airport and transferred to your hotel. In the afternoon, you are free to stroll around the Old Quarter and try some local food to your heart’s content.\n"},{"title":"Day 2: Hanoi City Tour","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Hanoi. \nAs the capital of Vietnam, Hanoi is an indispensable destination for any Vietnam trip package. This centuries-old city surely has a good many to offer its visitors, guaranteed to be a mix of cultural, historical and natural spectacles, starting with the Ho Chi Minh Mausoleum, the Presidential Palace and Ho Chi Minh’s stilt house at the back, the One Pillar Pagoda, the Temple of Literature, and the delightful scene around West Lake at the heart of Hanoi, including the well-preserved Tran Quoc Pagoda and Quan Thanh Temple. After lunch, stroll around the Old Quarter, the most bustling and characteristic neighbourhood in Hanoi, on a rickshaw, passing Hoan Kiem Lake. Go back to your hotel to relax. Dinner is on your own arrangement.\n"},{"title":"Day 3: Hanoi - Ha Long Bay - Overnight on Cruise","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nAfter enjoying breakfast, you will head out for a 3-4 hour ride to embark on a rejuvenating Ha Long Bay cruise. While cruising the emerald waters of the World Heritage Site recognized by UNESCO, you could marvel at its grotesque limestone cliffs and islands, such as Dinh Huong and Ga Choi, etc. Later on, you will go ashore to visit one of the most fascinating caves in the bay area. And you will stay overnight on board.\n"},{"title":"Day 4: Ha Long Bay - Hanoi - Flight to Ho Chi Minh city","description":"Meal: Breakfast, Brunch/Accommodation: Hotel in Ho Chi Minh city\nKick start your day early with a Tai Chi session on the sundeck and you will get a chance to admire the ethereal sight of the sun rising from the watery horizon. After breakfast, visit an enticing karst grotto and then go back to the ship for a final glimpse of Ha Long Bay while cruising back to the dock. As the boat arrives at the harbour by noon, check out before driving back to Hanoi. You will then have some free time before getting transferred to Noi Bai International airport for the flight to Ho Chi Minh City. Overnight in Ho Chi Minh City.\n"},{"title":"Day 5: City Tour - Cu Chi Tunnel","description":"Meal: Breakfast, Lunch/Accommodation: Hotel in Ho Chi Minh city.\nTake the morning trip to visit Independence Palace, also known at the Reunification palace, was built on the sight of the former Norodom palace. The Independence palace is a widely known landmark of Ho Chi Minh City and was designed by the architect Ngo Viet Thu. Continue seeingthe beautiful structures from the French Colonial times such as the Notre Dame Cathedral, the historic Central Post Office. Followed by the remarkable site of the War Remnants Museum the museum has a vast display of the both the Indochina wars. Have lunch at local restaurant. \nDepart for Cu Chi tunnel, the trip will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. Break time for relax or time for those who want to try the real shooting gun. Return to Saigon. Overnight in Ho Chi Minh city.\n"},{"title":"Day 6: Ho Chi Minh city - Departure","description":"Meals: Breakfast/Accommodation: NA\nThere is no activity planned for today, so you are free to enjoy your free time shopping for souvenirs until getting transferred to the airport for your onward flight.\n"}]},{"name":"Scenic Vietnam","duration":15,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1540,"summary":"Journey from Hanoi to Ho Chi Minh City on an incredible two-week adventure in Vietnam. Discover the stately capital Hanoi, the lush hills of the Da Bac region, the stunning limestone scenery of Cat Ba Island, the majesty of historic Hue, the fairytale atmosphere of Hoi An, the glorious waterways of the Mekong Delta and the dynamic streets of Ho Chi Minh City. Explore not only the main highlights of the cities, but also the remote countryside, well away from the tourist crowds. A homestay in Sung Village, nestled in the forest among caves and tea plantations, is a chance to trek through minority villages and experience Vietnam at its sleepy best.You'll be spending two nights with local families on this trip. While the accommodation is shared and basic, this is a great opportunity to connect with the local people (and enjoy delicious home-cooked meals!). Read more about the experiences here: https://www.intrepidtravel.com/adventures/community-based-tourism-vietnam/","highlights":["Cruise through the famous Halong Bay","Visit the Ho Chi Minh Mausoleum","Shop at the Dong Ba Market","Explore the Mekong Delta"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1838_0261ac.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1838_0261ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_97a16fbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_01d020a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_3a3b31f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_51778c77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_d31501de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_1d00fe02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_aca108f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_42f23f95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_20ac1890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_d12bffda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_3a3e741b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_c7910f13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_7aa377ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_b34cd874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1838_64965be2.jpg"],"destinations":["Hanoi","Cat Ba Island","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm where you'll meet you tour leader and fellow travellers. If you arrive early, why not step out onto the streets to explore the chaotic capital of Vietnam. Hanoi is an alluring city of contrasts, best discovered on foot. Tonight, perhaps get to know your new travel buddies over a glass of fresh bia hoi. This is a foamy, light beer made fresh each day and served in basic, open-walled ‘brew halls’ – take up a brightly coloured plastic chair and sip your tasty brew.\nAccommodation: Hotel"},{"title":"Day 2: Hanoi","description":"Enjoy breakfast at the Blue Dragon Children's Foundation, a community project dedicated to helping underprivileged children and victims of trafficking. Afterwards, head out on a city tour where you’ll see the city’s diverse past reflected in a mix of South East Asian, Chinese and French-influenced architecture. Stop by the aptly named One Pillar Pagoda, the country’s most famous stilt house (former residence of Ho Chi Minh), Ho Chi Minh Mausoleum and the Temple of Literature.\nAccommodation: Hotel"},{"title":"Day 3: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantation are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (2 kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so please ensure you have suitable footwear for this activity. After a handicraft workshop, return to your homestay accommodation for a nice hot shower and a delicious dinner.\nAccommodation: Homestay"},{"title":"Day 4: Hanoi","description":"This morning, have an opportunity to take in more of the Vietnamese highlands on a 10 kilometre (6.2 mi) trek from Sung Village to Da Bia. The first 8km of the trek is mostly flat ground along well-worn buffalo tracks. The final 2km gradually inclines and for a period of approximately 300m there are some steps to climb, however the walk will be a steady relaxed pace. Keep an eye peeled for the monumental stone at the peak of Da Bia Mountain during the hike that takes us through the local villages, meeting people from the ethnic Muong tribe along the way. Stop for lunch at Da Bia before enjoying a scenic 1.5 hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours). Arrive in Hanoi at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter?\nAccommodation: Hotel"},{"title":"Day 5: Cat Ba Island","description":"Rise and shine for the 7.30am bus, stop for a quick break, then jump on the ferry. This morning of travel will deliver you to beautiful Cat Ba Island before midday. There's no time to waste, so begin exploring the picturesque waters around Cat Ba. You’ll board a boat and spend the rest of the day cruising the breathtaking Lan Ha Bay. Located in the greater Halong Bay area, Lan Ha Bay is one of Vietnam’s most scenic places, where limestone islands and caves rise from the emerald waters. Enjoy lunch on board, then get up close and personal with giant karsts in a kayak. Stay overnight on Cat Ba Island and enjoy a dip at one of the beaches and a cold beer.\nAccommodation: Hotel"},{"title":"Day 6: Hanoi - Overnight train","description":"Wake up in paradise, maybe starting your morning with a refreshing swim. Make sure you soak up as much sun and sand as possible, because this afternoon it's back to Hanoi via ferry and bus. There will be free time to explore the city when you arrive back in Hanoi before boarding an overnight train bound for Hue around 10pm. Shared hotel rooms will be available if you want to freshen up or organise your luggage. Otherwise, use this time to do some shopping on Hang Gai Street or seek out some delicious Hanoi street food. Meet back at the hotel lobby at 9pm where you’ll transfer with the group to the train station. Although conditions are basic, overnight trains are a rewarding experience in Vietnam. They are an efficient way to travel long distances and a great way to get a sense of the country.\nAccommodation: Overnight sleeper train"},{"title":"Day 7: Hue","description":"Arrive in Hue just after sunrise and proceed to the hotel to refresh. Hue is the hub of Vietnam’s historic past. This former imperial capital is an eclectic mix of busy streets and peaceful beauty. The rest of the morning is free for you to relax, perhaps pick up a classic Hue breakfast of bun bo Hue, a popular Vietnamese soup containing rice vermicelli (bun) and beef (bo). After lunch you will visit the Imperial Citadel, a sprawling complex of temples, pavilions, moats, gates, and walls. The Ngo Mon Gate, Thai Hoa Palace and the Ancestral Altars are still impressive, and the complex must have been awe-inspiring during its heyday in the 19th century. In your free time you might like to visit to Dong Ba Market, which offers locally made goods, fresh produce and tantalising street food. This is a good place to try the specialties enjoyed by Emperor Nguyen such as the banh khoai royal rice cake.\nAccommodation: Hotel"},{"title":"Day 8: Hue","description":"Today’s adventure will be taken on the back of a motorbike. You’ll have your own driver who will take you first on a drive around the Imperial Citadel, including the Forbidden Purple City. The latter was almost completely destroyed during the Tet Offensive in the Vietnam War, but its humble, foliage-covered ruins remain a testament to its proud history. Here you'll gain some insight into the horrific damage endured during the war. Break up your sightseeing with a dragon boat cruise on the Perfume River. Then it's on to the Thien Mu Pagoda, the unofficial symbol of Hue. This site dates back to 1601 and is still an active Buddhist monastery. Here you’ll also see the car left by a monk who set himself alight to protest the treatment of Buddhists by the South Vietnamese regime. Ride to a special lunch spot at a convent or Buddhist monastery for a delicious vegetarian feast. After lunch, drive to the royal tomb of Emperor Tu Duc, set amid a lake, frangipani bushes and pine trees. This evening, perhaps ask your leader for the best place to try imperial street specialties.\nAccommodation: Hotel"},{"title":"Day 9: Hoi An","description":"Travelling by bus, head south through coastal rice paddies before stopping in at Lang Co Beach. Then traverse the dramatic Hai Van Pass, a sometimes bumpy but incredibly scenic stretch of highway with views back to Lang Co Beach and beyond. The spectacular Marble Mountains will be your backdrop as you arrive at Hoi An (approximately 4 hours). Declared a World Heritage site, Hoi An is being beautifully restored and preserved. Known as Faifo to early western traders, it was one of South-East Asia's major international ports from the 17th to the 19th centuries. Today, parts of Hoi An look exactly as they did more than a century ago and it retains the feel of times past, making it the sort of place that grows on you the more you explore it. On arrival, a walking tour will take you around the major sites of Hoi An’s charming Old Town, including an historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. You will notice a distinctly Chinese appearance to the pagodas and assembly halls scattered along the small streets. A sightseeing pass is included in your tour for you to visit a selection of the major sights as you wish.\nAccommodation: Hotel"},{"title":"Day 10: Hoi An","description":"If you feel like getting active on your free day today, why not hire a bicycle and tour the surrounding countryside. This is one of the best ways to get an insight into rural Vietnam. Other optional activities include a day trip to My Son Cham (elaborate World Heritage-listed temples that reflect the rich cultural traditions of the Cham civilisation), a cruise along the Thu Bon River, and a trip to the nearby Cua Dai Beach. Your leader will be able to help with suggestions on activities in Hoi An.\nAccommodation: Hotel"},{"title":"Day 11: Hoi An","description":"Enjoy another free day in the World Heritage-listed Hoi An. You may like to wander the Central Market and the street stalls selling paintings, woodwork, ceramics, lanterns and much more. Hoi An is also famous for its talented tailors who can make beautiful items to order within a few hours. Bring your favourite piece of clothing, or even just a picture, and you'll be able to have it copied. You might like to visit a local workshop to learn how to make your own rice paper, while a Vietnamese cooking class too is a great way to familiarise yourself with some age-old culinary techniques, not to mention being able to feast on the fruits of your own labour.\nAccommodation: Hotel"},{"title":"Day 12: Ho Chi Minh City","description":"Transfer to Danang (approximately 45 minutes) for your flight to Ho Chi Minh City. Formerly known as Saigon, Ho Chi Minh City is characterised by a fascinating blend of old and new, East and West. The huge number of people rushing about their daily lives in Vietnam's largest city gives it a dynamic atmosphere and the French influence is evident in the excellent baguettes and coffee on offer. Take a guided tour to get a feel for the city, going past the GPO, Reunification Palace, and the Opera house. Stop in at the War Remnants Museum and the Notre Dame Cathedral. With free time this evening perhaps drop by one of Vietnam’s most pulsing markets, Ben Thanh. This is the perfect place to pick up any last-minute snacks, cooking utensils, ingredients, or presents for friends and family before you return home. Perhaps enjoy some of the market fare for dinner as you shop.\nAccommodation: Hotel"},{"title":"Day 13: Mekong Delta","description":"Today you'll travel south by private bus (approximately 3 hours) to explore the Mekong Delta. When you arrive, you’ll board a boat and explore the intricate waterways of the Mekong Delta. Often referred to as ‘the rice bowl’ of Vietnam, the fertile delta is where rice, tropical fruit and flowers are grown for the whole country. Disembark at Ben Tre and visit a local cottage industry and sample the candy that the region is famous for. You’ll have the opportunity to take a tuk-tuk around this remote village and make a stop to sample tropical fruit, see a honey farm, and learn more about rural life. For lunch, go to a restaurant in the heart of the delta and try regional specialities such as the famous elephant-ear fish. After lunch, board sampans (small rowing boats) and paddle along the canals under the shade of lush water coconut trees. Stay overnight at a guesthouse in the Delta. The accommodation is fairly basic with shared bathroom facilities and dormitory style rooms, but the sounds of nature thrumming softly in the night makes for a memorable experience.\nAccommodation: Guesthouse"},{"title":"Day 14: Ho Chi Minh City","description":"Take the bus back to Ho Chi Minh City. Maybe spend the final night of your Vietnam adventure with a finale bowl of pho, celebrating with your new friends.\nAccommodation: Hotel"},{"title":"Day 15: Ho Chi Minh City","description":"Your Vietnam adventure ends after breakfast today. There are no activities included, so you are free to depart at any time. For those who are staying on longer and want to explore Ho Chi Minh City further, maybe check out our Urban Adventure day trips."}]},{"name":"Northern Vietnam Adventure","duration":10,"travelStyle":["Adventure","Attraction-Based Hikes","Group","Fully Guided","Discovery","Hiking & Trekking"],"oldPrice":0,"price":1070,"summary":"The remote mountains of northwest Vietnam are home to some of South East Asia’s most rugged terrain, beautiful scenery and colourful hill tribes. Leaving the graceful boulevards of Hanoi behind, travel to Sapa before traversing the bumpy mountain roads to Ha Giang, Dong Van and cruising the waters of Ba Be Lake. Experience breathtaking mountain views and meet friendly locals along the way. If you want to get a taste of remote Vietnam, this is the trip for you.This trip includes a number of long journeys on windy and sometimes bumpy roads in a private minibus. This is the only way to access some of these locations, but we promise you that the views for most of the journey are impressive enough to make it all worthwhile","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/83174_8bc80310.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/83174_8bc80310.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_498e3fc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_411f5f86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_328fa40f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_009a98df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_0486d4f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_dd9e7671.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_7e6f3015.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_3cb353c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_6c30328e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_e1ade63c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83174_c9b88e1e.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm. If you arrive early into the capital of Hanoi, there’s plenty to see and do. Consider booking the Hanoi Highlights Urban Adventure with an expert local guide to introduce you to the city. Start by visiting the Temple of Literature, drop into a traditional tea house, and learn the stories of the Hoa Lo Prison museum. This tour concludes at Hoan Kiem Lake, surrounded by modern office buildings and ancient Buddhist temples. Or take it at your own pace and wander the Old Quarter and admire the city’s French-colonial architecture, relax in a park, or enjoy some street food.\nAccommodation: Hotel"},{"title":"Day 2: Sapa Homestay","description":"In the morning, travel by private minibus from Hanoi towards Lao Chai in the Sapa region. The drive will take approximately 5 hours, which makes for the perfect opportunity to get to know your fellow travellers. Press on along the winding road before taking your first glimpse of Lao Chai village, sitting comfortably in a valley with cleared hillsides and rustic farmland. Stretch your legs as you walk off the bus, then begin a trek to your homestay in Ta Van (approximately 10 km/6 mi), enjoying a picnic lunch stop on the way. Your homestay is comfy, quaint and surrounded by pristine farmland.\nAccommodation: Homestay"},{"title":"Day 3: Sapa","description":"After breakfast at your homestay, trek to Giang Ta Chai – home to the Red Dzao hill people. Push on through terraced farmland and bamboo scrub for excellent views of emerald valleys and rushing waterfalls as you stroll on by (approximately 5km/3mi. Rest your legs on the bus ride back to Sapa. If you still have some energy once you arrive in Sapa perhaps visit the local market. This is a great place to pick up locally dyed fabrics, hemp plants and handmade textiles. In the evening, settle into your hotel in Sapa for the night.\nAccommodation: Hotel"},{"title":"Day 4: Ha Giang","description":"In the morning, embark on a long bus journey (approximately 7 hours) to the province of Ha Giang. This is a highland region of forests and terraced rice paddies, with the mountains of Heaven’s Gate (Quan Ba pass) soaring in the background. The Ha Giang province also shares a border with southern China, and is known as Vietnam's final frontier. After relaxing and getting to know your surrounds, visit the local markets and shopfronts, which are relics of a bygone era. Afterwards venture to the the local museum and explore Cuom Village, witnessing the colourful traditional dress of the local people. The evening is free to spend as you wish.\nAccommodation: Hotel"},{"title":"Day 5: Dong Van","description":"Today, leave for the first of many scenic mountain drives throughout Ha Giang province. Stop to browse Minh Tao Market before wandering through the village of Nam Luong. A visit to Mrs Mai’s Responsible Tourism project will be a highlight of the day. Learn about the stories of human trafficking and how the victims/witnesses of this crime found the opportunity of a life free from exploitation here. Afterwards pass through Lung Tam textile village and the Vuong Family Palace in Sa Phin commune, before continuing to Dong Van where you'll spend the night.\nAccommodation: Hotel"},{"title":"Day 6: Dong Van","description":"After breakfast visit the local market, before setting off on a trekking loop that starts and finishes in Dong Van. The trek (approximately 4 hours in total) is moderate and suitable for those with an average fitness level. Wind your way through the spectacular landscape, where you can expect to witness glorious views and capture some amazing pictures of lush valleys and rice paddies. The evening is then free to relax or explore more of Dong Van.\nAccommodation: Hotel"},{"title":"Day 7: Bao Lac","description":"Drive past terraced rice farms on the road to Bao Lac (approximately 4 hours), a small town in the mountainous region of northern Vietnam. The area is home to the Black Lo Lo ethnic group, who are well known for their colourful attire and finesse in making bronze drums. The bronze drums hold a special place in Lo Lo customs, being used at funerals and important family events. In Lo Lo culture, only the sound of the drums can help the souls of the dead find their way to the birthplace of their ancestors. Stay overnight in Bao Lac and perhaps explore the local marketplace and learn more about this fascinating culture. \nAccommodation: Hotel"},{"title":"Day 8: Ba Be Lake","description":"Travel on to Ba Be Lake early in the morning (approximately 4 hours). Once there, head down the river by boat on an exploration of Ba Be National Park, visiting the largest natural lake in Vietnam. Disembark for some light walks along the way, visiting the impressive waterfalls that feed the lake and observing the natural flora and fauna. Return to land in the afternoon and head to a family-owned guesthouse where you will be spending the night. The family you’re staying with will prepare lunch and the rest of the day is then free to explore. In the evening sit down for a delicious dinner with your hosts. This is a great opportunity to gain an insight into their lives and culture.\nAccommodation: Guesthouse"},{"title":"Day 9: Hanoi","description":"Head back to Hanoi after breakfast (approximately five hours). Use your free time exploring the boulevards and colonial buildings of the city. If you have time, visit the Hanoi Military Museum or take a look inside the city's spectacular Opera House. For your final evening in Hanoi, perhaps share a final dinner with the group at the KOTO restaurant, a project aimed at providing vocational training to disadvantaged young people.\nAccommodation: Hotel"},{"title":"Day 10: Hanoi","description":"There are no activities included and you’re free to depart your accommodation at any time. If you would like to spend some more time in Hanoi, we’re happy to organise additional accommodation (subject to availability)."}]}]