[{"name":"Vietnam Luxury Vacation plus Beach and Mountain Resorts - 17 Days","duration":17,"travelStyle":["Discovery","Adventure","Beach","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2765,"summary":"Special price, arranged by leading Tour Operators in Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95529_95400933.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95529_95400933.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_90d9c0fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_c122db86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_dcad8846.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_298851fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_7d003a50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_0b7582e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_01d1498c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_760e54f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_7f3feebc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_00deb61f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_56af63c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_d740afb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_68f7ace8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_3274eb94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_58113e84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_8c107098.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_36611d82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_ec183445.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_5389b7bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_5e01f8880b457.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_5e01f88819ab7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_5e01f8882084c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95529_5e01f8882660e.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nSheraton Hotel Hanoi or similar."},{"title":"Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi. \nSheraton Hotel Hanoi or similar."},{"title":"Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nParadise Luxury Cruises or similar."},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Cruise check-out. Rejoin car drive back to Hanoi.\n16:00: Arrive hotel in Hanoi. Check in and stay overnight in Hanoi.\nSheraton Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort in Mai Chau"},{"title":"Bakhan Village - Hanoi Airport - Fly to Hue City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi Airport directly. Arrive Noi Bai Airport (Hanoi) around 17:30. Catching flight to Hue City. Arrive Hue City in the evening, transfer to hotel for check in. Overnight in Hue.\nImperial Hue Hotel or similar"},{"title":"Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nImperial Hue Hotel or similar"},{"title":"Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble – and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nHoi An Palm Garden Resort or similar."},{"title":"Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nHoi An Palm Garden Resort or similar."},{"title":"(4 nights): Stay at Hoi An Palm Garden Resorts for Leisure & Shopping (B)","description":"You have luxurious 4 nights stay in 5* Parm Garden Resorts & Spa Hoi An or similar! Enjoy your time!\nDaily Breakfast is included in the Resort."},{"title":"Conclude Hoi An to fly for Ho Chi Minh City Sightseeing full day. (B, L)","description":"Breakfast at Hoi An Garden Resort then fly to Ho Chi Minh City. Pick up upon arrival & start visiting Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Colon, which means “Big Market.” Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City.\nNew World Saigon Hotel or similar"},{"title":"Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nNew World Saigon Hotel or similar"},{"title":"Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. We will arrange Private Car & Tour Guide pick you up from hotel in Ho Chi Minh City to Airport for your International flight! Finish unforgettable Vietnam Vacation with Legend Travel Group. Good bye & see you again!"}]},{"name":"Explore Bai Dinh – Trang An Eco Complex 1 Day plus Mai Chau Valley","duration":3,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":155,"summary":"Admire Bai Dinh pagoda - the biggest Buddhism center of South East Asia with hundreds of statues of different sizes.\nTrang An ecological tourist site where you take a boat trip to visit many caves of different sizes in a scenic landscape of Trang An.\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95678_e178b788.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95678_e178b788.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_3e100002.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_44670c5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_69549bb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_d364a1de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_9daabcf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_7ace775f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_16d6d50b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_468f19ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_c4b6ad33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_30c4175a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_d8f3dd93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_8cad4010.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_41cc524a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_2d2758a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_1ffdce85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95678_89e70525.jpg"],"destinations":["Hanoi","Ninh Binh","Mai Chau"],"timeline":[{"title":"Day 1: Trang An - Bai Dinh full day tour (L)","description":"Trip starts at 8:30am from your hotel lobby for Ninh Binh province (100km far), which owns Bai Dinh Pagoda and Trang An Eco Complex – the UNESCO Heritage.</p><p>8:30: pick up at your hotel to depart for Ninh Binh province (100km) for our day tour of Bai Dinh pagoda & Trang An ecosystem. We spend time to visit the Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters height, 100 tons weight.\n12:00pm: Have lunch at local restaurant with some local special dishes such as Goat meat with elderberry, pork storage vessel.\n1:00pm: Continue to visit Trang An Scenic Landscape complex nearby which recently recognized as an UNESCO World natural heritage, get on a rowing boat (small sampan) traveling along the small river with scenic mountain and green fields landscape. Boat takes you to visit cave complex of Trang An: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, the scenery of mountain and rivers.\nLate afternoon, drive back to your hotel in Hanoi.\nEnd this tour of Trang An - Bai Dinh Pagoda around 6.00pm. Finish unforgettable full day trip with Legend Travel Group at your hotel in Hanoi. (Hotel accommodation arranged by your own)"},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Trip ends at your hotel in Hanoi. Good bye and see you again!"}]},{"name":"Trekking Mai Chau And Pu Luong Hidden Trails","duration":3,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":336,"summary":"In and around HanoiDepart from your Hanoi hotel at 8:00 am transferring to Mai Chau. Daydream as we drive a safe route with spectacular views around every bend. Upon arrival at Pom Coong village in Mai Chau, we will take a short walk to visit the ethnic Thai people, then lunch will be served at local home.  By 2:00 pm, driving 20 km more to Pu Luong Natural Reserve then start a 2 to 3 hour walk through beautiful hill side villages, magnificent rice paddies, seeing hand crafted bamboo water wheels. The highlight on this walk is experiencing the beauty of Pu luong Nature Reserve, the everyday life and culture of the white Thai people. Become a part of local life when we are welcomed as honored guests at a traditional Thai home on stilts. Here in Hang village we will have a traditional dinner and stay the night.\n\n  Accommodation: Homestay\nStart point\n Hanoi, Hanoi, Vietnam ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128838_991968a2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128838_991968a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_3d2594f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_a7011ba1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_c8e5d847.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_8978ce71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_e21f7ec5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_1c52311c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_c4742b1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_9eb386dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_32f1fc03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_98b52328.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_882ba6fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_21bd9cf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_918ec304.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_17164b5e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_c0356d72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_85a1a729.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128838_f425880e.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi – Mai Chau – Pu Luong (170 Km & 3-hour Walk)","description":"Depart from your Hanoi hotel at 8:00 am transferring to Mai Chau. Daydream as we drive a safe route with spectacular views around every bend. Upon arrival at Pom Coong village in Mai Chau, we will take a short walk to visit the ethnic Thai people, then lunch will be served at local home.  By 2:00 pm, driving 20 km more to Pu Luong Natural Reserve then start a 2 to 3 hour walk through beautiful hill side villages, magnificent rice paddies, seeing hand crafted bamboo water wheels. The highlight on this walk is experiencing the beauty of Pu luong Nature Reserve, the everyday life and culture of the white Thai people. Become a part of local life when we are welcomed as honored guests at a traditional Thai home on stilts. Here in Hang village we will have a traditional dinner and stay the night."},{"title":"Day 2: Pu Luong Trekking","description":"It will be interesting for you to get up and observe, or even take part in their activities in the morning because the daily life here starts early, take an opportunity to stroll around Hang village before having breakfast served by Thai people, then at 8 a.m start our trek. Today we will be walking approximately 5 to 6 hrs .The first hiking is hard with some steep climbs and yet more stream crossing, the next is really glorious with beautiful views of valley, rice terraces, rich rain forest, streams.  Picnic lunch on the way at Eo Ken village, arrival in Kho Muong Village – the setting of the village is perhaps the most beautiful in Vietnam. It is recommended to stroll round the village and join in as villagers go about their daily lives, or relax in one of the three-eco homestays superbly set up by FFI (Flora and Fauna International) in conjunction with local villages. Please be soft and nice, nature is just very lovely here. Arrival in Kho Muong village in the afternoon. Here we will spend our second night in a typical Thai eco – stilt house."},{"title":"Day 3: Pu Luong Nature Reserve - Drive back to Hanoi","description":"After having breakfast, start for an easy day trek. We will continue on through beautiful valley, unspoiled villages with nice view, sure with much impression. Relax from the heat of the day before continuing on to a village nestled between steep karts mountains and nice terraces. Arrive in a small town in Pho Doan market after 3-4 hrs trekking.  Short break for lunch in a local food stall in the town. Our driver will bring us to Canh Nang, follow 217 road to Cam Thuy and back to Hanoi. Finish our trip at your hotel in Hanoi.  Trip ends in Hanoi. Ultimate Odyssey Travel loves to meet you again!"}]},{"name":"Hanoi at Glance for Full Day Trip plus Mai Chau Valley","duration":3,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":155,"summary":"Observe local life as you cycle through narrow street and small alleys of Hanoi\nEnjoy an authentic bowl of traditional Pho noodle at a café after your ride\nStudy about Hanoi culture and historical through the Museum visit\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95656_20ec3293.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95656_20ec3293.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_f395f525.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_b61d1bf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_72807c75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_ac446fe6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_114c12ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_5bbc698a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_945c08a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_7cdfcd9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_46da6962.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_ca8b0c05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_cba8aeb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_c6a18fa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_b84e880d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_e509b8ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_c307782f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_f4ba8b14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_4adf3dc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_57c21daf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_e3bdb176.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_7d89d999.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_e170be72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95656_ff32efc9.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi full day tour (L)","description":"8:30am: You will be greeted by our local English speaking guide and transferred to Ho Chi Minh Complex, at which you visit the Ho Chi Minh Mausoleum, the Presidents Palace and Ho Chi Minh’s House on which President Ho Chi Minh lived until his last breath, Ho Chi Minh Museum, unique One Pilar Pagoda.  It might take some minutes for the registration before you begin your visit at this complex.</p><p>11:00 am: Take a walk to Tran Quoc Pagoda, and enjoy the peaceful atmosphere and charming beauty of one of the oldest pagoda in Hanoi.</p><p>11:45 am: Lunch at a local restaurant with local Vietnamese cuisine.</p><p>1:30 pm: Continue your tour at Van Mieu - Quoc Tu Giam (Temple of Literature), the first Imperial University in Vietnam which was built in 1070. It is the place dedicating to Confucian.</p><p>2:30 pm: Leave the Temple of  Literature, you have a cycle (predicable) trip to the Old Quarter such as Hang Bac (Silver street), Hang Tre (Bamboo street), Ma May street and through Hoan Kiem Lake, Hanoi Opera House and stop at St. Joseph’s Cathedral.</p><p>4:00 pm: Enjoy a 45-minutes water puppet show at Thang Long Puppetry Theater. After the show, our transfer will take you back to your hotel in Hanoi.\n(Hotel accommodation arranged by your own)"},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Trip ends at your hotel in Hanoi. Good bye and see you again!"}]},{"name":"3-day Sapa trekking and Bac Ha market on Sunday","duration":3,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":220,"summary":"Breathtaking mountain scenery and tribal villages amongst perfect nature setting are highlights of Sapa. Getting off the beaten track and walking through villages where ethnic minority peoples live, paying visit to their homes, witnessing their every day activities,.. Although traveling in very basic condition, including 2 nights on the deluxe train, 1 night home stay in tribal village, 1 night in 3* hotel in Sapa, the trip will bring you a lot of unforgettable experiences.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/144033_6ea4a8d9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/144033_6ea4a8d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_3c01ec89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_125bdcc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_1feab6f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_9f92ff4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_e483ba28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_f6b16fff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_cd6c466f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_554b48a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_a4cf67ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_bda67dc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_5e8e4c32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_57e2f3f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/144033_dfd25135.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1 (Thursday Night) Take overnight train from Hanoi to Lao Cai","description":"\nDay 1 :(Friday) Lao Cai  - Sapa -  Y Linh Ho - Lao Chai - Ta Van ( B,L,D)\nThe tour guide will pick you up at Lao Cai Station. Then you will visit Sapa market and the old cathedral where you can meet a lot of local ethnic minority peoples such as Black H’mong and Red Zao. Back to our Sapa office at about 10.30 and begin your exploration trip to Muong Hoa valley. This part offers spectacular scenery of the highest part of Hoang Lien Son mountain range and in a nice day, Fansipan Peak can be seen. Crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai and then following the river bank to Ta Van of the Zay people. Settle down in Ta Van village for an overnight home stay. "},{"title":"Day 2 (Saturday) Ta Van - Giang Ta Chai - Hau Thao - Sapa Saturday Market ( B,L,D","description":"Day 2 (Saturday) Ta Van  - Giang Ta Chai   - Hau Thao - Sapa Saturday Market ( B,L,D)\nYou will take the trail uphill, walk for half an hour to Giang Ta Chai village of the Red Zao peoples which sits on the top of a hill and looks down Muong Hoa river, then uphill again to Hau Thao village. A late Lunch will be prepare here nearby this center.\nLater a short drive will take you back to Sapa, check in your hotel and evening is free to attend the locals at Saturday market in Sapa. "},{"title":"Day 3 (Sunday) Sapa - Bac Ha Market - Overnight Train to Hanoi ( B,L,D)","description":"Day 3 (Sunday) Sapa - Bac Ha Market - Overnight Train to Hanoi ( B,L,D)\n\nCheck out your hotel at 07.00 for a 3 hour road ride to Bac Ha via Lao Cai. Arrival in Bac Ha at about 10.00. You will join the locals at the market for your own discovery, taking a lot of photos as well as enjoying funs. Lunch break in a local restaurant before enjoying a walk for about 2 hours to Ban Pho village of the Flower H’mong and Tay ethnics. The road trip back to Lao Cai station take about two hours and you will arrive in late afternoon. Taking a shower and Dinner on your own before taking the overnight train to Hanoi which arrive early the next morning and your trip ends. \n\nNote: The schedule of Day 1 and 2 can be flexible and changed according to your choice of departure time. The Bac Ha market can only be visited on Sunday.\n\n"}]},{"name":"Vietnam the Long Way Up","duration":16,"travelStyle":["Discovery","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1987,"summary":"Saigon, as the most hectic hub, welcomes much more international arrivals than any other cities of Vietnam so you may find it much easier searching good airfare to Saigon before starting a Vietnam trip. Driving along the seashore, then discover step by step historical sites, hill resorts, sunlight beaches, ancient palaces to tribal market and unique Halong by all means of transport will make the trip unforgettable.","highlights":["Squeeze through the tunnels of Cu Chi from the fierce Vietnam War","Glide through the succulent waterways of the Mekong Delta","Stroll under the lantern lights through ancient streets of Hoi An Town"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101728_74636e5b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101728_74636e5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_4de9dfa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_0ffa64da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_78ea347d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_b454c6ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_f0881b08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_7471db3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_e518fbe7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_12c0ddd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_e8918514.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_73cf1953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_f093734f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_f62e3f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_ea229ce2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_dce0704c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_1c1a36a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_a6d889a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_6fa1c8b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_6df59a52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_c5e697a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_3b600415.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_921cb222.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_a7d2383c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101728_d342702c.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Dalat","Hoi An","Hue","Hanoi","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Saigon Arrival City Tour (D)","description":"Arrive Saigon. You will be picked up and transfered to city centre by local guide and private bus to check in our hotel. Hotel check in time is 14h00, early check-in upon availability.\nThis afternoon, start the city tour. We drive to visit the Reunification Hall, formerly known as the Presidential Palace. It was towards this modern building that North Vietnamese resistance fighters tanks (Viet Cong) rolled on the morning of April 30, 1975 as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. Cotinue visiting History Museum. Before check in the hotel, we stop to take a photos and visit at the colonial-styled Post Office and the Notre Dame Cathedral, built between 1877 and 1883 and one of the citys major landmarks which should be in your shooting of the city. End your tour at the central Ben Thanh Market, where vendors display a vast array of goods and handicrafts, appealing to every taste. Continue to the restaurant for dinner. Overnight in Saigon."},{"title":"Day 2: Saigon Mekong Delta Tour Saigon (B/L/D)","description":"Picked by at hotel and drive heading to My Tho the homeland of coconut and family factories with local products like coconut candy, rice paper, Upon arrival, embark on the boat cruising on the mighty Mekong River viewing the life to the local people live along the banks. We stop at one of 4 island in the area for sightseeing. Enjoy the fresh tropical fruits served in the heart of the garden accompanied by traditional southern Vietnamese folk music at the plantation. After that you will embark on the small boats rowed the the local people thru the small cannels with water coconut tree to visit the local factories. There you will taste the honey tea and see the local people produce the coconut candy milk and of course you also can try it or stroll in the garden where the locals feed honeybee. \nAfter that enjoy the horse-cart trip through the tranquil road of the village. We continue getting on the big boat to visit the vast area. Enjoy your lunch at a local restaurant nearby Mekong River with the Elephant Ear fish. Afternoon, drive back to Saigon, visit China Town also know as Cho Lon which makes Saigon differ from other cities of Vietnam, and Thien Hau pagoda. Short stop at Ben Thanh Market for your free shopping before dinner time. Overnight in Saigon."},{"title":"Day 3: Saigon Mui Ne (B)","description":"Pick up at your hotel in Saigon and leave by the landway to Mui Ne - Phan Thiet. The scenic 220km drive north on Highway One passes through the bustling city of Bien Hoa before cutting through dense rubber plantations. Nearer to Phan Thiet the terrain changes to arid semi-desert with cactus plants and strange-looking dragon fruit trees. Arrive in Mui ne at noontime and check-in the resort. Free at leisure rest of day to relax on the beach of Mui Ne and enjoy water sport games (at your own cost). Overnight in Mui Ne."},{"title":"Day 4: Mui Ne Free and Easy (B)","description":"At your own leisure today to relax on beach of Mui Ne. Overnight in Mui Ne."},{"title":"Day 5: Mui Ne Da Lat (B/D)","description":"Early morning, we will transfer to Dalat, the jewel of Vietnam's Central Highlands. This city is featured by a park-like environment, with lovely temperature 15-24C and sunlight all year round which make the city a haunt of honeymoon couples. Before reaching Dalat City, we will bend the route to visit the Elephant Waterfall and the Chicken Village of the KHo ethnic people residing at the base of Elephant Mountain where indigenous gong culture has been maintained by generations. Walk around the village to see their vegetable, flower farms, traditional wooden houses and beautiful weaving products. Arrive in Da Lat at the late afternoon, check-in hotel. Evening transfer to the restaurant for dinner. Overnight in Da Lat."},{"title":"Day 6: Da Lat-Nha Trang (B/D)","description":"Morning visit Dalat including the Summer Palace of Bao Dai - the last King of Vietnam, Tuyen Lam Reservoir, Truc Lam grandiose temple and Dalat Flower Garden (or the Crazy House of architect Hang Nga). After lunch head to Nha Trang. The landway from Dalat to Nha Trang (more than 200km) is very sightworthy and photogenic with pinewoods, waterfalls, farms of tea and coffee, and Picturesque mountain pass (Bellevue Pass as named by the French early 20th century!). We can have a break overlooking the magnificent Danhim Reservoir and spectacular view of the ancient tower Po Klong Garai built by the Cham nation in Phan Rang - Thap Cham, 101km from Dalat. Arriving in Nha Trang late afternoon, if time permits we will visit Thap Ba Ponaga (Po Nagar Cham Tower). Check in hotel. At leisure for relax with crystal plages of Nha Trang.  Evening transfer to the local restaurant for dinner. Overnight in Nha Trang."},{"title":"Day 7: Nha Trang Free and Leisure (B)","description":"At your own leisure today to relax on the beach of Nha Trang. Overnight in Nha Trang."},{"title":"Day 8: Nha Trang Da Nang Hoi An - Flight Vn1942 06h05 07h05 (B/D)","description":"Early morning, transfer to the airport for the flight to Da Nang. \nArrive Danang, picked up by the local tour guide and proceed to Hoi An, a major Asian trading port in the 17th and 18th centuries whose architecture and relaxed lifestyle has changed little over the years. Your tour takes you through Hoi An, once a major Asian trading port in the seventeenth and eighteenth centuries. Hoi Ans architecture and relaxed lifestyle have changed little over the years. Take a leisurely walking tour of the ancient town center and visit the sites of former merchants homes like Tan Ky House, a 400 year-old Japanese Covered Bridge, and a Chinese Communal Hall. Before you return to your hotel enjoy browsing and shopping in the one of the most colourful local market places in all of SE Asia. Overnight in Hoi An. "},{"title":"Day 9: Hoi An My Son Hoi An (B/D)","description":"Today, we will visit the religious centre of the former Champa Kingdom. My Son, 60km southwest of Hoi An, sits in a lush green valley with dozens of red brick towers and sanctuaries dating from the seventh through the thirteenth centuries. Your guide will take you through the museum and the holiest of sites before returning to your hotel. We also have chance to enjoy Cham dances in this Holy Land (at 09.30). Back to Hoian. Free at leisure in the afternoon for shopping. Dinner at a local restaurant. Overnight in Hoi An. "},{"title":"Day 10: Hoi An Da Nang Hue (B/D)","description":"Today we will depart from Hoian for Hue via Danang with stop to visit the Marble Mountains, five sacred hills containing dozens of Buddhist shrines, seeing the view and cave from Thuy Son and the Cham Museum, which contains the finest collection of Cham sculpture in the world and  (Water and Mountain).Heading to Hue, we will pass over the beautiful Hai  Van Pass -Vietnam's geographical and psychological boundary between north and south. The peak of  the pass lies perpetually shrouded in clouds. Once an outpost of the Hinduized Cham Empire, the area around Hue was conquered in the 14th century by the Viets from the north. In 1687 the Viets made Hue their capital, and continued their expansion into Cham territory. It remained the capital under the Nguyen dynasty, which had thirteen emperors, the last of whom ruled until 1945. Hue is still the intellectual capital of Vietnam with 12 schools of higher learning.  It maintained its cultural identity while other cities were accumulating foreign influences. The Nguyen dynasty left an Imperial city of citadels, palaces, tombs and temples set in the peaceful countryside bordering the Perfume River. Hue today has regained its royal demeanor and is a calm, peaceful and relaxed place to visit. The remaining French colonial garden houses and villas, quiet streets, riverbanks, and outlying tombs and pagodas that escaped damage - all give Hue a unique atmosphere of tranquillity. Upon arrival, check in hotel. Overnight in Hue. "},{"title":"Day 11: Hue City Tour Hanoi - Flight Vn1544 21h45 22h55 (B/D)","description":"Start your day with visit King Khai Dinhs Tomb, then the mausoleum of former emperor Minh Mang. Continue with a boat trip up (from the Tombs up toward the city) on the romantically named Perfume River visits Hues best-known religious site, Thien Mu Pagoda.\nAfternoon, we continue visiting the Imperial Citadel where the Nguyen Dynasty ruled between 1802 and 1945.  After exploring the ruins of this wonderful monument, we will have a cyclo tour around the old town to experience the real life of the local people. After dinner, transfer to the airport for the flight to Hanoi.\nUpon arrival, meet your local tour guide and transfer to hotel for check in. Overnight in Hanoi."},{"title":"Day 12: Hanoi City Tour Train to Lao Cai (B/D)","description":"This morning meet your guide at your hotel and depart on your tour after breakfast. Your first stop will be Ho Chi Minhs Mausoleum, as well as his private residence from 1954 until 1969. The wooden ethnic minority style house, which was built on stilts, is surrounded by lovely peaceful gardens. In the same complex you will  see the One Pillar Pagoda, founded by King Ly Thai To in 1049. This structure has become an important symbol for the people of Hanoi. Your next stop will be the Ethnology Museum. Free time for own lunch. The afternoon sightseeing also includes Temple of Literature, Vietnams first university.  Constructed in 1070, the gardens and well-preserved architecture offer a relaxing glimpse into Vietnams past. Then we have a tour around the Sword Lake with the stop at Ngoc Son temple. Finish the day with a Water Puppet show. This is a uniquely northern Vietnamese art form depicting scenes from rural life and episodes of national history. After dinner, transfer to the Railway Station for the overnight train to Lao Cai around 22.00. Overnight on train (4-berth apartment with air-conditioner). \nNote: Ho Chi Minh Mausoleum closed on Friday so we can only see outside. \nEscort tour guide on train. "},{"title":"Day 13: Lao Cai Sapa Lao Chai Ta Van (B/D)","description":"Arrive at Lao Cai Station at 06.00. Picked-up and transferred to Sapa by car (40km mountain road from Lao Cai). The mountain landscape of Sapa is magnificent and so different from what we have experienced in the South and Central Vietnam. Don't miss to stop to enjoy its misty pinewoods, graceful terraced paddy fields and get lovely pictures of charming Hmong or Dzao girls you see on the mountainside. \nAfter arrive in Sapa, we will have breakfast before leaving luggage at the hotel and hang around with our guide to Sapa market street, where we can meet the montagnards and admire their handicrafts made of wood, silver, or dyed and embroidered fabrics and clothes and visit Cat Cat village of the Hmong people. After lunch, drive to Lao Chai (10km from Sapa) and trek 5km to Tavan with stops at the villages of the tribal people Hmong, Tay and Dzay en route. Back to Sapa for overnight. Overnight in Sapa. "},{"title":"Day 14: Sapa Bac Ha Market Lao Cai (B/D)","description":"Today is Sunday so nothing will be better than driving overland to a market of the hill tribal people, mainly from Flower Hmong ethnical group. Early morning we will drive toward Bac Ha, about 110km from Sapa. With a dozen of tribes living in the surroundings, including Flower Hmong, Chinese, Nhang, Dzao, Nung, Phu La, Thai and King (or Viet), the market is extremely exciting esp. in the early morning. The winding road to Bac Ha helps maintain the colours (in both literal and figurative sense) of the area. In this market, we can meet hundreds of beautiful women from Flower Hmong tribe, who are famous for their wonderful craft and hand-made flowering clothes and textile fabrics, or intermingle with people from Black Hmong, Dzay, Dzao and other ethnic groups coming to the market not for purchasing stuffs, but for meeting and chatting  just once a week - like in a real cultural center. \nAfter lunchtime, we can hike around, following the mountain people to their villages for a visit, or take our car heading to further hamlets in Ban Pho. Back to Lao Cai Station later afternoon with stop for photo shooting at Ha Khau  border gate between Vietnam and China. Dinner at the local restaurant and take the night train from Lao Cai to Hanoi. Overnight on train (4-berth apartment with air-conditioner)."},{"title":"Day 15: Hanoi - Ha Long/ Lan Ha Bay - Overnight on Board (B/L/D)","description":"This morning, we journey east for 4 hour through picturesque rice-farming villages of the Red River Delta, where we see everyday Vietnamese village life to reach to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006.\n12h15, embark at Tuan Chau Marina. Get on board our overnight cruise. Welcome drink will be served instantly during cruise briefing. Check in our reserved cabin and take a rest.\n13h20, enjoy a nice set lunch. Relax on sundeck and grab the unparalleled scenery of Halong Bay while cruising ahead to the Bay. Cruise through Hoa Cuong floating fishing farm.\n15h00, by tender, visit Titop Island. Have free choice of activities such as sunbathing; swimming; conquering the peak of the biggest island in Halong named of a Russian space hero and taking panoramic photos of Halong bay in the afternoon.\n16h00, challenge yourself at Luon cave by kayaking  an indispensable water activity in Halong offering the serenity of escape and cooling your soul down to recover after a 4-hour-car drive.\n17h30, go back on our main cruise for relaxation. Regain our energy by enjoying fantastic views of Halong on sundeck at dusk. \n18h30, join cooking class on the sundeck to learn how to make Spring Roll - an authentic specialty, which is voted for World's 50 best foods by CNN.\n19h30, a sophisticated dinner that gives us an appetite will be dedicatedly served in romantic ambience, especially with BBQ fresh seafood and a variety of Vietnamese and Western foods.\n21h00 onwards, evening activities: watching film at the outdoor bar; playing board, guitar and card games; going fishing squid on tender. Enjoy squid cooked after fishing. \n22h00, overnight at the quietest sleeping area. End of the first day in Halong."},{"title":"Day 16: Halong/Lan Ha Bay - Hanoi Departure (B/L)","description":"06h30, start a new day by doing Tai Chi exercise on the sundeck or be ready your camera while Dawn breaks over the sea.\n07h30, have a light breakfast with coffee, tea and bakeries on board.\n08h30, explore Me Cung (Maze) cave, which is rare in cave-lake seascape. Climb up several rugged stone stairs to admire the miracle of stalactites in a very complex structure, then overlooking gradually to the west, a great lake will appear in font of you, considered as a royal garden surrounding by natural mountain walls. Its water looks blue all year round and breathtaking from high above. \n9h30  10h30, come back to the cruise. It's time to check out our cabin, relax among grand views. Farewell lunch is deliciously served whilst the cruise keeps on its route back to the marina.\n11h45, disembark at Tuan Chau Marina. Transfer back to Noi Bai airport for the departure flight. "}]}]