[{"name":"Ho Chi Minh - Cu Chi Tunnel - Cao Dai Temple - Mekong Delta 5 Days 4 Nights Package Tour","duration":5,"travelStyle":["Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":237,"summary":"Highlights :\n\n   \tVisit Cu Chi Tunnel.\n   \tVisit Cao Dai Temple.\n   \tStreet food tour by scooter ( on request ).\n   \tShopping at Ben Thanh or wholesale market.\n   \tDinner on Sai Gon Cruise, along Sai Gon river at night.\n   \tVisit Mekong River Delta : My Tho, Ben Tre, 4 Island.\n   \tVisit : Independence Palace, Notre Dame, Post Office, War Museum.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db89.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813db9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dba8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197406_5e8197813dbb5.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HO CHI MINH ARRIVAL (-/-/-)","description":"You will be met by Luco Travel’s tour guide and driver at Tan Son Nhat International airport and transfer to your hotel for check-in hotel. Free and easy or you may like this option as below: \nOption 1: Water Puppet Show & Dinner On Saigon Cruise\n18:00 Pick up at the hotel. We will watch the Water Puppet Show. Traditional content of water puppet performance contains daily life of Vietnamese farmers (cultivating, tending buffalo, catching fishes…), communal entertainment (swimming contest, dragon dancing…), and/or historical legends (Le Loi returns precious sword…), with a performance that has appealed to audiences for centuries.\n19:30. Have a dinner on Sai Gon Cruise. Enjoy your meal while cruing along the Sai Gon river and sightseeing a part of Sai Gon by night.\nOption 2:  Saigon Street Food Tour On Scooter At Night.\nAt 18:00, our tour guide will meet and greet you at hotel. You then receive safety instructions on how to ride on the back of a bike properly in order to ensure the safest experience.\nYou will participate in the rush hour of Saigon the way we, the local, do: all from the back of the bike. We ride through the beautiful lit boulevards, the back alleys and the busy streets, which is undoubtedly more awesome of an experience than looking through pictures in your handbook!\nFirst, let’s enjoy Vietnamese pancake (Bánh xèo), spring rolls,… and you will learn about the customs and background knowledge of the food you eat from our guide and you also will try how to make it. We also would sit on small plastic chairs in the alleys, enjoy our food and drink like Vietnamese.\nLater on, our guide takes you around Saigon and explore \"Chung cư\" - a Vietnamese residential building which was built very long time ago. We will sit down to taste coffee in the hidden coffee shop and learn how to make a glass of coffee without machine. It is so good and that is why it has its place in everyone's bucket list when coming to Vietnam.\nOn our way, you will see local activities and discover small alleys where Vietnamese always enjoy their spare time in the evening and of course, getting some snacks (Vietnamese pizza) with which almost every Vietnamese falls in love, is a must.\nYour last stop is the famous Vietnamese dessert, the sweet soup. You will have a chance to let us rock your senses until your jaw drop with 3 – 5 kinds of sweet soup desserts.\nAt around 10:00 pm, we will take you back to your hotel.\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"HO CHI MINH CITY TOUR (B/L/-)","description":"The morning, Luco Travel’s  tour guide will pick you up at the hotel and we will start the Ho Chi Minh City Tour. We will visit the War Remnants Museum: Formerly known as the Museum of American War Crimes, this is a poignant display of the futility of war. Some of the black and white photography in the ‘Requiem’ exhibit is particularly touching, dedicated to both foreign and Vietnamese journalists and photographers who perished during the conflict. The courtyard outside contains the spoils of war, namely rusting jets, tanks and cannons captured from the American military reginme.\nAfter that visitors can visit The Reunification Palace: This is one of the most important buildings in the city. Here on April 30th 1975 the ‘American War’ officially ended when tank number 843 of the North Vietnamese Army crashed through the gates of what was, at the time the residence of the President of the Republic of Vietnam.\nThen you can go sight-seeing at the Notre Dame Cathedral and Old Post Office: built between 1877 and 1883. this is one of the best examples of classical French colonial architecture. Remarkably every stone used in its creation was shipped from France to Vietnam. Her two 40m towers, topped with iron spires dominate the city’s skyline. The Old Post Office is another example of French colonial architecture and is also the country’s largest post office. Visit former US Embassy.\nEnjoy your lunch at the restaurant. (Cooking class can be arranged upon request)\nAfternoon: Visit Opera House, City Hall, Jade Emperor Pagoda, Ben Thanh Market: This bustling market is very popular with tourists, primarily due to its central location. It has a wide selection of goods ranging from fake Nike shoes to beautiful silk Ao Dais.\nBack to hotel. Free & Easy.\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"MEKONG RIVER DELTA -MY THO BEN TRE ISLAND TOUR","description":"After your breakfast, Luco Travel’s tour guide will pick up you at the lobby, to depart toward Mekong Delta. It takes 1,5 hours driving to get to My Tho Town in Mekong Delta. On the way, travellers will have chance to see the beautiful landscapes along the road such as the green rice fields, the peaceful Vam Co Dong river and the busy Long An town. To end the route, our bus will stop at Mekong rest stop where you can take a rest and see a beautiful bonsai garden.\nYou will arrive at My Tho Town and visit Vinh Trang pagoda, an old ancient pagoda in Southern Vietnam. Known as the largest pagoda and the most special architecture in Mekong Delta, its architecture was influenced by both Vietnamese and Khmer’s culture as well as European architecture.\nAfter visiting Vinh Trang pagoda, the bus will take tourists to the pier boat for getting on a motor boat. Take a leisurely boat ride in Tien river to enjoy the fresh air, to see the peaceful life of the local people, and also to pass by the stilt house, the fishing floating farm, and the four islands: Dragon, Phoenix, Tortoise and Unicorn.\nYou will take a half hour by boat to arrive at Thoi Son Island, the biggest island of four islands. Take a leisurely walk on the village paths, visit local people’s homes and an orchard garden, enjoy seasonal fruits while listening to traditional Southern folk music. \nWe will take a hand- rowing boat through the creeks for sightseeing the natural water coconut trees a symbol of the Delta areas. The local people will give you the “ nón lá” the Vietnamese traditional hat. After that you can try to row the boat by yourself. \nAfter 20 minutes we will arrive at the bee keeping farm, then visit the honey bee farm and taste delicious honey tea with lemon that is really good for health. The local people also have a python farm, for those tourists, who like adventure you can take a photo with the  pythons.\nAfter lunch at a local restaurant, you will ride through the village paths to enjoy the fresh air and observe the pastoral life, concluding with a short walk through the narrow village.\nYou will return  to the motor boat to cruise to Ben Tre Province, known as coconut country in Mekong Delta. There you will visit the coconut candy workshop to know how to make delicious candies by hand. The highlight of the trip is to take a sightsee through the peaceful villages by horse cart. You also can visit the crocodile farm on the island.\nYou will return to the boat and back to the car. Our car will take you back to Ho Chi Minh city, where you will have.\nFree & Easy.\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"CU CHI TUNNEL & CAO DAI TEMPLE TOUR. (B/L/-)","description":"In the morning, our car and tour guide will come to your hotel and pick you up. You will take the bus about 2,5hours to Tay Ninh city, then you will visit the Cao Dai Temple where you will attend the midday ceremony’s extravaganza to witness the daily mass held by the Cao Dai  followers which is a fantastic experience.\nAfter lunch, proceed to Cu Chi tunnel to explore the amazing site where Viet Cong hid during the War. It is now a popular spot for both Vietnamese & foreign tourists - the network of over 250km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities that included numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nThere is plenty of evidence of the fierce battles that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea with cassava ( the guerrillas food in war time).\nOur car will take you back to Ho Chi Minh City. Free & Easy.\nOvernight in Ho Chi Minh City, arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"HO CHI MINH DEPARTURE. (B/-/-)","description":"Today is departure day. Enjoy some free time for last minute purchases or simply relax before your transfer to the airport for your onward flight . Then, home sweet home."}]},{"name":"Hanoi to Hoi An - 8 days","duration":8,"travelStyle":["In-depth Cultural","Group","Fully Guided","Holiday"],"oldPrice":0,"price":945,"summary":"Travel between two of Vietnam's most charming destinations from the fading colonial chic of Hanoi to the attractive riverside merchant town of Hoi An with a night spent cruising the jade waters of Halong Bay and time spent exploring the royal citadel of imperial Hue, all in just 8 days.","highlights":["Explore the incredibly beautiful Halong Bay","Enjoy the sights of Hanoi","Take a guided sightseeing tour of Hue","Walking tour of Hoi An","Discover Tra Que village"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/89438_471bc1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/89438_471bc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_fd5cdbd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_5cbb6598.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_9072e00b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_ab7124a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_a5a00e30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_e601fe07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_86f79d02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_fb06fcf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_75ae0ded.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_12631e62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_b2bc5588.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_6a877d77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_96851fde.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_3ba521ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_69b4a67b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_ffcbe12a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_af5989ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/89438_697d5922.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin Chao! Welcome to Hanoi, one of the region's most charming cities where French colonial elegance meets Asian spirit with attractive lakes, colourful pagodas and atmospheric streets. On arrival you will be met by our local representative and transferred to our joining hotel where the remainder of the day is at leisure for you to relax or head out and explore. For those able to arrive very early today or the day prior, why not get off the beaten track and explore Hanoi with us on our optional Back Streets of Hanoi add-on, which explores the quaint districts of Cho Buoi, Hoang Hoa Tham and Vinh Phuc, and also includes an exhilarating local experience - riding pillion, on taxi-motorbikes through a maze of tiny streets and along the shore of beautiful Ho Tay Lake. "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. After breakfast this morning we leave Hanoi and transfer to the jewel in Vietnam's scenic crown - the incredibly beautiful Halong Bay. Board a comfortable junk boat to explore the emerald waters of the bay, dotted with green islets, and enjoy lunch with a view onboard. This afternoon we visit Trinh Nu Cave, one of the finest caves in Halong Bay, covering an area of 2,000m² with a stunning array of stalactites and stalagmites. There's also the opportunity to go kayaking and enjoy a refreshing swim. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner. "},{"title":"Day 3: Caves & Hanoi cyclo ride","description":"Halong Bay - Hanoi - Hue. Early birds can enjoy a beautiful sunrise and test their Tai Chi skills on the sundeck or enjoy a traditional massage - the perfect way to start the day. Before heading back to port this morning we explore the beautiful Sung Sot cave (Surprise Grotto), which is 10,000m² and consists of two major chambers. These spectacular chambers are spacious enough to hold thousands of people. On arrival back into Hanoi mid-afternoon we’ll explore the maze of streets in the French Quarter by cyclo (rickshaw), taking in highlights such as the Opera house and Ly Thai To Park. We then swap our wheels for a leisurely walk through ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street, from silk tailors to traditional medicine shops. Later this evening there's a chance to freshen up before boarding the overnight train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available. "},{"title":"Day 4: Hue","description":"Arriving into imperial Hue this morning, we enjoy a guided sightseeing tour of the 19th-century capital. Visit the iconic Thien Mu Pagoda with its 21-metre-tall tower, and explore the walled fortress of the Imperial Purple Palace, ringed by a moat with elaborate arches and impressive ramparts, some of which lie in ruin. Later we travel into the countryside to visit the ancient mausoleum of Emperor Tu Duc, one of the wonderfully ornamental Royal Tombs of the Nguyen kings. This evening there is an optional sunset cruise on the Perfume River. Travelling by longboat, it's the perfect way to enjoy the city skyline."},{"title":"Day 5: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. Bidding farewell to Hue we take a scenic drive along the coast via the Hai Van Pass (Road of the Ocean Clouds) to Hoi An. We stop en route for a stroll along My Khe beach, nicknamed 'China Beach' by the Americans during the war. The beach is famous for being in Francis Ford Coppola’s movie ‘Apocalypse Now’. We arrive into the charming, old-world trading port of Hoi An later this afternoon. A short walking tour will introduce you to the highlights of this enchanting and historical town with highlights including the Chua Ong Pagoda, Chinese Assembly Hall, 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. During your stay in Hoi An, we offer a unique optional Hoi An Street Eats add-on, which explores the city’s most popular local haunts. Cruise the city the way the locals do, by vintage Vespa and enjoy lots of tasty Vietnamese Cuisine. Book early with your reservation consultant, as numbers are limited. "},{"title":"Day 6: Rural Life in Vietnam","description":"Today will be spent out in the countryside learning all about the rural way of life in Vietnam. We'll reach Tra Que village by bicycle, a leisurely ride on flat roads that take us through ride paddies and farm land. The option of a taxi is available locally for those not keen on bike riding (payable locally). Once at the village we'll get our hands dirty learning about age-old farming practices and putting our knowledge to use by tending the fields and gardens. Lunch is a home-cooked affair with everyone mucking in. Later this afternoon return back to Hoi An on your bikes."},{"title":"Day 7: Hoi An - at leisure","description":"Today is completely free for you to enjoy Hoi An as you wish. Lose yourself in the cobbled streets lined with boutique restaurants, hip cafes, delightful craft shops and some of Asia’s best bespoke tailors (whose services come at a nominal price). If you prefer some R&R, lounge by the hotel pool or head to the beach. Alternatively you can opt for an excursion to the UNESCO-listed My Son sanctuary or enjoy a day trip to the popular Ba Na Hills mountain resort, where you will ride the second longest cable car in the world and walk along the striking Golden Bridge (book and pay locally)."},{"title":"Day 8: Hoi An","description":"Saturday. Today marks the end of your time in Vietnam. A departure transfer will be provided to take you to Danang airport in time for your onward flight. "}]},{"name":"Hanoi and HaLong cruise to Ho Chi Minh 7 days","duration":7,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":706,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Learn about the history of Hanoi","See the Dinh King temple","Explore the Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/99988_ade57eb0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/99988_ade57eb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_9d49fe67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_94c03036.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_e780e995.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_2f7417f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_a7e8c466.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_c946d97e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_c109b75f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_21573498.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_fcc1c777.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_25f9da32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_9140cb80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_cbebc5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_d169169b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_5a6d85c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_12f70a3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_b20590ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_bbca18d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_4fa70e6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_41623c3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_548ffd3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_a45fcdd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_17a9521a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/99988_bcfc61a0.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1 HA NOI","description":"Meal not included\nMorning: The car pick you up from Noi Bai airport (in Ha Noi) take you get in the heart of the city, it takes 40 minutes to drive. You will be free to discover many ancient and beautiful places such as: Old Quarter, Hoan Kiem Lake, Dong Xuan Market….\nEvening: You also have chance to enjoy water puppet show and go wander to see its landscapes. You can try to go out by Cyclo, a traditional transports of Viet Nam. Overnight in Ha Noi."},{"title":"Day 2 TAM COC - NINH BINH","description":"Meal included Breakfast, Lunch\n8.00 am:  After having breakfast, we will pick you up at your hotel, departure for Hoa Lu - Tam Coc, you will have a chance to enjoy the nice seeing of the rural areas on the way.\n10.30: After arriving in Ninh Binh province, the guide will be responsible for taking you to visit Hoa Lu - the Ancient Royal capital of Viet Nam. In addition, we also visit Dinh King temple and Le King temple in the 10th century, getting knowledge about the heroic histories of this two Kings in Chinese Wars. Then, we continue to go to Tam Coc (10 km far from Hoa Lu). Our lunch will be served at local restaurant.\nAfter having lunch, you will get on bamboo boat which is rowed by the local people in Hoang Long River to visit Tam Coc (three caves) on the way. You pass through three caves that provide a brief respite from the excruciating summer sun. You will spend approximately two hours for going up and down the river and along the way, you also have seen local fisherfolk, village life along the river and, of course, the special limestone karst formations that bring fame for Tam Coc. It is a good idea for going biking. Besides, you will have an opportunity to visit real villages and appalling scenery by bicycle about one hour (from Restaurant).\n17.00:  We take the car come back Ha Noi hotel. Overnight in Ha Noi."},{"title":"Day 3 HA NOI - HA LONG","description":"Meal included Breakfast, Lunch, Dinner\n(your hotel – Tuan Chau Marina  - Halong bay - Lunch – Amazing Van Gia floating village – Sunset party – Soi Sim island – Dinner – Fishing)\n7:45 - 8:00 Am - Our guide will meet you at your hotel. The shuttle bus or private car pick up.\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n- You will have a chance to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n12 – 12.30 noon approx - Arriving Tuan Chau Marina. Welcome aboard the cruise. Meet the captain, crew and join us for welcome cocktail as we tell you about life onboard.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is prepared by our chef.\n- Join us for a relaxing lunch in the restaurant or on the outdoor dining area. Enjoy the stunning views of the Bay, its dramatic limestone islands as we sail through the calm waters.\nAfternoon - While we make our way to the amazing Van Gia fishing village, relax on the sundeck and watch the world go by or take an afternoon nap in your cabin. Middle afternoon arrive at Van Gia floating fishing village.\n- Drop anchor.\n- Our guide will give you some information and interesting facts about this fascinating village and its local community.\n- Disembark and you can choose which options when you visit the village by Kayak or local bamboo boat to visit the village. They will be your guides through their fishing village where you can meet the locals, see at first-hand what life is like living on the water, we are proud of our working partnership with, and support of this community. \n-    Our cruise will take you to the Soi Sim natural beach for swimming and snorkeling, you can enjoy our interesting games such as football, basketball. On the way cruising, you will enjoy with us the sunset party with fruits and wine as our complimentary\n- Back on board the cruise, we head towards the sleeping area. \nEarly evening - Take an opportunity to refresh and then join friends for a pre-dinner drink in the bar.\n- Dinner is served in the restaurant or outdoor dining area if the weather is permitted, which is a gastronomic delight. After dinner, unwind in the bar where there is a selection of books, magazines and board games or watch a movie on our plasma TV; join some of our team to go cuttle fishing at night. Accommodation and overnight on boat"},{"title":"Day 4 HA LONG - HA NOI - HO CHI MINH CITY","description":"Meal included Breakfast, Lunch\n (Tai Chi - Breakfast – Surprising Cave – Cooking Demonstration – Lunch – Your hotel and Farewell)\n06:30 am - For the early risers join us for a Tai Chi session on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands.\n- Breakfast, coffee, tea served.\nAfter breakfast, we sail through the waters and pass by a number of caves and we drop anchor at Surprising (Sung Sot) Cave.\n- Disembark and visit Surprise Cave located on Bo Hon Island. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites\n09:30 am We board the cruise again. Take time to refresh and relax before checking out. Bags can be left in the luggage store. You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n12 noon Return to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30/17:00. Free for dinner. \n06:00PM Car transfer to the airport\n08:00PM Flight Ha Noi – Ho Chi Minh. \n10:00PM Arrive to Ho Chi Minh, transfer by car to the center, check in hotel. Overnight in Ho Chi Minh."},{"title":"Day 5  CU CHI TUNNEL","description":"Meal included Breakfast\n8:30AM We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh city. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out!\n02:30PM The tour finish at our company. Overnight in Ho Chi Minh."},{"title":"Day 6 MEKONG DELTA","description":"Meal included Breakfast, Lunch\n\n08:00AM We depart from Ho Chi Minh City to My Tho City for one and half hours by bus.\nA smooth one and half hour bus ride passing the green rice fields, leads you to the beautiful rural MYTHO city. The morning trip continues on the motorized boat on the Tien River to the Qui (Tortoise islet). On the way, you will view the fishing port, stilt houses, boat-building workshops, the other Dragon, Phoenix and Unicorn Islet. The cruise will lead you through Bao Dinh canal to enter Ben Tre province, \"the country of coconut\", to see a typical agricultural model call \"Garden - Pond – Cage” then enjoy coconut candy mill and the relaxing honey tea. Then the amazing rowing boat trip on the small canal - fully covered by the shadow of the water coconut’s tree and cool breezes is something you cannot miss. Lunch will be served right in the heart of the orchard garden.\nAfternoon: After lunch, we will walk into the village, visit fruit garden, enjoy the tropical fruit while you are listening to the sound of \"Southern Vietnamese folk music\" performed by the islanders. Here we also can join the daily activities of the local people and enjoy the atmosphere of this beautiful natural countryside.\nYour expectations will be fulfilled by final boat trip back to My Tho on the Tan Thach natural canal. \n03:00PM Drive back Ho Chi Minh, stop at Vinh Trang pagoda . Finish tour at 05:00PM"},{"title":"Day 7 HO CHI MINH DEPARTURE","description":"Meal included Breakfast\nFree time in Ho Chi Minh until your flight, car pick you up at the hotel and transfer to the airport. See you again."}]},{"name":"Magical Vietnam - Hoa Lu/Hue /Hoi An","duration":11,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":1439,"price":777,"summary":"Offering all the wonders of Vietnam in one trip, this is the perfect snapshot for tourists of all ages. Travelling from North to South, from the tranquil Hanoi to the vibrant Ho Chi Minh City.You will have a chance to see the most magnificent limestone mountains and cruising  into the turquoise water in Halong Bay. Then step in the ancient citadel of Hue to understand about the glorious old time of Vietnam's once-capital.  As well as, live a local life and experience their daily routine by staying at their home stay, boating and fishing just like them. ​","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136950_fb33776f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136950_fb33776f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_bec05165.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_78fd4423.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_ae650ceb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_470a670d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_f3382b88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_b03d2215.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_cf349ea0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_abebe06c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_b0b80011.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_2ff9fe5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_a35a53f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_abb1bade.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_0a7fd847.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_b542688d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_b6ee6c27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_cc6a2645.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_df229ee7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_fc78d31b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136950_6d4ea8df.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet you at the airport and transfer you to the hotel. Check-in to the hotel and have a rest after the flight. \nIf you arrived early in the afternoon you could mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.\nOvernight in Hanoi."},{"title":"EXPLORE THE CHARMS OF VIETNAM'S CAPITAL - GROUP TOUR (B/L)","description":"The colonial capital city Hanoi is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago.\nAM: 7.45 – 8.15: Free pick up at your hotel. Then visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West lake (In the pagoda’s garden stands a Bồ Đề (Bodhi) tree, which is attached to a past story. In 1959, on one visit to Vietnam, Indian Prime Minister Razendia Prasat offered the Pagoda a bodhi tree as a gift. The plant was grafted from the holy bodhi tree where Sakyamuni sat in zen (meditation) position and achieved enlightenment in India 25 centuries ago) \nLunch at local restaurant.\nPM: After lunch proceed to visit the Ethnology Museum (apply on Sun, Tue, Thu & Sat), the Literature Temple, see Vietnam’s first university, constructed in 1070 - it’s gardens and well-preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters and the beauty of Ngoc Son temple. At the end, journey through Hanoi’s Old Quarter, where you’ll then have a chance for some shopping and exploration. \nBack to your hotel for overnight stay\n(Meals: breakfast, lunch)"},{"title":"ESCAPE TO THE SPECTACULAR NATURAL BEAUTY - NINH BINH - GROUP TOUR (B/L)","description":"AM : 7:45 - 8:15. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12:30 pm.\nPM : After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). Dive back to Hanoi and drop off at your hotel around at 18:00 pm.\n(Meals: breakfast, lunch)"},{"title":"DISCOVER THE NATURAL WONDER OF THE WORLD - HALONG BAY (B/L/D) SHARING CRUISE","description":"In the morning, check-out from hotel and get pick-up by the Cruise. \nThe pick-up time will start from 7.30 am to 8 am. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise\t\nNote:  In case of bad weather (the boat is not allowed to push off or not allowed to overnight in the sea), the Ha Long bay tour could be cancelled without notice. We will consider other replacement tour or refund based on the specific circumstances.\n(Meals: breakfast, lunch, dinner)"},{"title":"SUNRISE FROM THE CRUISE'S DECK (B/L) - FLY TO HOI AN VIA DA NANG","description":"Rise early for a  Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Cave of Surprises, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and transfer to Noi Bai Airport for your evening flight to Da Nang. Upon arrival, you will meet our driver who will transfer you to Hoi An town. After hotel check in have some free time. \nOvernight in Hoi An \n(Meals: breakfast, lunch)"},{"title":"RIDING BASKET BOAT AND FISHING TOUR THROUGH PALM FOREST ( B/L)","description":"Would you like to go fishing with the local fisherman ? Why don't you have a fun experience with the funny basket boat. You shouldn't have any hesitance because the day will put a broaden smile in your face. It is very interesting to fish here on the river with the local fisherman as you catch your fish and we cook for you. \nOn the Fishermen & the Waterways of a Past War Tour you will enjoy a wide range of experiences - from learning traditional fishing techniques to paddling the strange and unique Vietnamese bamboo basket boats while exploring the now tranquil coconut-palm flanked waterways of a past war. On this tour we provide an authentic social and cultural insight into the local Vietnamese way of life. As well you will take part in some hands-on activities that are fun, safe and interesting to people all of ages. "},{"title":"VISITING THE IMPERIAL PURPLE CITY - HUE (B) - BY SHARING BUS","description":"Today you will be transferred by public bus to Hue, Vietnam’s former capital, which sits on the Perfume River. On arrival in Hue you will transfer to your hotel. \nOvernight stay in Hue.\n(Meals: breakfast)"},{"title":"TRAVEL FROM HUE TO HO CHI MINH CITY (B)","description":"Have breakfast at hotel and have some free time untill you will be transferred to the airport for your next flight to Ho Chi Minh city – the gem of Indochina. You have your own leisure time there.\nOvernight in Ho Chi Minh city\n(Meals: breakfast)"},{"title":"CRUISING THE MIGHTY MEKONG DELTA - HOME STAY (B/L/D)","description":"You will be transfer from Ho Chi Minh City downtown to Cai Be district in the morning. Arriving in Cai Be, you will be welcomed by the hospitable smile of the host and invited some fresh fruits before embarking on boat to visit Cai Be Floating Market and traditional handicraft villages.\nYou’ll have an opportunity to talk to the sellers on their boats. The boat will then lead you to the home-stay on Tan Phong Island for checking-in and having lunch.\nIn the afternoon, local host will lead you to his orchards where you can learn how to take care for the garden and how to pluck the ripen fruits as the host does every day. In the late afternoon, you will visit the vegetable garden and gather the vegetables for your dinner.\nYou will prepare your own dinner with the help of local host.\nStay overnight at the home-stay\n(Meals: breakfast, lunch, dinner)"},{"title":"EXPERIENCE VIETNAMESE LOCAL LIFESTYLE - MEKONG DELTA (B/L)","description":"Wake up in the early morning to enjoy the fresh air of Mekong region and then take a stroll around the home-stay, your 2nd day of tour in Mekong will start.\nCome back to the home-stay where the delicious breakfast is waiting for you. After breakfast time, You will visit kindergarten if it is school day. Stop at a local farmer’s house to learn how to make Jackfruit leaves cake and then cycle to Bonsai garden and talk to local farmers to understand how they take care for their gardens, then try pluck the fruits and taste them.\nAfterwards, we will return to the home-stay for check-out.\nAt 11:00, the small boat will transfer you back to the Cai Be tourist boat wharf and you will drive to Ho Chi Minh City.\nThe End.\n(Meals: breakfast, lunch)"},{"title":"BIGGEST FAREWELL AND WARMEST THANK YOU - HO CHI MINH CITY DEPARTURE (B)","description":"Depending on your flight time, you will have leisure time which is arranged by yourself for the last waking, cycling around, shopping souvenirs or handicraft products,… or having coffee as a local for the last time before we take you to the airport for your flight. \nEnd of the service at the airport\nGoodbye and safe travel \n(Meals: breakfast)"}]},{"name":"Vietnam Highlights","duration":9,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":666,"summary":"Traveling from North to South is the best direction to research the traditional culture and history of Vietnam before you reach its modern daily life. Excellent to visit World Heritages of Vietnam and to extend to Cambodia at the end by riverway.","highlights":["Stroll around the town crammed with bustling silk and fish markets in Hoi An","Experience the underground life of Vietnamese soldiers in the Cu Chi Tunnels","Wrap up in Hanoi and explore the fascinating Old Quarter and specialty shops"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101732_762e1323.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_c478f1ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5f67c353.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_93d5f612.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_f2b4f64a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_83087393.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e1b9cd7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_dbe593af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_daab6fb1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_741bc409.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_603525a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_028440f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_6ef74016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_cc4bccbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5a082f65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_66cecf43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e58fab8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_9025ecea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_8675f31b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_12334c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_88ae41b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_1374354e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_e54f53eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101732_5938d91a.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL – CITY TOUR (-/-/D)","description":"Welcome to Hanoi – Vietnam!\nUpon arrival flight, the local driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to the center of Hanoi then check-in at hotel. \nOur tour guide will pick you at your hotel in the Old Quarter and then we get a Cyclo to Hoan Kiem Lake, one of the major scenic spots in the city and serves as a focal point for its public life to visit Ngoc Son temple and The Huc Bridge. And then we will stop at Hanoi Opera House, erected by the French colonial administration between 1901 and 1911. \nAfter that, on the way to Water puppet show, we will see Sofitel Legend Metropole Hanoi Hotel - A Grand Dame of Southeast Asia that welcomes guests to experience her colonial grandeur and timeless elegance. Located steps from the Opera House in Hanoï’s French Quarter, this legendary property bring guests into intimate contact with the opulence of another era. A stage art invented by the Vietnamese peasants hundred years ago, with nearly 20 stories of Vietnam traditions and daily scenes will be the last activity. Finally we will take a walk on the streets of the old quarter and enjoy the Vietnamese traditional food: Beef noodles. \nNight activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with life music, the young people of Hanoi and also foreign tourists. Hundreds of bars and pubs in the Old Quarter are also at your disposal. Or just simple spend your time at shopping malls or various boutique Shops.\nPlease note: Standard check in time is 14:00\n"},{"title":"DAY 2: HANOI – TAM COC – HOA LU - HANOI (B/L/-) - Group tour","description":"A 90km drive south of Hanoi will lead you to Ninh Binh, the site of the one capital city of ancient Vietnam before Hanoi took its leading role in 11th century. The area is featured by lots of well-known sceneries, which include Tam Coc Caves and Hoa Lu ancient capital with the old temples dedicated to King Dinh & King Le reigned in 10th century. The visit in Ninh Binh starts by a boat trip in Tam Coc where spectacular limestone karsts jut out from the green paddy fields reminding about Guilin (China) and Halong Bay of Vietnam, which gives this scenery the name “Halong-bay-on-land”. Back to your hotel in Hanoi later on. Overnight in Hanoi. "},{"title":"DAY 3: HANOI - HALONG/ LAN HA BAY - OVERNIGHT ON BOARD (B/L/D) - Group tour","description":"From Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending-dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach islets to enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat near Titov Beach. \nPlease note! The program may be little varied upon the cruise you choose. \n"},{"title":"DAY 4: HALONG/ LAN HA BAY – HANOI – DANANG – HOI AN (B/L/-) - Group tour","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquil landscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that have been named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharf around 11.00. \nTake shuttle bus back to Hanoi. Our driver shall wait for you en route to continue the transfer to Noi Bai International Airport for a short flight to Danang. \nWelcome at the airport then transfer along the coast to reach Hoi An Ancient Town to check in.\nOvernight in Hoi An.\n"},{"title":"DAY 5: HOI AN – HALF DAY CITY (B/-/-) - Group tour","description":"After breakfast at hotel, you take interesting walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, enjoy the attractiveness of ancient houses Tan Ky & Phung Hung, as well as Japanese Bridge. Later we can stop at shrines or stroll into the market located by Thu Bon river, where you may find the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. Rest of day will be free on your own to discover the town or cycling (Bike rental on guest’s account) along Thu Bon to Cua Dai Beach. Overnight in Hoi An."},{"title":"DAY 6: HOI AN – HALF DAY SAIGON TOUR (B/-/-) - Group tour","description":"Relax till transfer to Da Nang Airport to take the midday flight to Saigon. You will be welcomed at the Tan Son Nhat airport and transfer to the hotel to check-in. Then we will join a half tour to have an overview of Saigon - the most dynamic city of Vietnam. Depart from your hotel to the Reunification Palace; this beautifully preserved palace was the residence of the President of the Republic of Vietnam. On April 30th 1975 the American War officially came to an end here. Enjoy a visiting the War Remnants Museum where you can see countless artifacts, photographs and pictures documenting the second Indochina war. Afterward, we visit The Notre Dame Cathedral, which was built in 1880, and the Old Post Office, which was built sometime between 1886 and 1891. It is one of the best examples of classical French colonial architecture. Our last stop would be at a local Market where you can practice your bargaining skills while shopping for souvenirs. Discover local life and culture. You’ll find some of the friendliest, liveliest, most convivial people in the city in here.  Overnight in Saigon."},{"title":"DAY 7: SAIGON – MEKONG DELTA – SAIGON (B/L/-) - Group tour","description":"After breakfast at hotel, picked by at hotel and drive heading to My Tho the homeland of coconut and family factories with local products like coconut candy, rice paper… Upon arrival, embark on the boat cruising on the mighty Mekong River viewing the life to the local people live along the banks. We stop at one of 4 islands in the area for sightseeing. Enjoy the fresh tropical fruits served in the heart of the garden accompanied by traditional southern Vietnamese folk music at the plantation. After that you will embark on the small boats rowed the local people thru the small cannels with water coconut tree to visit the local factories. There you will taste the honey tea and see the local people produce the coconut candy milk and of course you also can try it or stroll in the garden where the locals feed honeybee. We continue getting on the big boat to visit the vast area. Enjoy your lunch at a local restaurant nearby Mekong River. Afternoon, drive back to Saigon with stop to visit Vinh Trang pagoda, a famous pagoda in the area that its architecture is a mix of Chinese, Cambodian, and French culture. Overnight in Saigon.\n"},{"title":"DAY 8: SAIGON – CU CHI TUNNELS – SAIGON (B/-/-) - Group tour","description":"Morning visit Cu Chi Tunnels, one of the few remaining monuments to the Vietnam War. Beneath the ground lie 200 km of tunnels, dug by hand and inhabited by the forces of the Vietnamese guerillas during the conflict. At its peak, prior to the Tet Offensive in 1968, the tunnel complex was base to almost 10,000 troops. To this day, it remains one of the most impressive examples of how fierce the war used to be.  You even can try to crawl some dozens of m on the tunnel underground to have the real experience. Return to Saigon.\nAfternoon is at your own free time for shopping in the downtown where you can choose many lovely stuff at the very reasonable price. A few places to be mentioned to visit during your shopping is Ben Thanh Market – the center and typical market of Saigon; Saigon Square where is a few minutes walking from Ben Thanh Market; An Dong Plaza and its nearby Market; or Diamond Plaza and Thuong Xa Tax if you are seeking the high qualified and brand name goods.  Overnight in Saigon."},{"title":"DAY 9: SAIGON DEPARTURE (B/-/-)","description":"Breakfast at hotel. If your flight is in the  afternoon, you will have a half day more for the sightseeing and shopping before the departure till check out time and transfer to the airport for the departure flight back to your sweet home.  \nEnd of services!\nPlease note: Standard check out time is around 12.00.\n"}]},{"name":"Hanoi - Maya Cruises Halong Bay - Bakhan Village Resort 6 Days","duration":6,"travelStyle":["Boat","Family","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":399,"summary":"Discover Halong Bay - the UNESCO World Heritage Site.\nExplore Hanoi Old Quarter.\nFREE kayaking activity to explore tunnel caves.\nSpend overnight on boat with very specious cabin en-suite.\nStay at the most boutique hotel inside Hanoi Old Quarter.\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nAirport pick up & depart by private car.\nAll taxes and services charges included.\nNo hidden cost.\nBest services guaranteed.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95676_3eeddb6c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95676_3eeddb6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_5323e6df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_73478206.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_2ff36b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_03786db9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_d12ed57b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_59e77517.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_4e6b5ab4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_11dc9b5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_cc69bedc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_2457434b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_2206e602.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_d2aa1195.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_f50e80ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_b88fb6be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_0afc3065.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_12ff8980.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_8bfd55d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_8696f763.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_afae9753.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_66aae181.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_eb83afc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_d782b1ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95676_197071c4.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi Airport. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check in Hanoi hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Halong Bay Cruising - Lan Ha Bay (B, L, D)","description":"9h20 - 09h40 You will be picked up from Hanoi Old Quarter to take the highway to Got Port, Haiphong where we arrive at around 11h50\n12h00: Transfer by tender to the MAYA CRUISE. On the way to the main boat, you will have a chance to see Cai Trap canal. \n12h15: We welcome our guests onboard the MAYA CRUISE and then check in, enjoy Welcome Drink, receive cruise briefing, safety instructions and check in. Start cruising and explore Lan Ha Bay & Ha Long Bay.\n12h40: MAYA CRUISE proceeds to Da Chong islet, where you can see a lighthouse built by the French over 100 years ago. Have lunch while passing via the islets. These amazing limestone karst formations rise up out of the sea in an impressive manner. \n15h00: We progress to Tra Bau area of Lan Ha Bay- a separate part of Halong Bay. This is a quiet tourist paradise in Vietnam. You can try at kayaking or simply just enjoy a swim. This is a great experience, immersed in the crystal clear waters of the bay and enjoy free cocktail on Floating Bar.\n17h30: Returning MAYA CRUISE, you can watch the magnificent sunset over the Gulf of Tonkin. Onboard you may join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. Enjoy sun set party and Happy Hour deal\n19h30: Dinner is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting \n21h30: Enjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board.\nMaya Cruises 4* or similar"},{"title":"Day 3: Lan Ha Bay and back to Hanoi (B, L)","description":"06h00: Tai Chi session on the sundeck; after which we serve light breakfast. \nUpon completing breakfast continue our journey and head out in canoes to explore the bay in the area where the Toi Sang cave is situated. \n9h30: Visit then return MAYA CRUISE for check-out procedures \n10h00: Whilst cruising back you can enjoy a delightful brunch \n11h35: We return to the quay side in the south of the bay, where our visitors disembark. \n12h10: We bid farewell at Got port, this is the end of the program. \n14h30: Back to your drop-off point in Hanoi. Check in hotel and free for leisure.\nStay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before transferring to Airport by Private Car for your return flight home. Finish your unforgettable Hanoi & Halong Bay Trip with Legend Travel Group. Good bye & see you again!"}]},{"name":"Vietnam Foodie's Paradise ( Hanoi/Halong Bay/ Hoi An /Mekong Delta)","duration":10,"travelStyle":["Custom","Private","Fully Guided","Holiday"],"oldPrice":1299,"price":701,"summary":"Vietnam is a stunningly beautiful and diverse country with lovely people and delectable cuisine. Taste your way through the most amazing dishes, start from playful Ho Chi Minh city through the star of the central - Hoi An to elegant Hanoi capital, each region has unique cuisine that define rich diversity of culture. You will be showed how real Vietnamese people live, work and eat. It's great fun and the perfect way to discover some of the lesser known that local people love to eat. Let's fill your tummy with delicious and authentic Vietnamese food in this journey.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137645_7fffa330.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137645_7fffa330.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_02afedec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_f38c4a3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_e18db1ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_f58b154d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_71fc3448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_ddd63d07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_51b7285b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_596aa9f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_186c26cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_180212e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_1d9d6adc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_5d86709b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_9ceb21e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_5fa1720e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_32715a2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_fdb3076b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_f5cc0435.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_5b3d25c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_cea09091.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137645_64ef4935.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"WELCOME TO VIET NAM - HO CHI MINH ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  \n"},{"title":"THE SOUTHERN FOOD TASTE","description":"9:00 AM - we start the tour at Nguyen Thien Thuat backstreet – The Lively Saigon. You will pass through one of the typical streets of the city with constructions dating back to the 1960’s. Along the street are many Vietnamese guitar makers’ stores. Some of them are really of high qualities. There are also many interesting eateries. Mass residential apartment buildings are on the back street. Walking around here gives you an idea about how lively Saigon is. Street Photography is highly recommended. The walk starts from Nguyen Thien Thuat street and ends at Ban Co market. You are invited to try Vietnamese beautiful “chè” (desserts made of beans and sticky rice and coconut milk…).  \n10:00 AM - Keep on to District 10 and 5 to stroll through more typical residential apartment buildings. Again, you will witness Saigon unique lifestyles on the streets with shops, street food stands and rickshaws passing by.\n11:30 AM - Walk along Hai Thuong Lang Ong & Trieu Quang Phuc streets - the traditional medicine streets in China Town. This is an area concentrated with traditional clinics and medicine herb stores. Walking along the streets, you can smell the herbs and watch the shop owners do their business. Visit Thien Hau Temple (a temple where Chinese people worship Heavenly Queen - an important god in their culture.) \n12:00 noon - Go to a local restaurant for lunch then come back to hotel around 1:00 pm."},{"title":"CRUISING ON MEKONG DELTA - LUNCH ON CRUISE","description":"(start 7.20am  – return around 17.30 )\n7:20am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh\n( Meals: breakfast, luch)"},{"title":"TRAVEL FROM HO CHI MINH TO HOI AN (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and ready for the next flight to Hoi An\n( Meals: breakfast)"},{"title":"IMMERSE YOURSELF IN HOI AN CUISINE","description":"Our Hoi An food tour starts around sunset, and will walk you through local cafes, food stalls, markets, and restaurants, giving you a filling food adventure for the memory books.\n\nFirst up – a local bakery that has been making the tastiest banh mi in town for over 20 years. They use the freshest local ingredients and are famous for their banh mi, a scrumptious sandwich that will fire up your taste buds and get them ready for the flavours ahead!\n\nFrom one local fave to another, next we’ll join locals at a small eatery, taking a seat on the ubiquitous small plastic chairs and sampling tasty BBQ pork rolled with rice paper and fresh herbs. Served with typical soya dipping sauce, this dish is one of the highlights of the local food scene and an absolute must-devour.\n\nOur food tour of Hoi An continues into the atmospheric heart of the city as we head straight for the central market. What awaits us there are hundreds of street hawkers and food stalls selling a staggering array of local produce, including fresh noodles, sweet jelly, seasonal fruits, and live seafood. Your knowledgeable local guide will walk you through the colourful array of ingredients, filling you in on the most popular dishes in Hoi An and the significance of these foods to the traditional culture of central Vietnam.\n"},{"title":"GREETINGS FROM THE CAPITAL","description":"Breakfast at the hotel. Then, taking the flight to Hanoi. Check in your hotel and free at your leisure time to get your energy back\n( Meals: breakfast )\n"},{"title":"A TASTE OF STREET FOOD IN HANOI","description":"17h45 : Pick up at your hotel\n18h00 : Introduce the itinerary of tour and drive around 36 old streets in the old quarter to enjoy different kind of street foods \n19h30 Crssing over Ho Chi Minh Complex for sightseeing with overstop by the side of west lake to enjoy street food +drink \n20h15 Riding pass Long Bien Bridge for sightseeing and taking pictures. Continue riding around old quarter of Hanoi with overstop at Opera house, Metropole Legend Hotel, Hoan Kiem Lake, Big Church \n21h20 Drive to local Coffee to enjoy local life & drink "},{"title":"DISCOVER THE NATURAL WONDERS OF THE WORLD (B/L)","description":" In the morning, check-out from hotel and get pick-up by the Cruise. Take a route most scenic to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise\n( Meals: breakfast, luch, dinner)"},{"title":"HA LONG BAY FISHING VILLAGE AND BACK TO HANOI","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Free at your leisure time. Overnight in Hanoi.\n( Meals: breakfast, luch)"},{"title":"BIGGEST FAREWELL AND WARMEST THANK YOU - HA NOI DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"Vietnam Express 10 Days (Ho Chi Minh- Da Nang- Hoi An- Hue- Ha Noi- Ha Long)","duration":10,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":550,"summary":"\n\tStart in Ho Chi Minh and end in Hanoi ! With the discovery tour Vietnam Express, you have a 10 day tour package taking you from Ho Chi Minh to Ho Chi Minh City and 4 other destinations in Vietnam. Vietnam Express 10 days is a small group tour that includes accommodation in a hotel as well as an expert guide, meals, transport.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141130_896d59d1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141130_896d59d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_0f7df16b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_88c2e56d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_1cc575e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_d00b7b77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_b3a391b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_b7f8adc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_f15da4b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_043b098a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_28b1f876.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_9bdf2d6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_f17e2c83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_4d8fc902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_e7bec8d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_e7f72cee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_0238c9d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_9b8c1257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_ac5a3e24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_3df61a6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_d06c8ba8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_b3735809.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_cf5100f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_0771f197.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141130_642f68e4.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Sai Gon (No Meal)","description":"Arrival Ho Chi Minh city Welcome to Saigon! \nYou will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture.  \nOvernight in Saigon. \n"},{"title":"Day 2: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong.\nOn arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nEnjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\nMeet at the bus and return to Ho Chi Minh City. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.\nFree time in the evening.\nOvernight in Ho Chi Minh.\n"},{"title":"Day 3: Ho Chi Minh city- flight to Da Nang- drive to Hoi An (meals incl: B/ L)","description":"In the morning, visit Ho Chi Minh city:\nGet picked up and head towards Reunification Palace (Independence Palace). This palace is referred to as the symbol of Vietnam’s Independence as a North Vietnamese army tank crashed through its gate to take control of the whole south in 1975. Nowadays, this tank becomes the palace’s priceless property.Leave for other exciting historical spots, consisting of Notre Dame Cathedral and Central Post Office. Both of them were built in the past when Vietnam became a French colony.\nPay a visit to the War Remnants Museum where diverse exhibits on the Vietnam and Indochina Wars are displayed where you will learn more about the military history of Vietnam which will make you think about war crimes and the Vietnamese who must suffer the terrible torture during the time of war.\nAfter having lunch, the driver drop off at hotel.\nYou free time until departure time for your flight to Da Nang. Arrive Da Nang, drive to Hoi An.\nOvernight in Hoi An\n"},{"title":"Day 4: Hoi An – My Son holyland (Meals incl: B, soft L)","description":"My Son Heritage Site is located in a narrow valley, surrounded by springs, mountains and\ngreen, dense jungle. It consists of several temple – towers constructed between 7th and 13th\ncentury AD. After centuries of wars and numerous natural changes there are still about 70\nmonuments remaining, representing six styles of ancient Champa art. It contains evidence of\ncultural interactions between Champa Kingdom and other South East Asian civilisations, such\nas India and China.\n\n8h00-8h30: Pick up at your hotel ( in Hoi An ancient town)\n Leaving Hoi An for My Son Holy Land.\n Spend 2 hours to enjoy and discover the beauty of Acient buidings at of the Champa\nKingdom with our tour guide.\n Leaving My Son and taking a boat trip on Thu Bon river. Enjoying the beatiful sight\nseeing of Thu Bon River and feeling the fresh air .\n You will have soft lunch on the boat.\n14:00 - 14:30:\n The boat trip will finish at Bach Dang Boat station . Finish your trip."},{"title":"Day 5: Hoi An to Hue (meals B/ L)","description":"07:00 – 07:30: Our car and tour guide will pick you from your hotel reception in Hoi An.\nBegin your journey to Hue by crossing one of the best coastal roads in the world, the Hai Van Pass.\nYou will have a 30 minute stop at the peak and 5minutes to taking photo at Lang Co Beach\n Visit the Khai Dinh Tomb.\n Enjoy a delicious lunch at a Local Specialty Restaurant serving Hue style dishes.\n Continue to Hue’s main attraction, the Imperial Citadel.\n Explore Thien Mu Pagoda, Hue’s largest pagoda.\n Cruise along the Perfume River by Dragon boat.\nOvernight in Hue"},{"title":"Day 6: Hue- flight to Hanoi (meals B)","description":"Breakfast at your hotel and free time until departure time for your flight to Hanoi.\nArrive Hanoi, check in hotel.\nSee Water Puppet Show in the afternoon.\nOvernight in Hanoi.\n"},{"title":"Day 7: Ha Noi- Ha Long bay, overnight on cruise (meals incl: B/ L/ D)","description":"7.45-8.15:  Pick-up at the hotel. (Note: this time applied for those who book our shuttle bus service)\n10.00:  Having short break at stopover in Hai Duong Province.\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15:  Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner Island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30 PM\n•\tDo kayaking through the magnificent landscape with Limestone Mountains in Luon Cave, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\n•\tBack to Lavender Cruises and join sunset party\n•\tPass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n•\tJoin our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19.30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\n•\tJoin squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke….\n•\tOr Laze yourself with our happy-hour drinks at the bar.\n•\tOvernight on  Cruises\n"},{"title":"Day 8: Ha Long Bay- Ha Noi (meals incl: B/L)","description":"vernigjyO06.15: Morning exercises on the Sun-deck.\n07.15: Have breakfast with Coffee, tea and Bakeries on board.\n08.00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09.30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10.15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12.00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16.30 – 17.00 : Arrive in Hanoi. End of the trip!\nOvernight in Hanoi"},{"title":"Day 9: Ha Noi - Hoa Lu- Tam Coc boat trip (meals incl: B/ L)","description":"07h30 – 8h00 : Get picked up by our friendly guide then depart for NinhBinh province\n09h15 : Have a short break for 15 – 20 mins to relax\n10h30 : Visit Hoa Lư ancient capital of Vietnam between 968 and 1010. You have a chance to learn about Vietnamese history in the feudal system under Dinh, Le and Ly Dynasty\n11h45 : Have buffet lunch in the restaurant with a lot of local foods goat meat, fried rice….\nVegetarian foods is always available in the buffet lunch\n13h00 : Visit Tam Coc  by 1.5 hour bamboo boat.  During the boat trip, you will be surprised by the charming beauty  here with paddy field, river, water, cloud,sky and stunning cave system. All make a masterpiece which Vietnamese people called “ Halong Bay on land”\n14h30 : Continue the tour with  45 mins - cycling around the village to discover the life of local people.\n15h30 – 16h00 : Get on the bus to return to Hanoi\n18h30 : Get dropped off at Hotel  in Hanoi.\nOvernight in Hanoi"},{"title":"Day 10: Ha Noi departure (meals incl: B)","description":"Have a breakfast at your hotel.\nFree time and easy until departure time, the driver takes you to the airport for your flight.\nEnd of services!\n"}]}]