[{"name":"5 day / 4 night Hanoi - Mu Cang Chai Package tour","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":527,"summary":"Famous for its impressive landscapes of unique rice terraces, Mu Cang Chai has become a chosen destination among adventure & photograph lovers.Carefully designed with off-beaten-path trekking routes, this tour  promises  you a journey of life-time exploration of Mu Cang Chai's sceneries & its unique local cultures.Let's come & experience with us !!!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153955_9e23b7c8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153955_9e23b7c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_4c9b441d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_2a5616f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_3363f90a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_1a16ec19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_52b6754b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_2a1032d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_0da965e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_6ddf1de1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153955_1130da16.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and at leisure in the rest of the day. Note*: The hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied. Please be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you.\n  Meals: N/A  Accommodation: Hotel in Hanoi"},{"title":"Day 2 : Hanoi transfer to Nghia Lo town.Homestay in Nghia Lo town (L,D)","description":"You get picked at the hotel at 8h00 a.m by a private tour guide and driver.Getting out of Hanoi capital, we follow the national road 32 to Yen Bai city, then Nghia Lo town.The journey offers you scenic sceneries of rural villages, valleys & mountains  through the car windows. Arrive at Nghia Lo around 12h30, check in the homestay and have a lunch with a local family.\nIn the afternoon, we will cylce to visit surrounding local villages to discover the daily life of local ethnics living the region or Suoi Giang Eco-Park - a part of Hoang Lien national park, where you can find gardens of aged-old green tea trees and learn how the best green tea of Vietnam is made.\nLunch,Dinner & overnight at the homestay"},{"title":"Day 3: Nghia Lo town-Mu Cang Chai trekking tour to La Pan Tan village.Homestaying in Mu Cang Chai","description":"fter breakfast, we will embark a very scenic  transfer passing Tu Le town, imposing Khau Pha pass to approach Mu Cang Chai – the paradise of  the most beautiful rice terraces in the world.\nAfter a lunch in a local restaurant, we will do a wonderful trek to view the majestic lanscapes of rice terraces, local villages of Black H’mong & mountains in La Pan Tan commune.This 10km trek  is up & down along the community’s paths to view daily life of local tribes and to interact with friendly people; then along buffalo trails to captivate the most impressive terraced rice fields in La Pan Tan commune. Our driver picks us at Ba Nha bridge - the end of this  trekking route, and transfer to Thai village in Kim Noi commune for  having dinner and homestaying with a local family. Meals : Breakfast,Lunch,Dinner & overnight at the homestay"},{"title":"Day 4: Mu Cang Chai trekking tour to Cu Che Nha & Lim Mong villages.Overnight in Tu Le town","description":"After the breakfast, we say goodbye with the local family and continue with a wonderful trek  of 10km to mountain slopes along dirt trails where we can captivate rice stepped fields, Mu Cang Chai town and the daily life of villagers in Che Cu Nha communes.You get picked up en route & drive to Tu Le town for lunch.\nIn the afternoon, we do a short trek of 6 km  down the valley to visit Lim Mong village of H’mong ethnics, get insight of their daily life & cultures. Meals : Breakfast,Lunch,Dinner & overnight in Tu Le Town\n"},{"title":"Day 5: Tu Le shopping local products, then back to Hanoi","description":"After breakfast, free at leisure for shopping local products, then take our private car back to Hanoi. Finish Mu Cang Chai tour 4 days at the doorstep of your hotel in Hanoi.Meals : Breakfast,Lunch. Accommodation : N/A\n"}]},{"name":"Hanoi - Pelican Cruises Halong Bay 5Days/4Nights","duration":5,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":450,"summary":"\n\t01 night Luxury Cabin on Pelican Cruises\n\n\tFree kayaking to explore tunnel caves\n\n\t03 nights Boutique Hotel inside Old Quarter\n\n\tUnique Water Puppet Show & Cyclo\n\n\tAll transfer round trip included\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100259_07b4cab3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100259_07b4cab3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_56d3b386.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_de801c5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_cdaa4815.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_8a2cecef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_a58e974e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_a511280f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_f09bae82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_855778b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_770cb36c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_f72d80a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_4176e934.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_bc3964ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_696b85a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_a256bc08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_0df115b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_d50c342e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_8e41950e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5b5c302a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5dfc80be6e39d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5dfc80be7fce4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5dfc80be87e84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5dfc80be8f3fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100259_5dfc80be969dd.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Hotel which is in the perfect location to explore Hanoi Old Town at your leisure."},{"title":"Hanoi - Pelican Cruises (B, L, D)","description":"7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter\nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00 pm: Arrive at Tuan Chau island - Take break and welcome drink at Pelican Halong Cruise Lounge\n12:30 pm: Transfer to Pelican Halong Cruise\n12:45 pm: Welcome drink - receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature.\n1:00 pm: Enjoy buffet lunch with Vietnamese dishes served while cruising through the bay, passing the most beautiful and quiet areas, such as Incense Burner, Dog Stone Islet, Fighting Cock, Soi Sim beach, Coconut Three Island\n2:30 pm: Visiting Luon cave, the perfect combination of lime-stone mountains and jade-green sea by bamboo boat with local people. Enjoy quiet space and pure air, you will feel relaxed truly. If you are lucky, you will see monkeys on islands\n3:30 pm: Visiting the beautiful Ti Top beach for swimming (if the weather permits), Ti Top Beach is especially famous for its fresh atmosphere, clean water, and smooth white sand that create a great ambiance for tourists to relax or passengers can take steps to reach on the top of Ti Top beach to have a whole panorama view of Halong Bay.\n5:00 pm: Back to the boat and free time while sailing to Luon Bo area, and anchor overnight.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n6:00 pm: Attend the Cooking class on sundeck - How to make Vietnamese spring rolls - traditional Vietnamese food. Then enjoy Happy Hour (Buy one drink-get one free). It is time for chit chat and relaxing. Watch the magnificent sunset over Halong Bay.\n7:15 pm: Dinner - Deluxe Vietnamese BBQ Set Menu Dinner\n9:30 pm: Evening activities include: Leisure time to enjoy a chat around the bar, watching movies and many sort of Vietnam cultural films, relaxing and spend a romantic night on Pelican Halong Cruise’s music, playing cards, chess are available, reading magazines in room and dining room. You may also try your luck at squid fishing & fishing from the boat.\n11: 00 pm: End of Program for Day One."},{"title":"Pelican Cruises - Hanoi (B, L)","description":"6:00 am: The day starts early onboard with Tai Chi session on the sundeck. Tai chi also called Tai chi chuan, combines deep breathing and relaxation with slow and gentle movements.\n7:00 am: Coffee, tea and pastries for breakfast are served in the dining room with morning view of bay’s landscape.\n8:00 am: Transfer by tender to Sung Sot Cave. Walk up about 100 steps to the cave entrance. It takes approximately 45 minutes for cave visiting. Visit Sung Sot Cave, one of the most biggest cave in Halong bay with beautiful stalactites and stalagmites. Return to the boat by tender. Proper shoes are highly recommended.\n9:00 am: Back to Pelican Halong Cruise. Check out and settle your bill at reception.\n10:00 am: Have a buffet brunch while cruising back to the Tuan Chau Wharf. Relaxing on the sundeck or in the dining room enjoying the bay scenery while approaching the wharf\n11:30 am: Disembark to Tuan Chau Wharf. Say goodbye to the crew.\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: Arrive Hanoi! Check in Hotel. Overnight in Hanoi."},{"title":"Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam).\nStay overnight at Hotel."},{"title":"Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Hill Tribes of Sapa 7 Day Private Tour","duration":7,"travelStyle":["Adventure","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":880,"summary":"See the sights of Hanoi and take a day trip to the Red River Delta before heading north to the picturesque highland town of Sapa where you’ll trek through scenic valleys, encounter the Red Dao and Black Hmong ethnic hill tribes and cruise the Chay Rive","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150888_697cec34.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150888_697cec34.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_28a62afb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_bb8840b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_9fc124f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_34e8892a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_d89a2d8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_57158a39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_f12b85e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_902bb524.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_89a7b145.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_867dff11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_f43a6be7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_1ffb8a4e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_c788f6da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_9ef18401.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_5ae62d5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_c338934b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_3efc2515.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_19768784.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150888_825e59de.jpg"],"destinations":["Hanoi","Ninh Binh","Sapa"],"timeline":[{"title":"Day 1 : Hanoi Arrival","description":"Welcome to Hanoi. Upon arrival, you will be met and transferred to your hotel.\nMeals: N/A,  Accommodation: Hotel in Hanoi"},{"title":"Day 2 : Day trip to Ninh Binh","description":"This morning we transfer to Ninh Binh where we visit Hoa Lu, the erstwhile capital of Vietnam in the 10th and 11th centuries, home to palaces, pagodas, tombs and pavilions. From here we cycle to Tam Coc, passing through rice paddy fields and beautiful landscapes en route, and stopping for lunch upon arrival at a local restaurant. This afternoon we drive to Trang An, where we’ll take a boat through a remarkable cave system. Returning to Hanoi we’ll embark on a walking tour of the city.\nMeals: Breakfast/Lunch,  Accommodation: Hotel in Hanoi"},{"title":"Day 3 :Hanoi city tour","description":"Hanoi - Lao Cai. Today we start with a visit to the Ho Chi Minh Mausoleum, followed by a stop at Ho Chi Minh’s house-on-stilts and the nearby One Pillar Pagoda. Next up is a visit to the Museum of Ethnology, which provides an excellent overview of the country’s ethnic groups, their customs and ways of life. After time to freshen up we take the overnight train to Lao Cai (soft sleeper).\nOvernight: Sleeper train\nMeals: Breakfast/Lunch,  Accommodation: Take a Sleeper train to Lao cai"},{"title":"Day 4:Cao Son market & Chay river","description":"Lao Cai - Sapa. Early this morning we arrive into Lao Cai, a province in mountainous northern Vietnam. After enjoying breakfast in a local restaurant, we drive uphill through the Muong Khuong district onto Cao Son commune, passing terraced rice paddies, tea farms and pine plantations along the way. At Cao Son local market, we browse the wares on offer. Leaving the market, we take a short walk to Flower Hmong village before a break for lunch. The road then takes us along the Chay River through mountains, valleys and hamlets before we arrive at the Coc Ly Bridge. Boarding a local boat, we cruise along the Chay River to Trung Do village before continuing onto Sapa\nMeals: Breakfast/Lunch/Dinner,  Accommodation: Sapa Ethnic Homestay "},{"title":"Days 5: Northern hill tribes","description":"Sapa - Hanoi. On day 5 we meet the ethnic hill tribes of northern Vietnam with a visit to the Black Hmong minority village and Dzay hill tribe. After our picnic lunch, we walk through the bamboo forest to Giang Ta Chai, a Red Dao minority village and take a break at the waterfall.\n Meals: Breakfast/Lunch/Dinner,  Accommodation: Sapa Ethnic Homestay \n"},{"title":"Day 6: Northern hill tribes","description":"On the morning of day 6 we enjoy a trek through the scenic Ma Tra Valley, with views of verdant terraced rice paddies on steep hillsides, to the Ta Phin Village of the Red Dao group. Returning to Sapa there's free time before taking the overnight train back to Hanoi (soft sleeper).\nOvernight: Sapa \nMeals: Breakfast/Lunch/Dinner,  Accommodation: Sapa Ethnic Homestay and take a soft sleeper train to Hanoi"},{"title":"Day 7: Hanoi Quang Ba Flower Market ( B)","description":"Arriving into Hanoi we visit the Quang Ba Flower Market and Truc Bach Lake before breakfast at a local restaurant. From here you’ll be taken to the start hotel of your next tour booked with us, or to await your departure transfer to the airport. If departing Vietnam today, please ensure that you book a flight departing Hanoi after 12 noon.\nMeals: Breakfast,  Accommodation: N/A"}]},{"name":"Best of Northern Vietnam","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Moderate","Holiday"],"oldPrice":0,"price":339,"summary":"7-Day tour covers the most highlight destination of Northern Vietnam. The capital city Hanoi bears the traces of centuries of change in its wide Parisian boulevards and colorful Vietnamese temples. The landscape of Ha Long Bay is a magical sight with a complex of rock pinnacles rising from the sea and a series of magnificent caves. Further to the northwest, Sa Pa lies among mountains and jungles to maintain a special cultural diversity in a combination of ethnic minority groups’ culture.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047111e9202.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047111e9202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047112485a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e0471122de6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e0471121dc73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047111cc3bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047111e15d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047111f1bb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e04711212869.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e04711225f9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047112392ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e047112410eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e04711251fb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e04711259343.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e04711262a75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189937_5e0471126e005.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Hanoi Arrival( Meals: No)","description":"Get pickup from airport/train station to hotel. Then you will have time for discovering by yourselves the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\nOur Hanoi private city tour, Lovers Foodie Private Tour or My Village Show Hanoi can be good options for you. Please contact us if you want to join these tours with us.\n\nOptional Activities ( Not Included)\nHanoi Foodie Tour (Special local food tour and Old Quarter Sightseeing | only 26USD)\nMy Village Show (Vietnamese Bamboo Circus with live traditional music| from 29USD)\n\nNight 1: Overnight at the hotel in Hanoi"},{"title":"Hanoi - Halong – Halong Cruise (B,L,D)","description":"Have breakfast at your hotel\n7.45-8.15: Pick-up at the hotel. 10.00: Having short break at stopover in Hai Duong Province.\n12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n15.00-16.30 Do kayaking through the magnificent landscape with Limestone Mountains & swimming or just relaxing on the sun-deck for fantastic views at Hoa Cuong floating fishing village Join our Cooking Class on the floating house. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce. Pass by Soi Sim Beach, “Rang Dua” Island to the sleeping area near a Surprising cave. Enjoy sunset party and relax on the sun-deck for fantastic views.\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities: Join squid fishing on the boat with our crews. Or laze yourself with our happy-hour drinks at the bar.\nNight 2: Overnight on Halong cruise."},{"title":"Halong – Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck.\n07:15: Have to breakfast with Coffee, tea, and Bakeries on board. 08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay's scenery.\n10:15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00 - 17:00: Arrive in Hanoi. End of the trip!\nOvernight at the hotel in Hanoi.\n"},{"title":"Hanoi - Sleeper Bus To Sapa- Cat Cat Village Trekking (B,L,D)","description":"Have breakfast at your hotel or get take-away breakfast.\n6:30 – 7:00 Tour guide pick you up at your hotel, departure to Lao Cai city. Travelling on new Highway Noi Bai, It will take around 5 - 6 hours.\nAround 13:00 - 13:30. Arrival in Sapa town, enjoy lunch in a local restaurant or hotel restaurant. Then trekking from hotel to Cat Cat village of H’mong – It is named Cat Cat Village, you have a chance to visit a waterfall and the hydroelectric power station built by the French, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.\nNote: Lao Chai – Ta Van trekking route is around 12km. Please contact us if you can't do trekking for long distance.\nEvening: after dinner, you will have time to go around discovering Sapa town.\nOvernight at the hotel in Sapa"},{"title":"Lao Chai Ta Van Village Trekking - Bus Back To Hanoi (B,L)","description":"After breakfast, we leave the hotel and start trekking. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields and pass through Y Linh Ho hamlet, and from here to the Black H'mong village - Lao Chai village (Black H'mong is one of the biggest minority groups in the Sapa). After that, you will continue your trekking along Muong Hoa stream, paddy field to Ta Van village, visit and understand about \"Zay\" ethnic people. You will see houses of The Zay people which are built of wood and bamboo with a clay floor. You will have picnic lunch at the village when enjoying beautiful sightseeing of paddy fields around.\n15:00: We will transfer you to the bus station to catch the bus back to Hanoi. \n21:00 - 21:30: Drop you off at the hotel. Trip ends.\nOvernight at the hotel in Hanoi"},{"title":"Hanoi Free And Easy Day (B)","description":"You have breakfast at the hotel then have the whole day free in Hanoi to relax, go shopping and explore this city by yourself. Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum. Please contact us if you want to join any daily tours with us.\nOvernight at the hotel in Hanoi"},{"title":"Hanoi Departure (B)","description":"You will have breakfast at the hotel then have free time to explore Ho Chi Minh city before getting picked up to the airport by our driver. Trip ends. Please contact us if you want to extend your stay or want to visit other places in Vietnam, Cambodia, Laos, Myanmar, Thailand."}]},{"name":"9 days in the North of Vietnam - Ha Noi - Ha Giang - Ha Long Bay","duration":9,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1000,"summary":"The package will bring you to the special places in the North of Vietnam in 9 days. You will have amazing adventure to discover Hanoi City on the way you never explore by foot.Then you will continue to come Ha Giang to discover the stunning mountains, terraced fields and join other activities with local people. After that you will have amazing trip to the world heritage site of Halong in 2 days 1 night. Let’s start with us.\n\n ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b985.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b98a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b98c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b98d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d6fa9b98f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197062_5e79d730622a9.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately to the hotel in Ha Noi. \nCheck in hotel and relax in Ha Noi city.\n"},{"title":"Ha Noi - Bicycle Tours to Hanoi Countryside (B,L)","description":"After a truly scrumptious breakfast, join a bicycle day tour to the countryside of the city. This tour includes cycling 45 km on flat roads.\nAround 8:00 am in the morning, youare picked up to our bicycle store to choose your suitable bikewhich makes you feel comfortable. You have a safety instruction here.Your exploration for the day: \nBack to your hotel for a rest after the full day. Overnight in Ha Noi\n"},{"title":"Ha Noi – Ha Giang (280km) (B)","description":"You have your morning free to relax and explore the city\nIn the afternoon, you are picked up at your hotel for a transfer to My Dinh bus station where you board a coach leaving for Ha Giang. You will have a short break with some photo opportunities along the way \n Arrival in Ha Giang city late afternoon. Check in ahomestay and overnight in Ha Giang\n"},{"title":"Ha Giang – Quan Ba – Yên Minh - Dong Van (B,L,D):","description":"Your day today starts in the morning whenyou are picked up from your hotel for a driveron the mountain roads to Quan Ba town whereyou enjoy the incredible view of the Happy road below. The mountain road itself provides a lot opportunities for photos with magnificent view of rice fields, mountains and valleys. Your journey continues to Yen Minh Town in which you have lunch in a local restaurant.\nAfter lunch, you drive through the villages of Lung Cam in Sa Phin to visit a H’mong Village and the residence of the Vuong Family, still called “Palace of Hmong King.”\nYour dinner isservedin the town \nOvernight at hotel room or home-stay in Dong Van\n"},{"title":"Dong Van – Meo Vac – Ha Giang (B,L)","description":"This is the day for adrenalin experience of the famous Ma Pi Leng Pass\nIn the early morning, you stroll arounf the old town and local markets in serene before starting the day. This is the day for adrenalin experience of the famous Ma Pi Leng Pass\n\nYou start by driving towards Meo Vac Town witha few stops along the way for you to admire the scenery and take some photos of the Ma Pi Leng pass.\nThen, drive through the Meo Vac Town to Yen Minh town where we have lunch at local restaurant. After that, you visit Lung Tam Village, a village of Hmong minority, where you learn how to make fabrics from locally grown hemp in Northwest Vietnam, learn about their lifestyle, culture and customs as well as have a friendly chat to the local people You arrive in Ha Giang in the late afternoon\nOvernight in Ha Giang\n"},{"title":"Ha Giang – Ha Noi (280km) (B)","description":"Today, you are to returnto Hanoi by coach. Upon arrival at the hotel, check in and take the rest after long day on road.\nOvernight in Ha Noi\n"},{"title":"Ha Noi – Ha Long Bay (B,L,D)","description":"Join group tour for 2 days and 1 night to visit Ha Long by cruise.\nOur shuttle bus picks up you at the hotel in Ha Noi old quarter then depart to Halong. This 4-hour drive will take you to Halong Bay, a World Heritage Site recognised by UNESCOin 1994. Located in the Gulf of Tonkin, Halong Bay includes some 1,600 islands and islets, forming a spectacular seascape of limestone pillars. Because of their precipitous nature, most of the islands\nare uninhabited and unaffected by a human presence. The site's outstanding scenic beauty is\ncomplemented by its great biological interest.\n\nUpon arrival in Halong bay, you board our Junk for an overnight boat trip. After lunch you begin our\nfantastic cruise in Halong Bay. The scenery is truly breathtaking and is continuously changing. This\nincludes a visit to Sung Sot Cave, round over Tuan Chau Island, Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island and a swim at Titov beach. Enjoy dinner on board while watching the sunset.\nOvernight on Cruise.\n"},{"title":"Ha Long Bay – Ha Noi (B, L)","description":"After an early breakfast you continue the cruise to visit Man‘s Head island, Tortoise Island, Bai\nTu Long Bay, Toad Island and Bai Tho Mountain.\nAt noon, return to the shore and disembark from the cruise as our crew say farewell. \nGet on bus to get back to Hanoi.\nOvernight in Ha Noi.\n"},{"title":"Ha Noi – depart (B)","description":"Have breakfast. Free relax in Ha Noi.\nThen Transfer to the airport for your return flight home.\n"}]},{"name":"Hanoi Hilton Opera - Paradise Luxury Cruises 6Days/5Nights","duration":6,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":749,"summary":"Water Puppet Show & rickshaw rideVisit Caves & fishing village on Halong BayCooking & Tai Chi demonstration includedFree transfer roundtrip pick up from AirportSpend 4 nights at 5 star hotel in Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100143_7ade361d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100143_7ade361d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_e30dab98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_a2d288e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_77be237a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_6ac77a46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_866e3a79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_eb795b28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_4f9a6a82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_306ddddc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_0f94fa2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_daa8ea87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_51d2a478.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100143_d4530a01.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. "},{"title":"Hanoi - Paradise Luxury Cruises (B, L, D)","description":"7:30 am to 8:30 am: Pick up at Hilton Opera Hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00: Arrive in Tuan Chau Island\n12:15: Transfer to Paradise Peak\n12:30: Welcome drink, cruise information and check-in\n13:00 - 14:30: Lunch at the restaurant\n14:30 - 16:30: Cruise and sightseeing along Halong Bay\nEnjoy an afternoon spa treatment at Paradise Spa*\n16:00: Visit Sung Sot Cave (1 hour) or kayak near Luon Cave area (1 hour)\n17:00 - 18:30: Happy Hour* on the sundeck\nAnchor at Coconut Tree Island for overnight stay\n18:00 - 19:00: Cooking demonstration on the sundeck\n19:30 - 22:00: Bao Dai Dinner at the restaurant\n21:00: select from: Squid fishing or In-cabin movies"},{"title":"Halong Bay - Hanoi (B, L)","description":"07:00: Tai Chi on the sundeck\n07:00 - 08:00: Light breakfast, coffee & pastries\n08:00: Visit Ti Top Island (1 hour)\nStay on board and just relax or enjoy a spa treatment at Paradise Spa*\n09:00: A la carte breakfast at the restaurant\n09:30: Bill settlement and check out\n10:30: Return to Tuan Chau Marina\n10:45 - 12:00: Light snacks at Paradise Suites Hotel\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: Arrive Hanoi! Check in Hilton Opera Hotel. Overnight in Hanoi. \n* payable"},{"title":"Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). "},{"title":"Hanoi free for leisure (B)","description":"Today is free! You will discover Hanoi by yourself! Overnight in Hanoi."},{"title":"Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Truly Vietnam - 10 Days","duration":10,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":745,"summary":"From North down to Central and South, you'll get several lovely memories. Not only easy exploring Vietnam through stunning and famous destination, but also you can see how the local people, culture, architecture and costume are in North, Central and South. Plenty delicious local foods each city you are travelling in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76737.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76737.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7672f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76735.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7673b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7673d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7673e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76740.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76741.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76743.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76744.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76746.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76748.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c76749.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7674b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c598c7674d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c5c8780227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8c5c878022a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8d48a2d2a99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8d48a2d2a9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197692_5e8d48a2d2a9c.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"Ha Noi Arrival","description":"You will be welcomed at Noi Bai airport by our driver and transfer you to the hotel in Hanoi city. Enjoy Welcome Drink at hotel and check in the hotel.  Free time to visit the most interesting place in Hanoi city – Hanoi old quarter. With the ancient architecture, house and local lives, you can see and find out much strange things while slowly walking around. Tasting the local delicious street foods, traditional Vietnamese rice noodle, old house and ancient temples, friendly people…all will bring you the best. Overnight at hotel in Hanoi. \nNote: Hotel check-in time: 13:00"},{"title":"Ha Noi City Tour – Water puppet show (B/L)","description":"AM: 7.45 – 8.15: Free pick up at your hotel. Then visit the Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door\nis Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. Then continue on to the Buddhist Tran Quoc Pagoda at West lake (One of the oldest pagodas in Vietnam).Then visit Bat Trang pottery village (applied on Mon, Wed & Fri). Lunch at local restaurant.\nPM: After lunch proceed to visit the Ethnology Museum (apply on Sun, Tue, Thu & Sat), the Literature Temple and Quoc Tu Giam, see Vietnam’s first university, constructed in 1070 - it’s gardens and well-preserved architecture will offer a relaxing glimpse into Vietnam’s past. Take you past Hoan Kiem Lake to see the peaceful waters, and the beauty of Ngoc Son temple. At the end, journey through Hanoi’s Old Quarter, where you’ll then have a chance for some shopping and exploration. Tour ends around 15h30 - 16h00.\n\nOur tour guide will take you to visit water puppet show then. Free time for your stay in Hanoi\n"},{"title":"Ha Noi – Ha Long (B/L/D)","description":"Program customize up to cruise\n7:30 - 8:00: Take a 3-hour scenic drive from Hanoi to Halong Bay.\n12:00-12:30 : Arrive in Tuan Chau Tourist Wharf. Transfer to Halong Cruise by tender.\n12:30 : Welcome drink on the boat and check in to your private cabin.\n13:15-14:15: Serve have lunch on board while cruising to some magnificent Halong bay scenes.\n14:45 -15:00: Visit Titop island where you take your time on swim, sunbath, trekking....\n16:30: Arrive in Pearl Farm Village. Visit around and swim, kayaking in the bay.\n17:30: Back to the cruise and join cooking class to have experience in some traditional dishes. Tea time on sundeck.\n"},{"title":"Ha Long – Ha Noi (B/L) – Overnight train to Da Nang","description":"Program customize up to cruise\n6:00 : Practice Tai Chi on the Sundeck.\n7:00-7h30: Start your day with a light breakfast. During breakfast, cruising to explore other part of Halong Bay, admire the beauty of one in seven new wonder in the world.\n8:30 - 9h30: Arrive in Surprise cave, explore the Cave, one of the most beautiful caves in Ha Long bay.\n9:45: Check out and take all luggage outside of your cabin, cruise back to the Tourist Wharf through Ha Long bay.\n10:00: Have brunch and clear bills.\n11:30: Back to the Tourist Wharf.\n12:00: Departure to Ha Noi\n16.00: arrive in Hanoi\nYou will reach hotel at 4 pm, there you will keep luggage at hotel and have have your own plan till our driver come and take you to train station for overnight train to Da Nang. \nTrain takes about 15 hours from hanoi to Da Nang city with soft sleeping beds on train. You will see the local sountryside during this journey with rice field, mountain, river and he how beautiful and peaceful Vietnam is. Overnight on the train.\n"},{"title":"Da Nang Arrival – Free time in Hoi An","description":"You will reach Da Nang abot 12 noon, then our driver will take you to hotel in Hoi An for rest. Have free time by your own to visit Hoi AN town."},{"title":"Lantern Marking – Be a real famer in Tra Que Village (B)","description":"The tour will begin at your hotel or tour office. Our tour guide will greet you and provide your bicycle for your trip. Cycling through the paddle fields and shrimp farm \nAfter that we will head to Tra Que vegetable village, you can relax and enjoy the peaceful countryside then stroll along the vegetable villages. As a special treat, you will be involved with digging, sowing, planting, harvesting the vegetables with hundreds of years rudimentary tools of the farmers. You will enjoy the E Water, a speciality of TraQue vegetable village, you can feel the strong medicinal flavour from many kinds of vegetables. You could will be a famer with many interseting activities.\nFinish your time in Tra Que vegetable village, you will ride your bicycle leisurely passing the rice fields, villages, to come to the art of making lanterns. \n- You will visit craftsmen with skillful hands, showing you how to create the brightly colored lanterns. Expertly guided you could  make yourself a lantern as a gift to your family. \n- Finish your learning, the tour guide will take you back to your hotel, finish your trip.\n"},{"title":"Hue City Tour from Hoi An (B/L)","description":"07h30-08h15: Car and tour guide will pick up you at Da Nang and go to Hue city.On the way, you will visit Hai Van road tunnel - the longest tunnel in Southeast Asia and Lang Co Beach.\n10h30: You will visit the Khai Dinh tomb, the tomb had elements of eastern art mixed with western designs.\n12h00: Having lunch and rest at restaurant \n13h00: You will continue visiting Hue imperial city – the palace of 13 Nguyen Kings with Ngo Mon Gate, Library, Thai Hoa palace, Nine Dynastic Urns and visiting Thien Mu pagoda associated with culture and history of Hue. You will stay overnight in Hue City\n"},{"title":"Hue City (B) – Flight to Ho Chi Minh – Cu Chi Tunnels in afternoon","description":"After breakfast, we will transfer you to airport for flight to to HCM City. You will be transferred to hotel for check in, and get the tour to Cu Chi at 1 pm\n\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon.\n"},{"title":"Mekong Delta River (B/L)","description":"HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.00 )\nEnjoy the scenic journey along the way bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories. Overnight at hotel. \n"},{"title":"Departure (B)","description":"Breakfast at hotel, there is no activities for today, till our driver take you to airport for flight to home. Trip ends"}]}]