[{"name":"Vietnam Family Fun in 9 Days","duration":9,"travelStyle":["Family","Group","Fully Guided","Holiday"],"oldPrice":1363,"price":736,"summary":"The tour offers a lot of fun activities for families of all ages. Start the tour in Ho Chi Minh City – the most cosmopolitan city of Vietnam that blends the past and present. Crawling through the extraordinary network of Cu Chi Tunnels used by the Viet Cong during the war. Learning how to make a lantern, a symbol of Hoi An ancient town. Interacting with local people and join them in their daily activities, cycling through the rice fields Ba Vi Eco Tour - a community-based tourism product. Then kayaking on the emerald sea of the most stunning bay in Ha Long Bay. The tour will give you educational and memorable experiences since it's as unique as the country. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136958_e1d51d7e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136958_e1d51d7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_dc0ce821.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_9897db6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_b6c39acd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_b5c1c53f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_31f0b180.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_dea95cf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_e1582570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_e9f41cd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_23ea6fd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_92049b03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_6a861a17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_c2a899c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_ce2353ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_54ce2d48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136958_3fc97299.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"WELCOME TO VIETNAM - HO CHI MINH CITY ARRIVAL","description":"Your trip begins with arrival to Vietnam. Your private driver will meet you at the airport and transfer you to the hotel. Check-in to the hotel and have a rest after the flight. \nIf you arrived early in the afternoon you could mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.\nExperience the edgy and evocative blend of past and present in Vietnam's largest city. \nOvernight in Ho Chi Minh"},{"title":"EXPLORE MYSTERIOUS CU CHI TUNNELS - GROUP TOUR (B)","description":"Have breakfast and meet your guide 8:30-8:45 at the hotel lobby. depart for Cu Chi tunnel, the trip will take approximately one and a half hours driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun. You will be back to your hotel by 18:30-19:00.\nOvernight in Ho Chi Minh"},{"title":"STEP BACK IN TIME AT HOI AN ANCIENT TOWN (B)","description":"Have breakfast at the hotel and get ready for your flight from Ho Chi Minh city to Da Nang airport. Upon arrival our driver will meet you at the airport and will transfer you to Hoi An. You will check in hotel and have some relaxing time at your resort or at the beach. \nIn the evening you could go to the Old Town, which transforms into a mystical row of lights and lanterns. In fact, Hoi An is a big centre for silk lantern manufacturers and merchants. Every shop or establishment will have a few lanterns outside, but the real sight is the lantern market.\nAfter a stroll through the market, check out the outdoor traditional theatre. You will have a chance to see Vietnamese folk dancers and musicians perform traditional pieces. The theatre runs from 9pm to 10pm at the square on Nguyen Thai Hoc street. It is completely free and open to the public so it’s interesting to see, even if it’s just for a few minutes as you pass by. Before you retire to your hotel, be sure to light a candle box and set it in the water. Many kids sit along the banks of the channel and offer candles to you – remember to make a wish.\nOvernight in Hoi An"},{"title":"BE A LANTERN MAKER IN HOI AN ANCIENT TOWN (B/L)","description":"Have breakfast at hotel, and get ready to your latern making lesson. Lanterns are the symbol of Hoi An and a big part of the local culture, you will have the opportunity to learn how to make them. Enjoy a hearty breakfast at the hotel and get ready for a lantern making lesson. Lanterns are the symbol of Hoi An and a big part of the local culture; you will have the opportunity to learn how to make them. Your guide will meet you at the hotel at 8 am and you will cycle through the town to the craftsman home. You will be given an introduction about the lanterns and how it became the symbol of Hoi An, along with a demonstration of making a lantern. You will have an opportunity to create your own lantern and keep it as a souvenir\n\nAfter the lesson you will have time to explore Hoi An at your own peace, seeing what interest you. Today you will have free time explore Hoi An at your own pace, seeing what interests you. This ancient town is full of Japanese merchant houses and pagodas, temples and antique warehouses. Or just lounge about in a laid-back riverside café on the bank of the Thu Bon River."},{"title":"MEET THE TRANQUIL CAPITAL OF VIETNAM (B)","description":"Have breakfast at hotel and enjoy your free time before the evening flight to Hanoi. Upon arrival to Hanoi our driver will meet you and transfer you to the hotel. Have a good rest after the flight. \nOvernight in Hanoi"},{"title":"GETAWAY FROM BIG CITIES WITH BAVI ECOTOUR - GROUP TOUR (B/L)","description":"08:00 – Start your trip to Ri village in Ba Vi. After 1.5 hours’ driving, you will arrive at Mr Duoc’s house with a welcome drink. 10:00 – Then visiting the 30-year-old tea plantation in Ri Village. This is a green and peaceful place where you can enjoy beautiful scenery of the village. This Tea Plantation plays important role in providing tea products for the whole north of Vietnam. You will have a chance to help local family to harvest tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage as Vietnam traditional tea. Mr Duoc is a veteran of Vietnam War and the owner of a large tea farm. He also is an expert in handling the raw tea leaves, he will introduce you how to make a good green tea before selling. You will have great time listening to the host’s stories of his life in Vietnam war, besides, enjoying great tea with green lentils or lotus seeds that made by his family. 11:15 – Driving about 10 minutes to visit another host family in Moc Village to give you a cooking class by Mrs. Chin – a host family. She will show you how to cook Vietnamese food, and you will have great time to enjoy the lunch you cooked.  12:30: Have lunch with the host’s family and short break after lunch. (Meals: breakfast, lunch)"},{"title":"CRUISE IN THE NATURAL WONDER OF THE WORLD (B/L/D) - sharing cruise","description":"In the morning, check-out from hotel and get pick-up by the Cruise. You will be picked up from your hotel at 7:30-8:00 am. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat.\nOvernight on Cruise."},{"title":"WAKE UP WITH THE DRAGON IN HALONG BAY (B/L)","description":"Rise early for Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, you would sailing back to the main harbor and the return Hanoi around 17:00. Free at your leisure time.\nOvernight in Hanoi"},{"title":"BIGGEST FAREWELL AND WAMEST THANK YOU - HANOI DEPARTURE (B)","description":"Free day in Hanoi at your own exploration until our driver (no tour guide) picks you up at the lobby of the hotel and transfers you to Noi Bai International Airport for the flight back home. \nEnd trip. See you again!"}]},{"name":"Vietnam Gorgeous 14 Days","duration":14,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1250,"summary":"In and around Da Nang, Ho Chi Minh CityMeal: NA– Accommodation: Hotel in Saigon\nYour guide will greet you at the airport outside the baggage-claim area and then take you to the pre-booked hotel. The rest of the day will be left on your own.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146384_f5076d27.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146384_f5076d27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_079ea4fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_0bb2b34b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_07c2a052.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_b3992236.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_debde960.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_025bfce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_4eadbd43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_03bcbc74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_629d8fa3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_ce5c937f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_0aa71d42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_c69f0783.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_3d0e7311.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_f9531d6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_7cf2b579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_5a78977d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_127370b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_58dfa7da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_e00a47d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_e7e11009.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146384_6c7bd88c.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang","Hue","Hoi An","Hanoi","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"Day 1 Arrival in Ho Chi Minh City","description":"Meal: NA– Accommodation: Hotel in Saigon\nYour guide will greet you at the airport outside the baggage-claim area and then take you to the pre-booked hotel. The rest of the day will be left on your own."},{"title":"Day 2 Ho Chi Minh City","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Saigon\nAfter breakfast, Cu Chi tunnel, Vietnam’s underground legacy is next on your itinerary. It is a complex of more than 200 km subterranean passages and camouflaged entrances. Try squeezing through the tight passages to reach the former living areas, field hospitals, command centers and kitchens, a sobering experience that not many places in Vietnam can provide. In the afternoon, take a charming tour around the most amazing neighborhood in town that encompasses Notre Dame Cathedral, Old Post Office and the likes. Later in the day, head for the War Remnants Museum, and the Reunification Palace, the place housing the national government till the 1970s. "},{"title":"Day 3 Ho Chi Minh City – My Tho - Ben Tre - Can Tho","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Can Tho\nOur Vietnam trip package also offers you an immersive experience exploring the exotic Mekong Delta. You will leave  the hurly-burly of HCMC for My Tho, where you will enjoy a sail along the canals surrounded by luxuriant greenery on a private boat to a lush orchard. Here, you will be treated to a delicious lunch in a local restaurant in the heart of the Mekong, completed with tropical fruits. You then head to Can Tho City, the heart of the Mekong Delta, for an overnight stay."},{"title":"Day 4 Can Tho – Cai Rang – Da Nang","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Hoi An. \nToday you will get an early start to board a pleasant motorboat ride for the eminent Cai Rang floating market, a lively wholesale floating market that offers a large variety of local goods.  After that, the boat will continue sailing along lush vegetation and make a stop at Mekong Delta’s famous orchards to sample some exotic fruits. Continue your venture along the river; you will get a deeper insight into Vietnamese life by observing the daily activities of locals along the riverbank. Enjoy a lunch back in Can Tho for flight to Da Nang. Upon arrival, your local guide will take you to the pre-booked hotel in Hoi An. Overnight in Hoi An."},{"title":"Day 5: Hoi An","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Hoi An\nYour exploration of Hoi An starts with the mysterious My Son Sanctuary, a complex of ruined Hindu temples dating back to the Champa Kingdom, also known as “Angkor Wat in Vietnam”. Later in the afternoon, you will have a tour around the ancient town and visit some well-preserved historical sites like Japanese Bridge, Chinese Temple, and the former Vietnamese merchants’ houses."},{"title":"Day 6: Hoi  An – Hue","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Hanoi\nThis morning, you will head out for a ride along the Han Van Pass to Hue. Along the way, feel free to admire the marvelous mountain scenery and make a stop at the Marble Mountain to appreciate some delicate stone sculptures and crafts. Arrive Hue, have lunch in local restaurant. This afternoon, you will taske a trip to the Minh Mang Tomb, about 12km from the city center. After that, a Royal Dragon Boat will take you to the 400-year-old Thien Mu Pagoda while sailing down the Perfume River. Later in the day, you could stroll around the bustling Dong Ba Market to do some shopping.\n"},{"title":"Day 7 Hue – Hanoi","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Hoi An\nThis morning, You will then move on your journey to one of Vietnam’s seven UNESCO World Heritage Sites, Imperial Citadel and the Forbidden City. You will visit Khai Dinh Tomb then transfer to the airport to Hanoi. On arrival, our tour guide will wait you and transfer you to the city central.\nFree in Hanoi."},{"title":"Day 8: Hanoi – City tour","description":"Meal: Breakfast/lunch– Accommodation: Overnight on train.\nAs the capital of Vietnam, Hanoi surely has a good many to offer to its visitors, which guaranteed to be a mix of cultural, historical and natural spectacles, starting with the Ho Chi Minh Mausoleum, the Presidential Palace and Ho Chi Minh’s stilt house at the back, the One Pillar Pagoda, the Temple of Literature, and the delightful scene around West Lake at the heart of Hanoi, including the well-preserved Tran Quoc Pagoda and Quan Thanh Temple. After an A La Carte lunch, mill about the most bustling and characteristic neighborhood in Hanoi, the Old Quarter by the most local way, on a rickshaw, and also ride by the Hoan Kiem Lake. Lastly, take a seat at the Water Puppet Show, one of the most traditional craft and significant cultural symbol of the country. Before the day ends, you would be transferred to the railway station to take an overnight soft sleeper train to Sapa, a peaceful land with captivating mountain landscapes."},{"title":"Day 9: Hanoi - Sapa","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Sapa.\nEarly morning, you will take Limousine bus to Sapa. On arrival, our tour guide will welcome and transfer you for lunch.\nAfter lunch, take a walk to Cat Cat Village, nestled in a beautiful valley about three kilometers from Sapa Town. Cat Cat- the old village of ethnic groups- attracts tourists from all over the world for its distinctive customs and practices which have been lost in almost ethnic villages. The village is within easy walking distance from any hotel in downtown Sapa."},{"title":"Day 10 Sapa- Ta Van- Giang Ta Chai- Sapa","description":"Meal: Breakfast/lunch– Accommodation: Hotel in Sapa.\n After breakfast, you will start a lovely trekking in the spectacular landscape to Lao Chai Village, home of the Black H’mong, to have a glimpse of tribal life on the mountains. Enjoy a pleasant picnic lunch and continue your highland adventure to visit the Dzay people in Ta Van village, whose houses nestled in a beautiful valley that provides the best view of intoxicating rice terraces in Vietnam. Keep trekking through a bamboo forest, you will finally reach Giang Ta Chai village of Red Dzao tribe. Later in the day, you will head back to the Sapa Town and enjoy some free time in the Sapa Market."},{"title":"Day 11 Sapa-Hanoi","description":"Meal: Breakfast– Accommodation: Hotel in Hanoi.\nAfter breakfast in Sapa, you will free in the morning to enjoy Sapa town.\nIn the afternoon, take a Limousine shuttle bus to transfer to Hanoi."},{"title":"Day 12: Hanoi – Ha Long Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nAfter enjoying a breakfast, you will head out for a 3-4 hour ride to embark on your amazing Halong Bay cruise. Sailing around the UNESCO world heritage site, you could marvel at the grotesque limestone Karsts in the islands of Ha Long Bay, such as Dinh Huong and Ga Choi etc. Later on the agenda, you will go ashore to visit one of the fascinating caves in the bay area. And you will stay overnight on board."},{"title":"Day 13: Ha Long Bay- Hanoi","description":"Meal: Breakfast, lunch ( Or Brunch)– Accommodation: Overnight on Cruise.\nContinue sailing around Ha Long Bay today. Get an early start to join a Tai Chi lesson with other passengers on the deck, or just sock in the beautiful view of limestone islands, charming beaches, and amazing grottos. The cruise will pass by the Bai Tu Long Bay later, and you could enjoy a pleasant brunch while admiring the charming scenery. Afterward, your tour guide would wait for you at the dock and transfer you to the hotel in the city enter. The rest of the day will be open to your own agenda."},{"title":"Day 14: Hanoi – Departure","description":"After breakfast, you will be transferred to the airport to catch the flight to your next destination. Your memorable tour ends here.\n\n"}]},{"name":"Vietnam 11 Days 10 Nights North to South or Vice Versa","duration":11,"travelStyle":["Sightseeing","Group","Partially Guided","Easy","Holiday"],"oldPrice":0,"price":657,"summary":"Kicking off in Vietnam's capital Hanoi, embark on a breathtaking 11-day journey through cities and rural villages, taking in beautiful Halong Bay and the lush Mekong Delta. The journey follows the coastline which covers all the best destinations of Vietnam. Board your night train for Danang, headed for the ancient town of Hoi An – the loveliest town in Vietnam. Journeying to Ho Chi Minh City, Mekong Delta and Cu Chi Tunnels.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/148742_16243a5c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/148742_16243a5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_ffc3efab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_7762a578.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_b52efe05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_ebb55b7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_a8349c61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_626d7b5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_f0b5918c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_1b29ccfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_4fbc487a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_0419aa5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_1a7e04e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_49cb6d6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_838e2b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_27e9fc02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_5a2b3aa9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_c8c23cca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_f2fafcd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_67a98a0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_4c2bb3ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_4aed5cd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_3d37c20b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/148742_2a290702.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Check in Hotel in Hanoi and Free and easy (Meals: No)","description":"Get picked up from the airport or train station to the hotel. Then you will have time for discovering by yourself the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature, or get arty at the city's Fine Arts Museum.\nNight 1: Overnight at 3-star hotel in Hanoi"},{"title":"Hanoi - Halong cruise (B,L,D)","description":"Have breakfast at your hotel.\n7.45-8.30: Pick-up at the hotel then travel to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours) with a short break on the way. The bay is dotted with sandy coves, grottoes, and 1,600 limestone islands, which have been formed over millennia by wind and water erosion.\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy a welcome drink. Check in the cabin.\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n15.00-16.30 Do kayaking through the magnificent landscape with Limestone Mountains, visit Titov Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay. After kayaking, you will be back to Lavender Cruises and join sunset party.\nThe cruise passes by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\nJoining our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\nJoin squid fishing on boat with our crews, playing card, karaoke or laze yourself with our happy-hour drinks at the bar. To end the day, spend a peaceful night aboard the boat beneath the night sky.\nNight 2: Overnight on Halong bay Cruises"},{"title":"Halong Bay – Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck. \n07:15: Have breakfast with Coffee, tea, and Bakeries on board. \n08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for the geology value of Halong. \n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery. \n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier. \n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi. \n16:30: Arrive in Hanoi. End of the trip! \nNight 3: Overnight at 3 star hotel in Hanoi"},{"title":"Hanoi – Night train to Danang (B)","description":"You will have breakfast at the hotel then have free time to explore Hanoi city till our driver picks you up then leaving to Hanoi railway station. You will catch a night train to Danang city.\nNote: There is 4-soft berth per tourist cabin with A/C. You may share it with other passengers. It takes around 16 hours from Hanoi to Danang. Please contact us if you want to upgrade to the private train cabin or internal flight from Hanoi to Danang city.\nNight 4: Overnight on the train"},{"title":"Hoi An arrival – Free and easy (Meals: No)","description":"Arrive in Danang. Pick up from the train station to the hotel in Hoi An. You will have free time to look around Hoian ancient town by yourself. This town was a major trading port with the west during the 16th and 17th-century and has various architectural influences from Europe, China, and Japan. You'll see Chinese temples, Japanese pagodas, French-colonial houses, wooden shop-houses, and a peaceful river during your walk.\nNight 5: Overnight at the hotel in Hoian."},{"title":"Hoi An - My Son Holy Land – Boat trip on Thu Bon River or Tra Que Cooking class(B,Light Lunch)","description":"Have breakfast at your hotel.\nYou can pick one option as below:\nOption 1: My Son Holly Land and Thu Bon Boat Trip (Light Lunch)\n8:00 – 8:30: We will pick you up at your hotel\n8:30: Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains, and Cham islands, we arrive at the fishing village alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n9:45: Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4th to 15th century.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area your guide will explain the history of the religious site which served as a burial place for the Cham monarchs centuries ago.\nAround 12:00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village. You will have a soft lunch (Quang-style noodle with pork and shrimp) served on boat.\n14:00 - 14:30: The boat trip will finish at the dock in the old town and back to your hotel.\nOption 2: Tra Que Cooking Class and Foot massage ( Lunch)\n8:00 Local guide pick up at the hotel, then you will go bicycle to Hoi An’s colourful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients you will use in the cooking lesson later.\n9:00 Ride pass small roads, rice padddy fields, take pictures of water buffalos, cow or farmers on daily working at their fields and fish – ponds. Explore many beautiful views of VietNam country side meet many warm hearted local people. They will pass through the bendy small narrow roads in the village to one of the typical local houses\n10:00 Take a rest with special welcome drink. You will be taken around the herbs garden where local farmers work on their field using organic methods from 300 years ago. Then you will enjoy foot massage with local herbs (lemongrass, basil thai….)\n10:30 Learn the traditional ways of preparing and cooking Vietnamese food.( Made some flowers and animals by vegetables for decoration). After the lesson, enjoy what you have cooked.\n12:30 - 13:00 Return to the hotel.\nNight 6: Overnight at the hotel in Hoian"},{"title":"Hoi An – Free and easy day (B)","description":"You will have breakfast at the hotel. Today you have a free day to relax, go shopping or take a free bicycle to look around Hoian ancient town and the surrounding countryside. Many people like to just wander around and soak up the ambiance of the town, perhaps visiting a couple of the old traditional Chinese mansions. Others shop till they drop, spend time at the tailors or head out to the beach outside town, which has glorious white sand.\nNight 7: Overnight at the hotel in Hoian"},{"title":"Hoi An - Airport transfer – Fly to Ho Chi Minh(B)","description":"After breakfast at your hotel and you are free to get pick up to the airport. Today you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City.\nNight 8: Overnight at the hotel in Ho Chi Minh."},{"title":"Ho Chi Minh - Mekong Delta Deluxe Full Day Tour(B,L)","description":"A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit.\n7:30 - 8:30: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Upon arrival, visit Vinh Trang pagoda which sated back to the late 19th century. Then boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix, and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation.\nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop.\nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. \n17:30: Drop off at your hotel. Trip ends.\nNight 9: Overnight at the hotel in Ho Chi Minh."},{"title":"Ho Chi Minh- Cu Chi tunnel half day tour (B,Light Lunch)","description":"7:45-8:30: Our tour guide and driver will pick you up at your hotel and then start driving to Cu Chi which located 70 km from the Ho Chi Minh City Center to the Northwest.  Cu Chi was known as the “area of steel” in the wartime, and the tunnel systems were over 200km, which was considered the unbreakable underground village in the Vietnam-American war. It is legendary for its network of tunnels and is a popular destination for both Vietnamese and foreign visitors.\nThe trip to Cu Chi will take approximately one and a half hours of bus driving.\nUpon arrival, before exploring the tunnels, you will have some short introduction followed by an introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun.\n13:00: Return to Ho Chi Minh city. Have lunch at the restaurant\n14:30: Get transferred back to your hotel. Trip ends.\nNight 10: Overnight at the hotel in Ho Chi Minh."},{"title":"Ho Chi Minh departure (B)","description":"You will have breakfast at the hotel then have free time to explore Ho Chi Minh city before getting picked up to the airport by our driver. Trip ends. Please contact us if you want to extend your stay or want to visit other places in Vietnam, Cambodia, Laos, Myanmar, Thailand. We can customize the tour as your request."}]},{"name":"Vietnam Highlight Tour 11 Days/10 Nights","duration":11,"travelStyle":["Discovery","Boat","Family","Custom","Group","Fully Guided","Kayak & Canoe","Holiday"],"oldPrice":1559,"price":780,"summary":"Ho Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.\nDanang - Hoi An: See ancient sculpture in the Cham Museum, and tour Buddhist cave temples in the Marble Mountains. A walking tour through the UNESCO listed Old Quarter; Countryside bike ride, visit an old merchant house, the Hoi An Museum, and a Chinese assembly hall.\nHanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter.\n Halong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76090_85efe164.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76090_85efe164.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_45c15d78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_b16f4ac4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_dd138898.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_675c8ed9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_55d98b9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_a054cd8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_a4903fc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_652df19c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_ba5dcd51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_31eb89ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_434a376f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_0f6b844d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_29a2cdc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_4dbc4024.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_c953c742.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_c74f0472.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_f979be3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_0dbc92ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_f5fbeb26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_9514633d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_c57aa005.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_c505e778.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76090_525e4b24.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Ho Chi Minh City, Vietnam","description":"Today you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by Tour Guide & Car Driver at airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 2: Full day Sightseeing in Ho Chi Minh City & Cu Chi Tunnels. (B, L)","description":"This morning enjoy a city tour that includes the Reunification Hall, formerly known as the Presidential Palace. It was towards this modern building that Communist tanks rolled on the morning of April 30, 1975, as Saigon fell. This fascinating building is filled with history still fresh in the minds of many. The tour also includes the Old Post Office, the Notre Dame Cathedral, the Jade Emperor Pagoda, Chinatown and Binh Tay Market – the central market for the city and one of the liveliest areas. Next we visit the Cu Chi Tunnels, the incredible network of tunnels that once stretched for 210 miles. This underground complex was built by guerilla fighters beginning in 1940 and construction continued throughout the Vietnam War. We return to our hotel where the evening is free. Overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 3: Full day to Mekong Delta/River Boat Trip - Fly to Hoi An. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Transfer to Airport for flight to Hoi An Ancient Town.\nArrive Da Nang Airport and pick up at evening time. Transfer to hotel for check in. Overnight in Hoi An Ancient Town.\nPhu Thinh Resort Hoi An 4* or similar"},{"title":"Day 4: Cycling Tra Que Village - Cooking Class (B, L)","description":"8:00am: Have breakfast at hotel. Our guide welcomes you at hotel in Hoi An and ride bicycle to Tra Que Vegetable Village far from Hoi An Ancient Town 3km. You ride through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. Arrive in Tra Que Vegetable Village; you can experience the living and working of local farmers at this organic vegetable and herb garden. Your learn how to prepare soil, grow vegetable, water to get fresh vegetables as you see at the garden from previous tourists. You have 15 minutes foot massaged by herb to fresh yourself. Here is the chance for you to join in cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods like Tam Huu Spring Roll, BanhXeo pancake… Have lunch at the family. And then ride bicycle back Hoi An Town or hotel. Trip ends at 3:00pm.\nPm: This afternoon you have more free time to experience around the town to get some souvenir gifts or spend your time at Cua Dai beach - 4km from the ancient town. Free to have your own dinner. \nPhu Thinh Resort 4* or similar"},{"title":"Day 5: Full day Explore Hoi An - Night Train to Hanoi. (B, L)","description":"A full-day tour here includes the Japanese Covered Bridge, the beautiful Chinese Assembly Halls, the Phuok Kien Pagoda, and the local market. You’ll also take a boat trip on the Thu Bon River to a village of woodworkers and boat building families on Cam Kim Island. Later visit a local school for a very special visit with what are sure to become your newest friends (\"Make a Friend\" program). Free for leisure and go shopping until 5:00pm.\n5:30pm. Leave Hoi An Ancient Town for Da Nang City to take overnight Train to Hanoi around 7:00pm. Tonight you stay overnight on the Train. (4 Berths Cabin Soft Sleeper, sharing)."},{"title":"Day 6: Arrive Hanoi City by night Train","description":"You`ll arrive Hanoi Train Station around 12:00pm. Pick up & transfer to Hanoi Downtown to check in hotel. You`re free to discover Hoan Kiem Lake, Ngoc Son Temple, Dong Xuan Market, Old Quarter, market square. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi to Halong Bay Cruise & stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Ha Long Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Board.\nGarden Bay Cruises 3* or similar"},{"title":"Day 8: Halong Bay to Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 9: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 10: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 11: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. You`ll be transferred to Airport for your next flight! Finish your unforgettable trip with Legend Travel Group at Airport! Good bye and see you again!"}]},{"name":"Vietnam - South to North 10 days","duration":10,"travelStyle":["Adventure","Family","Private","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":895,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Visitthe Japanese Bridge in Hoi An","Explore the Holy Land of La Vang","Trek to see Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100048_a44a5e01.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100048_a44a5e01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_326dd271.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_a060e6b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_212a271d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_d0c6f2ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_057f4396.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_119de0c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_df839941.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_630d5fce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_35372606.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_57db50b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_d4dcd372.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_822a26c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_6bedbd87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_f3ca4c93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_28ebf380.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_eee7831e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_01f714fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_1d8ef25b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_1946f02f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_448679a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_83c8c4e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_f33c3d49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100048_96fca443.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 HO CHI MINH CITY ARRIVAL","description":"Meal not included\nOn arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You are free time for leisure. Overnight in Ho Chi Minh city."},{"title":"Day 2 MEKONG DELTA – MY THO & BEN TRE","description":"Meal included: Breakfast, Lunch.\nGet a chance to taste the real Vietnam and let the splendid views cover your senses. This trip allows you to visit the local factories and see how local products are made. Also, you will meet the friendly local people and have a lot of wonderful experiences on land and at the river while see the floating fish market and fish farm. Let's discover a hard-working land with traditional people, which will give you more appreciation on life! \n7h30 a.m Our tour guide welcome you at Vietnam Adventure Tours office, then transfer to the City of My Tho by bus. During 1.5 hours bus drive to My Tho join activities of local people and enjoy nice scenery of green rice paddy fields. We visit Vinh Trang pagoda - biggest pagoda in Mekong delta. Continue going to My Tho, where we take a boat trip along Mekong River. During a boat cruise along Mekong River, you can see fish cages, floating houses on the river.\nThe boat take you to small canal, where is the place you totally escape from the busy town. The boat cruise in the coconut trees canal takes you to a coconut island in Ben Tre. We disembark and have a walk around the village. Stop at a local family to enjoy tropical fruit, taste honey tea, honey wine and listen to Vietnamese traditional music, performance by the villagers.\nContinue walking on the village’s road to coconut candy shop, learn how to make candy, show some handicraft made by coconut tree. Take a walk through village with two sides there are so many kind of fruits, flowers, trees, local houses, children in Mekong delta, take your time to have nice photos and enjoy nature scenery. Then, we head to the local restaurant. Lunch is set with special Vietnamese food at here. Enjoy lunch under tree shadow you will feel the life is so beautiful.\nAfter lunch you relax half an hour to walk around the village or biking, travel on the river to back the ferry, transit to the bus back Ho Chi Minh, arriving in Ho Chi Minh city at around 4:30pm. Stay overnight in Ho Chi Minh"},{"title":"Day 3 CU CHI TUNNELS HALF DAY","description":"Meal included: Breakfast\n08:30        We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner. \nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was \"A Free Target Zone \". The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47?    Visit Cu chi tunnels, you have a chance to find out!\n14:30        The bus back HCM. Stay overnight in Ho Chi Minh."},{"title":"Day 4 DA NANG – HOI AN BY PLANE","description":"Meal included: Breakfast\nMorning: Breakfast at hotel. \nOur driver takes you to the airport for Da Nang flight.\nArrive to Da Nang, our car take you to Hoi An (40 minutes drive). Check in hotel in Hoi An.\nYou are free to discover the ancient town: Japanese Bridge, Lantern road, traditional tailor shop, enjoy the specialities. Besides, you can view sunset at Cua Dai beach. Spend overnight in Hoi An."},{"title":"Day 5 BIKING HOI AN VILLAGE WITH ACTIVITIES – HUE","description":"Meal included: Breakfast, Lunch\n8:00          Our local guide will pick you up at the hotel’s lobby. After that, you will ride a bicycle to the home of a craftsman in the city. Here you will get a short introduction to the history, shape, and color of the lanterns as well as the many stages of making them. Especially, you will be shown how to decorate and make your own lanterns you can also keep it as a souvenir. \nFirst, you will say goodbye to your host to continue going to the vegetable village named Tra Que Village. Join the farmers as they prepare the land, fertilizing it with seaweed from the local lake. Watch and participate in raking, sowing, watering the greens, picking vegetables, and more. We will having lunch here. Finally, get back to Hoi An by bicycle.\n4:00 pm Private car to Hue for 3 hours drive, you will check in hotel. Spend overnight in Hue."},{"title":"Day 6 PHONG NHA CAVE","description":"Meal included: Breakfast, Lunch\n6:30          \nStart at your hotel and depart to Phong Nha Cave. On the way, our guide will introduce the Holy Land of La Vang (it is named the Minor Basilica), Hien Luong Bridge and Ben Hai River. When Arriving in Quang Binh, you will have chance to visit some magic location such as: Phong Nha Cave, Ke Bang national Park.  After that, you will be served lunch at Xuan Son Boat Station (in Phong Nha).\n13h00\nWe will start visit Phong Nha Cave by boat on Son River. Then, proceed to explore the caves named Bi Ky grotto, Cung Dinh grotto, Tien grotto.\n15h00\nYou will be picked you up at the boat station by car and continue to depart for Hue city on Ho Chi Minh Trail, via Truong Son Martyrs’ Cemetary.\n 19:30      \nWe will return to Hue and overnight here."},{"title":"Day 7 HUE CITY – HA NOI","description":"Meal included: Breakfast, Lunch\nMorning: \nOur bus and guide will meet you at your hotel in Hue to start the tour to discover loyal and historic places as follows:\nMinh Mang Tomb\nKhai Dinh Tomb\nSeeing Vietnamese Kungfu Performance Shown of Võ Kinh Vạn An (if possible)\nTu Duc Tomb\nConical Hat and Incense Make Villages.\n Afternoon:\nYou will enjoy your meals at local restaurant: Buffet 50 dishes which has diversity in Hue local Specialties, Western and Asian food. After having lunch, we continue to visit the other famous places:\nImperial City (Đại Nội)\nThien Mu Pagoda (400yrs old)\nFrom the pagoda, you will take a dragon boat on Perfume River. During that time, you will be relaxed in fresh cool wind and enjoy the beautiful sceneries on the way. We will spend 30 minutes for coming back to Hue City\n16:30        Tour will be ended. Return your hotel to check out and then we will take a flight to Ha Noi capital.\nEvening  Arriving Ha Noi, car transfer to the center and spend overnight in Ha Noi."},{"title":"Day 8 HA NOI – HA LONG","description":"Meal included: Breakfast, Lunch, Dinner\n\n(Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities)\n07.45 – 08.15 approx\n- Our guide will meet you at your hotel. The shuttle bus or private car pick up\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n- Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n12 – 12.30 approx\n- Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is served\n- Join us for a typical local lunch in the dining room or at the outdoor dining area. \nAfternoon\n- Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n- Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n- Heading back toward the sleeping area\nEarly evening\n- Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n- An authentic Vietnamese menu is served\n- After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 9 HA LONG – HA NOI","description":"Meal included: Breakfast, Lunch\n\n(Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n07:00 – 08:00\n Local breakfast is served\n08:00\n- Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n- Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. \n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30-17:00\nStay overnight in Ha Noi."},{"title":"Day 10 HA NOI DEPARTURE / SEE YOU AGAIN","description":"Meal included: Breakfast\nYou will have breakfast at hotel. Relax time in Ha Noi until transfer to the airport for the flight back home. See you again!"}]},{"name":"Vietnam the Charming North","duration":5,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":279,"summary":"HIGHLIGHTS:\n\n  Delve into the 36 streets of 36 trades in Hanoi’s Old Quarter.\n  A leisure cruise in Ha Long Bay – one of the world’s new seven wonders where its’ 1,600 islands and islets form spectacular seascape of limestone pillars.   \n\n","highlights":["Experience the hustle and bustle of Hanoi’s fascinating Old Quarter","Enjoy a traditional stage show invented by Vietnamese farmers","Indulge in the endless charm of Halong Bay with caves and grottoes"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/107424_4d948439.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/107424_4d948439.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7217375d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7d7d381b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_ab05fcef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_1011ffa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_cbd3d268.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_dc8ace0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7ff80d63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_2d7c69fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_66b193d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_77e5b835.jpg","https://cdn.tourradar.com/s3/tour/1500x800/107424_7389b34d.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL (-/- /-)","description":"Welcome to Hanoi  Vietnam!\nOur driver will be welcoming you at Noi Bai airport; it takes us 35 minutes driving to hotel in the centre of Hanoi.\nOvernight in Hanoi.\nPlease note: Standard check in time is 14:00. Early check in is subject to availability of the hotel.\nNight activities suggestion: enjoy local beer at Ta Hien Streets, experience the ambience of sleepless street with lifemusic, the young people of Hanoi and also foreign tourists. Hundred of bars and pubs in the Old Quarter are also atyour disposal. Or just simple spend your time at shopping malls or various boutique Shops."},{"title":"DAY 2: HANOI CITY TOUR (B/-/- )","description":"Breakfast at hotel.\nAround 8.00: Pick up from your hotel take you to visit the Ho Chi Minh Complex, which includes Ho Chi MinhsMausoleum  the final resting place of the beloved national hero, Uncle Ho  and President Ho Chi Minhs stilt housewhere he lived off and on from 1958 to 1969.\n9.30: Youll visit the One Pillar Pagoda, which is actually a group of structures that collectively make up a pagoda builtover the water in the middle of a square lake.After that, youll have a chance to explore the Tran Quoc Pagoda on the shore of West Lake. From there, its onto theTemple of literature, which was Viet Nams first university and is dedicated to Confucius.\n12.30: You have lunch at the restaurant in the Old Quarter. Afterwards, youll visit Hoan Kiem Lake - the heart and soulof Hanoi.\nOPTION 1: TUE, THU, SAT, SUNDAY\nStop at Museum Of Ethnology. This superb museum showcases the depth of Vietnamese cultural diversity with anastounding collection of 15,000 artifacts gathered from throughout Vietnam. Maps, displays and dioramas are labeledin Vietnamese, French and English. Displays portray a typical village market, the making of comical hats and a Tayshamanic ceremony; videos show the real thing. You can also check out a traditional Black Thai house reconstructed inthe museum. There's also a centre for research and conservation where scientists from all over the world studytraditional Vietnamese cultures.\nOPTION 2: MONDAY, WED, FRI\nDepart for Bat Trang ceramic village which is about 20 km away from Ha Noi, this is pottery village with a half-millenary historic development.\n15.30 - 16.00: Take the car back your hotel.\nOvernight in Hanoi."},{"title":"DAY 3: HANOI - HALONG/ LAN HA BAY (B/L/D)","description":"Breakfast at hotel and check out.\nFrom Hanoi, at 8AM, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural WorldHeritage as designated by UNESCO in 1994. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Uponarrival in Halong, well take a big boat to cruise the Bay to discover the magnificent beauty of this Descending-dragon bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood onboard, we can visit the Surprising Grotto, stop for swimming or kayaking, passing floating villages and approach isletsto enjoy their beauty in close distance. Back to the boat for dinner late afternoon. Evening attend activities on theboat or relax at your own leisure. Overnight on the boat near Titov Beach.\nPlease note! The program may be little varied upon the cruise you choose."},{"title":"DAY 4: HALONG/ LAN HA BAY - HANOI (B/BRUCH/-)","description":"After breakfast, visit by boat to Luon Cave, a ring-shaped pool inside an island in Halong with absolutely tranquillandscape and emerald water. Back to the Wharf of Halong passing the most densely area with many islands that havebeen named like the Cock-Fighting Rock, Sail Island, Incense burner rock or Sea Dog Rock. Arrive at Halong Wharfaround 11.00.\nTake shuttle bus back to Hanoi. Free at your own leisure. Overnight in Hanoi."},{"title":"DAY 5: HANOI DEPARTURE (B/-/- )","description":"You are free until transfer to the airport for departure flight. End of service!\nPlease note: Standard check out time is 12:00."}]},{"name":"Vietnam Highlight Tour Package 7Days/6Nights","duration":7,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":902,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nHo Chi Minh City: City tour including entry to the War Remnants Museum\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95473_fd1068e4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95473_fd1068e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_e16090ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_09509291.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_356f3202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_e7dc333e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_4eb2eddd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_9a51b21a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_be52bb67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_b87c05ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_662a8b59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_9518d043.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_0e7837f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e56db032f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e56dbe2bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e56dc3f8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e56dc98eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e56dcf2a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58cb2874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58cbd00c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58cc1e72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58cc6890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58ccb6d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e58cd0b52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95473_5e02e5ac5de6d.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City"],"timeline":[{"title":"Arrival Hanoi Vietnam","description":"Today youll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Halong Bay Cruise & stay overnight on Board (B, L, D)","description":"Early this morning, well drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone peaks or karsts that jut from the deep blue water as far as the eye can see. Well spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since were overnight on the water, well be able to explore Ha Long Bays most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi City Tour Depart to Ho Chi Minh City (B, L)","description":"You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of lEcole Francaise dExtreme Orient, which includes artifacts from Vietnams turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Transfer to Airport for Ho Chi Minh City departure. Arrive Ho Chi Minh City in the evening. Pick up from airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City Tour - Cu Chi Tunnels (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means Big Market. Notre Dame Cathedral, in the heart of Saigons government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as Hotel de Ville, is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. Return to hotel for free. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Mekong Delta Cruise full day. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Saigon.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Conclude Ho Chi Minh City/Departure (B)","description":"Having breakfast at hotel in Ho Chi Minh City until your international flight departure. We will drive your family until Airport for departure! You will finish the unforgettable Vietnam Trip with Legend Travel at airport! Good bye & see you in the next time!"}]},{"name":"Highlight Vietnam Tour - 7 Days","duration":7,"travelStyle":["Discovery","Family","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":922,"summary":"Hanoi: Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. Take part in Water Puppet show.\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Cat Be floating market.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76131_5b00c343.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76131_5b00c343.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_98c14657.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_83ebc5cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_ac123a7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_3d260b65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_d44fd167.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_09d30dc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_f7fd21ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_53c972d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_aa2a2543.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_d89ec8b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_de92b9e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec4231f28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec423b9e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec42405c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec6a84af2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec6a8fb45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76131_5e02ec6a962a2.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nAirport pick up included\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay Cruise & stay overnight on Board (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi City Tour - Depart to Ho Chi Minh City (B, L)","description":"You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Transfer to Airport for Ho Chi Minh City departure. Arrive Ho Chi Minh City in the evening. Pick up from airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City Tour - Cu Chi Tunnels (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. Return to hotel for free. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Mekong Delta Cruise full day. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Saigon.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Ho Chi Minh City Departure (B)","description":"Today you are free for leisure & shopping until transfer to Airport for departure. Finish unforgettable Vietnam trip arranged by Legend Travel Group. Good bye & see you in the next time!\nAirport transfer included!"}]},{"name":"10 Days Unforgettable Vietnam from Ho Chi Minh city up to Central and Hanoi","duration":10,"travelStyle":["Discovery","Family","Local Guide","Group","Partially Guided","Sightseeing","Holiday"],"oldPrice":0,"price":655,"summary":"Vietnam – a lovely, friendly and beautiful country, might still be strange of you. Let us help you exploring it. During your vacation, you will understand much more the different culture, daily life style and food flavor between South and North, also you have the nice time in the best destinations in Vietnam. Visiting the floating life on Mekong Delta, understanding the difficulty of locals while war time in the past in Cu Chi war tunnel, tasting the sweet flavor of peaceful life in Hoi An, discovering the stunning landscape in Halong Bay…An unforgettable and memorable trip is waiting for you!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/126204_fdbcc6d9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/126204_fdbcc6d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_7cd33986.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_c5a4050e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_dfda95d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_c4206339.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_4d45144d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_b685a9e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_c3e81e55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_9dc1b041.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_d5853fb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_4b0ac246.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_12788ed5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_9a465184.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_d6d854f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_9008f932.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_18af8598.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_b49f94fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_63f77946.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_0e617dd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_50197b14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_53a3ba56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_70ec679e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_073bf32a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/126204_3cdc9e1d.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Ho Chi Minh city arrival – Hotel check in (Meal: No)","description":"Welcome to Ho Chi Minh city – the biggest city in Vietnam. Your driver will pick up and transfer you to the hotel in the center. Check in the hotel and exploring the city by your own. \nWalking time is the best way to visit the center of the city. Tasting the local foods, finding out the local life, taking photo of nice corner of the city…\nOvernight at hotel in HCM city.\nPlease note: Hotel check-in time: 13:00\n"},{"title":"Day 2: Cu Chi war tunnel half day (Meal: B, L)","description":"Cu Chi tunnel system was built by the Communist guerrilla troop knows as Viet Cong during the Vietnam War to combat the American colonial and South Vietnamese force. The system is of over 220 km of tunnels became a legendary and special architecture lying deeply underground. The tunnels were a function, including a lot of trap doors, storage facilities, specially constructed living areas, hospitals, command centers & kitchens. Nowadays, Cu Chi tunnel became very popular for both of Vietnamese and foreign travellers.\n08:00 - 08:30: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. The system is of over 220 km of tunnels became a legendary and special architecture lying deeply underground. The tunnels were a function, including a lot of trap doors, storage facilities, specially constructed living areas, hospitals, command centers & kitchens. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\nOn here you can try to Crawl through tunnels (do not apply for very fat people and very old people)\n12:00 Have lunch in a local restaurant\n13:00 Back to Ho Chi Minh City\n14:00 Arrive in your hotel in Ho Chi Minh City.\nOvernight at hotel in HCM city.\n"},{"title":"Day 3: HCM city – Flight to Da Nang – Hoi An check in ( Meal: B)","description":"Today, you have your own time to visit HCM city, shopping the souvenir until the time driver pick you up at the hotel and transfer you to Tan Son Nhat airport for flight to Da Nang city.\nUpon arrival, driver will transfer you from Da Nang airport to the hotel in Hoi An.\nCheck in the hotel and feeling the peace in Hoi An town by your own.\nHoi An old town is built in the past with the combination of Japanese, Chinese and Vietnamese architecture. Walking time is the best way to visit Hoi An town with old pagodas, temples, local houses and also you can see the local people’s style life, local food what locals is eating,.. you also can go to the silk shop where you can make a costume tailor – best place to make a costume tailor in Vietnam\nOvernight at hotel in Hoi An.\n"},{"title":"Day 4: Hoi An – My Son sanctuary 1 day tour (Meal: B,L)","description":"7:30 – 8:0: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide. \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon River. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch.Overnight at hotel in Hoi An."},{"title":"Day 5: Hoi An free time – Overnight train to Hanoi (Meal: B)","description":"Hoi An old town is built in the past with the combination of Japanese, Chinese and Vietnamese architecture. Walking time is the best way to visit Hoi An town with old pagodas, temples, local houses and also you can see the local people’s style life, local food what locals is eating,.. you also can go to the silk shop where you can make a costume tailor – best place to make a costume tailor in Vietnam\nDriver will pick you up and transfer you to Da Nang train station for train to Hanoi.\nTrain takes about 16 hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight at on the train."},{"title":"Day 6: Hanoi arrival – Train station pick up – Hotel check in (Meal: No)","description":"Welcome to the capital of Vietnam. Your driver is ready to pick you up and drive to the hotel in Hanoi old quarter. Check in the hotel and exploring Hanoi old quarter by your own.\nOvernight at hotel in Hanoi.\n"},{"title":"Day 7: Hanoi – Halong Bay – Overnight on Halong Cruise (Meal: B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise"},{"title":"Day 8: Halong Bay – Kayaking – Hanoi ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi"},{"title":"Day 9: Ninh Binh - Hoa Lu – Tam Coc - Cycling Tour (Meal: B,L)","description":"8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2 Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong River. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi.\n\n"},{"title":"Day 10: Hanoi Departure (Meal: B)","description":"Today, you are free to discover Hanoi old quarter by your own until the transferred time to Noi Bai airport for your flight out. Trip ends.\nIf you don’t want to leave, please let us know to help you extending your vacation.\nThis package is based on group joining, there is a different group each trip.\nWho should participate? - This tour is suited for all, including children as well.  \nPrice structure: - Price quoted is based on per person\nIf you are Solo traveller, you will stay at Share Dorm room at hostel during your vacation.\nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! "}]},{"name":"Mekong Delta Discovery Tour from Saigon to My Tho, Ben Tre, Can Tho & Chau Doc","duration":6,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":875,"summary":"Joining – day trip to discover all the best highlights of the South, visitors could enjoy almost every landmarks dotting in Cu Chi, My Tho, Can Tho, Chau Doc and Ho Chi Minh City. Besides observing the local life and natural beauty of countryside, guests could participate in various exciting activities on floating markets, tasting fruit orchards, visiting fish-breeding villages, and so on.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171056_a749caf0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171056_a749caf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_1a644721.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_89a35ca2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_3542695b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_efedefbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_60633ad7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_a0d83877.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_9c996545.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_aa357c58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_89bae508.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_6a20955b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_12e6000e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_ef36cdc4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_61110213.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_6e4cd413.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_e9d4595a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_6bc4ab8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171056_c06e9734.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Cai Rang","Chau Doc"],"timeline":[{"title":"DAY 1: ARRIVAL – HO CHI MINH CITY","description":"On arrival at Tan San Nhat Airport, you are met by our guide and transferred to hotel. The bustling Ho Chi Minh City, still called Saigon by many locals, is a center of commerce, finance, culture and tourism in Vietnam. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. ( If time permits) we stroll around the down town to explore the different local ways of life.\nO/N in Ho Chi Minh City."},{"title":"DAY 2: HO CHI MINH CITY PACKAGE TOURS & CU CHI TUNNELS (B)","description":"Today we spend a half day exploring the captivating Ho Chi Minh City. The most places of interest are located near the town center. We pass by the now-demolished wartime American Embassy on our way to the Reunification Palace. This famous edifice was a former residence of the President of Southern Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. We follow these with a visit to the Jade Emperor Pagoda and the War Remnant Museum with a wealth of images from the notorious conflicts. The sightseeing ends up with a walk around the retail Ben Thanh Market where anything and everything is for sale!\nAfternoon: Transfer about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range\nO/N in Ho Chi Minh City."},{"title":"DAY 3: HO CHI MINH TRAVEL PACKAGE TO MY THO – CAN THO TRAVEL PACKAGE (B/L/-)","description":"Start from Ho Chi Minh City and depart for My Tho and visit the Vinh Trang Pagoda. Then, take a boat along the river to see the typical stilt houses and fruit plantations of the area. Proceed to Tortoise Island and enjoy lunch in a local restaurant. Continue by boat under the shade of the water coconut trees and visit a family business that epitomizes the idyllic rural lifestyle. Take a row-boat along the creeks, and then stroll through the fruit plantations and village. Continue to Can Tho for your overnight stay.\nO/N in Can Tho."},{"title":"DAY 4: CAN THO CRUISING TOUR TO CAI RANG – CHAU DOC PACKAGE TOUR (B/L/-)","description":"Start with an early morning boat trip to Cai Rang Floating Market and marvel at the mounds of fruit and vegetables on display as you experience the market at its busiest time of day. Cruise through the small channels to visit a rice noodle making village, and then break for lunch. Proceed to Chau Doc and venture into the Tra Su Cajuput Forest to visit a wild bird sanctuary. Discover the diversity of the splendid canals deep in the forest as you look for storks, cranes and other tropical birds. Return to Chau Doc to check in to your overnight accommodation.\nOvernight in Chau Doc."},{"title":"DAY 5: CHAU DOC TRAVEL PACKAGE – HO CHI MINH CITY (B)","description":"Following breakfast in the early morning, go for a short walk before pick-up at the river bank. Journey to the fish farms and floating village of the Cham community, before taking the bus to back Ho Chi Minh City. \nO/N in Ho Chi Minh."},{"title":"DAY 6: HO CHI MINH – DEPARTURE (B)","description":"Breakfast at the hotel. Free for your own activities until transfer to Tan Son Nhat airport for departure."}]}]