[{"name":"Vietnam Express Southbound","duration":10,"travelStyle":["Discovery","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1130,"summary":"Discover the essence of captivating Vietnam on this ten-day tour through backstreets, villages, cities and waterways. Trace the east coast on this fast-paced adventure and take in World Heritage-listed landscapes and towns, feel the buzz of bustling cities and fuel yourself with banh mi and condensed milk coffee. As lively as it is lovely, Vietnam can seem an intimidating place to travel, but our local leaders will guide you to the best street food (and tell you how to order it), introduce you to fishermen on the Mekong Delta and give you the inside scoop on the best tailors in Hoi An. This is an adventure full of life, colour and flavour that introduces you to the highlights of this fascinating nation. In order to see as much as possible, this trip involves some long journeys, including by overnight train where the amenities are shared and basic. For more about what this experience is like, see our blog post here: https://www.intrepidtravel.com/adventures/what-to-expect-on-an-overnight-train-in-vietnam/. The motorbike tour of Hue has been assessed for safety and is closely monitored (helmets are provided). However, alternative transport can be arranged for those who would prefer not to travel by motorbike.Depending on where you come from, the weather in Vietnam might be hotter and more humid than what you are used to. Please consider your suitability for the season you wish to travel in. Check out https://www.intrepidtravel.com/vietnam/weather-in-vietnam for more info.This itinerary also runs in reverse, from Ho Chi Minh City to Hanoi. Enter trip code TVSQ on our website for details.This trip is a great way to see a lot of Vietnam in a relatively short period of time. If you would like a longer tour in Vietnam, maybe check out Best of Vietnam (TVST).You may also want to check out our South East Asia Loop (TTSVC), or our Best of Vietnam & Cambodia (TVSKC) if you have longer time to explore in the region.","highlights":["Enjoy a private cruise in Halong Bay","Explore bustling Ho Chi Minh City","Discover the Forbidden Purple City","Sightsee in Hue on a motorbike"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1842_5df9dc69aeab7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1842_5df9dc69aeab7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_5f81c574.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_b3b74925.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_1ae0aea7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_7d903926.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_7286b96e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_1972393e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_42631885.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_cf8285ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_0e79f70b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_a362330a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_baac68e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_13b95c6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_39cad867.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_95335740.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_e18c7fcf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_fa24e292.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1842_00665aeb.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Hanoi! Your adventure begins with a welcome meeting at 6 pm and is followed by a group dinner at KOTO restaurant. This organisation is dedicated to developing the hospitality careers of disadvantaged youth.\n\nIf you arrive before your tour begins there’s plenty to see and do. Consider booking the Hanoi Morning Highlights Urban Adventure, a wide-ranging tour with a local expert guide. This optional tour visits the Temple of Literature, stops by a traditional tea house, and takes you through the Hoa Lo Prison Memorial before concluding at Hoan Kiem Lake. Or maybe take it at your own pace and wander the Old Quarter to admire the city’s French-colonial architecture.\nAccommodation: Hotel"},{"title":"Day 2: Halong Bay","description":"Travel by private minibus to World Heritage-listed Halong Bay, which is dotted with sandy coves, grottoes and 1600 limestone islands formed over millennia by wind and water erosion (approximately 4 hours). Board a private boat and cruise the bay, exploring Surprise Cave and perhaps even enjoying a swim from Ti Top Island Beach during the warmer months. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. To end the day, spend an evening aboard the boat beneath the night sky. What better way to get to know your fellow travellers than an old school sleepover in an unforgettable location?\nAccommodation: Overnight boat"},{"title":"Day 3: Hanoi – Overnight train","description":"Return by boat to Halong Bay. At approximately midday, return to Hanoi by bus. Arrive late this afternoon and enjoy free time until tonight’s train voyage. Be sure to grab a bowl of pho while you’re in town and slurp down this local specialty made from broth, noodles and meat. Maybe chill by Hoan Kiem Lake until you board an overnight train to Hue this evening.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hue","description":"Arrive in Hue at approximately 11 am and transfer to the hotel. Once the imperial capital of Vietnam, Hue holds the treasures of the country’s royal past. Enjoy free time in the morning to rest or explore. If you choose the latter (and who can blame you) the bustling Dong Ba Market is a great place to sample some of the specialties that once graced the Nguyen emperors' tables like banh khoai (royal rice cake). Reunite with the group to visit the war-damaged ruins of the Imperial Citadel, a sprawling city-within-a-city which contains the remains of temples, state houses and the emperor’s palace.\nAccommodation: Hotel"},{"title":"Day 5: Hue","description":"See Hue like a local – from the back of a motorbike! Straddle the saddle and whiz around town with a local guide, taking in historic and contemporary sights along the way. Stop at Thanh Toan to see the 18th-century covered bridge and villagers shopping at their local market. Visit the 17th-century active Buddhist monastery of Thien Mu Pagoda and see the car that belonged to Thích Quang Duc, the monk who self-immolated in 1963 in protest against the treatment of Buddhists by the South Vietnamese regime. For lunch, savour a vegetarian feast in a nunnery. Finish at the lakeside royal tomb of Emperor Tu Duc before heading back to town.\nAccommodation: Hotel"},{"title":"Day 6: Hoi An","description":"This morning travel by bus through coastal rice paddies and the spectacular Hai Van Pass (approximately 3 hours). After a photo stop en route, arrive into Hoi An. Recently declared a World Heritage site, Hoi An was a major international trading port during the 17th, 18th and 19th centuries. Today, parts of the beautifully-preserved town retain the feel of centuries past. It's also a shopping mecca, famous for its plethora of tailors. On arrival your leader will take you on a sightseeing walk through the Old Town to visit a handful of the city's major attractions. You’ll also be given a sightseeing pass so you can further explore select attractions at your leisure.\nAccommodation: Hotel"},{"title":"Day 7: Hoi An","description":"Today is a free day to explore Hoi An. Maybe browse the cobbled streets and art galleries or hire a bike and cycle through rice paddies out to Cua Dai Beach. Maybe browse for paintings, ceramics and colourful cloth lanterns in the town’s markets and preserved Chinese shophouses. If you’re craving a new look, you could pay a visit to one of the hundreds of tailors and get something special made. Hoi An is also known for its delicious regional food, so be sure to enjoy a meal at a riverside restaurant or perhaps partake in a cooking class.\nAccommodation: Hotel"},{"title":"Day 8: Ho Chi Minh City","description":"Today take a short, early morning flight to Ho Chi Minh City (approximately 1.5 hours). Formerly known as Saigon, Ho Chi Minh City has a fascinating history and is arguably Vietnam’s capital of commerce and culture. After landing, take a sightseeing tour around the city by bus. Pass the Reunification Palace, Notre Dame Cathedral and the Opera House, then stop in at the War Remnants Museum to discover some of the sobering stories of the 20-year-long Vietnam/American War.\nAccommodation: Hotel"},{"title":"Day 9: Mekong Delta – Ho Chi Minh City","description":"This morning head out on a day trip to explore the Mekong Delta. Board a private boat to Ben Tre to visit the coconut gardens and stop at a local home to sample tropical fruits and coconut jams. Afterwards, paddle in sampans (small rowing boats) past coconut trees along the Mekong Delta. Take a tuk-tuk tour around the villages and learn about rural life and the industry created around coconut products like brooms and coconut fibre mats. Eat lunch at a restaurant in the heart of the Delta, sampling regional specialties such as the famous elephant ear fish. Cruise the major waterways to Ben Tre boat pier, then return by bus to Ho Chi Minh City. This evening, perhaps head out to sample some local specialties as a final farewell with your fellow travellers and leader.\nAccommodation: Hotel"},{"title":"Day 10: Ho Chi Minh City","description":"There are no activities included and you’re free to depart your accommodation at any time as long as you comply with check out time. If you would like to spend some more time in Ho Chi Minh City, we’re happy to organise additional accommodation (subject to availability). Ask your group leader or booking agent for more recommendations or help booking an Urban Adventure if you plan to stay."}]},{"name":"Vietnam Intro - 9 Day","duration":9,"travelStyle":["Discovery","Boat","Adventure","Group","Fully Guided","Easy"],"oldPrice":0,"price":909,"summary":"Vietnam Intro is the most amazing way to experience Vietnam! You’ll discover crazy Hanoi, experience the stunning Ha Long Bay, stay on your own private island, go sea kayaking, crab fishing with traditional fisherman, soak up fascinating local culture, learn to cook delicious Vietnamese food, relax on beautiful beaches, party the night away and much more. And you’ll have an awesome Group Leader with you from the moment you step off the plane, an instant group of friends to share your adventure with and help with all your onward travel. Get ready for the trip of a lifetime!\n+ We'll plant 10 trees for every INTRO Travel tour booking!","highlights":["Save Now, Travel Later with Unlimited Date Changes","An amazing itinerary with all activities included","Explore Hanoi by Rickshaw","Sail the magical Ha Long Bay","Stay overnight on your own private Island","Learn to cook delicious Vietnamese food","Bicycle and Riverboat tour of Ninh Binh","Experience local life"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/91425_5e3ce4436b84e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/91425_5e3ce4436b84e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e3ce4436b853.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e3ce4436b855.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5eea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e3ce4436b857.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_99215f90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_45f829bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_d1a22bbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_ed16ee52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_fc029fd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_ff2d9cd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_28a76aee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5efa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_0ffe00ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5efd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5efe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_5e68406eb5f08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91425_47c3aee9.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hoi An"],"timeline":[{"title":"Vietnam Intro Begins!","description":"Landing in Hanoi, we’ll meet you at the airport and take you to your boutique hostel in the heart of the old town. Meet up with your travel crew and get excited for the adventures to come."},{"title":"Discover Hanoi","description":"We’ll jump straight into the hustle and bustle of Hanoi today with a walking and rickshaw tour of the city. Soak in daily life in the chaotic capital and fill up on spicy spring rolls and tasty street food. This evening we’ll be heading out for dinner and drinks to see what Hanoi has to offer after dark."},{"title":"Ha Long Bay Overnight Boat","description":"From Hanoi we’ll travel to Ha Long Bay, where we’ll cruise the emerald green waters surrounded by limestone mountains, feeling like we’re not quite on this planet. The secret caves and coves will prove too much to resist, so we’ll jump into kayaks to explore further before settling down for the evening on our overnight boat complete with hot tub and bar. "},{"title":"Ha Long Bay Private Island Stay","description":"Waking up to gorgeous Ha Long Bay shimmering in the sunshine, you’ll be glad to know you’ve got one more night in this watery paradise. We’ll continue our boat journey until we arrive at our very own private island, our home for the night. "},{"title":"Ha Long Bay & Ninh Binh Homestay","description":"The rice paddies and vast limestone mountains of Ninh Binh await us today, where we’ll be staying at a local homestay in traditional bungalows right by the river. "},{"title":"Ninh Binh & Overnight Train","description":"Heading out to explore the countryside retreat of Ninh Binh, we’ll take to two wheels to weave through the rice paddies before taking a local row boat through the network of rivers and caves. We’ll finish our time here with a sunset hike to the Dragon Mountain viewpoint, before boarding our overnight train bound for Hoi An."},{"title":"Arrive in Hoi An","description":"Beautiful, historical Hoi An will win you over in an instant as we arrive this morning. We’ll check in to our hotel, then this afternoon you’ll have time to explore, go shopping, or perhaps visit a local tailor to get a custom suit or dress made."},{"title":"Hoi An, Basket Boat Tour with Crab Fishing & Cooking Class","description":"Local fishermen will be our guides today as we weave through coconut groves, teaching\nus the art of crab fishing. We’ll then take part in a hands on cooking class to become masters of all things Vietnamese cuisine."},{"title":"Head home or stay on longer in Hoi An","description":"Your unforgettable 9 day adventure will come to an end here. Those flying home will make their way to the airport, or keep living the dream and extend your stay in Vietnam or South East Asia with our help and the new friends you’ve made. "}]},{"name":"South to North Vietnam - 10 Days","duration":10,"travelStyle":["Discovery","Group","Fully Guided","Coach / Bus","Holiday"],"oldPrice":960,"price":653,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n\nDiscover all the incredible sights of Vietnam on a comprehensive ten-day tour from South to North of Vietnam! Discover Ho Chi Minh City, Da Nang City, Hoi An Old City, Ha Noi and Ha Long Bay overnight, explore the Cu Chi tunnels, My Son Sanctuary, Hoi An Walking Town, Ha Long Bay and more.","highlights":["Connect with locals and cruise to Cai Be Floating Market","Visit the My Son Sanctuary and the Temple of Literature","Explore the remarkable Vietnamese countryside on bike","Swim in the emerald waters of the stunning Ha Long Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/59429_5dfabf9e33205.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/59429_5dfabf9e33205.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_35c2ec8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_c7b4b164.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_82678fcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_71eaaa05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_99d12b05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_2379844f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_abaf9d63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_e876deaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_a1ab99d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_1978d8d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_d1800c62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_ba2cb2ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_c1ab863b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_2303807e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_c0589fd7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_047cc947.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59429_8b075819.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Arrival","description":"Pick-up and welcome at the airport with the transfer to your hotel. Overnight in Ho Chi Minh City."},{"title":"Day 2: Mekong Delta &ndash; Cai Be floating market (BL) by minivan &ndash; 2 hours","description":"The day will begin with a two-hour ride from Ho Chi Minh City to the Mekong Delta. You will: take a boat cruise to one of the highlights of the Mekong-Cai Be Floating Market; stop over at a local house to watch how locals make coconut candy, rice-paper, rice-popcorn and rice wine; spend time amidst local farmers, enjoying traditional music and tropical fruits on Tan Phong Islet, lunch on a local specialty- \" Elephant Ear Fish “ at a local home. Overnight in Ho Chi Minh City."},{"title":"Day 3: Cu Chi Tunnels - Da Nang (BL) by flight &ndash; 1 hour","description":"Explore the famous Cu Chi tunnel complex for fascinating and informative insight into how Vietcong lived in this underground military base. After lunch at a local Vietnamese restaurant, transfer to airport for a flight to Da Nang. Upon arrival, pick up and transfer to the hotel. Overnight in Da Nang."},{"title":"Day 4: Da Nang (B)","description":"2019: Day 4 Da Nang - My Son Sanctuary (B)</br>\nAfter breakfast, a visit to the My Son Sanctuary is an experience that should not be missed while visiting the beautiful city of Hoi An: wander around the lost Champa Kingdom that dates back to the 3rd century, explore the temples and learn about the fascinating history behind this sanctuary of Hinduism. Free time in the afternoon. Overnight in Da Nang.</br>\n2020: Day 4 Da Nang - Free day (B)</br>\nFree as your leisure day (optional tour are available). Overnight in Da Nang."},{"title":"Day 5: Da Nang - Hoi An (B)","description":"2019: Day 5: Da Nang - Hoi An - Ann Tailor for a free tailor-made item of clothing - Hoi An City Tour (B)</br>\nCheck out. Transfer to Hoi An and contact Ann Tailor to have a free tailor-made item of clothing. In the afternoon, exploring Hoi An ancient town on foot is one of the best ways to absorb the beauty of this city. Overnight in Hoi An.</br>\n2020: Day 5: Da Nang - Hoi An City Tour - Ann Tailor for a free tailor-made item of clothing - My Son Sanctuary (B)</br>\nCheck out. Transfer to Hoi An and explore Hoi An ancient town on foot is one of the best ways to absorb the beauty of this city. Contact Ann Tailor to have a free tailor-made item of clothing after the tour. In the afternoon, visit My Son Sanctuary - an experience that should not be missed while visiting the beautiful city of Hoi An: wander around the lost Champa Kingdom that dates back to the 3rd century, explore the temples and learn about the fascinating history behind this sanctuary of Hinduism. Overnight in Hoi An."},{"title":"Day 6 Hoi An &ndash; Foodie tour (BL)","description":"Discover Hoi An’s countryside and its local food by bicycle. We will past verdant rice-paddies to visit a very local village. Sample the traditional Hoi An specialty, Cao Lau. Learn how to make the local delicacy- White Rose. Move on to Cam Nam to sample some Ying and Yang food balancing favorites. Overnight in Hoi An."},{"title":"Day 7: Hoi An &ndash; Da Nang &ndash; Ha Noi City Tour (BL) by flight &ndash; 1 hour","description":"Have breakfast. Check out. Transfer to Da Nang for flight to Ha Noi. Once arrived in Ha Noi, you visit the Temple of Literature (The first Imperial School in Vietnam), Hoan Kiem Lake, the Jade Mountain Temple, But Tower (Pen-Shaped Tower), Dai Nghien (Ink Stand), The Red – painted wooden and the Huc Bridge…Have a cyclo (pedicab) ride around Ha Noi ancient town. Overnight in Ha Noi."},{"title":"Day 8: Ha Noi - Ha Long Bay (BLD) &ndash; by shuttle bus","description":"The shuttle bus will pick you up at your hotel and depart for Ha Long Bay. Cruise past exquisite scenery; limestone islands majestically rising out of emerald water, seductively scattered with grottoes and caves. Overnight on the Junk Cruise."},{"title":"Day 9: Ha Long Bay - Ha Noi (BL) &ndash; by shuttle bus","description":"After breakfast, swimming and sunbathing. After lunch, return to Ha Noi. Overnight in Ha Noi."},{"title":"Day 10: Departure (B)","description":"Breakfast and free time until time to go to the airport for departure flight. Transfer to Noi Bai International Airport."}]},{"name":"Vietnam Intro - 12 Day","duration":12,"travelStyle":["Discovery","Boat","Adventure","Group","Fully Guided","Easy"],"oldPrice":0,"price":1169,"summary":"Vietnam Intro is the most amazing way to experience Vietnam! You’ll discover crazy Hanoi, experience the stunning Ha Long Bay, stay on your own private island, go kayaking, crab fishing with traditional fisherman, soak up fascinating local culture, learn to cook delicious Vietnamese food, relax on beautiful beaches, party the night away and much more. And you’ll have an awesome Group Leader with you from the moment you step off the plane, an instant group of friends to share your adventure with and help with all your onward travel.\n+ We'll plant 10 trees for every INTRO Travel tour booking!","highlights":["An amazing itinerary with all activities included","Explore Hanoi by Rickshaw","Sail the magical Ha Long Bay","Stay overnight on your own private Island","Learn to cook delicious Vietnamese food","Experience local life","Mekong Delta & Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/91474_5e3ce291a1f58.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/91474_5e3ce291a1f58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e3ce291a1f5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5dfc220d85901.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5dfc220d8bc0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5dfc220d95e49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_f95d2c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5dfc220dbe899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b1a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5e68402175b1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_effeb238.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_6021934c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5df987cfbcd02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/91474_5df987cfe3fa3.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Vietnam Intro Begins!","description":"Landing in Hanoi, we’ll meet you at the airport and take you to your boutique hostel in the heart of the old town. Meet up with your travel crew and get excited for the adventures to come."},{"title":"Day 2: Discover Hanoi","description":"We’ll jump straight into the hustle and bustle of Hanoi today with a walking and rickshaw tour of the city. Soak in daily life in the chaotic capital and fill up on spicy spring rolls and tasty street food. This evening we’ll be heading out for dinner and drinks to see what Hanoi has to offer after dark."},{"title":"Day 3: Ha Long Bay Overnight Boat","description":"From Hanoi we’ll travel to Ha Long Bay, where we’ll cruise the emerald green waters surrounded by limestone mountains, feeling like we’re not quite on this planet. The secret caves and coves will prove too much to resist, so we’ll jump into kayaks to explore further before settling down for the evening on our overnight boat complete with hot tub and bar."},{"title":"Day 4: Ha Long Bay Private Island Stay","description":"Waking up to gorgeous Ha Long Bay shimmering in the sunshine, you’ll be glad to know you’ve got one more night in this watery paradise. We’ll continue our boat journey until we arrive at our very own private island, our home for the night."},{"title":"Day 5: Ha Long Bay & Ninh Binh Homestay","description":"The rice paddies and vast limestone mountains of Ninh Binh await us today, where we’ll be staying at a local homestay in traditional bungalows right by the river."},{"title":"Day 6: Ninh Binh & Overnight Train","description":"Heading out to explore the countryside retreat of Ninh Binh, we’ll take to two wheels to weave through the rice paddies before taking a local row boat through the network of rivers and caves. We’ll finish our time here with a sunset hike to the Dragon Mountain viewpoint, before boarding our overnight train bound for Hoi An."},{"title":"Day 7: Arrive in Hoi An","description":"Beautiful, historical Hoi An will win you over in an instant as we arrive this morning. We’ll check in to our hotel, then this afternoon you’ll have time to explore, go shopping, or perhaps visit a local tailor to get a custom suit or dress made."},{"title":"Day 8: Hoi An, Basket Boat Tour with Crab Fishing & Cooking Class","description":"Local fishermen will be our guides today as we weave through coconut groves, teaching\nus the art of crab fishing. We’ll then take part in a hands on cooking class to become masters of all things Vietnamese cuisine. "},{"title":"Day 9: Fly to Ho Chi Minh City","description":"Taking to the skies, we’ll head south to the bustling city of Ho Chi Minh. The rest of the day will be yours to explore as you wish."},{"title":"Day 10: Mekong Delta","description":"Today we’ll explore the incredibly lush green beauty of the Mekong Delta. See how locals live and work on the river, visit local villages, and stay tonight in a local homestay."},{"title":"Day 11: Cu Chi Tunnels","description":"The Cu Chi Tunnels are on the agenda for today. This network of hand dug underground tunnels played a crucial role in the Vietnam War, providing supply routes, hideouts and living quarters for soldiers. Arriving back into Ho Chi Minh City in the afternoon, we’ll be dressing sharp for our farewell dinner and party this evening."},{"title":"Day 12: Check Out and Onward Travel","description":"Your unforgettable 12 day adventure will come to an end today. Those flying home will make their way to the airport, or keep living the dream and extend your stay in Vietnam or South East Asia with our help and the new friends you’ve made."}]},{"name":"Vietnam Express Northbound","duration":10,"travelStyle":["Adventure","Group","Fully Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1135,"summary":"Go behind the scenes of Vietnam’s hot-spots on a small-group adventure that avoids the tourists. ","highlights":["Beatiful and historic Ho Chi Minh City","A motor bike ride to the Forbidden Purple City","Picturesque fishing village of Lang Co","Marvelous lakes and architecture in Hanoi"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1840_5dfb5e0a46c8f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1840_5dfb5e0a46c8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_6487ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_74859726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_a02194e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_237fca98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_fe00b3d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_985f51ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_6fc50f9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_8f5c6d4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_19dc10d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_432a5cfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_ec568350.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_8be882f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_4eb46e49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_6a58d77a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_4e1db0a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_f7e491fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1840_a3126532.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm. As this trip doesn’t spend much time in Ho Chi Minh City, why not arrive a day or two early to see the sights? We’ll be happy to book some additional accommodation for you (subject to availability). Ho Chi Minh City has a dynamic atmosphere and a French influence. Perhaps head to Pham Ngu Lao Street to see the local open-aired market, visit Vinh Nghiem Pagoda or take an Urban Adventure with an expert local guide. After the meeting, why not get to know your fellow travellers and the flavours of Vietnamese cuisine over an optional group dinner.\nAccommodation: Hotel"},{"title":"Day 2: Mekong Delta - Ho Chi Minh City","description":"Today you'll travel south by private minibus (approximately 3 hours) and spend the day exploring the Mekong Delta. On arrival, board a private boat and traverse the intricate waterways – soak up the tranquil surrounds and admire the breathtaking views as you float through this fertile landscape, often referred to as ‘the rice bowl of Vietnam’. Disembark at Ben Tre and visit the coconut gardens, stopping at a local home to sample tropical fruits and coconut jams before paddling in sampans (small rowing boats). Take a tuk-tuk tour around the villages, learning about rural life and how the locals make their living. Enjoy lunch at a restaurant in the heart of the delta, sampling regional specialties such as the famous elephant ear fish. Then it’s back to the boat to cruise the delta’s major waterways to Ben Tre boat pier. After the cruise, return via bus to Ho Chi Minh City.\nAccommodation: Hotel"},{"title":"Day 3: Hoi An","description":"This morning, say goodbye to Ho Chi Minh City and fly north to Danang (approximately 1 hour 30 minutes). From here you’ll take a 45-minute bus ride to Hoi An, with the five spectacular peaks of the Marble Mountains as a backdrop. Once in Hoi An, your leader will take you on a walking tour of this unique town, influenced over the years by Europe, China and Vietnam. The town was a major trading port from the 17th century onwards, and the outside influences can be seen all over its architecture, with pagodas and assembly halls found across the town. For a small place it has a liveliness alongside its charm and serenity. The tour will take you down the streets that are being restored and look much like they did over a century ago. Past low tiled buildings, you'll take in a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum.\nAccommodation: Hotel"},{"title":"Day 4: Hoi An","description":"Enjoy a free day in the World Heritage-listed Hoi An. You may like to wander the Central Market and the street stalls selling paintings, woodwork, ceramics, lanterns and much more. Hoi An is also famous for its talented tailors who can make beautiful items to order within a few hours. For those still feeling adventurous, why not hire a bicycle and tour the surrounding countryside? This is one of the best ways to get an insight into rural Vietnam. Other optional activities include a day trip to My Son Cham, an elaborate World Heritage-listed temple that reflects the rich cultural traditions of the Cham civilisation, a cruise along the Thu Bon River and a trip to the nearby Cua Dai Beach.\nAccommodation: Hotel"},{"title":"Day 5: Hue","description":"Leave Hoi An today and journey across the dramatic Hai Van Pass, a sometimes bumpy but incredibly scenic stretch of highway with views of Lang Co Beach. Make a quick photo stop enroute then continue to your destination of Hue, the former imperial capital of Vietnam (approximately 5 hours including stops). Hue contains the treasures of Vietnam’s royal history and has an interesting blend of bustling streets and tranquil settings. Join your leader for a tour of the Imperial Citadel – this fortress houses the Imperial City and the citadel-within-a-citadel, the Forbidden Purple City. This icon was almost completely destroyed during the Vietnam/American War, and the ruins and holes left by bombs are a reminder of the destruction that was caused. In your free time you might like to visit Dong Ba Market, which offers locally made goods, fresh produce and tantalising street food.\nAccommodation: Hotel"},{"title":"Day 6: Hue - Overnight Train","description":"Today’s adventure will be on the back of a motorbike. You’ll have your own driver who will take you first on a drive around the Imperial Citadel, then to the Thien Mu Pagoda, the unofficial symbol of Hue. This site dates back to 1601 and is still an active Buddhist monastery. Here you’ll also see the car left by a monk who set himself alight to protest the treatment of Buddhists by the South Vietnamese regime. Ride to a special lunch spot at a convent or Buddhist monastery for a delicious vegetarian feast, then drive to the royal tomb of Emperor Tu Duc, set amid a lake, frangipani bushes and pine trees. In the evening, board an overnight train to Hanoi (approximately 12 hours).\nAccommodation: Overnight sleeper train"},{"title":"Day 7: Hanoi","description":"Arrive in Hanoi early in the morning and transfer to your hotel. Vietnam’s capital is famous for its beautiful lakes, shaded boulevards, public parks and beautiful Old Quarter. As an emerging city in South East Asia, Hanoi has an attractive contrast of modern office buildings, old Buddhist temples and a labyrinth of ancient streets. Later in the day, take a walking tour through the city where you’ll see Ho Chi Minh’s former stilt house and other icons such as the Temple of Literature. In your free time, perhaps stop by the ’36 Streets’ of the historic Old Quarter, head to the beautiful Hoan Kiem Lake, or visit the Fine Arts Museum. This museum plays a crucial role in maintaining and promoting the cultural heritage of Vietnam’s ethnic communities.\nAccommodation: Hotel"},{"title":"Day 8: Halong Bay","description":"Travel by private minibus to the spectacular World Heritage site of Halong Bay (approximately 4 hours). This is one of Vietnam’s most beautiful places, a secluded bay of emerald waters flecked with limestone islands and caves. Here you’ll go on a cruise to explore Surprise Cave and surrounding rock formations, and in the warmer months perhaps go kayaking or opt for a swim from Ti Top Island. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. On board your ship, there’ll be a dining room and bar on board where you’ll enjoy your meals, including fresh seafood for lunch and dinner. Spend the night on board the boat beneath a sky alive with starlight.\nAccommodation: Overnight boat"},{"title":"Day 9: Hanoi","description":"Leaving the memorable scenery of Halong Bay behind, return by bus to Hanoi (approximately 3.5 hours). Arrive in Hanoi late this afternoon and enjoy some free time to explore Hanoi's sights or do some last-minute shopping. Otherwise, why not relax at a cafe or stop for a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter? Tonight there will be a farewell dinner to enjoy with the group at KOTO restaurant, an organisation that supports disadvantaged youth with careers in the hospitality industry.\nAccommodation: Hotel"},{"title":"Day 10: Hanoi","description":"Today your exploration of Vietnam comes to an end. There are no activities planned for the final day however you may consider continuing your adventure with a short tour such as ‘Hanoi Street Food by Night’ or ‘Village Discovery by Bike’ with our partners Urban Adventures (see urbanadventures.com for more information). Alternatively, perhaps visit the Hoa Lo Prison aka the ‘Hanoi Hilton’ which was used for prisoners of war during the Vietnam War. There’s also the Museum of Ethnology with its fascinating indoor and outdoor exhibits. We’ll be happy to book some additional accommodation for you (subject to availability), just ask at the time of booking."}]},{"name":"Vietnam: Noodles & Nightlife","duration":12,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":879,"price":747,"summary":"Now's the time to explore Vietnam on your terms with this tour that's affordable for young travellers. Savour your way through Nha Trang on a street food crawl, step into turquoise-coloured paradise in Ha Long Bay, and get some good stories to take back home in bustling Hanoi. With a mix of highlights and free reign to explore how you'd like, this is one introduction to Southeast Asia you won't ever forget.","highlights":["Relax on the sun-kissed beaches of Nha Trang","Stroll through picturesque river-side Hoi An","Take a rik-shaw ride through imperial Hue","Marvel at Ha Long Bay's iconic limestone islands"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/5583_d8dd7f22.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/5583_d8dd7f22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_b4c64ac2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_5a74deb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_be945279.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_96cadacb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_9d1e54c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_4bcbe1c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_a67f5f07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_1edfc263.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_d612483d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_83e20f69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_f728d65f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_a7edfc32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_2ea3637e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_abf0f93c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_0b561ab5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_f7dc2c2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5583_37249800.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Arrive at any time and welcome to the pulsing Ho Chi Minh City, also known as Saigon.\n\nFor your first night out, wander with your CEO and group through Pham Ngu Lao Street that’s popping with many bars and backpackers. Pick the best looking spot to get to know your fellow travellers and cheers to new adventures!\n\nAccommodation:\n- Phan Anh Backpackers Hostel (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n- Connect With New Friends\n\nAdditional Notes: Most nationalities require a visa to enter Vietnam. Please check with your travel agent or local Vietnamese Embassy regarding requirements.\n\n"},{"title":"Day 2: Ho Chi Minh City/Nha Trang (1B)","description":"Feel the pulse of Vietnam’s biggest city on a CEO-led orientation walk, with free time after to double back to your favourite spots. Shop 'til your heart's content, immerse yourself in local culture, or just wander the streets to take in the city's unique vibe. Tonight, catch up on sleep on an overnight train to Nha Trang.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 10:00 - 11:00 Hr(s)\n\nIncluded Activities:\n- Orientation Walk\n\nAdditional Notes: During January/February, Tết (the Vietnamese Lunar New Year) sees millions of Vietnamese commute to be with their families and celebrate. While this is a fascinating time to travel through Vietnam, availability of transport may mean that we will replace the overnight train with an overnight bus.\n\n"},{"title":"Day 3: Nha Trang","description":"You’ve arrived! Welcome to the eastern sea. Take this morning to explore local shops and markets, rejuvenate in a therapeutic mud bath, relax on the beach, or visit nearby historical sites before an evening street food crawl.\n\nAccommodation:\n- Bondi Backpackers Nhatrang (or similar).\n\nIncluded Activities:\n- Street Food Crawl\n\n\n"},{"title":"Day 4: Nha Trang/Da Nang (1B)","description":"It’s not over yet. There’s more free time to explore Nha Trang today, so soak it all in. Then, hop on an overnight train to continue to Hoi An, stopping first in Da Nang for a short transfer.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 09:00 - 10:00 Hr(s)\n\n\n"},{"title":"Day 5: Da Nang/Hoi An","description":"From Danang, it is only a short drive to the picturesque port town of Hoi An. Once known as Faifo, it was an important trading town with strong south Chinese influence and connections.\n\nAccommodation:\n- Hoi An Paradise Hostel (or similar).\n\nTransport:\n- Private Vehicle: Da Nang to Hoi An 00:45 Hr(s)\n\nIncluded Activities:\n- Hoi An Orientation Walk\n- Big Night Out\n\n\n"},{"title":"Day 6: Hoi An (1B, 1L)","description":"Noodles might be fun to eat, but they’re even more fun to make. Find out how during a visit to G Adventures-supported Oodles of Noodles. The rest of the day is yours, so see what you can discover. Choose to visit the ancient ruins of My Son, a UNESCO World Heritage Site, or cruise down the Thu Bon River.\n\nAccommodation:\n- Hoi An Paradise Hostel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 7: Hoi An/Huế (1B)","description":"Pre-book the \"Hue Motorbike Tour\" on the checkout page ahead of time to include this speedy activity on your tour.\n\nAccommodation:\n- DMZ Hostel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 8: Huế/Phong Nha (1B)","description":"Your second day in Huế comes with more free time to enjoy the city. In the afternoon, travel through Vietnam's stunning countryside to the green rocky mountains of Phong Nha-Kẻ Bàng National Park.\n\nAccommodation:\n- Sai Gon Phong Nha Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 9: Phong Nha/Hanoi (1B)","description":"Today, opt to head underground to explore the awe-inspiring caves of Phong Nha-Kẻ Bàng National Park, where the oldest karst mountains and longest cave in Asia are found. Then it’s an overnight train to Hanoi.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds)\n\nOptional Extras to chose from:\n- Caving in Phong Nha\n\nAdditional Notes: Pre-book the full-day Caving in Phong Nha adventure to explore the longest cave in Asia, Paradise Cave, with massive stalactites. Enjoy a sumptuous Vietnamese lunch, then boat to the turquoise beach of Phong Nha Cave.\n\n"},{"title":"Day 10: Hanoi/Ha Long (1B, 1L)","description":"After arriving in Hanoi, the bustling capital of Vietnam, take a private bus to the iconic Halong Bay for a seafood lunch cruise and cave exploring. Be sure to charge your camera so you can grab a shot truly worth sharing!\n\nAccommodation:\n- Gold Mark Hotel Halong (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Private Vehicle: Hanoi to Ha Long 04:00 Hr(s)\n\nIncluded Activities:\n- Hạ Long Bay Junk Boat Trip\n\n\n"},{"title":"Day 11: Ha Long/Hanoi (1B)","description":"Interested in local cuisine? Opt to pre-book the \"Hanoi Foodie Culture Tour\" activity on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- The Signature Inn (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\nIncluded Activities:\n- Old Quarter Orientation Walk\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 12: Hanoi (1B)","description":"Today, it’s time to say goodbye to your group of newfound friends. Be sure to sneak in some last-minute photos and exchange social medias before you head on your way.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]},{"name":"7 Days Discovery Central of Vietnam","duration":7,"travelStyle":["Discovery","Group","Partially Guided","Coach / Bus","Holiday"],"oldPrice":898,"price":494,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n\nThe Central part of Vietnam is extremely rich in heritage and history. This trip will give you chance to explore the best sightseeing of the Central of Vietnam, you have a 7-day tour package taking you through Da Nang, Hoi An, Hue, Quang Binh, visit Hoi An Old Town, My Son Sanctuary, Hue Citadel and Paradise Cave.\n","highlights":["Wander around the lost Champa Kingdom.","Bask in the amazing architecture of Hindu temples.","Step back in time and visit Vietnam battle sites.","Take a step in the mystical Paradise Cave.","Venture through tombs of royalty in Hue."],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/81794_92b83453.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/81794_92b83453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_3c4d8257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_6f9b4002.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_d618abe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_6cf9045a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_d243b093.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_95dd8ee7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81794_35dc0d2b.jpg"],"destinations":["Hoi An","Phong Nha-Kẻ Bàng National Park","Hue"],"timeline":[{"title":"Day 1: Da Nang – Arrival","description":"Pick-up and welcome at the airport with the transfer to your hotel.\nOvernight in Da Nang."},{"title":"Day 2 Da Nang – Quang Tri – Quang Binh (BLD)","description":"We will depart Da Nang and head for Quang Tri Province. Along the way, we will stop at a number of different battle sites to see the Quang Tri Citadel, Ben Hai River, Hien Luong Bridge, and Seventeenth Parallel - the former borderline between North and South Vietnam during the war. In the afternoon, we will visit the Vinh Moc Tunnels where North Vietnamese guerilla fighters lived and fought. We will continue on our way to Dong Hoi, check in at a hotel and relax for the night. Overnight in Quang Binh. \n"},{"title":"Day 3 Quang Binh - Paradise Cave – Hue (BLD)","description":"The day will begin with breakfast before driving to Paradis Cave. The cave was discovered by scientist of the British Caving Research Association in 2005, has the length of 31 km, the longest dry cave in Asia. With naturally primitive features Thien Duong cave look like a landscape painting, making it very attractive to visitors. According to spelunkers, the deeper one journey into the cave, the more one feels the wells of heavenly clarity all around. There are a series of white crystal stalactites resembling glass pillars and many other spectacular formations. After crossing an old forest, visitors see the entrance to the cave shaded by century-old trees and then dazzled by the mysterious beauty of stalactite pillars, each dozens of meters in diameter and grandiose rock arches, which are works made by the enchantment and sudden inspiration of the Creator over the past million of year. After visiting these legendary trails we will return to Hue after lunch. Overnight in Hue.\n"},{"title":"Day 4 Hue heritages – Hoi An (BL)","description":"Hue is a place that offers many cultural treasures: the tombs of kings, the imperial citadel and temples. In Vietnam there is no other place that has as many original historical remnants as this ancient capital. On this tour, we will visit the most famous landmarks situated within Hue’s borders, such as: Imperial Citadel, Thien Mu Pagoda or Khai Dinh Tomb, and Dong Ba Riverside Market.  Transfer to Hoi An. Overnight in Hoi An.\n"},{"title":"Day 5 My Son Sanctuary in the afternoon (B)","description":"My Son Sanctuary is an experience that should not be missed while visiting the beautiful city of Hoi An.  With us as your tour guide, enjoy a half-day trip to visit the capital and religious centre of the former Champa Kingdom, My Son, which has been designated as a UNESCO World Heritage site.  During a time spanning from the 4th to 8th centuries, when Tra Kieu (then known as Simhapura) served as the political capital of Champa, My Son was the site of the most important Cham intellectuals and a religious centre.\n\nIt is also believed that this site could have been used as a place of burial for Cham monarchs. My Son is considered to be Cham’s counterpart to the grand cities of South-East Asia’s other Indian influenced civilizations: Angkor (Cambodia), Bagan (Myanmar), Ayuthaya (Thailand), and Borobudur (Java). Overnight in Hoi An. \n"},{"title":"Day 6 Hoi An – Foodie tour (BL)","description":"Discover Hoi An’s countryside and its local foods by bicycle. We will start our tour with a ride through the countryside to a local village with a stop to enjoy a bowl of Cao Lau. Cao Lau is a traditional Hoi An specialty composed of local noodles, pork, fresh vegetables and rice paper. The noodles are made with local sticky rice soaked in the water that must be taken from Ba Le Well: the oldest well in Hoi An, believed to have the best water anywhere. You will also be able learn to make special white rose cakes with a local family and have the opportunity to enjoy them. Before the end of the tour, we will go to Cam Nam to enjoy the Ying and Yang food such as: Banh Dap, Che Bap. This tour is definitely an interesting journey. Overnight in Hoi An.\n"},{"title":"Day 7: Hoi An - Da Nang - Departure (B)</span><br/>","description":"Have breakfast in the hotel and relax.\nTransfer to the airport in Da Nang for departure flight."}]},{"name":"Vietnam's Essential Sapa","duration":6,"travelStyle":["Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Fully Guided","Hiking & Trekking","In-depth Cultural"],"oldPrice":0,"price":1210,"summary":"Travel to Sapa and uncover the jewel of Vietnam's verdant northwest. The region is home to terraced mountainsides descending into valleys like magnificent staircases, a multitude of minority cultures, and quaint villages hidden in the distant green hills. With plenty of scenery and exotic wildlife to discover, this is Vietnam at its picturesque best.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101914_31a803e8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101914_31a803e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_e883a494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_9fd870f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_2d6388c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_fe87ea2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_b76401d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_68a9b0e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_9d664f45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_9f6d2c28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_77c4732a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_ed2f9e21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_231cbb2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_be4640db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_2e4f334c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_ae5094ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_12b3aaea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_77c37db2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_c57e03d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_6776aec0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_96bc2c6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_d2e60344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101914_909d72b7.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to Hanoi. You will be met on arrival and transferred to your hotel. There will be a welcome meeting at 6 pm where insurance details and next of kin information will be collected. Please look for a note in the hotel lobby or ask the hotel reception where it will take place. If you can't arrange a flight that will arrive in time, you may wish to arrive a day early so you're able to attend the meeting. Subject to availability, additional accommodation may be arranged. If you find yourself with free time before the meeting, why not visit the Temple of Literature or Ho Chi Minh's Mausoleum.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 2: Sapa","description":"Your journey to the verdant mountains of northwest Vietnam begins with a private vehicle ride to Sapa (approximately 5 hours). Considered a summer capital by the French in the early 20th century, Sapa’s grown into the crown jewel of Vietnamese tourism since being opened to international visitors in 1993. The mix of ethnic cultures, eye-popping scenery and hill-tribe villages make it an ideal place to see on foot. Trek about 5 kilometres / 3.1 miles from the center of Sapa town to Cat Cat and return, one of the oldest Hmong ethnic minority villages in the region. Here you’ll see rice growing on terraced fields using traditional methods of cultivation, plus the Hmong people’s famed method of making cloth from hemp and dying it deep indigo.\nYou will have an evening to relax and enjoy crisp mountain air and vistas. \n\nNotes: Total trekking time today is 2.5 - 3 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 3: Sapa","description":"After breakfast meet your local guide and drive to Lao Chai. From here you delve deeper into serene Vietnam with a trek past isolated mountain hamlets to Ta Van (approximately 7km / 4.4mi). Passing rice terraces and farm animals you’ll have opportunities to learn about the daily life and traditional culture of the Hmong people. The trek may vary depending on local conditions. Afterwards you’ll need a well-earned rest so perhaps take advantage of the hotel spa and pool facilities. A signature treatment of the area is the Red Dao herbal bath.\n\nNotes: Total trekking time today is 1.5 - 2 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 4: Sapa","description":"Make the short trek to Lech Village and back this morning. About  5km / 3.1mi from Sapa, the village is home to the Red Dao ethnic minority, a remarkable people whose culture has remained relatively unaffected by outside visitors. Your camera will get a workout as you encounter the stunning vistas and rice paddies of the Thanh Kim valley. Stop to try the regional speciality of 3 colours sticky rice. This dish is so named as the rice is coloured with locally sourced natural ingredients such as leaves and flowers. Afterwards, the day is yours to spend as you please. Those with the energy can venture down further scenic trails (ask your leader for a recommendation). There are many more hill-tribe cultures and photographic opportunities to be found in the surrounding hills. Alternatively, simply sit back and soak it all up from your perfectly appointed lodgings. \n\nNotes: Total trekking time today is 2.5 - 3 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 5: Hanoi","description":"Return to Hanoi (approximately 5 hours) and use free time to discover its many treasures. Perhaps visit Hoan Kiem Lake, the excellent Ethnology Museum or the Hanoi Social Club. In the evening, sit down to a farewell dinner with your fellow travellers at KOTO restaurant. This philanthropic Hanoi institution is a long-time friend of Peregrine and is supported by our sibling charity, The Intrepid Foundation. Not only is it a lovely place to dine, it's also a great cause, doubling as a hospitality training program for disadvantaged local youth.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 6: Hanoi","description":"Your trip comes to an end after breakfast this morning. If you’d like to stay on in Hanoi, we can help arrange additional accommodation for you on request. Why not soak up all that Hanoi has to offer on an immersive one-day Urban Adventure tour? Visit www.urbanadventues.com for more details."}]},{"name":"Vietnam Legend - 10 Days","duration":10,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","Holiday"],"oldPrice":1918,"price":959,"summary":"The best Package for Solo Traveler to join\nSharing the Room with the same Gender\nNo Single Supplement Fee`s required\nBest price Group Tour, Departure guaranteed\nAll Transfers and Internal Flights included\nThe best quality and unbeaten price for 10 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional\nStart in Ho Chi Minh City and finish in Hanoi.\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nExplore Hoi An Ancient Town - World Heritage Sites\nTaste wonderful Vietnamese local cuisines along the trip\nAnd more...","highlights":["Step back in time to times of war in the mysterious Cu Chi Tunnels","Delve into culture and meet the locals along Thu Bon River","Fall in love with the hustle and bustle of Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76089_9c8d22d4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76089_9c8d22d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_9c8d22d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_f56f9911.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_b68d08be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_435e09f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_8bbc97f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_0b164f3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_f5017e21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_ac39d05c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_ee825454.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_da05532d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_6eefc1a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_33a0a1c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_80c973df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_7c5b70a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_2101c1b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_c6d00380.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_b825ce02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_602171de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_6dd3dd7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_32f60ece.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_a262f71e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_111785b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76089_a7775248.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Arrival Ho Chi Minh City, Vietnam","description":"Today you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by Tour Guide & Car Driver at airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 2: Full day Sightseeing in Ho Chi Minh City & Cu Chi Tunnels. (B, L)","description":"After breakfast, at 8 am, we will visit Cu Chi tunnels - an immense network of connecting underground tunnels during American War. Back to the city for lunch.\nAfter lunch we will visit Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Our last stop is Ben Thanh market, the biggest whole sales market in Sai Gon. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 3: Leave Ho Chi Minh City - Danang - Hoi An. (B, L)","description":"You have breakfast in the hotel then transfer to Airport departure for Danang City in Vietnam’s Central Region. You visit Cham Museum, an open air collection of some of the finest sandstone carvings in the world, My Khe Beach, and the Marble Mountain, before you continue on to picturesque Hoi An town – also known as Faifo to early western traders; it was one of Southeast Asia’s major international ports during the 17th, 18th and 19th centuries. Free for the rest of the day. Overnight in Hoi An Ancient Town.\nPhu Thinh Resort 4* or similar"},{"title":"Day 4: Explore Hoi An. (B, L)","description":"Today, we will visit the Japanese Covered Bridge, the beautiful Chinese Assembly Halls, the Phuoc Kien Pagoda, and the local market. After having lunch, you’ll take a boat trip on the Thu Bon River to a village of woodworkers and boat building families on Cam Kim Island and Thanh Ha pottery village. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 5: Leave Hoi An to Hanoi. (B, L)","description":"Having breakfast at hotel then transfer to Danang Airport for flight to Hanoi. Pick up & transfer to Hanoi City, start visiting Hanoi City, shaded boulevards, public parks, and the capital of Vietnam. With our local guide visit the most interesting Museum of Vietnam - Ethnology museum. We will also visit Ho Chi Minh Mausoleum, Ho Chi Minh Museum, One Pillar Pagoda, temple of Literature. Lunch and then we proceed to Hoan Kiem Lake for a short walk around the lake and visit Ngoc Son Temple, Dong Xuan Market, Old Quarter. End of the day by attending the water puppet show. Back in hotel. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi to Halong Bay Cruise & stay overnight on Board. (B, L, D)","description":"At 9:00am, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. The drive takes 3,5 hours. Halong covers 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 7: Halong Bay to Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 4:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 8: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 9: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 10: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip with Legend Travel Group or you can extend some days in Sapa or Siem Reap (Cambodia)"}]},{"name":"Vietnam Legend - 9 Days","duration":9,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1708,"price":854,"summary":"The best Package for Solo Traveler to join","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a759530c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a759530c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a75aa86d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a75cf6f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a75df816.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a75ef612.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a760a51f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a7615700.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a761f838.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a763624b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a7645570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a7650690.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a765ed06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a766a1fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a767f24a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a7686e0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a768bcf9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a768fd7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_5e1e7a769a368.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_d1843008.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_45ffe0f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_0b6990ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_be86a9c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_d6171b4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188722_45ebf13c.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check in hotel. Stay overnight in Hanoi.\nAirport Pick up is Optional service. You`ll pay extra 20 US$/ Per Person (pay in location) if you need picking up at airport upon arrival or you can arrange your own transfer from airport to hotel. In case of arriving before departure date, you will check in the hotel by your own following the address below:\nPomihoa Hotel Hanoi\nAddress: 166 Đường Trần Quang Khải, Lý Thái Tổ, Hoàn Kiếm, Hà Nội, Vietnam\nPhone: +84 24 3354 4555"},{"title":"Day 2: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises Halong Bay or similar"},{"title":"Day 3: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi\nPomihoa Hotel Hanoi or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 5: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Da Nang City. Overnight on the Train (4 Berth Cabin sleeper sharing cabin)"},{"title":"Day 6: Arrive Danang - transfer to Hoi An (No Meal today)","description":"Spend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30am! You`ll prepare the breakfast by your own because train doesn`t serve breakfast included in the ticket. Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. Check in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An..\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 7: Hoi An Excursions - Fly to Ho Chi Minh City (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. \nTransfer to Da Nang Airport to take flight to Ho Chi Minh City (1 hour). Arrive Ho Chi Minh City - welcome at airport by Driver, pick up and transfer to hotel for check in. Overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 8: Ho Chi Minh City - Cu Chu Tunnels full day (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War.\nArrive hotel around 5:00pm. Check in hotel and stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 9: Full day to Mekong Delta/River Boat Trip/Conclude. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City around 3:00pm - 4:00pm. Trip ends at Liberty Parkview Hotel Saigon.\nNotes: Today before you leave Ho Chi Minh City for Mekong Delta Tour, you can leave your luggage at Liberty Parkview Hotel until you come back after the trip (ask Hotel Reception to store your luggage until you take it). You can extend your trip by staying the same hotel or plan your own arrangements. Good bye and see you again!"}]}]