[{"name":"Along Vietnam from Saigon - Nha Trang- Dalat - Hoi An - Hue - Halong - Sapa","duration":19,"travelStyle":["Adventure","Family","Independent","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1512,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/102766_2f4cae86.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/102766_2f4cae86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_21de0d2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_5d13ec12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_40f3d072.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_cb65cba8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_79f11d21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_75ba540e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_f5d9fe30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_62b5eff1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_038b5004.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_f04a471c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_33017f6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_b993856a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_5bbdab66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_834d962e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_69803b6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_5cffca5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_d9ff2547.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_07b3c25c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_cfd3c47a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_cd04b4d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_caef18ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_d71c5b2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/102766_dca29b20.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Dalat","Hoi An","Hue","Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"DAY 1: SAI GON ARRIVAL ( NO MEALS )","description":"On arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You have free time for leisure."},{"title":"DAY 2: MEKONG DELTA (B,L)","description":"8:00 Am Begin the trip. It takes for one and half hours by bus to drive from Ho Chi Minh to My Tho City.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people. • The cruise will lead to Ben Tre province, \"the country of coconut\", visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake.  • The amazing rowing boat trip on the small canal - fully covered by the shadow of the water coconut’s tree. • After lunch, you have freetime for biking, walking. Next journey is Can Tho. Spend overnight in the hotel (or family home-stay with dinner can be arranged on request). \nOvernight in Can Tho\n"},{"title":"DAY 3: MEKONG DELTA - SAI GON ARRIVAL (B,L)","description":"After having breakfast, you have chance to take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river, visit Cai Răng floating market which are the liveliest in the whole Can Tho City. Your experience will be full fill when you go and see how vermicelli’s soup is made. Wander around the village and meet the friendly local people and  see a \"Monkey bridge\" – A bridge was built by only one stem of bamboo. Visit the orchard garden. Make a stop for lunch. Final trip is coming back to HCM City."},{"title":"DAY 4: CU CHI TUNNEL (B)","description":"08:30 We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\n14:30 The bus back HCM. Stay overnight in Ho Chi Minh.\n"},{"title":"DAY 5: SAI GON DEPARTURE - NHA TRANG","description":"08:00AM: Our car picks you up at the hotel and departs to Nha Trang by train. During the way, you can see the nice landscape such as: dragon fruit farm, coconut forest, beach, fishing villages, temples,…\nArrive Nha Trang beach city, our car transfer to down town, check in hotel and have a free time.\nEvening: Spend overnight in Nha Trang.\n"},{"title":"DAY 6: NHA TRANG 4 ISLANDS - DA LAT ARRIVAL","description":"9h00 :   Pick-up at the hotel and transfer to Cau Da pier.\n10h00 - 11h30:  At  Mun Island\n- Observe the structure of Salanganeisland.\n- Snorkelling to view coral reefs covered with multicolour fish.\n\n11h45- 13h45:  At  Mot Island\n-  Having lunch with dishes: fried salted shrimp, fried fish in sour and sweet sauce, sauteed cuttlefish, grilled rib, spring rolls, softly sauteed noodles…\n-  Entertainment program: singing songs & music.\n-  Enjoy cooktails at “ Floating Bar”\n14h – 15h30:  At  Con Se Tre Village\n-  Relax at Con Se Tre village.\n-  Seasonal fruit party.\n\n15h45 – 16h15: At  Mieu Island\nVisit Tri Nguyen Aquarium\n16h30:   Back to harbour and hotel and depart to Da Lat by private car (3 hours drive). Stay overnight in Da Lat.\n"},{"title":"DAY 7: DA LAT CITY (B,L)","description":"8:30am our tour guide will pick you up at your hotel to visit Dalat city \n1.Bao Dai King Palace\n2.Da Lat Cathedral\n3.Robin hill, cable car (exclusive)\n4.Datanla fall\n5.Flower Garden\n6.Truc Lam Zen Monastery\n16:30 Tour finishes.\nOvernight in Dalat\n"},{"title":"DAY 8: DA LAT COUNTRYSIDE (B,L)","description":"8:30am our tour guide will pick you up at your hotel to visit countryside\n1.Flower village\n2.Coffee plantation\n3.Cricket farm\n4.Silk factory\n5.Elephant fall\n6.Linh An pagoda\n7.Rice wine making\n16:30 Tour finishes.\nOvernight in Dalat\n"},{"title":"DAY 9: DA LAT - DA NANG - HOI AN (B)","description":"Morning:\n Our driver takes you to the airport for Da Nang flight. \nArrive to Da Nang, our car take you to Hoi An (40 minutes drive). Check in hotel in Hoi An.\nYou are free to discover the ancient town: Japanese Bridge, lantern road, traditional tailor shop, enjoy the special food. Besides, you can view sunset at Cua Dai beach. Spend overnight in Hoi An.\n\n\n"},{"title":"DAY 10: MY SON HOLYLAND (B,L)","description":"Morning:8.00 – 8.30: our guide pick you up at your hotel and depart to My Son holy land - the world cultural heritage. \n10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on!\n12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air.\n13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends!\n "},{"title":"DAY 11: TRA QUE VILLAGE - HUE ARRIVAL (B,L)","description":"8:00          Our local guide will pick you up at the hotel’s lobby. After that, you will ride a bicycle to the home of a craftsman in the city. Here you will get a short introduction to the history, shape, and color of the lanterns as well as the many stages of making them. Especially, you will be shown how to decorate and make your own lanterns you can also keep it as a souvenir.\n\nFirst, you will say goodbye to your host to continue going to the vegetable village named Tra Que Village. Join the farmers as they prepare the land, fertilizing it with seaweed from the local lake. Watch and participate in raking, sowing, watering the greens, picking vegetables, and more. We will having lunch here. After lunch, transfer to the train station, 14:13 depart to Hue.\n\nArrive to Hue, transfer to the city, check in hotel. Free for leisure. Overnight in Hue."},{"title":"DAY 12: PARADISE CAVE (B,L)","description":"6h00 Tour guide pick you up from your hotel in Hue and depart for Quang Binh. On the way, stop for sightseeing La Vang Church, where Virgin Maria appeared in 1798, and  Hien Luong Bridge, Ben Hai River (latitude 17 division from south to north of the country during 20 years from 1954 to 1973). \n11h30: Lunch at Phong Nha Restaurant\n12h15: continue to Paradise Cave to explore the glamor of Asia's longest dry and beautiful than the Phong Nha is inherently Natural Wonders of the World with the beautiful of nature given chemical.\nFrom the historic Ho Chi Minh Road (former Ho Chi Minh Trail), you veer off on a path through dense forest for about four kilometers, then you climb 519 rocky steps, and you’re in... heaven, well, Paradise.\nTour will back to Hue.\n"},{"title":"DAY 13: HUE CITY - HA NOI ARRIVAL","description":"Morning (8:15 am  -  12:30 pm)\n1. Dong Ba Market to see the daily life of local people\n2. Boat trip to Thien Mu pagoda - The oldest pagoda in Hue City\n3. Imperial Citadel of Royal Dynasty of Nguyen Family (1802 - 1945)\n4. Royal Antiques Museum - A collection of ornaments from the Nguyen dynasty\nLunch at local restaurant (Huế specialities, Western and Asian food)\nAfternoon (12:30 – 17:30)\n5. Incense stick village\n6. Khai Dinh King’s Tomb – a blend of Western and Eastern architecture.\n7. Minh Mang King’s Tomb, one is impressed by the majesty and symmetry of the architectural constructions.\n8. On the way back to your hotel, we drop in handicraft village in Hue city – Conical hat village\n16:30\tTour will be ended. Return your hotel to check out and then we will take a flight to Ha Noi capital.\nEvening\tArriving Ha Noi, car transfer to the center and spend overnight in Ha Noi.\n"},{"title":"DAY 14: HA NOI - HA LONG BAY (B,L,D)","description":"(Your hotel – Tuan Chau marina - Halong bay - Lunch– Surprising Cave – Titop Island  – Sunset party – Dinner – Onboard night activities)\n\n07.45 – 08.15 approx\n- Our guide will meet you at your hotel. The shuttle bus or private car pick up\n- Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n- Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n12 – 12.30 approx\n- Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n- Check into your cabin. Time to refresh and unwind\n- Set sail as lunch is served\n- Join us for a typical local lunch in the dining room or at the outdoor dining area. \n\nAfternoon\n-\tArrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n-\tHeading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n-\tHeading back toward the sleeping area\n-\t\n\nEarly evening\n-\tSummit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n-\tAn authentic Vietnamese menu is served\n-\tAfter dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…\n\nAccommodation and overnight on boat.\n"},{"title":"DAY 15: HA LONG BAY - HA NOI (Meal: B, L)","description":"(Tai Chi - Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n07:00 – 08:00\n Local breakfast is served\n08:00\n-\tMingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n-\tTake your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals. \n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\n16:30-17:00 Arrival back at your hotel. Stay overnight in Ha Noi.\n"},{"title":"DAY 16:HA NOI CITY- SAPA BY TRAIN (Meal: B, L)","description":"In the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\nAdd some options:\n15:30- 16:15: Enjoy Water Puppet Show or go sightseeing by Electric Car or Cyclo around Old Quarter in Ha noi\n17:00: End of City tour. The bus take you back hotel, you have free time.\n21:00: Our dirver pick you up at hotel. Transfer to train station, for Lao Cai. \nStay overnight on Train, soft sleeper cabin (4 beds/cabin)."},{"title":"DAY 17: SAPA TREKKING (Meal: B, L, D)","description":"( Lao Cai-Sapa- Lao Chai-Ta Van village)\n5.00: We will arrive at Lao Cai Train station in the early morning. Your tour guide will pick you up and take for 01hr drive to Sapa.\n6.00: The luggage is put in your hotel. Then, you have a good time to enjoy breakfast and take a shower in a local restaurant nearby. Taking a leisurely walk down the town to enjoy fresh air and make friend with friendly locals.\n9.30: We start to make a tour to Lao Chai and Ta Van villages down in Muong Hoa valley. At there, we will be seen the fantastic scenes of the beautiful valleys towards Fansipan – the highest peak of Vietnam and Indochina. In addition, you also have a change to go through the villages of Black H’mong ethnic minority to learn the way of weaving and embroidering their clothes. Have a break in a local restaurant for lunch then keep going down to enjoy immeasurable rice paddy fields and continue going into the village where the Dzay ethnic people inhabited, named as Ta Chan village\n15.30: You will be picked up by car to return Sapa for checking-in. The rest of the day, you will be leisure to explore the town (Dragon Mount, Orchid garden, the market…). Overnight in Sapa."},{"title":"DAY 18: SAPA TREKKING (Meal: B, L, D)","description":"9.30: After having breakfast in the hotel, we will depart to visit Cat Cat and Sin Chai villages. At there, you surely enjoy comfortable feelings when trekking through lush rice terraces towards villages and learn the experiences of Black H’mong people for their daily life and traditional culture. Then, we will come back to Hotel.\n14.00: We continue taking a drive to Ta Phin village (12km from Sapa) where the Red Dzao people lived to get more helpful experiences about their culture, custom and even their daily life. Moreover, you also have a best choice of buying woven and textile brocades which are completely made by hand by local people. After that, you will have an interesting chance to come into one of the local family to experience the true life of the Red Dzao.\n16.00: You come back to Sapa for a shower then you will proceed forward to Lao Cai City. Your dinner will be served in a restaurant close by the railway station. Final is to go on the board a night train to come back to Ha Noi."},{"title":"DAY 19:HA NOI DEPARTURE","description":"Pick up and take you to Hanoi hotel, early check in, have a breakfast and you have relaxing time in Hanoi until transfer to the airport for the flight back home. See you again!"}]},{"name":"Explore Ho Chi Minh City, Cu Chi Tunnels and Mekong Delta","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":319,"summary":"This 3 days package tour to explore Ho Chi Minh City and the Mekong Delta entitles you to obtain fascinating insights of the local life. Not only that, it also embraces an opportunity to approach the richness of culture, glorious chapters in the Vietnam’s history, and architecture in unique styles","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146094_bb4be515.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146094_bb4be515.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_7b786b23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_603c8f9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_746a85f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_99d883cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_97e1e936.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_20fd9c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_f0658bba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146094_e7f70b3d.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1 - Ho Chi Minh City arrival","description":"Right after arriving at Tan Son Nhat Airport, you are picked up and driven to your hotel for check-in. Just relax and have a good night’s rest in Ho Chi Minh City. \nOvernight in Ho Chi Minh City"},{"title":"Day 2 - Ho Chi Minh City – Cu Chi tunnel","description":"After morning pickup at your Ho Chi Minh City hotel, travel about 20 miles (30 km) to reach Cu Chi, a district of the city most famous for the 75-mile (121-km) network of underground passages built by the Viet Cong army. \nFollow your guide through this historic military site, now a war memorial park, which was once a key position for the Viet Cong during the Vietnam War (known as the American War in Vietnam). Learn how the tunnels provided shelter, supply and communication routes, medical treatment sites, and food and weapons storage. See booby traps that were built to capture intruders and dioramas that illustrate daily life in the tunnels. If you like, you can even crawl through parts of the narrow passageways. \nAfter your time in Cu Chi, return to the city for a traditional Vietnamese lunch served at a riverside restaurant. Then spend the afternoon visiting Ho Chi Minh City's top sights. Start your city tour at Reunification Palace, where in 1975, Viet Cong troops broke through the main gates and the party took control of the government, ending the long war. Inside the 1960s-style building, check out the official living quarters, meeting rooms and a military command center complete with old radio equipment and tactical maps from the war. \nA short walk from the palace, your guide shows you fine examples of French Colonial architecture, including Notre Dame Cathedral, the Central Post Office, Ho Chi Minh City Hall and Ho Chi Minh Municipal Theater, also known as the Saigon Opera House. Stroll toward the Saigon River along Dong Khoi Street and Nguyen Hue Boulevard to admire historic buildings and the ultra-modern Bitexco Tower, until recently the tallest skyscraper in Vietnam.\nWrap up your afternoon at Ben Thanh Market — the city’s central market and one of its most colorful areas. Marvel at mounds of goods, and practice your bargaining skills if you wish to purchase any items. \nOvernight in Ho Chi Minh City\n"},{"title":"Day 3 - Mekong Delta and Departure","description":"Our guide and driver will pick you up at your hotel, and drive 1,5 hours to Mỹ Tho. We will stop along the way for refreshments and toilet.\nUpon arrival, we board a motor-boat and cruise along a vast network of canals and channels to enjoy wonderful views of the Mekong River, including four famous islands “Dragon, Unicorn, Turtle and Phoenix”.\nStop at one of the floating fish houses, in nets and wire baskets under their house, the villagers cultivate freshwater fish and shrimp – a major export product of the region.\nCross the River to the other side, you will stop at a traditional workshop to witness a step-by-step process on how to make coconut candy, honey farming… while trying some yourself and listening to traditional music.\nEnjoy what local people offer by hand rowing a sampan along the shady, breezy canal. We will transfer to local transportation called Xe Lôi to travel throughout the villages.\nLunch will be served at a riverside restaurant with a Vietnamese 5-course set menu. Please request in advance if you have a food allergy, you are a vegetarian, or you observe Halal.\nTake a rest after lunch before boarding the motor-boat back to Mỹ Tho. We drive to Vĩnh Tràng pagoda, an ancient southern architectural gem built in the middle of the 19th century. There are many Buddha statues including some that are over a hundred years old.\nWe drive another 1,5 hours back to Hồ Chí Minh.Spend time at leisure until being transferred to Tan Son Nhat airport for the next departure. End the package tour."}]},{"name":"Vietnam Timeless Charm - 11 days 10 nights","duration":11,"travelStyle":["Sightseeing","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":870,"summary":"Welcom to Hanoi - the capital of Vietnam, get a feel of Hanoi's local culture while seeing the city's highlights and mingling with the locals by visiting some famous temples, pagoda, lakes,... Customers will have a great time to immerse in Hanoi Olf Quarter at night, walk through lots of local restaurant and enjoy street food tour with Vietnamese people.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/152927_747e29a8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/152927_747e29a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_f300d49c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_0aac2993.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_ced029ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_e09fa66f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_1f432088.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_f897d6d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_2fb0b516.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_7bd18a8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_9678d096.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_8c6a3446.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_202cabd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_a475f14e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_cffd5a4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_93e75909.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_43b936b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_41605d0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_6e8ead42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_d49ac641.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_566bde4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_204337e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_59f4c66a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_a6178cce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/152927_492f468e.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi Arrival – Walking Old Quarter Street Food tour (Dinner)","description":"-\tOur private car would pick you up at Hanoi Internatinal Airport and drop you off at your hotel in the city center. \n-\tCheck in your hotel\n-\tParticipate in the Hanoi Walking Street Food tour by night to experience the Vietnamese local cuisine such as Bun Cha, Pho, Banh Cuon, Egg Coffee, Deserts,....\n-       Tour guide take you back to hotel and take a rest\n-\tOvernight in Hanoi hotel"},{"title":"Day 2: Legendary Hanoi City full-day (Breakfast, Lunch)","description":"Have breakfast at hotel & ready for the trip at lobby.\n7:45 – 8:30: Tour guide pick up at hotel\n08:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world\n10:15: Visit the Lacquer Paintings workshop – the biggest center in Ha Noi.\n10:45: Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45: Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00: Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45: Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15: Tour finishes. It's time to enjoy dinner by yourself and comeback hotel\n\nOvernight at hotel in Hanoi"},{"title":"Day 3: Hoa Lu - Tam Coc Sampon Boat trip - Cycling (Breakfast/Lunch)","description":"7h30 - 8h00: Our tourist bus will pick you up at your hotel lobby in Ha Noi Old Quarter for departure to Hoa Lu.\n\n10h30 - 10h40: Arrive Hoa Lu ancient capital of Viet Nam. You will visit Dinh King temple and Le King temple in the 10th centery, finding out the heroic histories of this two king in Chinese Wars.\n\n11h50 - 12h00: Having a buffet lunch with Vietnamese cuisine.\n\n13h10 - 13h15: Get on the tourist bus continue going to visit Tam Coc wharf for taking the sampan go along the Ngo Dong river to visit Tam Coc (three different caves).\n\n15h25 - 15h30: Get your bicycle, biking around Tam Coc area and enjoy Vietnamese tea break.\n\n16h30 - 16h35: Get on our tourist bus to return Ha Noi.\n\n19h00 - 19h30: Arrive Ha Noi, drop off at your hotel in Ha Noi Old Quarter."},{"title":"Day 4: Hanoi - Halong Bay - Surprising Cave - Sunset Party - Cooking Class (Lunch, Dinner)","description":"8:00AM: Tour guide will pick you up at hotel and depart to Halong\n10:15: Arrive in Hai Duong province, and have 20-30 minute short break.\n12:00: Arrive to Tuan Chau Harbor\n12:20: Welcome to Cruise and Enjoy welcome to drink and get a brief introduction about cruise and safety guidelines.\nCheck- in your cabin with Air-Conditioning.\n12:30: Enjoy a special lunch with Vietnamese traditional dishes, while cruising in the magnificent Halong Bay, admiring the fascinating rock formations in the bay.\nAfternoon Activities:\n15:00: Visiting Sung Sot Cave (Surprising cave). \n16:00: Our cruise will take you to the Titop Island, It is noted for having a viewpoint at its peak which affords splendid views all around Halong Bay or you can enjoy your swimming on romance sandy beach.\n17:15: Come back to Cruise then take a shower, Relax on sundeck, sunset watching in comfortable lounge chairs while drinking a cocktail or reading a book in the most magical moment.\n18:00: Enjoy welcome sunset party and Cooking class. How to make fresh noodle roll, you can enjoy product which you make it. \nEvening Relaxing:\n19:00: Enjoy your dinner when sitting by overlooking sea view window in the night romantic Bay. \n20:30: Playing some sports games like: Squid Fishing, Singing karaoke, or playing puzzle game.\nOvernight on boat: Clean air- conditioning room."},{"title":"Day 5: Halong Bay - Pearl Farm Visiting - Kayaking – Hanoi - Night train to Sapa (Breakfast, Lunch)","description":"6:00: Wake up in the early morning to see sunrise on sundeck.\n7:00: Morning view of bay landscape with a cup of tea of coffee. Have breakfast\n7:40: Start visiting Pearl farm. The pearls in Halong are the most renowned in Vietnam. The process of farming and retrieving pearls takes years.\n8:30: Do kayaking to explore Halong Bay\n10:00: Check-out and enjoy a fantastic cruise on the bay.\n10:45: Enjoy the lunch while Cruising back to Tuan Chau Harbour.\n12:00: Cruise is landing Halong Bay harbor, tourist say goodbye to sailors and finish the cruise.\n12:30: Return to Hanoi by shuttle bus.\n14:30: Stopover in Hai Duong province for short break.\n16:30: Arrive in Hanoi and overnight at hotel and enjoy your dinner\n20:00: We will take you to Hanoi Raiway Station and check-in your train cabin"},{"title":"Day 6: SaPa arrival – Trekking to Y Linh Ho – Lao Chai – Ta Van (Breakfast, Lunch, Dinner)","description":"5:30AM: Arrive in Lao Cai around, we will take 1 hour van ride uphill to the beautiful town of Sapa. The ride gives you a glimpse of the stunning vistas and impressive rice terraces. Upon arrival Sapa town.\n7:00AM: We have breakfast at the hotel. And relax about 2 hour, you can take a shower.\n9.00 - 9.30: Begin a short walk of 5km along mountain trail to visit Y Linh Ho village which is inhabited by black Hmong tribe and completely secluded from tourists, especially you are able to embrace raw Sapa culture and community by coming into some native houses to discover their own culture and custom as well as study how the local tribe make handicraft from natural materials such as: hemp, indigo…ect. Continuing to walk down MuongHoaRiver where you can take a rest or swim before trekking uphill to Lao Chai village where your picnic lunch will be served. \n13.00: After lunch, you will visit the Day and Red Dzao tribes of Tavan village, which lies in the middle of MuongHoa valley where excellent panoramas of rice terraced fields. \n15h00 – 15h30: There you will have dinner and stay over night at local house.\nAccommodation: Homestay in Sapa with local people"},{"title":"Day 7: Ta Van – Giang Ta Chai – Su Pan – Sapa – Lao Cai ( Breakfast, Lunch, Dinner)","description":"8.00:You have breakfast at the home stay before trekking about 8km towards the Red Dzaovillage of Giang Ta Chai. On the way you will trek up and downhill then through bamboo forest before arriving at the waterfall, Rattan bridge and Stream where you have short rest to swim and picnic lunch. \n14h30 Continuing to walk uphill about 2km to HauThao village where we catch the car to return to Sapa. You are free to discover Sapa town and Market before having dinner then being transferred to Lao Cai train station to catch the night train to Hanoi.\nOvernight on train and get back Hanoi"},{"title":"Day 8: Hanoi arrival - Lang Son - Quang Uyen (Breakfast/Lunch/Dinner)","description":"5h00: You arrive Hanoi Railway Station. Take a taxi to small hotel in Old Quarter that we book for you to take a rest.\n8h00: Our tour guide will pick you up by car at your hotel, transferring you to Lang Son. We will start by driving in the direction of the Chinese border for about 3 hours, before stopping at Chi Lang Pass - a 20-km-long gorge created from a narrow valley between two mountains. \n\nThis place occupies an important position in Vietnamese history, being the place of many victories against various Chinese invasions over the centuries and millennia, as far back as 981AD. As such it bears the reputation of Vietnam’s strongest citadel and bastion. Here you will have roughly an hour to walk around and explore the area around the Quy Mon Quan Gate, which translates as “The Gate of Monsters”, named for the many invasion forces that would spill through the pass over the course of history only to be beaten back by stalwart Vietnamese defenders.\n\nAfter lunch at a local restaurant in Dong Dang, you will continue your trip into the pass, stopping to visit Mother’s Temple and Dong Khe – an important historical site where The Battle of Dong Khe was fought during the First Indochina War. In fact, this was the very first battle of the Indochina Wars, and the fighting here took place through September and October 1950, ending in a resounding victory for the Viet Minh.\n\nIn the evening you will get to enjoy dinner and overnight rest in a local homestay owned and operated by a local Nung family.\n\nHighlights and activities: Chi Lang, Quy Mon Quan Gate, Dong Khe Battle Site, Ethnic Villages, and a 3-5km walk.\nOvernight at homestay with local people"},{"title":"Day 9: Cao Bang - Ban Gioc Waterfall (Breakfast/Lunch/Dinner)","description":"After enjoying breakfast at the homestay, you will depart for Trung Khanh which lies right on the border with China. Here you will have another chance to meet and interact with the local Nung people living in the village of Phuoc Sen, a mountainous village famous for its traditional blacksmithing. The farming tools made here are an integral part of the lifestyle which is evident in the surrounding rice paddies and fields. \n\nNestled amongst these amazing landscapes is the breath-taking Ban Gioc Waterfall which spans over 300 meters, split half and half between Vietnam and China. You’ll get some time here to simply take in the amazing atmosphere surrounding the falls, which presents an excellent opportunity for some fantastic photography. \n\nOnce you’ve finished at the falls, it’s time to head over to Nguom Ngao Cave, for a very different, but no less impressive natural wonder. The cave stretches for 2,144 meters underground and is brimming with incredible stalactites and stalagmites. \n\nYou will then return to Cao Bang town and head down the “snake pass” to Ba Be Lake, where you will stay overnight in a homestay constructed in traditional Tay fashion and owned and operated by a local Tay family. Here you can relax and unwind from the day and enjoy a delicious and authentic home-cooked meal.\n\nHighlights and activities: Ban Gioc Waterfall, Nguom Ngao Cave, Ethnic Villages\n\nOvernight at homestay with local people"},{"title":"Day 10: Ba Be Lake - Hanoi (Breakfast/Lunch)","description":"After breakfast we’ll kick the final day of the tour of by boarding a boat and setting off onto the lake. It’s up to you how to spend your time on the boat, whether it’s relaxing and enjoying the views or going for a swim in the cool waters to refresh yourself. The views consist of stunning karst formations all around you covered with patches of wild vegetation and a rich wildlife.\n\nThe boat will then continue along the Nang River, giving you a chance to explore the caves of Puong Grotto where you can marvel at the stalactites and stalagmites created through river erosion, as well as observe the thousands-strong bat colony that lives here.\n\nNow that you’ve reached the end of your tour, you’ll be driven the roughly 230 kilometres back to Hanoi, with a stop at a tea plantation nestled among rolling hills. Once we arrive in Hanoi it is time to say farewell, having made lifelong memories and connections. \n\nHighlights and activities: Ba Be Lake, Puong Cave, Tay ethnic villages.\n\nOvernight at hotel in Hanoi"},{"title":"Day 11: Hanoi departure","description":"Enjoy free & easy time in Hanoi until your flight time.\nWe will arrange private car to take you to International Airport. It's time to say good bye and thank you for using our service!"}]},{"name":"Northern Vietnam Discovery 7 Days","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Hiking & Trekking","In-depth Cultural"],"oldPrice":0,"price":750,"summary":"The tour focuses on the northern part of Vietnam covering the highlights of the region including the capital city of Hanoi, northwest mountainous area of Sapa and finishes with a 2-day cruise in World Heritage area of Halong Bay, staying overnight on a traditional wooden junk. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/50373_f249627c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/50373_f249627c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_a5814751.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_f86953f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_a69f4e12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_f1480f9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_4816a94b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_7ccde627.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_a406abb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_bd8ff726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/50373_bbfcecf8.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi","description":"When you arrive at Noi Bai International airport in Hanoi, you'll be met and transferred to your hotel in the downtown. The remainder of the day will be your own.Overnight in Hanoi  "},{"title":"Day 2: Hanoi City Tour (Full day) - Overnight Train to Lao Cai","description":"\nAfter lunch at a local Vietnamese restaurant, you'll continue visiting the Museum of Ethnology, widely acknowledged as the best in the country, containing an extensive display of life-size structures dedicated to Vietnam’s 54 ethnic minority peoples; Ngoc Son Temple and Hoan Kiem Lake - the Ngoc Son Temple is set on a tiny island on Hoan Kiem Lake, its history dating back to the 13th century; a cyclo ride for 1 hour touring through the narrow, chaotic streets of the Old Quarter - a must for any visitor to Hanoi! The day finishes with a traditional performance of the famous Vietnamese water puppets.\nIn the evening, you'll be picked up by your guide to the train station for the overnight train leaving at 22.00 to Lao Cai. Stay overnight on the train. Accommodation aboard the train in four berth shared cabins, which are simple but comfortable. You might consider to pay extra for full cabin occupancy if you wish to.Overnight on the train﻿\nNote: the Ho Chi Minh Mausoleum is closed all day on Monday and Fridays, as well as from 1st October to 30th November (approx.) for annual conservation."},{"title":"Day 3: Lao Cai - Sapa Hiking (Cat Cat - Y Linh Ho – Tavan)","description":"\nYou first sneak through the market and leave the busy town behind. After a couple of minutes, you will follow a road going downhill to Cat Cat village. You will stop by a waterfall and a hydroelectric station for a while before you trek on a dirt trail through rice paddy terraces. You will also enjoy spectacular scenery while walking along a narrow river. You eventually arrive in Y Linh Ho village of Black Hmong minority, where you can take a rest while you are served lunch nearby the river. \nAfter lunch, you head Muong Hoa valley. You will pass through Lao Chai village of Black Hmong minority and then Tavan village of Giay minority by following a very popular trekking route. You will spend the night in local house of Giay minority. You will be able to take a walk to enjoy the valley view as well as swim in the river nearby.Stay overnight in Sapa.\nTour summary: Road transfer approx. 0 hour/Hiking and village visiting 5 to 6 hours/Grade 2 of 5."},{"title":"Day 4: Sapa Hiking (Tavan - Giang Ta Chai - Su Pan) - Lao Cai - Overnight Train","description":"\nAfter lunch, you continue toward Su Pan, a small village located by the road. Here you start your journey back to Sapa by car for a short break and enjoy free time for shopping and photos before leaving for Hanoi on an return overnight train.Overnight on the train\nTour summary: Road transfer approx. 1/2 hour/ Hiking and village visiting 3 to 4 hours/ Grade 2 of 5."},{"title":"Day 5: Hanoi - Halong Bay (Join with other travelers on the cruise)","description":"\nMeet the crew upon boarding the traditional wooden junk, then relax and enjoy lunch while the boat heads towards the secluded islands. Visit ancient limestone caves and go sea kayaking and swimming if the weather permits. Return to the junk refreshed and invigorated and relax on deck with a drink to watch the sunset. Enjoy a freshly prepared seafood dinner under the stars.Overnight on a wooden junk in Halong Bay "},{"title":"Day 6: Halong Bay to Hanoi","description":"Enjoy an early morning swim (if weather permits) followed by breakfast. The tour then visit one of the famous caves in the middle of the bay before cruising back to the main harbour for the return drive to Hanoi, arriving in the late afternoon.Overnight in Hanoi."},{"title":"Day 7: Depart Hanoi","description":"Your time will be your own until being picked up for your onward journey or departure flight."}]},{"name":"Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai","duration":6,"travelStyle":["Motorcycle Ride","Trail/Dirt bikes","Group","Partially Guided","Sightseeing","Holiday"],"oldPrice":0,"price":980,"summary":"\n\tThis 6-day Timeless Hoi An Motorcycle Tour to Saigon via Kon Tum, Buon Ma Thuot on Ho Chi Minh trail takes you on adventure rides to explore breathtaking landscapes of Central Highlands with coffee plantations, waterfalls, jungles and visit ethnic minorities in remote villages then taste great local foods at regions …\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129836_5fab6792.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_9963919f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_0cd07aa6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_247cb302.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_bba333e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_787051ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_04032620.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_87071a10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_3a58824c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_40d2e2f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_d43b85c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_4fe03696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129836_7ac07973.jpg"],"destinations":["Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hoi An motorbike tour to Kham Duc","description":"Saying goodbye with Hoi An ancient city, we will see how to make incense, visit Cham tower and Cao Dai Temple. Travelling on Ho Chi Minh trail, we will enjoy its magnificent scenery, exploring the rural life of the local people, learn their culture and customs We also learn more about the history of Vietnam and enjoy water massage on the Ho Chi Minh trail and the local market of the mountain town\nArrive in Kham Duc around 5:00pm."},{"title":"Day 2: Kham Duc motorbike tour to Kon Tum","description":"Continuing Ho Chi Minh trail, today we will ride to Kon Tum. On the way, we will stop at Charlie Hill, Indochine three Corner, Dak To – Tan Canh battle field, Phoenix airport, Wooden church that is combined of European style and culture of the Central Highlands Vietnam and     Kon K’tu ethnic village with their tradition Rong House"},{"title":"Day 3: Kon Tum motorbike tour to Buon Me Thuot","description":"Wake up in the early morning to enjoy the fresh air of the highland town and walk around to visit Kon Tum market. After breakfast, we will get on the motorbike for visiting Sea lake – the eyes of Pleiku, War monument, Local house to learn how to make rice paper and rice noodle, Black pepper farm\nWe will try to experience the daily life of local people\nArriving in Buon Me Thuot around 5pm."},{"title":"Day 4: Buon Me Thuot motorbike tour to Dak Mil","description":"This is one of the best days of the tour, so don’t miss anything! Before leaving Buon Me Thuot, let’s enjoy the best coffee in Vietnam (Buon Me Thuot is coffee homeland of Vietnam) and visit Ede ethnic minority village where still keep their tradition long house and local market where we will buy really special foods for our picnic lu’nch in the national park\nFollowing Ho Chi Minh trail, we will head to the national park where we will visit the Dray Sap and Dray Nur Waterfall – Biggest one in the Central Highland, and swim in Fairy pool, take a water massage from waterfall. Then Our guide will cook special foods for the lunch (Secret).\nOvernight in Dak Mil (Near Vietnam and Cambodia border). "},{"title":"Day 5: Dak Mil motorbike tour to Dong Xoai","description":"We will Ride through the legendary Ho Chi Minh trail to enjoy its magnificent scenery, Explore the rural life of the local people and Learn more about the history of Vietnam. We continue to visit Soc Bom Bo village to understand S’tieng ethnic minority people culture and traditions and learn how the locals make rice papers, noodles,… Overnight in Dong Xoai (The beginning point of the Ho Chi Minh trail from South to North)"},{"title":"Day 6: Dong Xoai Motorbike Tour to Saigon","description":"After breakfast, we will get on the motorbike to head to Cu Chi tunnel. On the way, we will stop at Rubber tree plantations, War Victory Monument, Paddy field\nWe will spend few hours to discover the Cu Chi tunnel and learn Vietnam History, then will ride to Sai Gon to finish the trip. Our guide will drop you off at the place you require."}]},{"name":"Cambodia & Vietnam: Bonfires & Banh Mi","duration":20,"travelStyle":["Discovery","Adventure","Group","Fully Guided"],"oldPrice":1499,"price":1274,"summary":"Now's the time to explore Cambodia and Vietnam on your terms with this tour that's affordable for young travellers. Plug into the electricity of Bangkok and Cambodia's bustling streets, get a living history lesson as you look upon Angkor Wat's ancient stone faces, and bliss out on white-sand beaches. Combine must-see highlights and free time to explore, and you've got the Southeast Asia journey of a lifetime.","highlights":["Visit the Angkor Wat Temple","Enjoy a village homestay in Vietnam","Check out rooftop bars","Relax on beautiful beaches"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/5549_5df9d2e2e8847.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/5549_5df9d2e2e8847.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_1bace60b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_d1873639.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_a19fbadf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_1e8b9b87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_3d511213.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5549_b04cce12.jpg"],"destinations":["Bangkok","Siem Reap","Phnom Penh","Ho Chi Minh City","Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Bangkok","description":"Arrive at any time and welcome to Thailand's bustling capital - Bangkok!\n\nTonight, meet your CEO and get to know fellow travellers as you cheers to new adventures.\n\nAccommodation:\n- The Bangkokians City Garden Home (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n- Connect With New Friends\n\nAdditional Notes: You must arrive on tour with your Vietnamese visa. See the Visa section of the Tour Details for more information and exceptions.\n\n"},{"title":"Day 2: Bangkok/Siem Reap (1B, 1D)","description":"Cross the border from Thailand into Cambodia, your home base for exploring Siem Reap and the incredible Angkor Wat. Taste all manners of salty, sweet, spicy, and sour with a delicious Khmer meal at a restaurant kickstarted by our non-profit partner, Planeterra, or with a local family. Opt to check out Phare Circus, a uniquely Cambodian experience.\n\nAccommodation:\n- Sovann Angkor II Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Dinner\n\nTransport:\n- Private Vehicle: Paôy Pêt to Siem Reap 03:00 - 03:00 Hr(s)\n\nIncluded Activities:\n- Border Crossing (Thailand - Cambodia)\n- Local Khmer Meal\n\nOptional Extras to chose from:\n- Phare Circus\n\n\n"},{"title":"Day 3: Siem Reap (1B)","description":"Prefer to plan ahead? Pre-book the \"Siem Reap Quad Biking\" or \"Phare Circus\" activities when booking your tour to include one of these exciting activities in your itinerary.\n\nAccommodation:\n- Sovann Angkor II Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Angkor Wat Guided Tour\n- Big Night Out\n\nOptional Extras to chose from:\n- Siem Reap Quad Biking\n\n\n"},{"title":"Day 4: Siem Reap/Phnom Penh (1B)","description":"Travel to Phnom Penh, Cambodia’s busy capital nestled along the mighty Mekong River. Get your bearings on an orientation walk and spend the rest of the evening at leisure.\n\nAccommodation:\n- Angkor International Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Local Bus 06:00 - 07:00 Hr(s)\n\nIncluded Activities:\n- Orientation Walk\n\n\n"},{"title":"Day 5: Phnom Penh (1B)","description":"Spend the day diving deep into Phnom Penh's culture and history. Opt to reflect on one of Cambodia’s darkest periods with a visit to the Tuol Sleng Prison and the Killing Fields. Or venture to the Silver Pagoda or Royal Palace for a more peaceful experience. Later, discover the foodie side of this city on a street food crawl.\n\nAccommodation:\n- Angkor International Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Street Food Crawl\n\nAdditional Notes: Phnom Penh can be confusing and we recommend to always keep a hotel card with you when you are exploring.\n\n"},{"title":"Day 6: Phnom Penh/Koh Rong (1B)","description":"Ride in style to Sihanoukville and board a boat to your own private beach on Koh Rong island. Take the afternoon to taste local seafood, snorkel the coral reefs, or sit back and relax with a drink before hitting the warm waves.\n\nAccommodation:\n- Palm Beach Bungalows (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 - 05:00 Hr(s)\n- Ferry 02:00 Hr(s)\n\nAdditional Notes: Please note that during monsoon season (between June to October), this itinerary may be subject to change based on weather conditions. If heavy rains and flooding prevent our boat from safely travelling to Koh Rong island, we will provide alternate activities and accommodations in a nearby town.\n\n"},{"title":"Day 7: Koh Rong","description":"Enjoy your last full day on this pristine island. Do anything you might have missed the day before, like snorkelling, fishing, hiking, or kayaking. Wait 'til after sunset to swim in a sea of blue sparkles caused by phosphorescent plankton. Ooh la la!\n\nAccommodation:\n- Palm Beach Bungalow (or similar).\n\n\n"},{"title":"Day 8: Chambok Homestay (1D)","description":"Head back to the mainland and journey to Chambok Village where you’ll spend the night and get to know the local people over a delicious Cambodian home cooked meal. Immerse yourself in the community and wander around this remote region.\n\nAccommodation:\n- Chambok Homestay (or similar).\n\nMeals Included:\n- Dinner\n\nTransport:\n- Ferry 02:00 Hr(s)\n- Private Vehicle 01:30 - 02:00 Hr(s)\n\nIncluded Activities:\n- Home Meal\n\n\n"},{"title":"Day 9: Chambok Homestay/Ho Chi Minh City (1B)","description":"Cross another border into Vietnam, stopping in the famed Ho Chi Minh City where you'll spend the night at a popular backpackers hostel. Take this chance to visit the Ben Thanh Market for souvenirs and handicrafts before taking in the buzzing nightlife. Choose to venture to one of the many rooftop bars for a panoramic view and live music.\n\nAccommodation:\n- Phan Anh Backpackers Hostel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 05:00 Hr(s)\n- Local Bus 02:00 Hr(s)\n\nIncluded Activities:\n- Border Crossing (Cambodia - Vietnam)\n\n\n"},{"title":"Day 10: Ho Chi Minh City/Nha Trang (1B)","description":"Feel the pulse of Vietnam’s biggest city on a CEO-led orientation walk, with free time after to double back to your favourite spots. Shop 'til your heart's content, immerse yourself in local culture, or just wander the streets to take in the city's unique vibe. Tonight, catch up on sleep on an overnight train to Nha Trang.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 10:00 - 11:00 Hr(s)\n\nIncluded Activities:\n- Orientation Walk\n\nAdditional Notes: During January/February, Tết (the Vietnamese Lunar New Year) sees millions of Vietnamese commute to be with their families and celebrate. While this is a fascinating time to travel through Vietnam, availability of transport may mean that we will replace the overnight train with an overnight bus.\n\n"},{"title":"Day 11: Nha Trang","description":"You’ve arrived! Welcome to the eastern sea. Take this morning to explore local shops and markets, rejuvenate in a therapeutic mud bath, relax on the beach, or visit nearby historical sites before an evening street food crawl.\n\nAccommodation:\n- Bondi Backpackers Nhatrang (or similar).\n\nIncluded Activities:\n- Street Food Crawl\n\n\n"},{"title":"Day 12: Nha Trang/Da Nang (1B)","description":"It’s not over yet. There’s more free time to explore Nha Trang today, so soak it all in. Then, hop on an overnight train to continue to Hoi An, stopping first in Da Nang for a short transfer.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds) 09:00 - 10:00 Hr(s)\n\n\n"},{"title":"Day 13: Da Nang/Hoi An","description":"From Danang, it is only a short drive to the picturesque port town of Hoi An. Once known as Faifo, it was an important trading town with strong south Chinese influence and connections.\n\nAccommodation:\n- Hoi An Paradise Hostel (or similar).\n\nTransport:\n- Private Vehicle: Da Nang to Hoi An 00:45 Hr(s)\n\nIncluded Activities:\n- Hoi An Orientation Walk\n- Big Night Out\n\n\n"},{"title":"Day 14: Hoi An (1B, 1L)","description":"Noodles might be fun to eat, but they’re even more fun to make. Find out how during a visit to G Adventures-supported Oodles of Noodles. The rest of the day is yours, so see what you can discover. Choose to visit the ancient ruins of My Son, a UNESCO World Heritage Site, or cruise down the Thu Bon River.\n\nAccommodation:\n- Hoi An Paradise Hostel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 15: Hoi An/Huế (1B)","description":"Pre-book the \"Hue Motorbike Tour\" on the checkout page ahead of time to include this speedy activity on your tour.\n\nAccommodation:\n- DMZ Hostel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 16: Huế/Phong Nha (1B)","description":"Your second day in Huế comes with more free time to enjoy the city. In the afternoon, travel through Vietnam's stunning countryside to the green rocky mountains of Phong Nha-Kẻ Bàng National Park.\n\nAccommodation:\n- Sai Gon Phong Nha Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 17: Phong Nha/Hanoi (1B)","description":"Today, opt to head underground to explore the awe-inspiring caves of Phong Nha-Kẻ Bàng National Park, where the oldest karst mountains and longest cave in Asia are found. Then it’s an overnight train to Hanoi.\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Basic Overnight Train (beds)\n\nOptional Extras to chose from:\n- Caving in Phong Nha\n\nAdditional Notes: Pre-book the full-day Caving in Phong Nha adventure to explore the longest cave in Asia, Paradise Cave, with massive stalactites. Enjoy a sumptuous Vietnamese lunch, then boat to the turquoise beach of Phong Nha Cave.\n\n"},{"title":"Day 18: Hanoi/Ha Long (1B, 1L)","description":"After arriving in Hanoi, the bustling capital of Vietnam, take a private bus to the iconic Halong Bay for a seafood lunch cruise and cave exploring. Be sure to charge your camera so you can grab a shot truly worth sharing!\n\nAccommodation:\n- Gold Mark Hotel Halong (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Private Vehicle: Hanoi to Ha Long 04:00 Hr(s)\n\nIncluded Activities:\n- Hạ Long Bay Junk Boat Trip\n\n\n"},{"title":"Day 19: Ha Long/Hanoi (1B)","description":"Interested in local cuisine? Opt to pre-book the \"Hanoi Foodie Culture Tour\" activity on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- The Signature Inn (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\nIncluded Activities:\n- Old Quarter Orientation Walk\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 20: Hanoi (1B)","description":"Today, it’s time to say goodbye to your group of newfound friends. Be sure to sneak in some last-minute photos and exchange social medias before you head on your way.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]}]