[{"name":"Vietnam Superior Tour Package 18Days/17Nights","duration":18,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1619,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter","highlights":["Visit Hanoi's marvellous temples","Enjoy Hue City, Vietnam's political capital","View the last Nguyen dynasty monument","Explore the Mekong River on a boat"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95426_ad9c240a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95426_ad9c240a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_5816b23f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_e706cb5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_ca89b698.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_95d36894.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_62b7ce1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_896923de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_6091275e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_5e58515e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_e4e4e2c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_9e9c3139.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_690e4ec2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_079cd728.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_b21a7518.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_9a42f273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_d9033061.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_0adb0a75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_63336f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_a43f3912.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_5252bc73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_ec4d2ee2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_c1092e71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_b1febc51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95426_dede9058.jpg"],"destinations":["Hanoi","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Mekong Delta","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations.\nCruise check-out in the noon time.\nTransfer back to Hanoi for hotel check in around 5:00pm. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi fly to Hue City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nRejoin car drive to airport directly. Arrive Noi Bai Airport (Hanoi) at 6:00pm. Catching flight to Hue City. Arrive Hue City, transfer to hotel for check in. Overnight in Hue.\nHue Cherish Hotel 3* or similar"},{"title":"Day 7: Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nHue Cherish Hotel 3* or similar"},{"title":"Day 8: Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Overnight in Hue City.\nHue Cherish Hotel 3* or similar"},{"title":"Day 9: Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 10: Hoi An Excursion/Thun Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thun Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 11: My Son Sanctuary half day Tour & free go shopping (B, L)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch. In afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 12: Leave Hoi An to Nha Trang Beach City (B)","description":"Free for leisure in the morning until transfer to Danang Airport to take flight to Nha Trang Beach City - one of the most beautiful Beaches in over the World. Pick up & transfer to hotel. Check in & overnight in Nha Trang City.\nNha Trang Regalia Hotel 3* or similar"},{"title":"Day 13: Nha Trang Sightseeing (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nNha Trang Regalia Hotel 3* or similar"},{"title":"Day 14: Nha Trang Beach leisure (B)","description":"Today is a free day at leisure in Nha Trang for relaxing and unwinding at the resort overlooking beautiful Bay. Snorkel or dive among the coral reefs in crystal blue waters, hike nature trails, cool off in your private plunge pool, indulge in spa treatments or just relax on the white sand beach and admire the unspoiled mountain and sea views. Overnight in Nha Trang.\nNha Trang Regalia Hotel 3* or similar"},{"title":"Day 15: Nha Trang Beach leisure (B)","description":"Enjoy your time on the one of the most beautiful beaches on the World! Overnight in Nha Trang.\nNha Trang Regalia Hotel 3* or similar"},{"title":"Day 16: Leave Nha Trang to Saigon/City Sightseeing. (B, L)","description":"Leave Nha Trang City in the morning. Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Colon, which means “Big Market.” Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 17: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel 3* or similar"},{"title":"Day 18: Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. We will arrange the Transfers take you to Airport for your International flight! The unforgettable Vietnam Trip with Legend Travel Group will be finished at Airport! Good bye & see you in the next times!"}]},{"name":"Sapa 3 Days 2 Nights Trekking Tour From Hanoi (2 Nights in Hotel)","duration":3,"travelStyle":["Hiking & Trekking","Mountain Hikes","Group","Partially Guided","Holiday"],"oldPrice":185,"price":130,"summary":"\n  Explore the real life of diverse hill tribe peoples\n  Admire the beautiful landscapes of rice paddies on terraces\n  See the most popular travel sites in Sapa: Cat Cat, Lao Chai, Ta Van and Giang Ta Chai\n  Visit the most well-known ethnic groups in the region\n\nPlease note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147252_8276ef65.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147252_8276ef65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_b1224ae4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_a4ef837a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_4cc4e879.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_ca27b36d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_c55080a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_b7c57152.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_34ae0918.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_6353ac14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_d3ca0d55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_3229670c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_44f0520e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_62778e10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147252_c6675575.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Hanoi – Sapa by bus with a short trek to Cat Cat village (L, D)","description":"6.30 – 7.00: Pick up from your hotel/stay in Hanoi Old Quarter, get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costumes of H’mong, Dzao, Tay ethnic People. And Waiting about 30min at the bus station for the tour guide & driver pick up you to Hotel.\nWelcome drink and itinerary briefing\nEnjoy the lunch with local Vietnamese dishes, check-in procedures\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n16.30: Come back to Sapa Town. We prepare a good dinner for you at 18.00. Overnight at the hotel"},{"title":"Day 2: Sapa discovery with long trek Y Linh Ho - Lao Chai - Ta Van village (B, L, D)","description":"7.00 – 7.45: Have breakfast at hotel and prepare light pack for the long trek of 9 kms\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain then trek to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 4 hours\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n12.00 – the Evening: Have lunch and enjoy free time in the afternoon do discover Sapa town by yourself. Have    dinner and overnight in the hotel. "},{"title":"Day 3: Sapa - Lao Cai - Bus to Ha Noi (B, L)","description":"6.00-8.00: Breakfast and you have free time for enjoin to visit to Sapa or Fansipan Mountain peak with cable car (Indochina highest - 3143m above sea level) by yourself.\n11.00: Check out and clear bills, have lunch at the hotel and time at leisure on your own.\n15.00: Meet all group members at hotel to get ready for Hanoi\n15.15: Get on bus to go back hanoi with one comfort break\n21.00: Arrive Hanoi. Trip ends."}]},{"name":"Vietnam in Depth - 19 Days","duration":19,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":2464,"price":1232,"summary":"Start in Hanoi and finish in Ho Chi Minh City\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new resort in the Northwest of Vietnam\nLearn about Vietnam history through Imperial City - Hue\nExplore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\nDiscover Phong Nha - Ke Bang Caves - World Heritage\nRetreat on the one of the most beautiful Beaches - Nha Trang Beach\nChillout in Ho Chi Minh City - the biggest City of Vietnam\nAnd more...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186934_0d9134c1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186934_0d9134c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_f95adc22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_27ec4cdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_5ef2c5c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_63a1bb79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_a9548ad6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_f4481049.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_b7acad27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_c15db848.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_f60c10ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_975a229b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_af14dd04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_f30dbd6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_5478f2fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_9f7fe8a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_afb40b2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_832a632a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_3b9a1d58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_253153b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_87001c9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_7ec61fe7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_f2ee0401.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_52318f84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186934_8fd1fe71.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hue","Phong Nha-Kẻ Bàng National Park","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi City Tour full day (B, L)","description":"Breakfast at hotel.\nDepart at 8:00 am from your hotel by van. \nWe will begin our day by visiting Uncle Ho, learning about his great life at the Ho Chi Minh Mausoleum, Presidential Palace, and his residential place. \nNext stop is the nearby Temple of Literature. The site of Vietnam´s first University, built in twelfth century, to teach Confucius’s theory to royals. Here we will also have a chance to see a traditional music performance. \nLunch will be served at a local restaurant for a taste of authentic Hanoi Pho (noodle soup). \nIn the afternoon, choose one from the numerous museums or temples around Hanoi (Museum of Ethnology, Women´s Museum, History Museum or Quan Thanh Temple). \nIn the late afternoon walk around Hoan Kiem lake and Hanoi´s fascinating Old Quarter for some great fun, shopping, and street side traditional food, may be to try one “Hanoi bia”. This is your chance to be part of typical Hanoian style and its traditional Vietnamese culture. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 3: Hanoi - Halong Bay Cruise (B, L, D)","description":"Breakfast at hotel\n8:30-9:00 AM you will be picked up from hotel lobby for the journey to Halong Bay. \nAfter 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the port. \n12:30 PM Board your boat and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave” or other ones, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck. Overnight on the Cruise.\nGarden Bay Cruise 3* or similar"},{"title":"Day 4: Halong Bay Cruise - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs. \nHave lunch on boat while cruising back to the Halong City pier, return to Hanoi.\nArrive in Hanoi around 4:30 PM\nFree at leisure to discover the city and local food. Overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan via Hoa Binh city.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Hue (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Hue City. Overnight on the Train (4 Berth Cabin sleeper sharing)"},{"title":"Day 7: Hue Arrival - Hue Half Day City","description":"Arrive in Hue City about 9:00 am. Today, you`ll prepare the breakfast by yourself because overnight train doesn`t serve breakfast.\nWe`ll pick you up and take you to hotel to store your luggage. You are free for leisure in the morning time.\n1:00 pm. Be picked up and transfer to visit Thien Mu Pagoda on boat, overlooking the Perfume River and the beautiful scenery beyond. Take some time here to learn about the influences of Buddhism in Vietnam. Visit Minh Mang Tomb\nPM: Check in your hotel. Free at leisure and stay overnight in Hue City\nHue\tCherish Hotel 3* or similar"},{"title":"Day 8: Phong Nha - Ke Bang National Park (B, L)","description":"06:30am Picking up at hotel\nAround 08:00AM, visiting La Vang Holy Land (Christians believe that Mary showed flexibility in this area in 1798 and a church was erected. It is an important place of pilgrimage for Catholics of Vietnam and La Vang Holy was recognized by the Vatican)\nOn the way, information about DMZ of Quang Tri is introduced as the bus passes by the 17th parallel line (a demilitarized zone established as a dividing line between North and South Vietnam during the Vietnam War)\n11:30AM Arriving at Phong Nha and having lunch\nAfter lunch, at 12:45PM continue to Zipline Center. \nFrom the center, taking a zipline all the way to Dark Cave (Hang Tối), beautiful stalagmites and stalactites can be observed once inside the cave, there is also a chance to dip in a cool mineral mudpool. Exiting the cave and kayaking back to the center (or taking a motorboat back). \nEnjoying water sports (free of charge) at the center such as river swing, river swimming, paddling chair, etc. \nBack to the bus at 03:00PM and returning to Hue\n07:00pm. Arriving in Hue and dropping off at hotel for overnight. \nHue\tCherish Hotel 3* or similar"},{"title":"Day 9: Hue - Danang - Hoi An by Road (B)","description":"Breakfast at hotel\nToday, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. \nOn the way, stop at Marble Mountain, Cham Museum for your view (entrance fee is on your own)\n15:00 arrive in Hoi An - one of the most beautiful ancient town in Vietnam. \nStay overnight in Hoi An Ancient Town.\nPhu Thinh Resort 4* or similar"},{"title":"Day 10: My Son Holy Land half Day (B)","description":"Breakfast at your hotel\nLeave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An.\nLocated in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. \nReturn to Town for lunch (own arrangement). \nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 11: Tra Que Herb Village and Cooking Class (B, L)","description":"In the morning, your guide will meet you at your hotel. You experience a bike ride towards Cẩm Thanh village. Right here you take a bamboo boat ride, and learn how to make traditional bamboo handicrafts with locals.\nNext, you cycle to the fishing village of Thanh Nam, where you can see local fishermen catching fish, crabs, squids and shrimps. It is interesting to know that the fishing village is still actively working, even with the appearance of modern fishing methods in Vietnam.\nYou take the next stop at the Tra Que village, where you will enjoy a welcome drink and a walk around this agricultural village. You will meet local farmers and join in with activities like hoeing and sowing.\nYou will have a great time with a cookery lesson. You may learn how to make spring rolls and crispy Vietnamese pancakes, before enjoying a traditional Vietnamese lunch of 7 courses. \nFinally, you cycle back to Hoi An for the end of the tour. Check in hotel and stay overnight in Hoi An Ancient Town.\nPhu Thinh Resort 4* or similar"},{"title":"Day 12: Hoi An Departure - Nha Trang City by Flight (B)","description":"In the morning, you leave Hoi An for Da Nang Airport to take the domestic flight to Nha Trang - Beach City. \nUpon reaching to Nha Trang airport, be welcomed and transferred to your hotel. \nOvernight in Nha Trang City. \nRegalia Nha Trang Hotel 3* or similar"},{"title":"Day 13: Nha Trang Islands Tour full day (B, L)","description":"Highlights: Tri Nguyen Aquarium - Tranh Beach - Mun Marine Park - Fishing Village - Con Se Tre Village\nStart from your hotel to Cau Da port. \nTri Nguyen Aquarium on Mieu Island is the first place to visit, many sea species of Nha Trang/Khanh Hoa province make a small ocean world there. Mun Island is the best island for snorkeling where you can see lots of lives colorful corals and fish.\nYou will also be able to see caves in which the sea swallows make their nest.Then relaxing, swimming & doing water sports or other activities at Mot Island, Tranh Beach Island or on a small island calling “Mini beach”. \nTaking a fresh lunch at the island. On the way back you will visit a fishing village before going to the shore. Return to hotel around 6:00pm. Check in & overnight in Nha Trang City.\nRegalia Nha Trang Hotel 3* or similar"},{"title":"Day 14: Free for leisure on the Beach (B)","description":"You`ll have breakfast at hotel and free for leisure on the Beach. The time belongs to you whole day. Overnight in Nha Trang Hotel.\nRegalia Nha Trang Hotel 3* or similar"},{"title":"Day 15: Free for leisure on the Beach (B)","description":"You`ll have breakfast at hotel and free for leisure on the Beach. The time belongs to you whole day. Overnight in Nha Trang Hotel.\nRegalia Nha Trang Hotel 3* or similar"},{"title":"Day 16: Nha Trang Departure - Ho Chi Minh City by Flight (B)","description":"In the morning, you leave Nha Trang to take the domestic flight to Ho Chi Minh City. \nUpon reaching to Tan Son Nhat airport, you are warmly welcomed by our friendly guide and start your tour around Saigon City Landmarks, almost all of the places of traveler’s interests are located near the town center. \nFree to discover the city on your own way\nRecommend historical sites: Reunification Palace (This famous edifice was ever a former residence of the President of Southern Vietnam until the end of April 1975), Old Sai Gon Post Office, Notre Dame Cathedral, War museum \nRecommend shopping area: Saigon Square, Binh Tay Market, Ben Thanh market etc. \nStay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 17: Cu Chi Tunnels half Day Tour (B)","description":"Breakfast at hotel at 7:00am\n8:00am - 8:30am: Take a half day trip to visit Cu Chi Tunnels for an half day Tour.\nWalk through what were once the front battle lines during the Vietnam War. \nYou can weave your way through the extensive tunnel system or even pay a small fee to try your aim with several firearms - AK47 included.\n1:00pm. Arrive at hotel. Check in & overnight in Ho Chi Minh City\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 18: Saigon city - Free at leisure (B)","description":"Breakfast at hotel \nFree at leisure to enjoy your last day in Vietnam, shopping and pack your luggage.\nOvernight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 19: Ho Chi Minh City - Airport for flight home (B)","description":"After breakfast, you will be picked up from the hotel lobby for your international flight home. \nEnd of services with great memories about Vietnam  with us. 5* Reviews made by you is the best prize for both Tourradar and Legend Travel Group!\nThank you so much and hope to see you again soon!"}]},{"name":"Hanoi Culinary Experience","duration":10,"travelStyle":["Food & Culinary","Group","Partially Guided"],"oldPrice":0,"price":1152,"summary":"Vietnam is the most magical country when it comes to food, a mix of Thai and French food. Street food and markets that will intrigue and excite, dishes that will blow you mind, Bun Cha, Pho, Bang Mi and caramelized fish. Once you have completed this culinary experience, the countries culture and grace will live with you forever.\t\t\t\t\t\t\t\t\t\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198016_5e95642081012.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198016_5e95642081012.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198016_5e95642081017.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198016_5e95642081019.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi Arrival (-/-/D)","description":"\tXin chao! Welcome to Hanoi, Vietnam. Hanoi is one of Asia’s most enchanting cities and is full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted by your guide and driver at Noi Bai International Airport for your transfer to the hotel.\n\tLate afternoon, we will begin our culinary journey in Vietnam at a bia hơi restaurant. Enjoy a few glasses of fresh cold beer, rice crackers & peanuts while watching the sunset on the side of West Lake, the biggest lake in Hanoi city.\n\tEnjoy welcome dinner at local restaurant.\n\tOvernight in Hanoi.\n"},{"title":"Foods & Markets (B/-/D)","description":"\tToday we will skip the breakfast at the hotel and rather venture out to the streets of Hanoi for breakfast. Walk to Hang Be market, a local market which is hidden among the Old Quarter. Hang Be market is famous for its talented ladies who sell their home cooked foods as well as vendors with the freshest vegetables and high-quality meat & fish in the town. Turning into a small alley near Hang Be market, we will arrive in a courtyard filled with various food stalls. Savour a bowl of tasty noodles for breakfast, before making our way to enjoy a popular drink of Hanoi - lime ice tea or a caffeine dose near St. Joseph's Cathedral. You will have some free time to explore the city by yourself until our tour continues in the late afternoon.\n\tAt 4:00pm, you are transported to a different part of the city to visit Thanh Cong market - a typical market of Hanoi. Once here, we will meander through the market stalls and along the trails. Stop in the middle of the market to taste nem – a traditional Vietnamese spring roll. We will leave the market and make our way to a street food paradise. The street food paradise is hidden in a yard among apartment buildings and is full of restaurants and food stalls. Now is your chance to get adventurous as you are then free to try the variety of Vietnamese food in this yard. \n\tOvernight in Hanoi.\n"},{"title":"Hanoi – Ha Long Bay (B/L/D)","description":"\tToday we will start early at 6.00am, to enjoy a leisurely walk around Hoan Kiem Lake before joining in with the local laughter yoga at Ly Thai To Park - a combination of Laughter Exercises with Yogic Breathing (pranayama), so that one increases the amount of oxygen in the body which helps to make you feel more healthy, energized, and alive. Bid farewell to our friendly yogi, and continue our morning walk through the streets of the Old Quarter to buy some famous local bánh mì on the way before stopping at Giang Café to try the signature egg coffee. \n\tAt 9.00am we will head to Halong bay for a majestic 2D1N cruise trip in one of the most famous natural wonders of the World. Departing Hanoi this morning, we drive across the Red River delta and reach the coast a little before noon. We then embark on a beautifully crafted junk for an overnight cruise in the legendary seascape of Ha Long Bay. Once on board, we are served a delicious seafood-based lunch, while the surrounding limestone outcrops make for a truly magical setting. In the afternoon, we reach a less travelled area where we will devote ourselves to pure relaxation. The program is not fixed and depends on the time of the year and weather, but there will be an opportunity to visit a cave as well as to explore a floating village over the course of these 2 days. We end the day on the sundeck as the sun sets on this magical seascape. This evening, you can enjoy an aperitif or attend a cooking demonstration before dinner.\n\tOvernight on board in a comfortable private cabin with an en-suite bathroom.\n"},{"title":"Ha Long Bay – Hanoi (Brunch/-)","description":"\tFor those early birds, start the day with a proposed Tai Chi session, while tea and coffee are served as the sun rises and illuminates the surrounding seascape. We then continue our exploration of the bay. Upon returning to the boat, check-out of your cabin and enjoy a light brunch while cruising back to the pier. We disembark and transfer back to Hanoi.  \n\tOvernight in Hanoi.\n"},{"title":"Rice Wine & The Noodles Trail (B/L/D)","description":"\tThis morning is free for you to enjoy at your own leisure until you are transferred to Van Village - a village with a long-lasting tradition of brewing rice wine, which is considered the best of its kind in the region of the Red river. Meet with Mrs. Huyen, a rice wine artisan and enjoy a hearty lunch with her, then taste some of her rice wine before learning more about the traditional rice wine distillery process in Vietnam.\n\tHead back to the city at late afternoon to start our noodles trail. Vietnam is definitely a noodles-country with no less than 6 different types of them. Trying all 6 in a single meal would be too much. So we have selected three noodle-based dishes, leaving aside the classic bún chả, bún bò or phở soup that one can very easily try on your own at just about every corner of the city centre, rather we are going to take you on a nice urban walk to sample some other popular dishes. We start from the covered market of Dong Xuan, passing the “under-the-railway zone” and reaching the charming little Hong Phuc Street, where we will try some bánh đa with fish. Bánh đa is a flat brown noodle made from rice and often served with seafood. We continue our digestive walk to Phan Dinh Phung - one of the most beautiful streets in Hanoi, then turn onto Truc Bach peninsula which is full of specialised pho food shops. We will try the famous phở noodles, the same ones used in the iconic soup of the same name. You will discover different ways to prepare these noodles, sautéed or rolled with beef and veggies. Last but not least, we walk to another little street called Yen Ninh where we will have some miến with eels. Miến are glass noodles, translucent and made from starch.\n\tOvernight in Hanoi.\n"},{"title":"Free at Leisure (B/-/-)","description":"\tEnjoy a full day exploring this amazing city at your own pace. Hanoi boasts an extensive mix of charm and atmospheres through its different districts, which are made of diverse architectures, green parks, lakes and daily street life. The city is large and offers much to see and do - here are our top recommendations: for shopping enthusiasts, head to Collective Memory (12 Nha Chung Street) for a gold mine of shopping experiences. For foodies, you’ll find some of the best street-food in the entire city at lunch time on a very narrow street called Ngo Trung Yen at the heart of the Old Quarter. Other enjoyable experiences of Hanoi include sipping on a fresh beer at a bia hoi (try the one at the western edge of Bat Dan Street); having a traditional coffee on Yen Hoa Street nearby the Ho Tay Lake; enjoying a sunset from the Long Bien bridge; or download the Grab app to your mobile phone and explore the city from the back of a motorbike, as you choose your own route through the city, stopping at your desired sites along the way.\n\tOvernight in Hanoi.\n"},{"title":"Farming Village (B/L/-)","description":"\tThere are two very important elements of Vietnamese culinary: fresh ingredients and taste balancing. Set off to the west of Hanoi city to meet the skillful farmers of Song Phuong village and spend your day learning to cook common Vietnamese dishes with the villagers. Meet Mrs. Manh at the village market, where you will start a market tour and buy some fresh ingredients to cook later on. Follow our friendly host along the trails through the fields and farms to harvest the vegetables and herbs for our lunch. Returning back to her house, we will join hands and together make our own tasty Vietnamese meal.\n\tArrive back in the city in the late afternoon.\n\tOvernight in Hanoi.\n"},{"title":"Signature Dishes of Vietnam Culinary (B/L/-)","description":"\tThis morning, we will continue to pursue the secrets of Vietnamese culinary with the most famous dishes - phở, bún chả and bánh cuốn. We will travel all the way to the countryside of Hanoi city to meet a woman whom is famous in her village for her cooking skills. She will guide you step-by-step to cook three signatures dishes of Vietnam. Savour your culinary delights over lunch.\n\tYou will be transferred back to the city at late afternoon and you can enjoy the rest of the day at your own leisure.\n\tOvernight in Hanoi.\n"},{"title":"The Sweetness of Hanoi (B/-/-)","description":"\tThis afternoon, we will start our tour from Dong Xuan market and walk through the market to the Dong Xuan alley to sweeten the journey with one of the many kinds of chè - Vietnamese sweet beverage/ dessert soup. Our next stop is on Hang Duong Street at a traditional ô mai shop to buy some ô mai - Vietnamese dried fruits with a sweet and sour taste. Continue walking the small streets to a traditional dessert cake shop to buy some cakes to complete our afternoon tea party. Back in the car, we drive to a tea house where we will relax as we enjoy all those ô mai and cakes with some delicious Vietnamese tea.\n\tOvernight in Hanoi\n"},{"title":"Hanoi Classics - End of arrangement (B/L/-)","description":"\tAfter breakfast at hotel, head out to Ethnology Museum which gives an excellent overview of the country's ethnic groups, their customs and ways of life. The highlight here is the large, beautiful outdoor area featuring genuine houses and compounds as built and used by the many different ethnic groups. Next visit is The Temple of Literature, dedicated to Confucius was built in the 11th century. It was the first university in Vietnam and students still come here to burn incense. You will find a peaceful atmosphere tinged with incense smoke, and sunken lotus ponds populated by fish and turtles. \n\tAfter lunch, we take you visit the Ho Chi Minh complex, pass in front of the impressive mausoleum and take a nice stroll in the lush gardens of the Presidential Palace that includes the one-pillar pagoda and the house on stilts of Ho Chi Minh.\n\tBack to your hotel, say goodbye to our guide, end of services for today. You will check out tomorrow at 12pm and have your own arrangement onward, no airport transfer is included.\n\tEnd of services.\n"}]},{"name":"Highlight Vietnam Tour plus Phu Quoc Island - 20 Days","duration":20,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2342,"summary":"Hanoi: Sightseeing with a Local Guide; water puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95653_5e02f0d15e34d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95653_5e02f0d15e34d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_b4272f93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_8218e70f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_ec14c140.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_5d2edfdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_9451b792.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_fa9d2c89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_db7808bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_d3e722e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_42edf135.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_b999cfd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_9c24f9c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_e672b503.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_6734d73b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_7f80e69e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_2998c4e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_2f130eb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_d3b8169f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_e6375f89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_2ba6fd75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_15fab113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_274890eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_c43c3a59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95653_bf45b87c.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Halong Bay","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi Sightseeing full day and spend Night train to Sapa (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Dinner time then transfer to Railway Station. Take night train to Sapa. Overnight on the train.\nLivitrans Express Train, 4 Berth Cabins (Soft Sleeper)"},{"title":"Day 3: Sapa arrival and trekking to the Villages (B, L)","description":"Arrive Lao Cai Railway Station at 6:00am. Pick up to Sapa town for check in. Having breakfast and start trekking down to Lao Chai village to visit the Black H’mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Sapa Town.\nBamboo Sapa Hotel or similar"},{"title":"Day 4: Lao Cai- Bac Ha Sunday Market - Night train back Hanoi (B, L)","description":"After breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most wonderful and colourful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, horses… are all on sales. This is a golden opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H’mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30am. Overnight on the train.\nLivitrans Express Train, 4 Berths Cabin (Soft Sleeper)"},{"title":"Day 5: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Arrive Hanoi Railway Station at 5:30am. Pick up & transfer to hotel for short rest & breakfast until 8:30am. Leave Hanoi for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises Halong Bay or similar"},{"title":"Day 6: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 7: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 8: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 9: Hanoi free for leisure - Depart to Hue Imperial City (B)","description":"Today free to go shopping in the Hanoi Old Quarter or sightseeing by your own until 7:00pm. Pick up at airport then transfer to Train Station to take overnight Train to Hue City.\nOvernight on the Train. 4 Berths Cabin (Soft Sleeper)\nSharing Cabin (4 Persons) on Deluxe Cabin Train"},{"title":"Day 10: Full day sightseeing in Hue City - Old Imperial City. (L)","description":"Arrive Hue City by overnight Train around 9:00am. Pick up at Train Station in Hue then transfer to hotel for check in. Taking a short rest then:\nSpend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nHue Cherish Hotel or similar"},{"title":"Day 11: Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Overnight in Hue City.\nHue Cherish Hotel or similar"},{"title":"Day 12: Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble – and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 13: Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 14: My Son Sanctuary half day Tour & Leave Hoi An to Ho Chi Minh City. (B, L)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch. In afternoon, free go shopping in Hoi An Town. Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars.Overnight in Ho Chi Minh.\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 15: Visiting Cu Chi Tunnels & Cao Dai Temple in Tay Ninh. (B, L)","description":"This morning you take a drive to Cao Dai Temple in Tay Ninh, near the Cambodian border, is home to the unique Cao Dai sect, whose patron saints include Joan of Arc, Victor Hugo and Winston Churchill to name a few. The religion is a hybrid of Buddhism, Taoism, Confucianism and Christianity. The Cao Dai Temple at Tay Ninh has been described as a Walt Disney fantasia of the East. The temple’s exterior is decorated with multi-colored dragons of all shapes and sizes competing for space with a number of Buddhist symbols. Above the main entrance is the all-seeing holy eye, the symbol of the Cao Dai sect. The interior is just as engaging as statues of Jesus Christ, Buddha and the Hindu god, Brahma, stand side by side.\nThe trip to Tay Ninh is combined with a visit to the Cu Chi Tunnels. At its height, the tunnel system stretched over 250km. from Saigon to the Cambodian border and was three levels deep. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers and kitchens. Today the remaining tunnels have become a major tourist attraction giving the visitor a unique experience and a feel of what underground life during the US – Vietnam War. Arrive hotel in Ho Chi Minh City at 6:00 pm. Check in & stay overnight in Saigon.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 16: Full day to Mekong Delta/River Boat Trip. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City. Check in hotel & stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 17: Conclude Saigon/Ho Chi Minh City fly to Phu Quoc Island. (B)","description":"Having breakfast at hotel in Ho Chi Minh City then transfer to Airport to fly to Phu Quoc Island - the most beautiful Island of Vietnam! Enjoy the Beach relaxing!\nThien Thanh Resort Phu Quoc or similar"},{"title":"Day 18: Beach relaxing on Phu Quoc Island (B)","description":"Today you are free to discover \"Pearl Island\" and go to the beach by your own plan. Time belongs to you whole day! Overnight in hotel on Phu Quoc Island.\nThien Thanh Resort Phu Quoc or similar"},{"title":"Day 19: Beach relaxing on Phu Quoc Island (B)","description":"Today you are free to discover \"Pearl Island\" and go to the beach by your own plan. Time belongs to you whole day! Overnight in hotel on Phu Quoc Island.\nThien Thanh Resort Phu Quoc or similar"},{"title":"Day 20: Conclude Phu Quoc Island - fly back Ho Chi Minh City - International flight (B)","description":"Today you will finish the best Beach Vacation relaxing Tour in Phu Quoc Island. Fly back Ho Chi Minh City then take your International flight back home! The unforgettable Package Tour in Vietnam with Legend Travel Group will be finished at Airport! Good bye & see you in the next times!"}]}]