[{"name":"5 Days North Of Vietnam Package","duration":5,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":325,"price":270,"summary":"Hanoi, Halong bay, Sapa, Tam Coc are the most popular places in all North of Vietnam. With all inclusive tour, Vietnam Travel Top will bring you to all them and guarantee your satisfaction. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Visit UNESCO listed Halong Bay","Swim in the emerald waters of the stunning Ha Long Bay","Explore the emerald waters by kayak or bamboo boat","Learn more about rice cultivation in the mountain areas"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b194a6e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b194a6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1ae1bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1b0150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1b2e4e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1c3802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1c573e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1c78b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1c98e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1cd344.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1d42b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1dba97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1e5313.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1ed07e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b1f3232.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b20dbef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b21467d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136668_5e22c0b221c5c.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 01 Hanoi Arrival – Check in Hotel (in Hanoi Old Quarter). – Welcome drink.","description":"Pick up from the Noi Bai airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\n\nNote: Check in time is 13:00 P.M.\n\nOur people will greet and brief all information around the trip."},{"title":"Day 02 Hanoi – Halong overnight on cruise (B/L/D)","description":"Morning:\nShuttle bus picks you up from your hotel at 8:00am. Enjoy a scenic drive to Halong Bay with lush green paddy fields and romantic rivers. Embark on Cruise by noon for a short cruise briefing and check-in.\n\nAfternoon:\nSavour a delectable lunch as Cruises amongst the limestone islands. In the afternoon, we will stop at Surprise Cave, the most impressive cave in Halong Bay. Climb up the stairs and be thrilled by what Mother Nature has crafted here. Later return to main boat and continue cruising further into the Bay to Titop Island.\nHave a shower to relax then you can join us in our cooking class in the dining room or sunset party on sundeck. For the rest of the night, socialize with other guests, fish for squid, or just laze around. Overnight on board."},{"title":"Day 03 Halong – Hanoi (B/L)","description":"Start your day with morning Tai Chi exercises a photo hunt on the sundeck.  Have a light breakfast with coffee and tea and cake then head toward the Luon Cave. Come back to the ship and check out of your cabin while the farewell party is ready at the dining room. Passing famous sites like Ba Hang Fishing Village, Dog Islet on the way back to Ha Long Harbour. "},{"title":"Day 04 Hanoi - Hoa Lu & Tam Coc (Meals: B/L)","description":"08:00 Picking up from hotel/stay.\n08:30 Starting drive to Ninh Binh Province\n10:00 Arriving at Hoa Lu Ancient Capital\n10:15 Visiting King Dinh and King Le’s temples.\n11:30 Arriving in Tam Coc Wharf.\n11:45 Having buffet lunch with Vietnamese Cuisine.\n13:00 Getting on Sampan boats through caves and visiting countryside landscape\n15:00 Back to Tam Coc Wharf to chill out.\n15:15 Biking on country road around village\n16:00 Getting on shuttle bus to go back to Hanoi\n18:30 Saying goodbye to you at your hotel/stay"},{"title":"Day 05 Hanoi - Back Home (B)","description":"Breakfast at the hotel then free and easy. Wait until our driver come and pick you to the airport. \nTrip ends."}]},{"name":"Package Tour Crossing Vietnam - 5 Days","duration":5,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":566,"summary":"The best quality and unbeaten price for 5 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional Services\nStart in Ho Chi Minh City and finish in Hanoi\nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\n Hanoi: Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. Take part in Water Puppet show.\n Halong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3c37c8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3c37c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_4bcbab52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_186442b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_026e1c60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_7c7cf1d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_f8b992b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_815e11f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_6082ca43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_6e03eba0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_ecab8857.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3ce69a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3d3664.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3d8623.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3dd03b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9a3e1deb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4931fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4a0827.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4a7068.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4ada5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4b38a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76084_5e02e9c4b92d4.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Ho Chi Minh City, Vietnam","description":"Today you’ll land in Ho Chi Minh City (Tan Son Nhat International Airport). Warmly welcome by Tour Guide & Car Driver at airport then transfer to hotel for check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City Tour - Cu Chi Tunnels - Fly to Hanoi (B/L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War. After Cu Chi Tunnels you will take flight to Hanoi by Vietnam Airlines. Arrive Hanoi in the evening. Transfer to hotel for check in. Stay overnight in Hanoi.]\nPomihoa Hanoi Hotel or similar"},{"title":"Hanoi - Halong Bay Cruise stay overnight on Board (B/L/ D)","description":"Picking up from hotel at 8:00, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B/ L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Take part in Water Puppet Show an hour (optional). Overnight in Hanoi.\nPomihoa Hanoi Hotel or similar"},{"title":"Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group. Good bye & see you again!\nAirport transfer included!"}]},{"name":"Ho Chi Minh to Phu Quoc via Mekong Delta River 7 days","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":590,"summary":"\nWith one week of our Saigon to Phu Quoc via Mekong Delta in Southern Vietnam, you will visit Ho Chi Minh City with some highlight spots of Saigon China Town, Notre Dame Cathedral, Ben Thanh Market... then travel through Mekong Delta witnessing busy and colorful floating markets to Phu Quoc, a paradise island.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132490_a8ad25e7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132490_a8ad25e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_5ab76507.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_eb98c419.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_a046a665.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_6380aa73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_f782f1fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_b0a8e1d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_5db1aa00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_e97fc7af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_5319720b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_a9460701.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132490_f84f5f65.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Phu Quoc Island"],"timeline":[{"title":"Day 1: Arrive Sai Gon (No Meal)","description":"Arrival Ho Chi Minh city\nWelcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. \nOvernight in Saigon.\nIncluded: Private car pick up at the airport transfer hotel, No meal"},{"title":"Day 2: Ho Chi Minh city- Cu Chi tunnels (meals incl: B/ L)","description":"We start the trip by visiting Reunification Palace, whose former name was Norodom Palace. Ngo Viet Thu is exactly the architect who designed this stunning palace. Later, other next destinations consist of Notre Dame Cathedral, Central Post Office, and especially War Remnants Museum, where exhibits on Vietnam War and Indochina Wars are displayed. After enjoying lunch at the local restaurant, you will be taken to Cu Chi Tunnels. Before entering allotted areas of Cu Chi Tunnels, watch an introductory video which is an overview of the tunnel system’s history and Vietnamese’s life during the hard time of war.\nClimb down small tunnels to get amazing experiences and blow your mind when special constructed living areas and martial facilities of Viet Cong appear in front of your eyes. It will be great to know the system of tunnels – a subterranean village where there are bedrooms, kitchens, field hospitals, command centers, weapons factories, and storage. Moreover, taste special tea and cassava – the common food of Vietnamese guerillas in the past. Take your break time to try the real shooting gun or just relax as you wish.\nReturn to Saigon and end the trip. \nOvernight in Saigon. \n"},{"title":"Day 3: Ho Chi Minh City - My Tho - Ben Tre - Can Tho (meals inc: B/ L)","description":"Start from Ho Chi Minh City and depart for My Tho. After visiting Vinh Trang Pagoda, take a boat ride along the river viewing the stilt houses and the fruit plantations along the river bank. Proceed to Tortoise island and have lunch in the local restaurant. Enjoy a boat ride under the shadow of the water coconut trees to visit a family business which epitomizes the idyllic rural lifestyle. Then enjoy the seasonal delicious fruits & honey tea while listening to the  traditional music. Take a rowboat ride along the creeks. After taking a delightful walk through the fruit plantation and village, proceed to Can Tho. Have dinner (own expense) and overnight at your proposed hotel in Can Tho.\n"},{"title":"Day 4: Can Tho- Rach Gia- Phu Quoc (Breakfast)","description":"5:00 AM Wake early and leave the hotel to visit the famous Cai Rang Floating Market by motor boat. Experience the daily life of the Mekong River Delta as vendors from around the region gather to sell fresh fruits, local delicacies and handmade goods. \n8:00 AM come back hotel and then take a bus to Rach Gia with 3 hours driving to take the speed boat to Phu Quoc Island.  Situated in the Gulf of Thailand, 45km west of Ha Tien Province, the forested island of Phu Quoc and its beaches were voted as \"The most cleanest and beautiful beach of the world\" by the ABC News in the end of February, 2008\". \nUpon arrival, the hotel shuttle bus will come to pick up you at the jetty. Check in to hotel and free at leisure. \nOvernight in Phu Quoc\n"},{"title":"Day 5: Phu Quoc – Free at leisure (Breakfast)","description":"Breakfast at hoytel.\nFull day at leisure for beach activities\nLunch and dinner by yourself. \nOvernight at your chosen resort on Phu Quoc island."},{"title":"Day 6: Phu Quoc – Free at leisure (Breakfast)","description":"Breakfast at the resort. Full day at leisure for beach activities"},{"title":"Day 7: Phu Quoc- flight to Ho Chi Minh (Breakfast)","description":"Today you fly from Phu Quoc to Ho Chi Minh City's Tan Son Nhat Airport to catch your departure flight.\nTour ends."}]},{"name":"Best 7 Days North of Vietnam","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":486,"price":403,"summary":"Hanoi, Halong bay, Sapa, Tam Coc are the most popular places in all North of Vietnam. With all inclusive tour, Vietnam Travel Top will bring you to all them and guarantee your satisfaction. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Swim in the emerald waters of the stunning Ha Long Bay","Explore the emerald waters by kayak or bamboo boat","Visit UNESCO listed Halong Bay","Bicycle and Riverboat tour of Ninh Binh"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136669_c82ff404.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136669_c82ff404.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_f431741b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_874d4516.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_aa74b3d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_160a108e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_1b90a985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_29ff6d41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_75f21ad1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_dd7dc719.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_42d90fb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_a17f25b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_39ff2ec0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_8b592d46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54d10aaa4b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136669_5e54e0c80b3e4.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Airport pick up - Check in hotel in Hanoi","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\n\nNote: Check in time is 13:00 P.M.\n\nOur people will greet and brief all informationa round the trip.\n\nnote: Flight is not included in the price, whenever you arrive Noi Bai Airport, we will pick you up subjext to your flight time provided.Start point\n Hanoi old quarter, Hanoi, Vietnam 07:00 - 08:00"},{"title":"Day 2: Hanoi – Halong bay – Overnight on Cruise (B, L, D)","description":"Morning:\nShuttle bus picks you up from your hotel at 8:00am. Enjoy a scenic drive to Halong Bay with lush green paddy fields and romantic rivers. Embark on Cruise by noon for a short cruise briefing and check-in.\nAfternoon:\nSavour a delectable lunch as Cruises amongst the limestone islands. In the afternoon, we will stop at Surprise Cave, the most impressive cave in Halong Bay. Climb up the stairs and be thrilled by what Mother Nature has crafted here. Later return to main boat and continue cruising further into the Bay to Titop Island.\nHave a shower to relax then you can join us in our cooking class in the dining room or sunset party on sundeck. For the rest of the night, socialize with other guests, fish for squid, or just laze around. Overnight on board."},{"title":"Day 3: Halong Bay - Hanoi - Check in hotel in Hanoi (Meal: B, L )","description":"Start your day with morning Tai Chi exercises a photo hunt on the sundeck.  Have a light breakfast with coffee and tea and cake then head toward the Luon Cave. Come back to the ship and check out of your cabin while the farewell party is ready at the dining room. Passing famous sites like Ba Hang Fishing Village, Dog Islet on the way back to Ha Long Harbour. "},{"title":"Day 4: Hanoi - Sapa by bus - Cat Cat village – Sapa Hotel (L, D)","description":"6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa.\n\n9.30: Follow the highway to Lao Cai city with the first comfort break\n\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n\n13.00: Arrive Sapa Town with colorful traditional costums of H’mong, Dzao, Tay ethnic People.\n\nWelcome drink and itinerary briefing\n\nEnjoy the lunch with local Vietnamese dishes, check-in procedures\n\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\n\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n\n17.00: Come back to Sapa Town. Have dinner and overnight in hotel."},{"title":"Day 5: Sapa - Y Linh Ho - Lao Chai - Ta Van – Hanoi (B/L)","description":"7.00 – 7.45: Have breakfast at hotel and prepare light pack for trekking\n\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\n\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n\n12.00 – 15.00: Have a shower at hotel, check out and have lunch and time at leisure on your own.\n\n15.00: Meet all group members at hotel to get ready for Hanoi.\n\n15.15: Get on bus to go back to Hanoi with comfort break.\n\n21.15: Transfer to and Check in hotel in Hanoi"},{"title":"Day 6: Hoa Lu Tam Coc 1 day tour (B/ L)","description":"8.00 – 8.30 am:  Picking up from hotel/stay.\n\n08:30 Starting drive to Ninh Binh Province\n\n10:00 Arriving at Hoa Lu Ancient Capital\n\n10:15 Visiting King Dinh and King Le’s temples.\n\n11:30 Arriving in Tam Coc Wharf.\n\n11:45 Having buffet lunch with Vietnamese Cuisine.\n\n13:00 Getting on Sampan boats through caves and visiting countryside landscape\n\n15:00 Back to Tam Coc Wharf to chill out.\n\n15:15 Biking on country road around village\n\n16:00 Getting on shuttle bus to go back to Hanoi\n\n18:30 Saying goodbye to you at your hotel in Hanoi.\n\nNote: Sometimes, we will switch to visit Tam Coc first and then Hoa Lu."},{"title":"Day 7: Hanoi Departure (B)","description":"We will arrange car to airport for you, please advise your flight details.\n\nIf you need any further arrangement: tour to Hoi an, Ho Chi Minh City…please advise.End point\n Hanoi old quarter, Hanoi, Vietnam 17:00 - 18:00"}]},{"name":"Vietnam Legend Beach Vacation 10 Days","duration":10,"travelStyle":["Beach","Family","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":1037,"summary":"Why choose Vietnam for your Beach Vacation?\n\nWith over 2,000 kilometers of coastline facing the clear waters of the South China Sea, Vietnam has dozens of silky smooth sandy beaches for your choose. Many of them are still relatively untouched by tourism and retain their traditional charm with small fishing villages and historical sites to explore nearby. The epitome of unspoiled natural splendor, Vietnam’s Beaches are resplendent from top to tip, whether you’re treating the family to a stay in lively Nha Trang, exploring the historic town of Hoi An or escaping to a lovely resorts on white sandy beach Mui Ne. We highly recommend combining a beach stay with one of our touring itineraries to ensure your holiday is both fulfilling and rejuvenating.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95451_0d001e2d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95451_0d001e2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_9e52e4e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5f562e21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_0158aa49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5dab678e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_1bf7d6fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_7361349a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_7528e09f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_ff0a7e66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_f751f96b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_bdf1f6e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_17e4f704.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_41d8af86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_9b2cdfe9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_f8883b72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_dc05d138.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_0c993403.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_3753fe78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_318ad2f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_a42f0f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5e030c0f3214e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5e030c0f432a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5e030c0f4a3a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95451_5e030c0f51141.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Hoi An"],"timeline":[{"title":"Ho Chi Minh City (Formally Saigon) arrival","description":"Today, you will be warmly welcomed to Ho Chi Minh City - the hustle and bustle metropolis of Vietnam. On your arrival, our guide and driver will pick you at the airport and transfer you to your hotel. After check-in, it is your free time to discover the Saigon night life. More experience, more fun. Stay overnight in Ho Chi Minh City.\nDistance: Tan Son Nhat Airport: 8km or 30 minutes driving.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Saigon City Full Day Trip (B, L)","description":"Despite not being capital of Vietnam (Hanoi), Saigon is still the most exciting and favorite city of Vietnam. As the heart and the soul of Southern Vietnam, Saigon represents an image of fast-moving and dynamic metropolis.\nStart your tour with Re-Unification Palace, the Central Post Office, the Notre Dame Cathedral, and the War Remains Museum. Other important tourist sites as Jade Emperor Temple, China town and Ben Thanh Market will be your next destinations after lunch. Stay overnight in Saigon.\nRouting: Notre - Dame Cathedral - Saigon Central Post Office - Reunification Palace - War Museum - Emperor Temple - China Town - Ben Thanh Market.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 3: Saigon - Phan Thiet City - Mui Ne Beach (B)","description":"After breakfast, you will have an exciting day for meeting up with sandy beach Mui Ne. Along this scenic 220-km-drive towards the North on Highway One, you will pass a bustling city of Bien Hoa and some plantations of dense rubber. As getting nearer to Phan Thiet, you enjoy more impressive beauty of a semi-desert with cactus plants and amazing-looking dragon fruit trees. Upon arrival, head towards Mui Ne beach for hotel check-in. Then take your heavy clothes out and replace by the sexiest and hottest bikini/swim suites to enjoy the sandy and sunny beach. Relax and stay overnight at resort in Mui Ne.\nDistance: Saigon - Mui Ne: 220 km or 5.5 hours driving.\nTien Dat Resorts Mui Ne or similar"},{"title":"Day 4 - 5: Mui Ne Free & Easy Day (B)","description":"You have a free day to explore Mui Ne on your own in wonderful places like Golden Sand Dunes, Pink stream or just enjoy a sunbathing on the beach. Stay overnight at resort in Mui Ne.\nTien Dat Resorts Mui Ne or similar"},{"title":"Mui Ne - Nha Trang (B)","description":"After breakfast, leave Muine for Nha Trang Beach. On the way, stop at Phan Rang to see the 13th century Po Klong Jarai Cham Tower on a rocky hill with prickly pear cacti around. Then, continue the journey on Highway One to the coast, past Ca Na beach before reaching Nha Trang Beach City. Stay overnight in hotel in Nha Trang.\nDistance: Mui Ne - Nha Trang: 219 km or 5.5 hours driving.\nRegalia Hotel Nha Trang or similar "},{"title":"Day 7: Nha Trang - Islands Tour (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nRegalia Hotel Nha Trang or similar "},{"title":"Nha Trang - Hoi An by flight (B)","description":"Leave Nha Trang to Hoi An - an ancient town of Quang Nam Province. This journey need the domestic flight from Nhatrang to Danang airport. Arrive in Danang, you will be greeted to transfer to hotel in Hoi An for check-in. Stay overnight in Hoi An. Discover Hoi An ancient town by night.\nDistance: Da Nang airport - Hoi An Town: 35 km or 45 minutes driving.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An Ancient Town (B)","description":"Immerse yourself in the tranquility of the Ancient town of Hoi An. In the 16th and 17th centuries, Hoi An was a busy international port frequented by the foreign merchants to trade and buy the high-quality silks made there. Hoi An has become an attractive destinations for visitors to explore its resorts, cafes as well as to admire its originally intact looks. The old houses dating back from more than 100 years ago are still served in its first appearance. Pay a visit to Japanese Bridge, Phuc Kien Assembly Hall, Phung Hung Ancient House…on a city tour. Enjoy Hoi An gastronomy, architecture and cuisine will surely a great satisfaction. Stay overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - Saigon by 45-minutes of flying - Departure (B)","description":"Free at your own interest until the driver and the guide transfer to Danang Airport for a flight to Ho Chi Minh City, take the connecting flight home or to the next destination. End of tour services. Have a safe journey and see you soon!\nLegend Travel Group can also arrange the flight to Hanoi instead of flying back to Ho Chi Minh City!"}]},{"name":"Vietnam Northern Tour to Hanoi - Sapa - Halong Bay","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":897,"summary":"This is a very popular tour including main tourist sites in Vietnam Northern. With a 8-day trip but we have a chance to discover the life style of the hill tribe, the terraced rice field in Sapa as well as the world heritage sites of Halong bay…","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170812_3deffcaf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170812_3deffcaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_36f6b47c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_deb73b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_01a04309.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_5337a101.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_bc7c6d42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_f1534b75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_fae6f8a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_ebf1be9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_70da85ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_8ba7c664.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_d502fa7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_6cfd3c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_f436f2dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_70566059.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_1cfc28cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_84951d51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_93224af0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_a81294fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170812_8a985d54.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Halong Bay"],"timeline":[{"title":"DAY 01: HANOI – ARRIVAL","description":"When you arrive at Noi Bai airport – Hanoi, right after getting out of the restricted area, you will see our guide waiting for you at the lobby with a board of your name. Then our driver will take care and transfer you safely to Hanoi center for checking in hotel in Hanoi.\n* Meal code: (no)\n* Services: Pick-up private car with guide, Hotel in Hanoi.\nO/N in Hanoi."},{"title":"DAY 02: HANOI FULL DAY CITY GROUP TOUR – WATER PUPPET SHOW (B/L)","description":"After breakfast in our hotel then at 08h00 to start the journey to visit the Hanoi old quarter by bus. We will take you pass Hoan Kiem lake, see the peaceful waters and visit Ngoc Son temple, Ho Chi Minh mausoleum, Museum. Enjoy the architectural and historical aspects of Uncle’s O final resting-place. Just nest door is Ho Chi Minh’s house on stilts, lying to one side of the mausoleum is the One Pillar Pagoda, founded by King Ly Thai To in 1049, this structure has become an important symbol for the people of Hanoi.\nContinue to visit Quan Thanh temple and Buddist Tran Quoc pagoda on West lake ( one of the oldest in Vietnam) Lunch time then proceeding to visit the Ethnology museum, continue to visit the literature temple and Quoc Tu Giam, which is the first university of Vietnam since 1070. It’s gardens and well-preserved architecture offers a relaxing glimpse in to Vietnam’s past. Getting back to our hotel at round 16h30 for relaxing, shower… then you will be free to go out for dinner.\nBy the end of day (at around 18:30 or 20:15), you will have a chance to enjoy the first-class tickets for a “Water Puppet Show” prolonging roughly within 1 hour. You can totally walk by yourself from your hotel to the Water Puppet Theatre for around 3 – 5 minutes.\nFree time to visit and relax in Hanoi, overnight in Hanoi hotel.\n* Meal code: (B,L)\n* Services: Hanoi City Group Tour, Water Puppet Show, Hotel in Hanoi.\nO/N in Hanoi."},{"title":"DAY 03: HANOI – SEAT-IN COACH BUS TO SAPA – CAT CAT VILLAGE (B/L/D)","description":"06h30 – 07h00: Pick up at hotel or at the meeting point and then start departure to Sapa, following Noi Bai – Lao Cai high-way.\nAlong the way, you will have chance to contemplate the beauty of northwest mountains that terraced fields are sparkling in sunlight or dim in thick fog. Have a short break for 30 minutes then continue the trip to Sapa.\n13h00: Arrive in Sapa, check in hotel and have lunch.\nAfternoon: Start trekking to Cat Cat village, about 45 minutes walk from Sapa, this is the village of Black H’Mong hill tribe. The village is on the slope of the hill and easy walking, rice and corn are grown here.\nVisiting Cat Cat village, you will have a chance to visit a big waterfall on the stream and the old Hydro Electric Power Station built by French people.\nThat is the image of young women sitting by looms with colorful pieces of brocade decorated with designs of flowers and birds. When these pieces of brocade are finished, they are dyed and embroidered with beautiful designs. A note worthy is that H’Mong women use indigo plants and leaves to dye these brocade fabrics. And then they roll around and smooth section of wood covered with wax on fabrics to polish them, making their colors.\nEvening: After dinner, you are free to explore the charm of Sapa by night, enjoy roasted corn, baked eggs beside charcoal fire or go shopping. Especially on Saturday night, we highly recommend a stop at the Love Market which is one of unique cultures of ethnic minorities HMong, Dzao in Lao Cai in particular and North West of Vietnam in general.\nDinner and overnight at hotel in Sapa\n* Meal code: (B,L, D)\n* Services: Bus Limousine to Sapa, Group Tour to Cat Cat Village, Hotel in Sapa."},{"title":"DAY 04: SAPA – FREE – OPTIONAL TO MINORITIES MARKETS (B)","description":"Today, you will have free time in Sapa to relax and discover Sapa town by yourself.\nAnd if needed, you can choose one of below optional tours:\nOption 1: Coc Ly Market, Private Tour (Tuesday only)\n=> The tour price applied to a private group of 2 people is USD 85.- per pax\n=> The tour price applied to a private group of 3-4 people is USD 75.- per pax\n=> The tour price applied to a private group of 4-8 people is USD 60.- per pax \nHighlights:\nThis is a unique market, which takes place only on Tuesday. Coc Ly is a very small market where you can meet several ethnic minorities such as Flower Hmong, Black Zao, Phu La, Nung and Tay. The trip offers you a one-way boat ride along Chay River and a short walk to Trung Do village of Tay minority\nItinerary:\nAfter having breakfast, you will travel by car from Lao Cai Railway Station. The ride is relatively flat from Lao Cai. It will take you through rural area. The road is rougher for the last 30km. You arrive in Coc Ly by the time where the market is the most crowded.\nCoc Ly market locates by the Chay River, which flows from China. Every Tuesday morning, minorities from surrounding villages such as Flower Hmong, Black Zao and Tay, gather to sell and buy their products. After visiting the market, you travel by boat downstream. Along the ride, you can enjoy magnificent sight of the beautiful caves and life on the riverbank. You will have lunch on a beach or later in a village.\nThe trip will also offers you a visit to Trung Do village of Tay minority, where you can stop by a traditional Tay house for a cup of tea. You will go further downstream until you arrive to Bao Nhai Bridge. Here you get on the car for the journey back to Lao Cai.\nApprox: 5 hours driving/ 1.5 hours boat cruise/ 0.5-hour walking/ 1-hour lunch\nOption 2: Cao Son Market, Private Tour (Wednesday only)\n=> The tour price applied to a private group of 2 people is USD 82.- per pax\n=> The tour price applied to a private group of 3-4 people is USD 72.- per pax\n=> The tour price applied to a private group of 4-8 people is USD 68.- per pax\nHighlights:\nCao Son is the most stunning part of Lao Cai province. The wonder of Cao Son is ever inspirational with mild weather, authentic culture of local hill tribes, spectacular views toward lush valleys and mighty Chay river.\nOn this trip you will visit one of the smallest local markets in the area, which locates in a beautiful landscape. The market still keeps its original aspect as it is.  Here you will meet Flower Hmong , Black Dao, Tay, Nung minorities.\nItinerary:\nAfter having breakfast, you will travel by car from Sapa. You will enjoy beautiful scenery along the ride until you arrive in Muong Khuong. From there, you turn in a dirt road, which goes up in mountains. Pine trees forests and villages surround the tinny market. Flower H’mong, Black Dao, Tay, Nung ethnic minorities come to buy and sell local products such as food and material for agriculture and fabric.\nPeople coming to the market not only for selling or buying something but also importantly to meet friends, relative and to sip some cups of wine until the dawn comes. No where else but here, Flower H’mong people greet you with a temptation of corn wine and endless hospitality. After exploring the market, you will be able to visit a village of Flower H’mong or a village of Tay people. You will then head back to Muong Khuong and have lunch in a local restaurant. After lunch, you get on the car for journey back to Lao Cai\nApprox: 6 hours driving/ 1-hour walking/ 1-hour lunch\nOption 3: Can Cau Market, Private Tour (Saturdays only)\n=> The tour price applied to a private group of 2 people is USD 85.- per pax\n=> The tour price applied to a private group of 3-4 people is USD 75.- per pax\n=> The tour price applied to a private group of 4-8 people is USD 60.- per pax\nHighlights:\nAlthough Can Cau is not a big market in the area but it is very beautiful, animated and colorful. The market is open only on Saturday. You will meet there several ethnic minorities such as Flower Hmong, Black Zao, Phu La as well as Chinese people. Another highlight is the boat trip along Chay River and a short walk to a Tay village.\nItinerary:\nYou will be met by local guide and driver upon your arrival at Lao Cai station then transferred to a local restaurant for breakfast (optional). Then start our drive to Can Cau market. The road is relatively flat from Lao Cai to Bao Nhai bridge.\nAfter crossing the bridge, we begin our journey uphill offering beautiful views over the valleys. Situated 20 km from Bac Ha, Can Cau is a small, but very colorful market. Opening only on Saturdays, it always delivers a very photogenic display of Flower Hmong, Black Zao, Phu La ethnic costumes. After spending the whole morning exploring the market, you will leave the market for Bac Ha town for lunch.\nIn the afternoon, we drive downhill towards Lao Cai for about half an hour. We stop on the way (before reaching Lao Cai) to take a short walk to Trung Do village inhabited by Tay people. Tay villages are always set up at the foot of a mountain or along a stream and are named after a mountain, a field, or a river. Each village contains about 15-20 households. A large village is divided into many small hamlets.\nThe houses are built on stilts or level with the ground. Stop by a traditional Tay house for a cup of tea before taking a boat cruise upstream the Chay River. The scenery is very beautiful on both sides of the river. The boat trip will end at Coc Ly where your vehicle will be waiting for you for the journey back to Lao Cai. End of tour.\nApprox: 6 hours driving/ 1.5 hours boat cruise/ 0.5-hour walking/ 1-hour lunch\nOption 4: Bac Ha Market, Group tour – Sunday only\n=> The tour price applied to a private group of 2 people is USD 85.- per pax\n=> The tour price applied to a private group of 3-4 people is USD 75.- per pax\n=> The tour price applied to a private group of 4-8 people is USD 60.- per pax\n=> The tour price applied to a group tour is US$ 45.-per pax\nHighlights:\nBac Ha market, located in the heart of Bac ha small town is the largest one in the area. Every Sunday, the different and colorful ethnic minority come all here to sell their homemade products or buy something for the family. They are Hmong, Phu La, Back Dzao, Tay or Nung minorities. Some of these ethnic minorities can’t be met in any other areas.\nThe highlights of this trip is to live yourself in Bac Ha colorful market that happens only on Sunday and also to take a wonderful boat trip upstream Chay River, to have some pleasant walks through Tay village.\nItinerary:\nYou will be met by local guide and driver upon your arrival at Lao Cai station then transferred to a local restaurant for breakfast (optional). Then start our drive to Bac Ha town. The road is relatively flat from Lao Cai to Bao Nhai bridge. After crossing the bridge, we begin our journey up to Bac Ha. Bac Ha market, located in the heart of Bac ha small town is the largest one in the area.\nEvery Sunday, the different and colorful ethnic minority come all here to sell their homemade products or buy something for the family. They are Hmong, Phu La, Back Dzao, Tay or Nung minorities. Some of these ethnic minorities can’t be met in any other areas. Your lunch will be provided in a local restaurant.\nIn the afternoon, we drive downhill towards Lao Cai for about half an hour. We stop on the way (before reaching Lao Cai) to take a short walk to Trung Do village inhabited by Tay people. Tay villages are always set up at the foot of a mountain or along a stream and are named after a mountain, a field, or a river. Each village contains about 15-20 households. A large village is divided into many small hamlets.\nThe houses are built on stilts or level with the ground. Stop by a traditional Tay house for a cup of tea before taking a boat cruise upstream the Chay River. The scenery is very beautiful on both sides of the river. The boat trip will end at Bao Nhai bridge where your vehicle will be waiting for you for the journey back to Lao Cai. End of tour.\nApprox: 5 hours driving/ 1.5 hours boat cruise/ 0.5-hour walking/ 1-hour lunch\nOvernight at hotel in Sapa.\n* Meal code: (B,)\n* Services: Hotel in Sapa."},{"title":"DAY 05: LAO CHAI AND TA VAN VILLAGES – SAPA – SEAT IN COACH BUS TO HANOI (B/ L)","description":"09h00: After breakfast, we start trekking down to Lao Chai village of Black H’mong ethnic people. Here we will discover their daily life and how they make traditional clothes, handicraft, indigo… We will visit the biggest valley which provides the best view for golden rice terrace fields in Vietnam. After Lao Chai we walk to Ta Van village of Dzay people. It is a small group of ethnic people in Vietnam with a rich culture and beautiful houses located on rice paddy fields.\nLao Chai & Ta Van Villages, about 8 km from Sapa town, where black H’mong and Dzay people are living, it is also the beginning of the valley which is called Muong Hoa. From a high point of the main road, great view of the whole villages open wide to offer the marvelous panorama views, backed by high mountains and facing the river.\nHere you will enjoy the fresh air, see terraced fields, stream, discover and visit some Black H’mong families. You will have a welcome feeling at any house of the hospitable people there. You can interact them, learn about their culture and customs…We will have lunch with the locals in one of the local houses.\nThe bus will pick you up from Ta Van village to Sapa Town.\nAfternoon: Free time at leisure for shopping or visiting Sapa on your own.\n16h00: It‘s time to say “Good bye Sapa!” and drive back to Hanoi. Along the way, once again you have a chance to enjoy the magical beauty of northwest mountains.\n21h30: We arrive in Ha Noi.\n* Meal code: (B,L,D)\n* Services: Lao Chai & Ta Van Group tour, entrance fees, Bus Limousine to Hanoi, Hotel in Hanoi.\nO/N in Hanoi."},{"title":"DAY 06: HANOI – HALONG BAY – OVERNIGHT ON CRUISE (B/L/D)","description":"07:30 Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30 Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30 Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30 Great lunch is served while cruising passing by islets.\n15:00 Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30 Happy Hour. Buy 2 beverage get 1 for free\n18.00 Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30 Enjoy Sunset Party with fruits and tea\n19:30 Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00 Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises."},{"title":"DAY 07: HALONG BAY DISCOVERY – HANOI (B/L)","description":"06:15 Tai Chi class on the Sun-Deck\n07:15 Have light breakfast with Coffee, tea, and bakeries on board\n07:45 Arrive at the Surprising cave, the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00 Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00 Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45 Brunch is served.\nAfter brunch, Relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11:45 Disembark at Marina coffee – Gate 26 in Tuan Chau New Marina.\nAround 5 pm, you will arrive in Hanoi.\nO/N in Hanoi."},{"title":"DAY 08: HANOI – DEPARTURE (B)","description":"On time as your request, our car & guide will come to take you to the airport for catching your flight to other city or home.\n* Meal code: (B)\n* Services: transferred-car with guide."}]},{"name":"VNA001 - 8days North to South of Vietnam","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":554,"summary":"This 8-DAY INSIGHT OF VIETNAM TOUR tour offers you cultural and historical insights of Vietnam in the North and the South.In the North, you will have a chance to explore the ancient Hanoi and you will have the oppotunity to come to Halong Bay, a world-renowned UNESCO heritage site, which is famous for its breath-taking natural beauty, and cruise around the wonderful limestone karsts here. In the South, you will end your trip with a few days in the southern heart of the country, Saigon, where you can find the incredebly awesome combination between the old buildings of the past and the modern works of the present and you will get a lot of unforgettable memories when coming to Mekong Delta, take a boat trip along the river and trying the traditional meals, fuits with friendly locals.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108617_680b0824.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108617_680b0824.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_23304e73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_130ff32a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_ee50a18f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_03619c7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_2693c652.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_bfd272b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_36d37c63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108617_5252fb09.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Fly to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in. Free at leisure or relaxing at hotel, overnight in Hanoi.\n3* Gondola Hotel: Sup Room \n4*: Tirant hotel: Deluxe Room \n5*: Melia Hotel: Deluxe Room"},{"title":"Day 2: Hanoi","description":"After breakfast, our guide pick up at hotel at 8.00AM. Sightseeing today includes explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake including the sedate Tran Quoc Pagoda; and one of the city’s museums (a choice between the History Museum and the Ethnology Museum). End the day’s explorations enjoy a traditional water puppet show. Overnight in Hanoi. "},{"title":"Day 3: Halong Bay","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 -8.20AM and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Spend the night on our luxurious boat\n3* Swan Cruise: Deluxe Cabin\n4*: Calypso Cruise: Deluxe Cabin\n5*: Signature Royal Cruise: Sernior Suite"},{"title":"Day 4: Halong Bay","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi. The rest day is free at leisure in your own way and overnight in Hanoi"},{"title":"Day 5: Ho Chi Minh City","description":"Free at leisure until transfer to airport for flight to Ho Chi Minh. Upon arrival Ho Chi Minh, you will be welcomed by our tour guide/ driver and transfer to hotel for check in. Rest of the day is free at your leisure, overnight in Ho Chi Minh City\n3* Gk Central Hotel: Superior Room \n4* Grand Silverland: Pre DLX Garden\n5* Majestic Hotel: Colonial Deluxe "},{"title":"Day 6: Cu Chi Tunnels","description":"Breakfast at hotel, meet our guide at 8.00 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City.\nHave a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there. \nAfter that, taste the typical boiled tapioca and hot tea before you come back to Saigon.\n"},{"title":"Day 7: Cai Be","description":"After breakfast our guide and driver will pick you up at 6.30AM to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends in Cai be. Getting on bus and drive back to Ho Chi Minh, overnight in Ho Chi Minh City.\n"},{"title":"Day 8: Ho Chi Minh City","description":"Free at leisure until transfer to airport for flight back home. End of service!"}]},{"name":"Real Sapa Experience 5Days/5nights","duration":5,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":323,"summary":"Highlight :\nvisit Y Linh ho, Lao Chai and Ta Van villages of the H’mong and the Dzay minorities.\ndiscover Giang Ta Chai village, then Su Pan villages of the red Dzao minority\n2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93640.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93640.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93638.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa93634.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/117658_5e4365fa9363f.jpg"],"destinations":["Hanoi","Sapa","Lao Cai"],"timeline":[{"title":"First Night : Hanoi – Sapa (No Meal ) by train","description":"Driver will pick you up at hotel in Hanoi old quarter then transfer to station catch train to Sapa. Overnight on Train                                                                 "},{"title":"Day 1 : Lao Cai - Sapa (B/L)","description":"Arrival Lao Cai station\nOption 1: Bac Ha market open Sunday only\n. Guide take you to Bac Ha Market is held every Sunday and is the biggest minority peoples market in Northwest Vietnam .Lunch at local restaurant before back to Sapa. Free time to explore Sapa by yourself. Overnight in Sapa.\n\n\nOption 2: Pick you up at Lao cai Station then transfer to Sapa. Have breakfast before walking to visit Sapa Church and Ham Rong Moutain Lunch at local restaurant before back to Sapa. Free time to explore Sapa by yourself. Overnight in Sapa."},{"title":"Day 2: Sapa – Y Linh Ho – Lao Chai – Ta Van (B/L/D)","description":"12 km of trekking, visit Y Linh ho, Lao Chai and Ta Van villages of the H’mong and the Dzay minorities. After lunch at a local family in Ta Van, we keep on hiking around the village of the Dzay & H’mong where we stay overnight in a local family for you to get to know their daily life of the local people: work, custom, embroideries, clothes...\n\n\n- B, L, D\n- O/N at the Dzay local house"},{"title":"Day 3 : Ta Van – Giang Ta Chai – Su Pan – Ban Ho (B/L/D)","description":"After pancake made by your host family, we continue to discover Giang Ta Chai village, then Su Pan villages of the red Dzao minority. After picnic lunch, we keep on hiking to Ban Ho, the village lies within a beautiful valley, home to the Tay minority people who have their traditional house on stilts and we will spend the night here. \n\n\n- B, L, D\n- O/N at the Tay local house"},{"title":"Day 4 : Ban Ho – Nam Toong - Sapa (B/L/D)","description":"2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam. Enjoy swimming then go up to the mountain to visit a small hamlet of the Red Dzao people called Nam Toong, then get back to Ban Ho before get to Sapa by Car.\n\n\n-\tB, L,D\n-\tBus to Lao cai Station catch train back to Hanoi."},{"title":"Day 5 : Hanoi Depature ( No meal )","description":"Arrival Hanoi early morning, End of services ! "}]}]