[{"name":"Best of Vietnam & Cambodia - 14 Days","duration":14,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":1571,"price":943,"summary":"Experience glamorous Vietnam and Cambodia with an unforgettable 14 day Best of Vietnam & Cambodia tour. Be blown away by the famous landmarks Ha Long Bay or Angkor Archeological Park, constructed in the 12th century and covers an astounding 210 hectares of land! We continue on to incredible Ta Prohm temple where enormous creepers and fig trees adorn the stone foundations, before seeing the Bayon Temple, the Royal Enclosure, Elephants terrace and more.","highlights":["Discover the grottos and caves of exquisite Halong Bay","Taste delicious dishes on a foodie tour through Hoi An","Wave to the locals at the Cai Be floating markets","Challenge yourself to crawl through the Cu Chi Tunnels","Explore Siem Reap and catch sunrise over Angkor Wat"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/65645_613a0ede.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/65645_613a0ede.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_21fec6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_cc3a2d13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_24f6b8ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_95ec0292.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_b16c69c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_bb05504c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_ee68db0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_2b5f35a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_4fa04493.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_1c9817fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_7212624d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_ca7d3f51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_8c870b78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_9c984b22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_b38bbb2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_04a6c6ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_29a7afd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_8d6c2a62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_858e73eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_da8757af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_453d15c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/65645_9f47a9d5.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Siem Reap","Angkor Wat"],"timeline":[{"title":"Day 1: Ha Noi - Arrival","description":"Arrive at Noi Bai Airport. Pick up and transfer to hotel.\nCheck in. Overnight in Ha Noi."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 2: Ha Noi &ndash; Ha Long Bay (BLD) &ndash; by shuttle bus &ndash; 4 hours</span>","description":"The shuttle bus will pick you up at your hotel and depart for Ha Long Bay. Cruise past exquisite scenery; limestone islands majestically rising out of emerald water, seductively scattered with grottoes and caves. Overnight on the Junk Cruise."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 3: Ha Long Bay &ndash; Ha Noi (BL) &ndash; by shuttle bus &ndash; 4 hours</span>","description":"After breakfast, swimming and sunbathing.\nAfter lunch, return to Ha Noi. Overnight in Ha Noi."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 4: Ha Noi City Tour &ndash; Da Nang (B) &ndash; by flight &ndash; 01 hour</span>","description":"(In 2018) Visit Ba Dinh Square and continue to the One Pillar Pagoda. We will also visit Van Mieu - Quoc Tu Giam (temple of literature). \n(In 2019) You will visit the Temple of Literature (The first Imperial School in Vietnam), Hoan Kiem Lake, the Jade Mountain Temple, But Tower (Pen-Shaped Tower), Dai Nghien (Ink Stand), The Red – painted wooden and the Huc Bridge. Have a cyclo (pedicab) ride around Ha Noi ancient town.\nTransfer to airport for flight to Da Nang. Check in the hotel in Da Nang. Overnight in Da Nang.\nNote: Ho Chi Minh’s Mausoleum closed on Monday & Friday and from 5th September to 5th November for annual maintenance."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 5: Da Nang (B)</span>","description":"2019: Day 5: Da Nang - My Son Sanctuary (B)</br>\nAfter breakfast, a visit to the My Son, Wander around the lost Champa Kingdom that dates back to the 3rd century Explore the temples and learn about the fascinating history behind this sanctuary of Hinduism. Free time in the afternoon. Overnight in Da Nang.</br>\n2020: Day 5: Da Nang - Free day (B)</br>\nFree as your leisure day (optional tours are available). Overnight in Da Nang."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 6: Da Nang - Hoi An (B)</span>","description":"2019: Day 6: Da Nang - Hoi An - Contact Ann Tailor - Hoi An City Tour (B)</br>\n10:00 Check out. Transfer to Hoi An and contact Ann Tailor to have a free tailor-made item of clothing. In the afternoon, exploring Hoi An ancient town on foot is one of the best ways to absorb the beauty of this city. Overnight in Hoi An.\n2020: Day 6: Da Nang - Hoi An City Tour - Contact Ann Tailor - My Son Sanctuary (B)</br>\nCheck out. Transfer to Hoi An and explore Hoi An ancient town on foot is one of the best ways to absorb the beauty of this city. Contact Ann Tailor to have a free tailor-made item of clothing after the tour. In the afternoon, visit My Son, Wander around the lost Champa Kingdom that dates back to the 3rd century Explore the temples and learn about the fascinating history behind this sanctuary of Hinduism. Overnight in Hoi An."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 7: Hoi An - Foodie Tour (BL)</span>","description":"Discover Hoi An’s countryside and its local food by bicycle. We will:\n- Past verdant rice-paddies to visit a very local village.\n- Sample the traditional Hoi An specialty, Cao Lau\n- Learn how to make the local delicacy- White Rose.\n- Move on to Cam Nam to sample some Ying and Yang food balancing favoritesFree time in the afternoon.\nOvernight in Hoi An."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 8: Hoi An &ndash; Da Nang &ndash; Ho Chi Minh City (B) &ndash; by flight &ndash; 01 hour</span>","description":"Check out and transfer to Da Nang for flight to Ho Chi Minh City. Upon arrival, pick up and transfer to the hotel. Overnight in Ho Chi Minh City."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 9: Mekong Delta &ndash; Cai Be floating market (BL) by minivan &ndash; 2 hours</span>","description":"The day will begin with a two-hour ride from Ho Chi Minh City to the Mekong Delta. You will:\n- Take a boat cruise to one of the highlights of the Mekong\n- Cai Be Floating Market\n- Stop over at a local house to watch how locals make coconut candy, rice-paper, rice-popcorn and rice wine\n- Spend time amidst local farmers, enjoying traditional music and tropical fruits on Hoa Phuoc Islet\n- Lunch on a local specialty- “ Elephant Ear Fish “ at a local home\nOvernight in Ho Chi Minh City"},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 10: Cu Chi Tunnels - Ho Chi Minh City Tour (BL)</span>","description":"Explore the famous Cu Chi tunnel complex for fascinating and informative insight into how Vietcong lived in this underground military base. In the afternoon, we will visit some of the other major attractions in HCMC: the War Remnants Museum, Reunification Palace, Notre Dame Cathedral and Old Post OfficeOvernight in Ho Chi Minh City."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 11: Ho Chi Minh City &ndash; Siem Reap (B) &ndash; by bus &ndash; 13 hours</span>","description":"06:15 Transfer to the bus station to go to Siem Reap. Upon arrival, pick up and transfer to the hotel. Overnight in Siem Reap."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 12: Siem Reap &ndash; Floating Village in the afternoon (B)</span>","description":"A half day to visit one of Siem Reap’s authentic floating villages. By visiting a local home you get a better understanding of life on the lake. Return to the port and visit the Silk Farm of Artisans d’Angkor. Return to town for a free.\nOvernight in Siem Reap."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 13: Siem Reap &ndash; Angkor Temples (Angkor Wat &ndash; Angkor Thom) (BL)</span>","description":"We spend a full day to visit the well-known Temples of Angkor Archeological Park. Wake up early at 05:00 am to witness the beautiful Sunrise at Angkor Wat or Ta Prohm. Then back to hotel for breakfast and continue the tour to visit Angkor ThomOvernight in Siem Reap."},{"title":"<span style=\"color: rgb(34, 34, 34);\">Day 14: Siem Reap &ndash; Departure (B)</span>","description":"Check out, then transfer to the airport for departure flight. END SERVICE."}]},{"name":"4 Days Private Hanoi Tour with Halong Bay Cruise , Max 6 Guests","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":639,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\nHighlights:\nDuring the 4-day private tour, you will not only have a cruise to explore the beautiful limestone grottoes at Halong Bay,  a UNESCO world heritage site, but also enjoy a guided city tour of Hanoi, the capital of Vietnam, to catch a glimpse of this country's mesmerizing landscape and traditional culture by visiting  Ho Chi Minh Complex, One Pillar Pagoda, Vietnam Museum of Ethnology and watching a Water Puppet Show. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cba.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199011_5eb8bda6e0cbb.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Arrival in Hanoi - Halong Bay","description":"Our guide will meet you at Noi Bai International Airport holding a sign with Agate Travel on it. They will transfer you to Halong Bay, a UNESCO world heritage site. After having dinner at a local restaurant, you will have a free evening to explore this coastal city. Stay overnight at a hotel in Halong Bay.\nMeals: Dinner\nAccommodation: Novotel Ha Long Bay (4 stars) or similar "},{"title":"Halong - Hanoi","description":"After breakfast, you will take a sailing junk cruise to admire the gorgeous scenery of Halong Bay. You will have a chance to walk on one of the islands to see the beautiful limestone grottoes. After that, we will continue cruising along the Halong Bay to further explore the beauty. Lunch is served on board. Later, we will transfer you back to Hanoi.\nMeals: Breakfast, Lunch\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar "},{"title":"Hanoi","description":"After breakfast, we start the city tour with the Ho Chi Minh Complex (Ho Chi Minh's Mausoleum and stilt house. Note: Ho ChiMinh's Mausoleum is closed every Monday and Friday & annual maintenance during Jun-Aug). Later, you will visit the famous One Pillar Pagoda, followed by the interesting Vietnam Museum of Ethnology. After lunch, you will continue to visit the Temple of Literature. Afterward, Vietnam's traditional puppet show is also scheduled for you. We will leave some free time for you to go shopping in the old streets and Dong Xuan Market.\nMeals: Breakfast, Lunch\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar "},{"title":"Departure from Hanoi","description":"Your Vietnam tour ends here when our driver picks you up at the hotel and transfers you to the airport for your homeward flight. Should you wish to extend your stay in Vietnam please contact our travel consultants for more information.\n\nMeals: Breakfast\n\n"}]},{"name":"Trekking Fansipan and Mu Cang Chai Tour 5 Day","duration":5,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":600,"summary":"As Southeast Asia’s highest peak, Mountain Fansipan (3,143 m) providing the perfect backdrop for some great trekking routes. This 1-day trek with outdoor camping offers all of the challenges and rewards of any hike. Upon reaching the summit you be one of the few who have reached up and touched the clouds, marking the roof of Indochina.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/114537_2b0fc31d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/114537_2b0fc31d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_3c611548.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_2c769b64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_a98c6f35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_ee23048d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_1502384c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_6d6c651e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_8561ecb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_d37e3540.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_760aab92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_e999190b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_77d43a95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_6f8bf288.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_2838768b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_a98eebfc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_3837d864.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_211242fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_64ed81a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_cfa71dc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_a5177a99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_b49afe48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_408b43ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_c0e4e944.jpg","https://cdn.tourradar.com/s3/tour/1500x800/114537_e0b6406b.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"DAY 1: HANOI – YEN BAI CITY – NGHIA LO ( L, D)","description":" \n8am: Our guide will pick-up you at hotel. Start journey to Nghia Lo and Tu Le via Thanh Son, Thu Cuc road 32. On the way, we will spend 1,5-2 hrs visit Vietnam Ethnic Village- where displays the tradditional houses and keep the tradditional culture, life of 54 ethnic groups in Vietnam. We will introduce you about the feature group in North Vietnam such as: Mong, Thai, Dao, Tay…group\nLeave Vietnam Ethnic Village, we can take a break to enjoy the Milk products or Green Tea hill in Phu Tho province.\nArrive Nghia Lo town in the afternoon, check-in homestay and take a break a few minitue before do a short cycle trip to explore the Thai village – where is the home of Thai people in Vietnam. Cycling between rice fields, beside the stream, visit the house, chatting with locals or say Hello with the friendly & kute children beside the road.\nBack to homestay, enjoy the good meals and sleep on the stilt house- the tradditional house of Thai people.\nIf you travel in the group from 6 people, there will be a traditional performance, with the local intereting songs and dancing.\nSummary:\nDistance trekking or cycling: Around 4-5km\nTrekking or cycling Time: Around 1,5-2hrs\nDrive time: around: 6hrs"},{"title":"DAY 2: NGHIA LO – TU LE – MU CANG CHAI – TREKKING AROUND VILLAGES (B, L, D)","description":" \nYou will be surprise before the wonderful rice terrace belong the route from Tu Le – Mù Cang Chải.\nRun over the Khau Pha pass (one of the four greatest passes in Northern Vietnam with 40km, connect Tu Le and Mu Cang Chai).  We’ll cross Tu Le town, you’ll have chance to see the interesting activities of Thai women in Tu Le making the “Com – green rice” – the famous special product of Tu Le belong your road in the harvest season. Most scenic roads which offer a lot of stops for picturing as the view point to see the Lim Mong, Lim Thai village or paragliding-point on the top of this pass. We will spend 1-2hrs trekking through the village of Thai people\n When arrive Mu Cang Chai,  we will continue take 3-4hrs (13km) to trek from La Pan Tan village to Mam Xoi – the best view in Mu Cang Chai . On the trekking way, we will go up to the high mountain, pass to the Hmong village and Waterfall in remote area, visit a kinder garden school. From the above, we can see the amazing view of Rice terraces field, visit some schools, playing game or singing with children. Beside seeing the beauty of Rice field, you’ll guided how to plant rice, harvest rice or discover the farm working of locals. It will be exciting experience. Enjoy stunning landscapes along the way, the stunning views of countryside and nature, visit local villages, experience daily life of hill tribe people, how to make traditional clothes… \n \nSleeping at Homestay at Mu Cang Chai\nNote: 3- hour drive &  5-6 hrs trek /day"},{"title":"DAY 3:MU CANG CHAI – SAPA( B, L, D) (160KM – 4 HOURS DRIVE)","description":" \nAfter our breakfast, we will spend 3 hours to continue follow the local guide to trek from Che Cu Nha to Kim Noi village. There’s more time to enjoy the other view of Rice Terrace fields and experience life in Mu Cang Chai. After lunch at Mu Cang Chai, we transfer to Sapa.\nWe’ll pass to the pass over O Quy Ho pass, one of the four greatest passes in Vietnam where there are the highest peak of Indochina: Mt Fansipan. You can enjoy fresh and cool air and nice landscapes.  …It will be unforgettable experience. Stay at Hotel 3* in Sapa.\n "},{"title":"DAY 4: TREK UP FANSIPAN (B, L, D)","description":" After breakfast at hotel, we will arrange the guide and driver at the hotel at 8:00am, you will be transfer by car to Tram Ton Gate to Heaven Gate, the highest peak of roads inVietnam. From there you can see Fansipan, the highest peak of Indochina mountains as well as enjoy stunning views. The trek will be relatively soft until lunchtime. After a couple of hours of hiking, you will have a break at a nice spot in the forest and enjoy a good lunch. \n With new energy you start ascending as well as descending towards the campsite. En route you have many opportunities to enjoy the scenery and magnificent views to Sapaarea and beautiful landscape of Lai Chau province. You will arrive to the campsite at 2800m ASL in the late afternoon. Now it is time to relax and enjoy a well prepared dinner. \n \nSummary\nTrekking:   5 hrs/ascend 2,800 m from 1,900 m\nAccommodation:  Hut\nMeals:    Lunch, Dinner"},{"title":"DAY 5: 2800M – THE TOP OF FANSIPAN – TRAM TON – SAPA (B, L, )","description":" \nAfter having breakfast, you climb to the top, where you can celebrate your victory. From there, you can enjoy the best view to beautiful sceneries. You will then trek through rainforest to go back to the campsite for lunch.\nAfter lunch, you start your journey back. You follow the trail as well as stone steeps built by Hoang Lien National Park until you meet your car, which is there to take you back to Sapa. In the afternoon you will arrive back in Sapa, where you can celebrate your achievement and relax.\nSummary\nTrekking:   7,5 hrs/ascend 3,143 m to Sapa\nMeals:    Breakfast, Lunch\nNote: If you want to back Sapa by cable car, pay more $40/person.\nP/s: The itinerary can change according your requirement."}]}]