[{"name":"Best of Northern Vietnam 6 days","duration":6,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":504,"price":454,"summary":"Discover a corner of North Vietnam where ancient history and stunning landscapes collide. Travel from the modern capital to the first capital city, Hoa Lu and admire ancient relics. Meet the Hmong people and other minority villagers on a hilltribe excursion in Sapa.  Explore the limestone karsts and rice paddies of ‘Halong on Land’ before boarding a boat to cruise the real Halong Bay.  This trip offers great value as it introduces the region’s main sights, providing plenty of flexibility so you can experience an adventure you'll never forget.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/166761_0a4e42b6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/166761_0a4e42b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_3ac51c6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_e1020e67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_998fee77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_30d72c31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_6cbec1f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_b9f99365.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_04144e0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_cacc9c10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_66d8a150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166761_24b9df90.jpg"],"destinations":["Hanoi","Ninh Binh","Sapa","Halong Bay"],"timeline":[{"title":"Hanoi Half day City tour","description":"Begin the first day of the trip with a tour of Hanoi. Depart from the hotel for a visit to Vietnam’s first university: the Temple of Literature. Founded in 1076, Quoc Tu Giam was established within a temple to educate Vietnam's royalty, mandarins and members of the elite.\n\nContinue with a visit to the iconic One Pillar Pagoda, one of Vietnam’s most iconic temples. Nearby is the mausoleum of the historic father figure of modern Vietnam, Ho Chi Minh, and his modest house on stilts. (Sites are viewed from outside; closed Mon and Fri and from Jun - Aug)\n\nVisit the picturesque West Lake and its sixth century Tran Quoc Buddhist Pagoda.Tran Quoc Pagoda is regarded as the most ancient pagoda in Hanoi with its history line of more than 1,500 years.\n\nAfter visiting, you will have a meal at an authentic Vietnamese Restaurant. Free time at leisure for rest of the day.\nMeals: Lunch\nAccommodation: Hotel in Hanoi"},{"title":"Hanoi – Ninh Binh – Hanoi - Night train to Lao Cai","description":"Just a couple hours’ drive outside of Hanoi and the tour heads deep into Vietnam’s picturesque countryside. Discover Hoa Lu, the ancient capital of Vietnam during the Dinh and Le dynasties, before taking a sampan trip down the Tam Coc River. Also called the ‘Halong Bay on Land,’ this region is famous for its charming grottoes and limestone karst mountains.\nDepart from the hotel around 08:00 for the 2-hour drive through rural northern Vietnam. Stop off at Hoa Lu, where there are temples dedicated to Emperor Dinh Tien Hoang of the Dinh Dynasty (968-80) and Emperor Le Dai Hanh of the Le Dynasty (980-1009).\n\nIf time permits after visiting Hoa Lu, take a half-hour walk up one of the surrounding limestone karst hills; a difficult but highly rewarding climb with spectacular views. (A moderate level of physical fitness is required.)\n\nContinue on for Tam Coc Town where a Vietnamese-style lunch will be waiting; there will be ample opportunity to stop for photographs of the villages and landscapes along the way.\n\nFor those feeling adventurous, climb up to the 15th century Bich Dong Pagoda on nearby Ngu Nhac Mountain, comprising three structures: Ha, Trung, and Thuong Pagodas (in ascending order).\n\nThen get on bus and our driver will take you back to Hanoi.\n\nMeet at your hotel in Hanoi at around 20:00 hrs and transfer to Hanoi train station. Overnight train trip to Lao Cai in shared sleeping compartments (sharing with other passengers in 2 lower & 2 upper berths per compartment). Train departs at approximately 21:15 hrs.\n\nNotes:\n\n-\tOur tour guide will not accompany during the train trip\n\n-\tTrain schedule is subject to change.\n\n-\tPrivate compartments on request at surcharge.\n\n-\tTrain journeys are part of a great local experience. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). Restrooms at either end of the carriages complete the local experience.\n\nMeals: Breakfast, Lunch\nAccommodation: Overnight train to Lao Cai"},{"title":"Lao Cai – Road transfer to Sapa – Y Linh Ho - Lao Chai - Ta Van - Sapa","description":"05:30 ~ 06:00 Arrive at Lao Cai Train Station. Pick up at the train station and transfer to Sapa. Early check in upon arrival is possible upon room occupancy (Surcharge applicable). Relax for a while to get ready for our full day tour.\n9.30am: Meet up your local guide and start trekking. The first part is on the road but we soon turn to the right and walk on a small path down the valley to Y Linh Ho village settled down by the Muong Hoa River and from here to the Black H’mong village of Lao Chai. Black H’mong is one of the biggest minority groups in the Sapa area. They have their own language and wear traditional indigo blue clothing. The H’mong peoples have just recently changed their living way from sifting style into the sedentary one. So there are still a lot traces of the past time can be seen: rudimentary houses, stone wall around homes… After this you continue to Ta Van village (1.200 m) to visit Zay people. Zay is a fairly small minority group of about 38.000 people who live mainly in the mountains in Northwest Vietnam.\n\nAfter visiting Ta Van village the car will return you to Sapa. Free at leisure the rest of the day. Overnight at Sapa Hotel.\n\nMeals: Breakfast, Lunch\nAccommodation: Overnight in Sapa"},{"title":"Sapa - Cat Cat - Sin Chai - Sapa - Hanoi - Road transfer","description":"In the morning, have breakfast at the hotel and then check out.\nTake a walk down to the South-west of Sapa (around 3 km) to visit Cat Cat Village of the Black H’mong, one of the more well-known ethnic village of Sapa. Relax at the foot of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam.\n\nEnjoy picnic lunch by the side of the river, and then continue trekking to 3 km to Sin Chai Village, located at the foot of Fansipan Mountain - “the Roof of Indochina”, where you enjoy a stunning landscapes of the mountain.\n\nThen come back to the main road to be transferred to Sapa town on a jeep for 3km.\n\n15:00 - 15:30 Driver will pick you up & transfer 5 hours to Hanoi.\n\nMeals: Breakfast\nAccommodation: Hotel in Hanoi"},{"title":"Hanoi- Halong Bay Cruise Tour","description":"Halong Bay is listed by UNESCO as a World Natural Heritage and voted as a Wonder of Nature by the New7Wonders Foundation. You will have a night staying in this world famous bay.\nAfter breakfast in Hanoi, depart the capital for the 3hr 30mins drive to Halong Bay. Arrive to Halong City’s jetty (around noon) and proceed with check-in formalities. After a welcome onboard, lunch will be served while cruising towards the bay. In the afternoon, enjoy some sightseeing, on-board activities (depending on each boat’s itinerary) or just spend some time relaxing on the vessel. Towards the end of the day the boat sets anchor for the night among the karst formations. Dinner is served on board.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Cruise in Halong Bay"},{"title":"Halong Bay- Hanoi","description":"Early risers can enjoy a memorable sunrise over the karst formations of Halong Bay. Breakfast will be served shortly thereafter.\nEnjoy breakfast (brunch on some boats) while the vessels cruises slowly through the magnificent rock formations back towards port. Arriving at the harbor, you will be picked up for transferring back to Hanoi.\n\nDrop off at your hotel (hotel in Hanoi is not included)\n\nMeals: Breakfast, Brunch\nAccommodation: NA"}]},{"name":"Classic Viet Nam 10 Days 9 Nights (Ha Noi, Ha Long, Sai Gon and Mekong Delta)","duration":10,"travelStyle":["Adventure","Family","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":575,"summary":"This is a north-south route that can impress anyone who once have chance to step in this beautiful S-shaped country. Our first destination is the well-known Sapa town. Tourists can find in this picturesque town many hill tribe villages, spectacular mountains, amazing waterfalls and romantic valleys. We will also have chance to share cultural experiences with families that live in the area. A full day Hanoi city tour and 2-day Halong cruise are good chances for you to catch best glimpse of Northern Vietnam’s nature and people. Flying to the South, we have 1 day getting to know Saigon city and then explore the Mekong Delta which has recently been dubbed as a \"biological treasure trove\". Take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. So exciting!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140632_ada758d6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140632_ada758d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_f269d624.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_0313b392.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_e6178bfd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_6de3d5a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_3edb1d3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_a8803b6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_79c3a514.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_8530a272.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_8b587308.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_f542145b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_18f49e4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140632_b6b2919c.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: HA NOI ARRIVAL ( NO MEAL)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. Check in hotel and Overnight in Hanoi."},{"title":"DAY 2: HA NOI CITY TOUR (BREAKFAST, LUNCH)","description":"08:00 – 08:30 a.m: Our guide and driver pick you up from your hotel and start to visit Ho Chi Minh complex, including Ho Chi Minh’s Mausoleum – the final resting place of Vietnamese great father or Uncle Ho, President Ho Chi Minh’s stilt house – where Ho lived on and off from 1958 to 1969, then visit Ho Chi Minh’s museum where tourists will learn what he had done for Viet Nam and some other countries and a lot of information about President Ho Chi Minh. The next place is One Pillar Pagoda which is a group of structures consisting of a pagoda and a tower built in the middle of a square pond. Leave One Pillar Pagoda for the Temple of Literature the first college of Viet Nam dedicated to Confucian. Have lunch at local restaurant.\nAfter lunch, drive to visit Tran Quoc Pagoda, Which is on the shore of West Lake, the Museum of Ethnology. The last place of city tour is Hoan Kiem Lake (Restored Sword Lake), Ngoc Son Temple. Drop you off at your hotel. Overnight in Hanoi.\n"},{"title":"DAY 3: HA NOI - SAPA - LAO CHAI AND TA VAN VILLAGE (BREAKFAST, LUNCH, DINNER)","description":"06:30 a.m: Our guide and bus will pick you up at hotel and depart to Lao Cai, on the highway running from Hanoi - Lao Cai 245 KM with less than 5 hours. You have the opportunity to enjoy the beautiful scenery on the both sides of this road.\n12:00: Arrival Sapa, enjoy  lunch at local restaurant then check in hotel.\n13:00: Bus will take visitors to start the journey to visit Lao Chai – Ta Van and Giang Ta Chai, explore the life of ethnic minorities, admire the spectacular natural scenery with the terraced rice fields. Visit Sapa ancient rocks with engraved images  big– small rocks, unique patterns of the ancients; visit the Bridge which made by clouds, cross the poetic Muong Hoa stream. Get back hotel and Overnight in Sapa.\n"},{"title":"DAY 4: SAPA - CAT CAT VILLAGE - HANOI (BREAKFAST, LUNCH)","description":"After breakfast, at 09:00 a.m you start the trip by trekking to explore the Cat Cat – Sin Chai village of ethnic Hmong – discovered by the French and choose resort here in the early twentieth century. Coming to Cat Cat Village, visitors will be visiting hydropower station,waterfall of the Cat Cat village and learned about the culture, customs and unique people here with traditional crafts such as weaving, touching carved silver, forged agricultural tools, to drag his wife...\n12:00: Pick up from Cat Cat village back to Sapa town. Enjoy lunch at local restaurant then you are free at leisure to visit Sapa town for shopping.\n16:00: Bus and tour guide pick you up again at hotel and transfer back to Hanoi. Arrive Hanoi, check in hotel and free at leisure. Overnight in Hanoi.\n \n"},{"title":"DAY 5: HANOI - HA LONG BAY (BREAKFAST, LUNCH, DINNER)","description":"07:45 - 08:30 Tour guide and shuttle bus of will pick you up then take 3.5 hour drive to Ha Long. Have a break 20 minutes en-route to refresh.\n12:15 Embark Bai Chay harbor, get transferred to the Cruise by a tender and enjoy a welcome drink.\n13:00 Receive a cruise briefing. Savor delicious lunch while cruising among wonderful limestone islands.\n14:30 Visit Sung Sot “amazing” cave, the most beautiful with millions of surprising stalactites and stalagmites\n15:30 Stop at Ti Top Island one hour for swimming, sun-bathing or photographing of Ha Long at island peak.\n16:30 Do kayaking among hidden parts and around Bo Nau cave to discover mysterious beauty of Ha Long.\n17:30 Drop anchor in a calm water area, rest on the sundeck to enjoy Ha Long views at sunset.\n19:00 Have a delectable dinner in cozy restaurant of the Cruise in the middle of the bay.\n20:00 Entertain evening by karaoke singing or try your luck doing squid-fishing. Overnight on the cruise in Halong.\n \n"},{"title":"DAY 6: HA LONG BAY - HANOI - FLIGHT TO SAI GON (BREAFAST, LUNCH)","description":"07:30 Enjoy the morning landscape with complimentary tea and coffee served, photograph nice pictures.\n08:00 Experiencing unforgettable memory passing through “tunnel cave” on a bamboo boat to a secluded lake.\n09:30 Check out your cabin. Relax on sundeck for sun-bathing, photo hunting while sailing back to the harbor.\n11:30 Enjoy lunch on the boat while cruising back to Halong City.\n13:30 Say goodbye to Ha Long bay then return to Hanoi. Have a rest en-route again.\n17:30: Arrive Hanoi, transfer directly to the airport for your flight to Saigon.\nWelcome to Saigon! You will be met at the airport and transferred to hotel. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture. Check in hotel, free at your own leisure tie and Overnight in Saigon.\n"},{"title":"DAY 7: SAI GON CTIY TOUR FULL DAY (BREAKFAST, LUNCH)","description":"08:15-08:30 Our tour guide and car will pick you up at hotel for fullday Saigon City.\nIn the morning: we will start to visit the War Remnants  Museum and  go to China-town to see the bustling and busy Cho Lon market. On the way back, we will visit the Thien Hau Temple.\nIn the afternoon: we will continue visit the former Presidential Palace, Norte-Dame Cathedral, Central Post Office, Jade Emperor Pagoda. Back to your hotel. free at leisure and Overnight in Saigon.\n \n"},{"title":"DAY 8: MEKONG DETAL - MY THO (BREAKFAST, LUNCH)","description":"Pick up at hotel and departure for Mekong delta trip. This trip provides a look at a wide variety of the life and scenery of the Delta. On the way you can see green rice paddy fields stretching towards\nthe horizon. After 70km driving, we arrive in My Tho, a private boat trip takes us to Ben Tre. Walking on land and exploring local life and then we’ll visit the local coconut-candy workshop. Lunch at local restaurant.\nAfter lunch, we’ll enjoy the local tropical fruits, folk music  and see how they look after their honey bee farm. Afternoon, our boat takes us back My Tho where we meet our bus again for a 2 hour drive back Saigon. Overnight in Saigon.\n"},{"title":"DAY 9: CU CHI TUNNEL (BREAKFAST)","description":"This morning, we proceed to Cu Chi to explore the amazing site where Viet Cong hid during the War. It is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. Spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food in war time). Head back to Saigon at 14:00. Free at leisure to visit more and do shopping in the afternoon. Overnight in Saigon."},{"title":"DAY 10: SAI GON DEPARTURE (BREAKFAST)","description":"Breakfast at hotel then you are free at leisure to visit more and do shopping in Saigon till transferring to the airport for your flight back home. End of trip. "}]},{"name":"Legends of Northern Vietnam - Sapa/Halong Bay/ CoTo Island","duration":10,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":1805,"price":975,"summary":"Locates in the cool mountain ranges of the Northwest, Sapa becomes popular among travellers who want to be captivated in the beauty of rice terraces; colorful hill tribe and unique local cuisine. Experiencing the magnificent mountain view and meet warm-smile locals on the way. Immerse yourself in the descending dragon legend and majestic site in Halong Bay, one of the wonder of Nature World. And discover the hidden beach gem of North Vietnam- Co To island, one of the five most beautiful islands in the country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0953b3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0953b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0a5b09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0a814b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0aa742.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0ac719.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0aefbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0b106a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0b3224.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0b566e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0b7bd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0b9f0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0bbebb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142949_5e0ebab0be32c.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"WELCOME TO VIETNAM - HA NOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"EXPERENCE VIETNAMESE'S LIFESTYLE IN COUNTRYSIDE ( B/L )","description":"Pick-up at 7:30​ ​am from your hotel’s lobby​.​ ​The drive ​takes​​​ 2 hours and leave the noisy city behind your back! We’re heading to a peaceful and quiet countryside which is really a hidden charm!\n10:00 - Starting your trip at your host’s house by having welcome drink. Short break at your host’s house​.​\n10:45 – Cycling around the village and stop over the local market to experience how people trade their own products for lives. Then heading to traditional Miến village (type of transparent noodle made from starch).\n11:15 - Hands-on farming experiences by growing vegetables and harvesting the raw vegetables in Chau’s garden. Vietnam is the tropical country with the most famous variety ​of ​raw vegetable herbs as: lettuce, mints, fragrant knot weed, coriander, balm-mint, cilantro​ etc. You will see the way ​how local people not only​ always​ have fresh food to eat​​ but also have enough to trade in local market. \nThen ​Mr. ​Chau will take you to a boat trip for the fishing on Da River. On the way, you will experience the local live on river side and stop for fishing with​ Mr​ Chau ​with his local unique technique!\n12:30: Have lunch with the host’s family and short break after ​it.​\n14:00 – ​Say goodbye ​to ​your local host​ and ​head to 30-years-old tea fields in Ri Village. This place it is very important ​in​ providing tea products for the whole North​ of Vietnam​. Beside walking & helping local people to harvest tea leaves, you will know how to take the best part of the tea tree to make the most wonderful drink in the world.\nAfter visiting and learning cultivat​ion of tea leaves, you will come to Mr Duoc’s house – he is a veteran and the owner of a huge tea farm​. ​​From him you will know how we handle the raw tea leaves​,​ make it into the products and get ready to sell on market.\nHave a break time with desserts made of ground green lentils or lotus seeds with your host and listen his story from Vietnam war, as a veteran, he is a witness of Vietnam history and could make you understand about the past of the country.\nThen drive back to Ha Noi in the evening, end the tour at your hotel around 18:30.\n(Meals: breakfast, lu​n​ch)"},{"title":"BOATING AND CYCLING IN THE ANCIENT CAPTITAL - OVERNIGHT TRAIN TO SAPA (B/L)","description":"Today you will experience the ancient culture and history of Vietnam as well as seeing the stunning landscape and beautiful scenery when we travel to the Ninh Binh Province. This area is known as “Ha Long Bay on land” and is located 80 km South of Hanoi\nAM: 8:00 - 8:30. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12:30PM.\nPM: After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). Dive back to Hanoi and drop off at your hotel around at 18:00PM.\nHave leisure time on your own and late check out before pick up to train station \n20:30 - 21:00 Pick-up at the hotel. Transfer to railway station for a night train to Sapa (schedule 21:50 - 06:30)."},{"title":"RELISHING THE STRIKING LANDSCAPES OF SAPA(B,L,D)","description":"AM : 6h30 arrive Lao Cai, pick up at Lao Cai Station then transfer to Sapa. You will have breakfast and some time for R&R.\n09h00 - 09h30 Trek to Cat Cat villages of Black H'Mong tribe . Enjoy the waterfall in Cat Cat and beautiful scenery along the way. Then check-in hotel (check-in after 12:00PM). Enjoy lunch at local restaurant.\nAfternoon: free time to explore & discover Sapa Market & Stone Church. Back to hotel for dinner and enjoy the night in Sapa town .\nApp .3 hours trekking - 4 km .- Meals: B - L - D Accommodation: Hotel."},{"title":"TREKKING TO THE CORLOUFUL VALLEY OF SAPA (B/L)- OVERNIGHT TRAIN BACK TO HA NOI","description":"After breakfast you will check out and leave your luggage in the hotel, get ready for the trip. Trek down to Lao Chai village to visit the Tay and Day tribes then keep going along the bottom of the Sapa valley to get to Ta Van village which is supposed to be the most beautiful one in the area. Have a picnic lunch on the way. You go back to Sapa by motorbike/jeep. Back to Lao Cai Station by our car, then dinner at your account. App .5 hours trekking - 13 km\nOvernight at the A/C soft sleeper cabin to Hanoi (schedule: 21:15 – 05:30)."},{"title":"CRUSING TO THE WONDER OF THE NATURE WORLD (B/L/D)","description":"Back to Hanoi in the early morning, chek in at the hotel for showers and have some rest before a trip to Halong Bay. \nIn the morning, check-out from hotel and get pick-up by the Cruise. Take a route most scenic to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise"},{"title":"FROM HALONG BAY TO CO TO ISLAND (B/L)","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and be transferred to Co To Island. Overnight in Co To Island "},{"title":"WAKE UP IN THE HIDDEN BEACH PARADISE (B)","description":"Despite being the furthest inhabited island from the mainland, Co To Island has boomed in the last few years, and today it's a popular destination for domestic tourists. This should hardly come as a surprise, as the island is home to some of Bai Tu Long Bay's best beaches and its widest spread of accommodation and restaurants. Yet despite all of this, the island sees very few foreign faces."},{"title":"DISCOVER THE RAW BEAUTY OF CO TO ISLAND (B) - TRANSFER TO HANOI","description":"Find way to Dragon Claw Stones with impressive rocky cliffs and Cloud Bridge Peak to view the sunrise in early morning. Try the fresh and super tasty seafood the relaxing at Van Chai beach or Hong Van beach. \nTransfered to Hanoi in the afternoon."},{"title":"TIME TO SAY GOODBYE - HA NOI DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Sapa Hard Trekking for 5 days 4 nights","duration":5,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":379,"summary":"Four days trekking from the centre of spectacular Muong Hoa valley up and down hills you will challenge your feet with hard trekking while enjoying beauty of nature, meeting and making acquaintance to tribal peoples from different ethnic groups to enrich your knowledge with different culture and way of life. You also have chance to experience peoples and especially their hospitality while staying two nights in their homes.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/159195_667da9fe.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/159195_667da9fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_50e7daea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_1cbc7c79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_db5ae128.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_42560bed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_8b4788ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_17b712a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_8a11ff3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_f950ad41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_d1d92ca8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_7cffc7ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_9972a314.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_add5baa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_c5bea638.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_fa07bf74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_1a6dd972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_0e185a1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_1a8a9411.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_0b7f4910.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_a7c30090.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_8f674805.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_03d9a3fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_f9c21ea9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/159195_a6c21173.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Take overnight train from Hanoi to Lao Cai","description":"Be ready at your hotel lobby at 8:00 p.m, our tour guide and driver will meet and pick you up for a short transfer to Hanoi Station to take the overnight train to Lao Cai City. \n\n• Overnight on the train "},{"title":"Day 2: Lao Cai - Sapa - Ta Van - Seo Mi Ty ( B,L,D)","description":"Pick up at Lao Cai station upon your early arrival for over an hour transfer uphill to Sapa by mini van with A/C. Freshen up and Breakfast before walking around the town centre and paying visit to the market. Back to our Sapa office for a short transfer southwards by jeep to Ta Van village of the Zay peoples where your trekking begins. The morning trek is really challenging because the path is tough and mostly uphill but you will enjoy many short breaks for resting. The scenery gets more beautiful and the view gets wider as after every hundred meter you walk. After a long break for Lunch, the trek gets easier and the trail winds its way through an area of the nature reservation. Enjoy your discovery of the wild nature before paying visit to an isolated village of the H’mong, watching everyday life activities before arriving to our camp site which is nearby a river away from the village. You may join your tour guide and porters putting up tents and prepare dinner or fancy a walk around to stretch the legs and discover wild life. Evening comes earlier than usual and everyone sit down near the fire for dinner and revise of what you got today. \n\n• Accommodation: Homestay in Seo Mi Ty Village "},{"title":"Day 3 : Seo Mi Ty - Den Thang - Ta Trung Ho ( B,L,D)","description":"Breakfast and follow a narrow trail sneaking through thick rainforest for a couple of hours, crossing some old suspension bridges and then suddenly the view opens to a wide valley with beautiful terraced of rice paddies in all shapes as you approach to Den Thang village of Black Hmong by noon. Here you will drop in some local homes and visit a school before sitting down for Lunch. \n\nAfternoon trek becomes tougher on tinny footpath going up and down hills to Ta Trung Ho village. Here you will, with your guide, spend the rest of the day walking around the village, visiting homes, talking to the Red Zao people for your discovery of a unique culture and way of life. The area is not visited by tourists and outsiders till recently, so the people is little bit reserved but hospitable and frank. \n\n• Accommodation: Homestay in Ta Trung Ho Village "},{"title":"Day 4: Ta Trung Ho - Ban Ho - Sapa ( B,L,D)","description":"Saying good bye to our host, you are now on the path again, from the fringe of the rain forest of the Hoang Lien Son mountain, ascending through forest and terraced rice paddies and corn fields to Nam Toong, another village of Red Dao and here lunch will be prepared in a local school. It is interesting to spend time talking with the teachers and playing with children, teaching them some English. They are very keen to learn new things. \n\nContinue our trek in the afternoon descending to Ban Ho valley dominated by Tay peoples. Crossing the river by suspension bridge you will walk through this large and well organized village composed by over a hundred large wooden houses built on stilts, enjoying your discovery of the Tay way of life as well as making acquaintance with local peoples. Picked up and transfer by jeep to Sapa late in the afternoon, check in your hotel and relaxed. \n\n• Accommodation: Basic hotel in Sapa "},{"title":"Day 5: Sapa free day - Overnight train to Hanoi (B,L,D)","description":"Enjoy the whole day to explore Sapa town on your own. Our recommend is to take a walk to Sapa market, where you can meet tribal ethnic peoples such as Black H’mong, Red Zao, Zay… from nearby villages come every day selling their farming, gathering products: Vegetable, bamboo shoot, mushroom… and of course handicrafts for souvenir. Continue walking the steps from the market to the church and then onto the top of am Rong Mountain where you can visit an orchid garden and a small museum about ethnic peoples of the Northwest. \nHaving a bus at 4p.m to be back Hanoi and arrive in Hanoi at 10p.m"}]},{"name":"Saving Amazing Moments Vietnam Trip - 15 days","duration":15,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1365,"summary":"15 days trip in Vietnam is no ordinary trip to Vietnam. This is really trip for travellers like to discovery, experience and learn about Vietnam nature, history, culture, local people, lifestyle, cuisine…with the most ideal destination in Vietnam will take you from surprise to others. That may be a day you are overwhelmed with the beautiful scenery of Ha Long Bay, a day trek through pretty small villages and extensive terraced rice fields in Pu Luong, these are the days you get lost in the ancient town, and one day with countless new things in the unique floating market. It's time, a great moment of a trip waiting for you.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119700_894cef76.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119700_894cef76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_f2a6bf33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_2b410675.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_4c07f009.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_858267fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_c9f1ff98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_225a66d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_82ffeff5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_5b3c7d4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_0f278818.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_46f5bbbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_cc6debe5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_2983cad2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_23dadbcb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_0950042a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_77c8e095.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_0cc36f11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_853c6ec9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_7bb810f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_5a6f2690.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_6b0209af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_96ef77f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_ef64e441.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119700_d60377b1.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin Chao! Welcome to Hanoi, Vietnam. Hanoi, one of Asia’s most enchanting cities, full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted in Noi Bai airport by guide and driver at Noi Bai International Airport for your transfer to the hotel.\nIn the evening, a culinary adventure takes you to taste sampling street food in the Old Quarter. It’s a great opportunity to try all those weird and wonderful foods you see but just aren’t sure what they are! The local brew is a plus point for this short trip. Find an open seat, do as the locals do: pull up a stool and enjoy a drink while watching the world go by at Bia Hoi Corner.\nContinue to wander in the old quarter’s narrow streets as your guide points out a range of tasty noodles, bread and snacks. Don't forget to bring the camera to take some beautiful shot about local nightlife. The pavement Vietnam is really street food haven, not only for walking. End the night with dessert from Hanoi’s best-known ice-cream parlour before heading back to your hotel.\n"},{"title":"Day 2: Hanoi","description":"Hanoi capital is the first destination on this journey. The highlight of this day is to visit the pagoda, ancient centuries-old temple as Ngoc Son temple, the One Pillar Pagoda and Tran Quoc pagoda. Visit the Ho Chi Minh Mausoleum, along with exploring the first university of Vietnam, the Literature Temple and Quoc Tu Giam, followed by the  the Ethnology Museum. Beside, you have the opportunity to take an hour cyclo tour around the bustling old quarter to see the ordinary life in Hanoi. (Meals included: Breakfast, Lunch)"},{"title":"Day 3: Hanoi – Pu Luong for trekkking","description":"The bus pick up at hotel and departure to Pu Luong to trek through field terraces, meeting friendly Black Thai Minorities, enjoying the pristine landscapes, discover some cultural aspects such as the impressive bamboo waterwheels or a duck farm. Relax at the lodge, a rustic-but-comfortable retreat. You have dinner at the lodge, enjoy some local rice wine with the family. (Meals included: Breakfast, Lunch, Dinner)"},{"title":"Day 4: Pu Luong - Hanoi","description":"Wake up as early as you wish to witness the daily life of the locals before having breakfast. After breakfast at the lodge, go on to explore the other interesting areas of Lu Luong. You trek to follow the small road through the paddy field and sugar cane fields, cross the Hanging Bridges to visit other remote rural villages of Thai Ethnic. Pay a visit to some of the neighbors, learn more about their life and society. Stop at the giant waterwheels, ducks farm to learn about the agriculture before getting on the Bamboo Raft for a relaxing cruise on Cham stream. After heading back to the lodge, refresh yourself check out and have lunch. before heading back to Hanoi in the late afternoon. (Meals included: Breakfast, Lunch)"},{"title":"Day 5: Hanoi - Tam Coc - Mua Cave","description":"After collection from the Hanoi hotel, enjoy a scenic drive to an area of natural beauty, often referred to as ‘Ha Long Bay on land’. First stop at Hoa Lu, you will have quick visit two temples built in honour of the emperors Dinh and Le. Keep going to the Mua cave. Climb 500 stone steps staircase leading up the peak and enjoy a stunning panoramic view of the countryside and the Ngo Dong river.\nAfter lunch, you get a small boat. Ferryman will take you to visit the scenic landscape of the majestic mountains, the fields in the triangle cups when the sampan go along the Ngo Dong river. It is an outstanding natural beauty and the scenic karst formations which contribute to its reputation as being the “Halong Bay on land”. Arrive back in Hanoi in the late afternoon. (Meals included: Breakfast, Lunch)\n"},{"title":"Day 6: Halong Bay sightseeing","description":"In themorning, the tour guide will pick you up at the hotel in Hanoi Old Quater. transfer to Halong Bay in Quang Ninh province. On the way, our guide will introduce to you about the culture, history, people, of the places that you will pass by. Then you will have a short break in a middle way for 15-20 minutes. On arrival at Tuan Chau Port, get on the boat, you are warmly welcomed by professional and friendly crews. Lunch will be served in the dining room while the boat’s cruising through the thousands of islands and islets. You will have private time on the upper deck to enjoy the beauty of Halong Bay. After that do kayaking in floating village area for an hour, swimming if the weather permitted. Then back the boat for sunset party on the sundeck. Enjoy the special dinner cooked by our professional chef. In the evening, free time for relaxing, singing, squid fishing… (Meals included: Breakfast, Lunch, Dinner)"},{"title":"Day 7: Halong Bay - Hue","description":"In the morning, after Tai Chi lesson, breakfast will be served with egg, toast, coffee, tea… Tourists start to visit cave named \"surprising cave\", one of the most beautiful caves on Halong Bay. After that, the boat continues cruising further, go through many islands and islets to discover the hidden charm of the bay. Then, tourists join a cooking class opened right on the cruise, you will have chances to learn how to make deep fried spring roll \"Nem Vietnam\". Cruise back to the harbor after finish lunch. Say goodbye to the crew and disembark. Get on the bus to go back to Hanoi.\nA quick transfer back to airport we catch a short flight to the central Vietnam. The car will pick you up at Hue airport and transfer to your hotel. (Meals included: Breakfast, Lunch)\n"},{"title":"Day 8: Hue city tour","description":"Today is your insider day trip starting to Hue city. This ancient city is a living museum. Wander the antique beauty of a monarchic complex consisting of monuments, tombs of the Imperial City, learn about the political past of Thien Mu Pagoda, and experience the modern-day rebirth of a city that suffered one of the bloodiest battles in the Vietnam War. (Meals included: Breakfast, Lunch)"},{"title":"Day 9: Hue – Bach Ma – Hoi An","description":"Our driver and guide will pick you up at your hotel in Hue city center and transfer to visit Bach Ma national park. At Bach Ma National Park, you will check in at the Visitor Center to hear some information about the park. Then, you continue to trek through the jungle to Five Lakes, a system of 5 lakes formed by a large stream. The water here is very clean and cool. Have Lunch at Bach Ma National Park. After visiting Bach Ma National Park, the car drives to Hoi An. (Meals included: Breakfast, Lunch)\n"},{"title":"Day 10: Chillday in Hoi An at the beach","description":"Free leisure in Hoi An. You can explore the ancient town or the beaches in Hoi An. (Meals included: Breakfast)\n"},{"title":"Day 11: Hoi An farming & fishing life by bike and boat","description":"The start of this journey, you will ride along the country roads. The roads take you to the rustic countryside with the friendliness of the locals. Visit a vegetable village, learn and do this job. In addition, you have the opportunity to ride a water buffalo in the rice paddies. The beautiful scenery is the opportunity for your photography talent. Then, you get boat to meet and engage with local fishermen and enjoy a hands-on experience of traditional net fishing.  Paddling the unique Vietnamese bamboo basket boat on the river with coconut palm trees is a unique exoeriences before the tour ends. (Meals included: Breakfast, Lunch)"},{"title":"Day 12: Hoi An - Ho Chi Minh city","description":"Morning, breakfast at hotel in Hoi An. let walking to discover the beauty of this ancient town in Vietnam. Do not forget to bring your camera to take impressive shots.\nCheck-out hotel, transfer to Danang airport for flight to Ho Chi Minh city. (Meals included: Breakfast)"},{"title":"Day 13: Mekong Delta","description":"Leave Ho Chi Minh City by bus at 8:00 in the morning. Enjoy the captivating landscapes and green rice fields along the highway. Visit the stunning Vinh Trang Pagoda at My Tho. Take a relaxing boat ride on the river and see the traditional fishing villages with their stilt houses along its bank.\nBe part of an exciting cycling tour and discover the beauty of this place. Taste seasonal local fruits and drink the popular honey tea while listening to Southern Vietnamese folk music performed by local artists. Feel the pastoral life as you travel past exotic villages and beautiful orchards. Come back to Ho Chi Minh in the late afternoon. (Meals included: Breakfast, Lunch)"},{"title":"Day 14: Ho Chi Minh city tour – Cu Chi tunnel","description":"This day's bus will take you to the famous attractions in Ho Chi Minh city. Provides you with an overview of the past, present and the architecture of Vietnam's most vibrant cities through attrations such as French colonial heritage buildings, the Notre Dame Cathedral, the Central Post Office Reunification Palace… However, the highlight of this trip is at the end of the tour with a visit to Cu Chi tunnels. A legendary place in the Vietnam war. You really can not believe that people can live like this in the damp cellar and this little road. Take beautiful photos before returning to ho Chi Minh city. (Meals included: Breakfast, Lunch)"},{"title":"Day 15: Ho Chi Minh departure","description":"Have a breakfast at hotel. Check out your hotel (unless you choose to stay a little longer). A private transfer to the airport for departure flight home or travelling on to more adventures, we will help you with the planning. (Meals included: Breakfast)"}]},{"name":"AMAZING VIETNAM IN 5 DAYS 4 NIGHTS","duration":5,"travelStyle":["Beach","Group","Partially Guided","Holiday"],"oldPrice":0,"price":540,"summary":"OUTLINED ITINERARY \nDay 1 – Hanoi Arrival\nDay 2 – Hoa Lu Tam Coc Day Tour (B/L)\nDay 3 – Hanoi – Halong Bay, overnight in cruise (B/L/D)\nDay 4 – Halong Bay - Hanoi (B/L)\nDay 5 – Departure (B)\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0c4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196116_5e6700386f0e6.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi Arrival","description":"You will be warmly welcomed upon arrival at airport in Hanoi and transferred to your hotel. You will have free time. Overnight in Hanoi. "},{"title":"Hoa Lu Tam Coc – Group Tour (B/L)","description":"Hoalu - Tam Coc is perfect combination for a day trip to learn about a dark period when Vietnam was conquested by Northern Invader. Hoalu is a sacred land with two temples worshiping those kings in 10 century who gave great contribution for the nation. Next, let's take a boat trip along the Ngo Dong river to enjoy landscape in Tam Coc. You will know why it's named Halong Bay on Land\nHIGHLIGHT.\n\n\tHoa Lu and Tam Coc Biking and Boat Day Trip from Hanoi\n\tTour Hoa Lu and Tam Coc\n\tBiking trip to Bich Dong Pagoda\n\tEnjoy the epic landscapes of northern Vietnam with a professional guide\n\tPerfect for all fitness levels\n\tRound-trip hotel transportation is included (in the Old Quarter area only)\n\nITINERARY.\n\nAM. 8.00 - 8.30. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12.30PM.\nPM. After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). Dive back to Hanoi and drop off at your hotel around at 18.30PM.\n"},{"title":". Hanoi – Halong (B/L/D) – Shuttle bus","description":"Program customize up to cruise\n7.30 - 8.00. Take a 3-hour scenic drive from Hanoi to Halong Bay.\n12.00-12.30. Arrive in Tuan Chau Tourist Wharf. Transfer to Halong Cruise by tender.\n12.30. Welcome drink on the boat and check in to your private cabin.\n13.15-14.15. Serve have lunch on board while cruising to some magnificent Halong bay scenes.\n14.45 -15.00. Visit Titop island where you take your time on swim, sunbath, trekking....\n16.30. Arrive in Pearl Farm Village. Visit around and swim, kayaking in the bay.\n17.30. Back to the cruise and join cooking class to have experience in some traditional dishes. Tea time on sundeck.\n"},{"title":". Halong – Hanoi (B/L)","description":"Program customize up to cruise\n6.00. Practice Tai Chi on the Sundeck.\n7.00-7h30. Start your day with a light breakfast. During breakfast, cruising to explore other part of Halong Bay, admire the beauty of one in seven new wonder in the world.\n8.30 - 9h30. Arrive in Surprise cave, explore the Cave, one of the most beautiful caves in Ha Long bay.\n9.45. Check out and take all luggage outside of your cabin, cruise back to the Tourist Wharf through Ha Long bay.\n10.00. Have brunch and clear bills.\n11.30. Back to the Tourist Wharf.\n12.00. Departure to Ha Noi\n16.00. arrive in Hanoi\n"},{"title":". Departure (B)","description":"You will have free time in the morning. Then our guide will pick you up at the hotel and transfer to airport for your onward flight. Tour ends.\n\n"}]},{"name":"Vietnam At A Galance 9 Days ( Sai Gon, Hoi An, Hue City, Ha Noi, Ha Long Bay)","duration":9,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":817,"summary":"Asia Focus Travel will arrange for you a package from South to North on  9days tour, exploring Vietnam’s geography and culture. Start in Vietnam’s modern metropolis, Saigon then travel north to Hoian. Discover the ancient capital of Hue, before immersing yourself in Hanoi’s colonial charm and conclude your tour with an overnight boat cruise among the towering limestone islands of Halong Bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194134_5e4a553195c88.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Sai Gon Arrival ( No Meal)","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking\ninto the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious\ncentre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the\nteeming metropolis are the timeless traditions and beauty of an ancient culture\nOvernight in Sai Gon\n"},{"title":"Ho Chi Minh City - Cai Be Floating Market (B,L)","description":"Breakfast take away.\nPick up: 6:30 to 6:45\nCome back: 17:30 to 18:00\nPick up at your hotel in Ho Chi Minh City. Depart for Cai Be by car/van via Trung Luong Express\nHighway. On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the\nlocals trading fruit and many other commodities on board their vessels. Visit a small family business\nto see how coconut candy and crispy rice popcorn are made. Then wander into the small villages\nand visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk\nmusic.\nKeep cruising to experience the charms of the Upper Mekong Delta, where you can immerse\nyourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese\ndishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax in the\nhammocks to get back your energy.\nCycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn\nmore about the local daily life in the Mekong delta. Take a boat ride back to Cai Be and meet your\nbus for the trip back to Ho Chi Minh City.\n"},{"title":"Cu Chi Tunnel ½ Day – Flight to Da Nang, Hoi An (B,L).","description":"Pick up at your hotel and depart to Cu Chi will take approximately one and a half hours bus driving. \nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon. Drop you off at your hotel and transfer to the airport to take flight at 16:00\nArrive Da Nang at 17:35, the driver pick you up at the airport transfer to the hotel check in hotel\nOvernight in Hoi An\n"},{"title":"My Son Sanctuary – Hoi An Town (B,L)","description":"Pick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu\ncapital which was the the former administrative centre of champa kingdom. Discover the majestic\nancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock\nand board on boat cruise along Thu Bon river.\n12:00 am: Have lunch at restaurant in Hoi An town.\n01:30 pm: Have time for relax\nContinue: You will depart for  Hoi An tour . Walk to the old town, buy entrance tickets and begin the\ntour. Start visiting the Temple Kwan, Phuc Kien Temple, Tan Ky Ancient House, Phung Hung\nhouse, Japanese Bridge and cultural show rooms in Hoi An.\nAfter your walking tour if you have free time, you can do shopping at the old town. Guide will take\nyou back to the hotel. End of program.\nOvernight in Hoi An.\n"},{"title":"Hoi An – Hue by Bus (B)","description":"Free and easy until 13:00 the bus pick you up at your hotel transfer to Hue\nArrive Hue at 17:00, check in hotel and\nOvernight in Hue\n"},{"title":"Hue City tour (B,L)","description":"Have breakfast at your hotel.\nMORNING: Pick up guests at the hotel at 07:30 am by bus.\nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh - Tu Duc, stop on the way to visit The\nTraditional Martial Art Van An, The Conicat Hat Village &amp; The Incense Making Village. Buffet\nlunch with over 50 traditional and international foods.\nAFTERNOON:\nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing\nalong the river to see fishing village and sampan on the way back. Do not miss the Sunset on the\nPerfume River !\n05:00 pm: End of tour at the boat station .\nOvernight in Hue\n"},{"title":"Hue – Flight to Hanoi - Street Food Tour(B,D)","description":"Free and east in Hue, my driver will pick you up at 8:45 transfer to Phu Bai airport to take flight to\nHanoi\nWelcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.\n17:30 to 18:00 The tour guide will pick you up at your hotel to join with street food tour\nYou will have 3 hours to enjoy 5 traditional Vietnamese dishes and explore the small streets of Hanoi to explore the culture here\nVietnamese Beef Noodle Soup ( Phở Bò )\nGrilled Mince Pork ( Bún Chả )\nVietnamese Pan Cake ( Bánh Xèo )\nFruit Beam ( Hoa Qủa Dầm)\nEgg Coffee ( Cafe Trứng )\nOvernight in Hanoi "},{"title":"Ha Long – Sung Sot cave- Titop island – overnight on cruise (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive\ncruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing\nfavorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the\nbay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and\nclimbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and\nserved for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Ha Long – Pearl farm – Hanoi- Departure (B/L)","description":"6.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds\nof the island on the bay (accept winter time have no sunrise)\n\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new\ngroup\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17:00 Arrive Hanoi, My driver will pick you up at the hotel transfer to the airport. \n"}]},{"name":"Vietnam Tour Package 10 Days 9 Nights - Hanoi and Ho Chi Minh City","duration":10,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":690,"summary":"\n\tVietnam package tour 10 days 9 nights  and Enjoy city tours in Ho Chi Minh City and Hanoi\n\n\t• Cruise through the Mekong Delta\n\n\t• Explore the famous Cu Chi Tunnels\n\n\t• Relax on a Halong Bay cruise\n\n\tCapture the spirit of magical Vietnam on this comprehensive tour starting from Ho Chi Minh City. Sip coffee with locals in Hanoi and shop up a storm in the Old Quarter, cruise along emerald waters on a Halong Bay boat trip,\n\n\tThis is an adventure full of beauty and contrast that paints Vietnam as a country of incredible food, lively locals, stunning scenery and cosmopolitan cities.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140650_69578d38.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140650_69578d38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_bb87a29a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_09bf02f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_092df641.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_b6828997.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_77f8943c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_ca439296.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_c976c617.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_b2700800.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_19b0348a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_f5da3f81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140650_dd20e693.jpg"],"destinations":["Hanoi","Lao Cai","Cat Cat Village","Halong Bay","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Upon arrival at Noibai International airport;  our representative will meet and transfer you to downtown. Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day will be free at your own leisure"},{"title":"Day 2: Hanoi - Hanoi – Sapa – Cat Cat – Sapa (B/L/D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\nOvernight at the hotel \n\n"},{"title":"Day 3: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (B/ L)","description":"8:00 – Have breakfast at the hotel.\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. \nOvernight in Hanoi"},{"title":"Day 4: Hanoi - Ha Long Bay (B/ L/ D)","description":"7.45-8.15:  Pick-up at the hotel. (Note: this time applied for those who book our shuttle bus service)\n10.00:  Having short break at stopover in Hai Duong Province.\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n13.15:  Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner Island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30 PM\n•\tDo kayaking through the magnificent landscape with Limestone Mountains in Luon Cave, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\n•\tBack to Lavender Cruises and join sunset party\n•\tPass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n•\tJoin our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n19.30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\nEvening activities:\n•\tJoin squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke….\n•\tOr Laze yourself with our happy-hour drinks at the bar.\n•\tOvernight on  Cruises\n"},{"title":"Day 5: Ha Long Bay - Hanoi (B/ L)","description":"06.15: Morning exercises on the Sun-deck.\n07.15: Have breakfast with Coffee, tea and Bakeries on board.\n08.00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09.30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10.15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12.00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16.30 – 17.00 : Arrive in Hanoi. "},{"title":"Day 6: Hanoi City Tour - Departure to Ho Chi Minh City (B/ L)","description":".30 – 8.30 :Tour guide pick you up at suggested places around Hanoi Old Quarter.\nStart the trip with Tran Quoc Pagoda, a Buddhist relic and national heritage lying on the West Lake. Visit Ho Chi Minh’s Mausoleum, the final resting place of Vietnam’s greatest father; his house – on – stilt and One Pillar Pagoda – modeled after a lotus flower, a symbol of Hanoi.\nVisit the Temple of Literature constructed in 1070 dedicating to Confucius, sages and scholars. It was also the first university of Vietnam once.\n12.30 Relax and have lunch at a local restaurant in Hanoi Old Quarter.\nExplore daily life of traditional ceramics villag of Bat Trang. Visit showrooms and see how they model the products. Arrive legendery Hoan kiem lake, visit Ngoc Son temple dedicated to Tran Hung Dao – General Commander for his struggle against Mongolians.\n15.30 Drop you off at your hotel. Tour ends.\nFree time till car pick you up and transfer to airport for flight to HCM.\n"},{"title":"Day 7: Ho Chi Minh City - My Tho - Ben Tre - Ho Chi Minh City (B/ L)","description":"08.00: pick you up at your hotel\nEnjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCM. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  \n"},{"title":"Day 8: Ho Chi Minh - Cu Chi Tunnel (B/ L)","description":"Located 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nVisit   Notre-Dame Cathedral , Independence Palace ,  Saigon Central Post Office and Ben Thanh market.\nOvernight in hotel in HCM.\n"},{"title":"Day 9: Ho Chi Minh City - Free (B)","description":"Breakfast at hotel.\nFree for your own leisure\nOvernight in Ho Chi Minh"},{"title":"Day 10: Sai Gon Departure (B)","description":"Breakfast at hotel.\nFree for your own leisure until transfer to Phnom Penh airport 2hours before departure. End of service."}]},{"name":"VNA010 - 9days Glimpse of Vietnam","duration":9,"travelStyle":["Custom","Family","Private","Partially Guided","Holiday"],"oldPrice":0,"price":741,"summary":"Starts/Ends: Ho Chi Minh/ Hanoi or Vice VersaTour Duration: 9 days 8 nightsDates: No fixed departure dates. You may go whenever you wish.Tour Type: Landscape and Nature, Cruise Holidays, and HistoricalActivity Level: Regular itinerary, moderate walkingTour Customizable: Absolutely! (Tell us your specific requirements in the inquiry form)","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/109672_0b06892b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/109672_0b06892b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_ae802023.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_f63c17bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_e418a33b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_1b4ace14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_d16a55b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_b536da20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_e5fc88bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_62035272.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_f7ac3c91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_9cb50987.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_60423151.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_d9c86e89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/109672_9b5545a3.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 01: Arrival Ho Chi Minh","description":"Fly to HCMC. Upon arrival, our driver will be holding a sign with your name and welcome you at Tan Son Nhat International airport, transferred to hotel for check in. (Early check-in is NOT included and subject to hotel’s availability)\n3* Gk Central Hotel: Superior Room  \n4* Grand Silverland: Pre DLX Garden \n5* Majestic Hotel: Colonial Deluxe"},{"title":"Day 02: Cu Chi Tunnels – City (B/L)","description":"Breakfast at hotel, meet our guide at 8.00 & start visiting to the most attractive places in Ho Chi Minh City including Reunification Palace - a special national relic for its historical and architectural values of Vietnam, and the War Remnants Museum. Next, we will explore a little bit about Notre Dame Cathedral and Old Post Office – the French building in Ho Chi Minh City.\nHave a lunch at local restaurant before leaving the city for a tour to Cu Chi Tunnels - a man-made maze with the length of almost 250 kilometers. Also, the tunnels were used to serve as communication routes, storage facilities, hospitals and living quarters for Vietnamese fighters in the long period of war. If you are interested in, you can go into the tunnels to discover the harsh living conditions of those whose were used to live there. \nAfter that, taste the typical boiled tapioca and hot tea before you come back to Saigon.\n"},{"title":"Day 03: Ho Chi Minh – Mekong Delta - Fly to Da Nang (B/L)","description":"Pick you up at hotel at 8.00, A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong. On arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. Enjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. Meet at the bus and return to Ho Chi Minh City for your flight to Da Nang. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories\n3* Calla Villa: Deluxe Room  \n4*: Vinh Hung Riverside: Superior Garden \n5*: Silk Sense River Resort: Sup Garden"},{"title":"Day 04: Cycling to Tra Que - Walking Tour (B/L)","description":"Cycling into the countryside to the small farming community of Tra Que Vegetable Village. Here you can enjoy the lush green countryside and see the farmers at work, later learn to make Vietnamese spring roll and free on foot massage by herbs. Transfer back to Hoi An and free visiting a lovely old house, still occupied by the descendants of the merchants who built it over 200 years ago, before seeing the elaborate Japanese Bridge, a Chinese temple, the bustling market. Overnight in Hoi An.\n"},{"title":"Day 05: Hoi An - My Son (B)","description":"My Son Sanctuary, situated around 50km away from Hoi An, is another Cultural Heritage site recognized by UNESCO in 1999 with 32 epitaphs and 71 monuments. The unique Hindu sanctuary is the perfectly ideal destination for those who want to learn everything about the Champa Ancient Kingdom including the history, culture, and architecture.\nThis morning (afternoon), you will set out on a drive to the southwest of Hoi An to My Son Sanctuary for a My Son half day tour. This is where the Cham culture in Central Vietnam started in the 4th century, declined in the 13th century, and ceased to exist in the 15th century. The once capital of the Champa Kingdom dedicated to the worship of the god Shiva is now a cluster of partially ruined and heavily damaged Hindu temples, with only 20 left, due to age and bombing during the Vietnam War. This unique and majestic sanctuary stands as a witness to a glorious bygone era of the once-thriving Cham culture\n"},{"title":"Day 06: Hoi An – Da Nang - Fly to Hanoi – Foodie Tour (B/D)","description":"Today, transfer to airport for your flight to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in. \nAfternoon (17.30-20.30), spend 3 hours with our guide to explore the old quarter and enjoy a foodie tour as it’s a perfect way to discover some of the lesser known dishes that the locals love to eat. From Bun Bo (Sauteed Beef Rice Vermicelli), Banh Cuon (Steamed rice rolls), “Banh Mi” and end with unique Ca Phe Trung (Egg Coffee) which will round off our four courses perfectly. Local life, local stories; local food and local drink tasting. It's the little things that make all the difference in your travel experience!\n3* Gondola Hotel: Sup Room  \n4*: Tirant hotel: Deluxe Room  \n5*: Melia Hotel: Deluxe Room\n"},{"title":"Day 07: Hanoi – Halong Bay - Overnight on Cruise (B/L/D)","description":"Escape the city on a tranquil Overnight cruise through Halong Bay, Vietnam spectacular UNESCO world heritage site. Board a traditional wooden junk and set sail through a scenic panorama of over 2000 towering limestone cliffs draped in dense jungle foliage. Explore the hidden cover by kayak, kick back with a cocktail on board and enjoy fresh seafood delicacies.\n3* Swan Cruise: Deluxe Cabin \n4*: Calypso Cruise: Deluxe Cabin \n5*: Signature Roya Cruise: Senior Suite"},{"title":"Day 08: Halong Bay – Hanoi (B/L)","description":"Wake up to tai chi on board, continue cruising amongst magnificent karst peaks on the tranquil green waters of Halong Bay. Stay on the boat before returning to Hanoi."},{"title":"Day 09: Hanoi Departure (B)","description":"The morning is at leisure before boarding your flights home"}]}]