[{"name":"Vietnam Family Holiday with Teenagers","duration":9,"travelStyle":["Family","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1350,"summary":"Discover a different side of a much-loved country on this activity-focused trip through the northern half of Vietnam. Encompassing cycling excursions, guided walking tours, kayaking expeditions and two nights of boating on Halong Bay, this trip is bound to get the blood pumping and the family bonding. Starting in Hanoi, uncover Vietnam's landmark attractions on a city cycling tour, and sit down to lunch at an initiative geared towards helping street children. Savour the picturesque countryside of rural Vietnam during a two-day ride from Luong Song to stunning Ninh Binh, cruise the waters of Halong Bay by junk boat and kayak, and explore charming Hoi An and its surrounds by bike and foot. This is an adventure for families who like spending their down time getting up and at it.The weather in Vietnam can be hot and sticky, particularly during the monsoon seasons, so ensure that you pack accordingly. Please be sure to pack sunscreen and a hat, especially for wearing when out kayaking in Halong Bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/92899_96fb367a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/92899_96fb367a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_3103c871.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_e26e61bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_0f054db1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_9dbd6f9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_8da7fbe1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_dc84e38e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_64750183.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_85f10e78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_9750154e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_952e72cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_b885d375.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_7ab1b4ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_42e1345c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_96d188fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92899_5af73adc.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Halong Bay","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a Welcome Meeting at 5pm on Day 1.\n\nIf you arrive early, why not get your first taste of Vietnam exploring the lovely, laidback capital. You can stroll the tree-lined boulevards to get a sense of the old days, wander the Old Quarter to uncover ancient temples and a rich, religious culture or head to the Temple of Literature, an oasis of calm right at the heart of Hanoi.\nAccommodation: La Sante Hotel or similar"},{"title":"Day 2: Hanoi","description":"This morning you’ll get the chance to explore the Vietnamese capital in more depth. Full of parks, lakes and tree-lined boulevards, the city is known for its laidback atmosphere. .\n\nJump on our bus and visit the Ho Chi Minh Complex, which includes Ho Chi Minh's Mausoleum, Stilt House and Museum,  the Buddhist temple One Pillar Pagoda and the Temple of Literature. \n\nWe'll join our friends at KOTO for lunch. KOTO stands for 'Know One, Teach One'. An organisation supported by The Intrepid Foundation, it trains street kids for careers in the hospitality industry. After lunch we swap 4 wheels for 2 and head out on a cycling tour around the West Lake.\n\nRiding distance: Approx 25kms/15miles\nAccommodation: La Sante Hotel or similar"},{"title":"Day 3: Mai Chau","description":"After another hearty breakfast it's on to our private bus for the journey to Luong Son (a drive of approximately 1.5 hours). Luong Son, a region in the country's northwest, is the starting point for our cycling adventure through Vietnam's famously picturesque countryside. Today's ride to Mai Chau is mostly along paved roads. After Hanoi's hustle and bustle, this area's fresh country air and relative lack of traffic are a delight. Mai Chau is home to a variety of minority groups with their own unique culture and languages.\n\nWe have a support bus that travels with the group during the entire cycling route for those who don't wish to ride the entire way.  Don't forget to pack plenty of water and snacks for along the way.\n\nRiding distance: Approx 60kms/37miles\n\nNOTE: At the homestay you and your family will sleep on mattresses in a communal room. Bedding and mosquito nets are provided. Shared toilet and bathroom facilities are basic.\nAccommodation: Mai Chau Homestay "},{"title":"Day 4: Ninh Binh","description":"Today is dedicated to exploring the villages and scenic countryside of provincial Vietnam. The journey from Mai Chau to Ninh Binh is fairly easy and leisurely-paced. You'll have plenty of opportunities to hop off your bike and take some photos of the surrounding valleys, sugarcane farms and rice paddies that compose the landscape. \n\nFinal stop for the day is the small town of Ninh Binh. The Ninh Binh province is famed for its spectacular limestone karst scenery, lush rice paddies and gently flowing waterways.\n\nRiding distance: Approx 60kms/37miles\nAccommodation: Thuy Anh Hotel or similar"},{"title":"Day 5: Halong Bay","description":"Having seen a bit of Northern Vietnam by bike, it's now time to see it by sea. Back on board our private bus, enjoy some easier travel on the drive to Halong Bay – home for the next two nights. Factoring in some stop-offs along the way, the journey will take approximately 4 hours.\n\nA natural harbour of more than 2,000 limestone islands rising from the emerald waters of Bac Bo Gulf, Halong Bay is one of Vietnam's most scenic regions. Countless beaches, caves and grottoes exist in its area of 1,500 sq km, creating an environment perfectly suited for exploring by kayak. \n\nOver the next couple of days there'll be opportunities to swim in the South China Sea and check out its caves of stalactites and stalagmites. Today, however, you'll set out on a kayak expedition. Your trip leader will take you through a safety demonstration, then lead you out onto the open waters. \n\nTonight you'll be dining and sleeping on board a traditional Vietnamese junk boat. Our vessel has twin-share cabins with air-conditioning and private facilities, plus a cosy bar and dining area."},{"title":"Day 6: Halong Bay","description":"Today head out for a full day's exploration of Halong Bay by kayak. All food for the day is included and the pace is set according to the ability of the group. After yesterday's warmup session, and in such an exquisite setting, today's exploration is sure to be fantastic fun."},{"title":"Day 7: Hoi An","description":"Returning to land we head straight to the Hanoi Airport to catch a flight down to Hoi An (flight time 1.5hours), a delightful old city with a great atmosphere. This will be our base for the next two days, from which we explore both the town and its surrounds by foot and bike.\n\nRecently declared a World Heritage site, Hoi An is beautifully preserved. Known as Faifo to early Western traders, it was one of South-East Asia's major international ports during the 17th, 18th and 19th centuries. Today, parts of Hoi An look as they did more than a century ago and it retains the feel of centuries past, making it the sort of place that grows on you the more you explore it.\n\nWe arrive into Hoi An in the early evening.\nAccommodation: Hoi An Rose Garden Hotel or similar"},{"title":"Day 8: Hoi An","description":"Spend a day becoming acquainted with Hoi An, beginning with a guided orientation walk led by your leader. (approximately 2hours) Following lunch, it's back on two wheels for a wider exploration of the town and its surrounds. One of the routes we often take a ride past rice paddies and shrimp ponds to Cua Dai beach.  The ride takes 2.5hours including stops.\n\nHoi An is one of the best places in Vietnam to shop for souvenirs, especially if you’re looking for clothing, paintings or ceramics. For those interested in getting some clothes tailored, this is definitely the place to snare a bargain. Hoi An's streets are lined with small tailor studios and the speed with which they can whip up garments is remarkable.\n\nOn the last night of your tour, why not wander down to the riverside and enjoy a final feast with the group?\n\nRiding distance: Approx 20kms/12miles\nAccommodation: Hoi An Rose Garden Hotel or similar"},{"title":"Day 9: Hoi An","description":"Your trip ends today after breakfast. Either take a transfer to Danang airport for your onward flight or stick around a while longer getting to know this charming city."}]},{"name":"Impressive Vietnam 7 Days 6 Nights","duration":7,"travelStyle":["Holiday","Group","Partially Guided"],"oldPrice":0,"price":576,"summary":"Start in Ho Chi Minh City and end in Hanoi! With the christmas & new year tour Impressive Vietnam 7 Days 6 Nights , you have a 7 day tour package taking you through Ho Chi Minh City, Vietnam and 5 other destinations in Vietnam. Impressive Vietnam 7 Days 6 Nights includes flights, an expert guide, meals, transport.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/184657_c2b7d4da.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/184657_c2b7d4da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_7fdf7436.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_d9dd0d3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_14362874.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_5ec1fe9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_516a78fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_d48c9430.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_dfd1d135.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184657_eea62d72.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Ho Chi Minh Arrival (No Meal)","description":"Welcome to Saigon! You will be met at the airport and transferred to hotel in Sai Gon. After checking into the hotel, the rest of the day is yours to enjoy. Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture"},{"title":"Day 2: Sai Gon - Mekong Delta- My Tho- Ben Tre (Breakfast, Lunch)","description":"Start from Ho Chi Minh City and depart to My Tho.  On arrived at My Tho, visit the Vinh Trang Pagoda, a sacred place that is also one of the top local sights. Continue on to the harbor, where you’ll board a boat to explore the Delta region. During the cruise on the Tien River you’ll see the Phoenix, Unicorn, Dragon and Tortoise islands, and fishing villages, stilt houses and fruit plantations along the river. Stop at one of the islets for lunch in an orchard garden.\n Afterwards, you’ll continue on your sightseeing tour of the attractions of Ben Tre. A sampan ride will take you along the natural canals in the shadows of water coconut trees. You’ll get a real sense of the charm and tranquility of the area. Stop to visit a coconut fudge family business, taste some of their products and buy your favorite candies in the workshop. Savor fresh fruits as you sip honey tea and enjoy Southern Vietnamese folk music performed by locals. \nTake the bus and back Ho chi Minh City. \nOvernight in Ho Chi Minh.\n"},{"title":"Cu Chi Tunnel 1/2 Day- flight to Hanoi (B,L)","description":"Located 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon., my driver pick you up at the hotel transfer to the airport take flight to Hanoi.\nDeparture time 17:00- 19:05 Pm arrive Hanoi.\nArrive Hanoi, meet my driver pick up transfer to the hotel check in\nOvernight in Hanoi "},{"title":"Day 4: Hanoi - Ha Long Bay overnight on Cruise (Breakfast, Lunch, Dinner)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board."},{"title":"Day 5: Ha Long Bay - Hanoi (Breakfast, Lunch)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi, check in hotel\nOvernight in Hanoi "},{"title":"Day 6: Hanoi - Ninh Binh - Hoa Lu - Tam Coc (Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\n- Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\n- Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \n- Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \n- Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\n- Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. \nOvernight in Hanoi "},{"title":"DAY 7 : Hanoi city half day tour and departure (Breakfast, Lunch)","description":"8:00 tour guide picks up at your hotel and start the trip to visit Ha Noi city:\nvisit Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university.\n12:00- 12:30 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter OR take-away lunch if your departure time of flight before 16:00 PM.\nThe driver takes you to the airport for your flight.\nEnd of tour!"}]},{"name":"North & Central Vietnam - 8 Days","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":793,"price":476,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\nDiscover all the incredible sights of Vietnam on a comprehensive eight-day tour from North to Central of Vietnam! Discover must see Golden Bridge, Hoi An Old City, Ha Noi and Ha Long Bay overnight and more.","highlights":["Marvel at the golden wonder that stretches over the Ba Na Hills","Fall in love with the cultures and traditions of the local people","Cruise past limestone islands majestically rising out of emerald water"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/185015_4cb94a79.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/185015_4cb94a79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_107ebdb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_8a6bd8ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_38f2f620.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_138a8e80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_5db918cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_0032f62c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_54909c9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/185015_408f9886.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An"],"timeline":[{"title":"Day 1: Ha Noi – Arrival","description":"Arrive at Noi Bai Airport. Pick up and transfer to hotel. Overnight in Ha Noi."},{"title":"Day 2: Ha Noi – Ha Long Bay (BLD) – by shuttle bus","description":"The shuttle bus will pick you up at your hotel and depart for Ha Long Bay, go through the scenic countryside. The wondrous Ha Long Bay is truly one of Vietnam’s most impressive scenic sights. Heading out of the town, embark on a boat for an exploration of the legendary Ha Long Bay. This exciting cruise will provide a fantastic view of the picturesque scenery blending with the sky and some 3,000 limestone islands rising amazingly from the clear and emerald water. The limestone karsts formations are littered with beaches, grottoes and beautiful caves. Along the way, anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath towering cliffs. Stay overnight on the Junk Cruise. "},{"title":"Day 3: Ha Long Bay - Ha Noi (BL) – by shuttle bus","description":"After breakfast, swimming and sunbathing. After lunch, return to Ha Noi. Overnight in Ha Noi. "},{"title":"Day 4: Ha Noi – Da Nang - Hoi An – Contact Ann Tailor for free tailor-made item of clothing (B) – by flight","description":"Transfer to airport for flight to Da Nang. Upon arrival, pick up and transfer to Hoi An. Overnight in Hoi An."},{"title":"Day 5: Ba Na Hills & Golden Bridge (BL)","description":"08:00 Ba Na is one of the most interesting areas in the region as often one can feel the four distinct seasons within a single day: morning - spring, noon - summer, afternoon - autumn and evening - winter. You will have chance visiting Golden Bridge which is a 150-metre long pedestrian bridge with two giant stone hands supporting the structure. It is designed to connect the cable car station with the gardens and to provide a scenic overlook and tourist attraction. With the hiking train, visitors can enjoy the view of the beautiful landscape of nature comfortably and smoothly. It takes tourists to several popular destinations including Linh Ung Pagoda, Le Jardin Garden and a complex of ancient villas. You will also visit Linh Ung Pagoda with its exquisite architectural design. It was built in 2004 and is symbolized by a 30 meters high Buddha statue that is exposed amidst an immense space of clouds and mountains. We will continue our trip discovering Tinh Tam Garden, Nghinh Phong Peak and Vong Nguyet Hill where we can enjoy the panoramic views the areas have to offer. After lunch, we will proceed to our last stop - Man Thai Fishing Village, talking with fisher folk about traditional methods catching and rattan basket boat.Overnight in Hoi An."},{"title":"Day 6: Hoi An - Free time (B)","description":"Free at your leisure day. Overnight in Hoi An."},{"title":"Day 7: Hoi An - Foodie Tour (BL)","description":"WARNING:\nForeigners in Vietnam are allowed to drive a motorbike only with a Vietnamese driver’s license. Purchasing this tour, you should be aware of and abide by the Vietnamese Law.\n09:00 Discover Hoi An’s countryside and its local foods by bicycle. Local foods in Hoi An are known and enjoyed by the tourists once setting foot here. In Hoi An, these cuisines are very popular and sold everywhere in all streets. And these cuisines are considered as a unique culture and introduced to every tourist. We will start our tour with a ride to a local restaurant for Hoi An specialty – Cao Lau. Cao Lau is a traditional Hoi An specialty composed of local noodles, pork, fresh vegetables and rice paper. The noodles are made with local sticky rice soaked in the water that must be taken from Ba Le Well: the oldest well in Hoi An, believed to have the best water anywhere. We then bike through the countryside to a Tra Que Village. Vegetables from this village are provided to most of restaurant in town and specially make the Cao Lau to have a perfect taste. You will also be able to learn to make special white rose cakes with a local family and have the opportunity to enjoy them. Before the end of the tour, we will go to Cam Nam to enjoy the Yin and Yang food such as: Banh Dap (“cracked or smashed rice pancake”), Che Bap (“corn and coconut sweet soup”). This tour is definitely an interesting journey.\n"},{"title":"Day 8: Hoi An – Da Nang – Departure (B)","description":"Transfer to Da Nang for departure flight."}]},{"name":"Northern Vietnam with Sapa","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":698,"summary":"In and around HanoiArrive at Noi Bai international airport. You will be greeted by your local tour guide and driver. Transfer to your hotel in the city center. Enjoy a welcome dinner. Stay overnight at your hotel in Ha noi City.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108468_a81eda49.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108468_a81eda49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_30374f21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_c1070d57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_17b4e5d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_fcee4ee6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_c8acc8bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_55a2c8b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_5e44ce7a8bf11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_5e44ce7a8bf14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_5e44ce7a8bf16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_5e44ce7a8bf18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108468_5e44ce7a8bf1a.jpg"],"destinations":["Hanoi","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrive at Noi Bai international airport. You will be greeted by your local tour guide and driver. Transfer to your hotel in the city center. Enjoy a welcome dinner. Stay overnight at your hotel in Ha noi City."},{"title":"Day 2: Hanoi","description":"Breakfast at the hotel. Visit the Ho Chi Minh Complex, containing the Ho Chi Minh Mausoleum, the Presidential Palace, Ho Chi Minh's house on stilts and the One Pillar Pagoda. Continue on to the Temple of Literature, Vietnam's first university. Lunch at a local restaurant. In the afternoon, visit the Museum of Ethnology, Hoan Kiem lake, Ngoc Son temple and enjoy riding in a rickshaw for 1 hour in the old quater of Hanoi and its teeming streets filled with fascinating shops. Dinner at the restaurant. Transfer to the Ha Noi railway station to boarding the train depart for Sapa. Stay overnight in an air-conditioned soft sleeper cabin on train (2 pax/cabin, wooden cabin)."},{"title":"Day 3: Sapa","description":"Arrive at Lao Cai station at 6:00am. Pick up at Lao Cai Station then transfer to your hotel in Sapa. Have breakfast at the hotel.\n\nStart trekking downhill to Y Linh Ho and Muong Hoa Valley through rice paddies and small hamlets to learn the life of the hill tribes here. Meet the local people in Lao Chai village and spend time to experience their local life, then, continuing walking through villages and rice terraced fields to Ta Van village which settled by the Dzay ethnic people. Have a picnic lunch on the way then keep heading down to the bottom of Sapa valley, the most beautiful one in the area. Back to Sapa in the afternoon. Stay overnight at your hotel in Sapa."},{"title":"Day 4: Sapa","description":"Breakfast at your hotel. Trekking down to Cat Cat village, home of the Black H'Mong tribe. Enjoy the waterfall in Cat Cat village and the beautiful scenery along the way. Take a jeep back to Sapa. Check out. Have lunch at a local restaurant. In the afternoon, take a car to Ta Phin village to visit the home of the Red Dao people. Walk around the village to explore the customs, daily life and weaving techniques of the Red Dao people. Transfer to Lao Cai for boarding the overnight train back to Ha Noi. Stay overnight in an air-conditioned soft sleeper cabin."},{"title":"Day 5: Halong Bay","description":"Arrive in Hanoi at around 5.00am. Pick up from the railway station. Transfer to a restaurant for breakfast then leave for Ha Long Bay through the Red River Delta. Board the Junk and enjoy a welcome drink on arrival, check in to your cabin. Enjoy a sea seafood lunch served on board.\n\nCruise on the Bay and enjoy beautiful views of this world natural heritage site with limestone cliffs growing up from the green tranquil water. See Dinh Huong Island, Ga Choi Island, Dog Island and Sail Island. Visit Sung Sot Cave, the nicest cave in the Bay. Visit the Vung Vieng fishing village by local rowing boat (01 hour) or Kayak into the village then return to the vessel for your leisure or join one of the following optional activities: Sunbathing, traditional massage, swimming etc Have dinner and relax in the quiet and calm of the Bay. Overnight on board."},{"title":"Day 6: Halong Bay","description":"Wake up and start your day with Taichi on the sundesk. Have breakfast, coffee, tea and pastries… for breakfast are served in the dining room with morning view of bay’s landscape. Transfer by tender to the Surprise Cave. Walk up about 100 steps to the cave entrance and tour the cave for approximately 45 minutes. Walk down about 100 steps and return to the boat. Have lunch/brunch while cruising back to the pier. Return to Ha Noi. Overnight at the hotel in Ha Noi."},{"title":"Day 7: Hanoi","description":"Breakfast at your hotel. Free leisure time until your transfer to the airport for departure"}]},{"name":"Vietnam Insight","duration":13,"travelStyle":["Discovery","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":2715,"summary":"Spend 13 days in Vietnam discovering the highlights and traditions of this colourful country. This adventure samples the old-world charm in this pocket of Asia, while uncovering the natural treasures of Vietnam’s verdant northwest along the way. Venture into the misty mountains of the Hoang Lien National Park, an evergreen realm where cloud and hills often meet. Get lost in the districts of Hanoi, cruise past the limestone karsts of Halong Bay, discover the colonial charm of Hoi An, and navigate the winding streets and chaotic traffic of Ho Chi Minh City. In between, there is still much to discover – this trip distils the country’s finest moments, with plenty of time for hidden treats and quiet surprises.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101919_17de2222.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101919_17de2222.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_a6a341e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_96296c98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_ed290e25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_b6f4108b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_eecf26d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_473d873e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_dffecebb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_6bf5dc91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_9f665db1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_1a7e4be0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_f8b00d87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_499ac66b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_fd67588d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_c42ed710.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_9fc66e89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_1c913116.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_e2b0f823.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101919_2f40d698.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to Hanoi. You will be met on arrival and transferred to your hotel. There will be a welcome meeting at 6 pm where insurance details and next of kin information will be collected. Please look for a note in the hotel lobby or ask the hotel reception where it will take place. If you can't arrange a flight that will arrive in time, you may wish to arrive a day early so you're able to attend the meeting. Subject to availability, additional accommodation may be arranged. If you find yourself with free time before the meeting, why not visit the Temple of Literature or Ho Chi Minh's Mausoleum.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 2: Sapa","description":"Your journey to the verdant mountains of northwest Vietnam begins with a private vehicle ride to Sapa (approximately 5 hours). Considered a summer capital by the French in the early 20th century, Sapa’s grown into the crown jewel of Vietnamese tourism since being opened to international visitors in 1993. The mix of ethnic cultures, eye-popping scenery and hill-tribe villages make it an ideal place to see on foot. Trek about 5 kilometres / 3.1 miles from the center of Sapa town to Cat Cat and return, one of the oldest Hmong ethnic minority villages in the region. Here you’ll see rice growing on terraced fields using traditional methods of cultivation, plus the Hmong people’s famed method of making cloth from hemp and dying it deep indigo.\nYou will have an evening to relax and enjoy crisp mountain air and vistas. \n\nNotes: Total trekking time today is 2.5 - 3 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 3: Sapa","description":"After breakfast meet your local guide and drive to Lao Chai. From here you delve deeper into serene Vietnam with a trek past isolated mountain hamlets to Ta Van (approximately 7km / 4.4mi). Passing rice terraces and farm animals you’ll have opportunities to learn about the daily life and traditional culture of the Hmong people. The trek may vary depending on local conditions. Afterwards you’ll need a well-earned rest so perhaps take advantage of the hotel spa and pool facilities. A signature treatment of the area is the Red Dao herbal bath.\n\nNotes: Total trekking time today is 1.5 - 2 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 4: Sapa","description":"Make the short trek to Lech Village and back this morning. About  5km / 3.1mi from Sapa, the village is home to the Red Dao ethnic minority, a remarkable people whose culture has remained relatively unaffected by outside visitors. Your camera will get a workout as you encounter the stunning vistas and rice paddies of the Thanh Kim valley. Stop to try the regional speciality of 3 colours sticky rice. This dish is so named as the rice is coloured with locally sourced natural ingredients such as leaves and flowers. Afterwards, the day is yours to spend as you please. Those with the energy can venture down further scenic trails (ask your leader for a recommendation). There are many more hill-tribe cultures and photographic opportunities to be found in the surrounding hills. Alternatively, simply sit back and soak it all up from your perfectly appointed lodgings. \n\nNotes: Total trekking time today is 2.5 - 3 hours.\nAccommodation: Victoria Resort or similar (feature stay)"},{"title":"Day 5: Hanoi","description":"Return to Hanoi (approximately 5 hours) and use free time to discover its many treasures. Perhaps visit Hoan Kiem Lake, the excellent Ethnology Museum or the Hanoi Social Club. In the evening, sit down to a farewell dinner with your fellow travellers at KOTO restaurant. This philanthropic Hanoi institution is a long-time friend of Peregrine and is supported by our sibling charity, The Intrepid Foundation. Not only is it a lovely place to dine, it's also a great cause, doubling as a hospitality training program for disadvantaged local youth.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 6: Hanoi","description":"Have a full day in Hanoi to explore what you may have missed yesterday. You are free to do as you please until you gather together for another meeting, this time with your new group leader. There will be a meeting at 6 pm where you’ll welcome some new travellers on the next stage of your Vietnam adventure. To get acquainted after your meeting, why not head to a local restaurant for some dinner – your group leader will know of some places to go.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 7: Halong Bay","description":"Today, you will leave Hanoi and drive north (approximately 4 hours) to the renowned Halong Bay. You can leave your luggage behind at your hotel in Hanoi and pack an overnight bag for staying on the boat. Halong Bay is listed as a World Heritage site and is one of Vietnam’s most spectacular natural wonders. The views of sailing junks navigating past thousands of limestone islands with rocky outcrops are nothing short of spectacular. You will travel to Tuan Chau Port (Halong City West) where you will board a boat for an exploration of the bay, enjoying a seafood lunch and dinner (non-seafood also available), as well as spending a night on board. We visit Surprise Cave, and, in the warmer months, you can enjoy a swim from Ti Top Island Beach or go on an optional kayak tour. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. A night on the boat under the stars is very special, but another highlight of this evening is a delicious candlelit dinner out on deck (weather permitting). This is the perfect way to enjoy the beautiful surroundings, dining on a seafood feast.\nAccommodation: Halong Bay Boat (feature stay)"},{"title":"Day 8: Hanoi","description":"After breakfast at Halong Bay, return by bus to Hanoi (approximately 3.5 hours). Later this afternoon, you will enjoy a unique Peregrine experience when you sit down to a traditional Hat Xam performance. Hat Xam is an art form of Northern Vietnam dating back to the Tran Dynasty, and literally translates to ‘singing in darkness’. Originally, this was performed by blind performers, and was enjoyed by local working-class audiences, right up until the late 1950s, when a wave of communism deemed all art forms to be corrupting influences. Today, this style of performance occurs rarely, but you and your group will be taken to a private club house for an exclusive performance; one of the few places where such artists still perform acoustically. The performance takes around 90 minutes, and includes some story telling aspects, performances and possibly interaction with guests, so be ready to get involved!\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 9: Hoi An","description":"This morning, take a half-day tour of Hanoi with your leader. Enchanting Hanoi stands in contrast to its southern counterpart in Ho Chi Minh City – it is relaxed rather than frantic, and full of lakes and parks to escape to. The tour will take in the major sites, including the Temple of Literature, One Pillar Pagoda, and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. The tour will also include lunch at the KOTO café, an amazing project aimed at providing vocational training and experience in the hospitality industry for disadvantaged young people. In the afternoon, you will leave Hanoi and fly south to Danang (approximately 1 hour). You will have the chance to enjoy some spectacular scenery on the drive to Hoi An (approximately 1 hour). Arrive in Hoi An late this afternoon and check into your accommodation.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 10: Hoi An","description":"This morning you will take a tour of the unique town of Hoi An, influenced over the years by myriad traders from various cultures. Originally a busy Cham Port, the town also has Chinese influences scattered about, with pagodas and assembly halls found down the streets. For a small town it has a liveliness alongside its charm and serenity. The tour will take you down the streets of low tiled buildings, taking in a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. There is some free time this afternoon to further explore the Old Town or surrounds at your own pace.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 11: Ho Chi Minh City","description":"The morning is free for you to enjoy more of delightful Hoi An and the surrounding area. Perhaps browse the market for silk and other materials or collect any garments that you might have had crafted by the efficient tailors or hire a bicycle and ride along the lanes and out to a nice nearby beach. In the afternoon, transfer back to Danang and fly to Ho Chi Minh City. Check into your hotel and enjoy a free evening – perhaps spent exploring the bustling food stalls at Cho Ben Thanh market. Delicious!\nAccommodation: Millennium Boutique Hotel or similar"},{"title":"Day 12: Ho Chi Minh City","description":"This morning, head out of the city to the nearby Cu Chi Tunnels. Cu Chi is the name of the district that covers the extensive network (approximately 200 kilometres) of underground tunnels dug by the Viet Minh and later expanded by the Viet Cong. The tunnels contained hospitals, accommodation and schools, and were used for refuge, storage and as a military base for the Viet Cong close to Ho Chi Minh City. A section of them has been widened to allow visitors to enter and get a feel for what the life underground must have been like. Please note that these tunnels will be hot, sweaty, and claustrophobic for some, and so, you can choose to participate in the tunnel walk or continue to explore the complex from above. Afterwards, return to Ho Chi Minh City for a tour of the city, where daily life plays out on the streets and the dynamic atmosphere is a fascinating blend of old and new. Your leader will take you to the Reunification Palace, formally the Presidential Palace and the site of South Vietnam’s surrender in 1975, before visiting the War Remnants Museum. In the evening, perhaps spend some time with your fellow travellers and have dinner at a local restaurant. Your leader will know of some great options.\nAccommodation: Millennium Boutique Hotel or similar"},{"title":"Day 13: Ho Chi Minh City","description":"As there are no activities planned after breakfast, you are able to leave the accommodation at any time. If you wish to spend some more time in Ho Chi Minh city, we would be happy to organise additional accommodation for you (subject to availability)."}]},{"name":"Mu Cang Chai & Sapa - 5 Days","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":586,"summary":"This Vietnnam Tour aims to show you the most beautiful route in-North Vietnam: a journey from Yen Bai to Lao Cai. It covers the least-visited, but most stunning destinations of the region, including Thac Ba, Nghia Lo, Tu Le and Mu Cang Chai.\nYou will enjoy a relaxing boat trip on Thac Ba Lake and a scenic hike to admire the picturesque settings of terraced rice fields in Nghia Lo, Tu Le and Sa pa. These imposing fields draw a number of Vietnamese youth who love to take pictures and travel with a sense of adventure. Amidst this magnificent landscape, you will meet ethnic minority people in their colorful costumes.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153965_b885ce0c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153965_b885ce0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_52625ebf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_b06b8476.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_c8e01462.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_f79792bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_a1c01f84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_fd23dd71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_39cb3e00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_2f46fd9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_5f5ed6ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_3611578a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_8d1d7ed1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_b09644ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_99d133b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_1676cf3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_3b205317.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_2d67eab2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153965_4c39cc98.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1 : Hanoi Arrival","description":"Arrive in Hanoi. Greeted by your driver at the airport. Transfer to your hotel in the city centre for check-in and free at leisure. Note*: The hotel room will be available at 2:00pm, and in case that you would like to secure an early-check in, an additional charge will be applied. Please be advised that both international and domestic might be crowded at sometimes during the day, so in case that you arrive and cannot find our representatives, please be presented at Pole No.16 outside lobby A2 (International) or Lobby of domestic arrival (Domestic flight) and contact us, so we could easily search for you . Meals: N/A  Accommodation: Hotel in Hanoi"},{"title":"Day 2: HANOI - MU CANG CHAI","description":"After breakfast at your hotel, at 6:30am Crossing's private tour guide and driver pick you up for a beautiful drive to Mu Cang Chai. If we have time, have a quick visit to Duong Lam ancient village in Son Tay. Several stops on the way for breaks and photos. It is a long journey (300km), but as you reach Mu Cang Chai, it is like a step to the paradise of rice terraces.\nOn arrival, we start walking to visit small village in Tu Le, follow the terraces fields and conquer the pine forest. Then you will stop at Khau Pha Pass, one of four peaks pass in Vietnam. You will enjoy the fresh air cool in the middle of nature and mountains. When you go on a small road in the forest, you will have the opportunity to hear the birds singing and the occasional squirrel in a tree.\nAfter 2 hours walk you will encounter villages where people Hua Khat ethnic minority Hmong live, where you'll discover extremely simple lives and many wild character. Yet indigenous people could not communicate with us because of the language barrier, but they are very friendly and open welcome when we visit home. Leaving the village of the Hmong people you will be completely surprised to see the valley of terraced fields, which is the mark of human impact on nature in a harmonious way. We can imagine as the space carved by the hands of the artists.\nCheck in homestay in Mu Cang Chai then waiting for the dinner, enjoying local foods and local wine with Thai's family. \nMeals: Breakfast, Lunch, Dinner.  Accommodation: Homestay in Mu Cang Chai"},{"title":"Day 3 :MU CANG CHAI - SAPA","description":"A wonderful morning starts with breakfast and a cup of tea or coffee in the paradise of rice terraces.\n8h30: You depart to visit terraced fields are recorded as national heritage.\nWe will go about 7km to reach the point of walking. All the beautiful things of Mu Cang Chai are waiting for you at the top, after a 1 hour climb we go through the H'mong people where you will meet innocent children, met hardworking women.  All will welcome you with a friendly smile, in this village you can visit the traditional home of the indigenous people and learn the customs. You continue on the trail until you see the whole terraced fields that have been recorded as national heritage. This beautiful place has been CNtraveler magazine rated as the theater of golden rice. \nAfter lunch at homestay, our tour guide and driver will guide you go through the most beautiful road in Vietnam, Than Uyen Valley.\nAround noon, you will say goodbye your tour guide, your driver will take you to Sapa. Check in on arrival. Overnight hotel in Sapa.\nMeals: Breakfast, Lunch.  Accommodation: Sapa Vista hotel"},{"title":"Day 4:Sapa - Y Linh Ho - Lao Chai - Ta Van","description":"Breakfast at your hotel, you will enjoy a free walk around this charming town, paying visit to Sapa market and the old cathedral where you can meet a lot of local ethnic minority peoples such as Black H’mong and Red Zao wearing their traditional colorful dresses selling their farming and gathering products and handicrafts for souvenir. Back to our Sapa office at about 10.30 and begin your exploration trip to Muong Hoa valley. You will follow the main road heading south for about an hour before turning right to a foot path down hill to Muong Hoa Valley. This part offers spectacular scenery of the highest part of Hoang Lien Son mountain range and in a nice day, Fansipan Peak can be seen. Crossing the river by a suspension bridge you will challenge your feet uphill to Y Linh Ho village. Here you will pay visiting to some H’mong families, watching them doing their daily works. After picnic Lunch, the trail continues up and down hill for about 2 hours as you reach to Lao Chai, a large village of the H’mong and then following the river bank to Ta Van of the Zay people. Paying visiting to local homes, village schools… you will enjoy much your cultural discovery of local ethnic peoples as well as breathtaking scenery of the Muong Hoa Valley. Settle down in Ta Van village for an overnight home stay.\nMeals: Breakfast, Lunch, Dinner.  Accommodation: Homestay in Ta Van Village "},{"title":"Day 5: Return to Hanoi","description":"In the morning, our tour guide will come to pick you up and guide you to visit Heaven Gate and Silver Waterfall. After lunch our tour guide come to pick you up for the transfer to Hanoi by sleeping bus, which takes around 6 hours. Goodbye and see you again\nMeals: Breakfast, Lunch"}]},{"name":"Highlights of Vietnam from Ho Chi Minh","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":810,"summary":"Discover dynamic Ho Chi Minh City and admire the beauty of the Mekong River, Experience life underground in the Cu Chi Tunnels. Chill out in charming Hoi An and explore the tombs and temples ofHue. Witness the wonder of Halong Bay with an overnight cruise and enjoy a traditional water-puppet performance in Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146126_87d03c87.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146126_87d03c87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146126_82e8aec9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146126_0de0500a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146126_d02c4f53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146126_808d68a2.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Ho Chi Minh city and arrival","description":"When you arrive at the Tan Son Nhat Airport in Ho Chi Minh City you will be welcomes by your tour guide and driver. We will take you to your hotel, and if times permit, we will take you on a tour around in the afternoon. In the evening you will enjoy your dinner at a cruise at the Saigon River and in the evening you can enjoy a good night’s rest in the heart of Ho Chi Minh City ."},{"title":"Ho Chi Minh City tour","description":"After  having  had  a  good  rest,  you  will  enjoy  yourbreakfast  at  the hotel.  Starting  off  your  day with  an interesting  sightseeing  tour ofHo  Chi  Minh City, where  you  can  experience  the Reunification  Palace, the famous building  fromwhere  the  tank  crashed through  the  gates  at Saigon’s  fall.  Afterwards  you can enjoy the beautiful structures from the French Colonial times such  as  the  Notre Dame  Cathedral  and  the  Old  Central  Post  Office.   Before  continuing further into the history ofHo Chi Minh City, lunch will  be served at a local Vietnamese restaurant. We will  visit  the  Thien  Hau,  Quan Am  and  Emperor  Jade  Pagoda  before  arriving  at  the  War Remnants Museum. To  lighten  the mood  after  visiting  the  museum,  we  will  bring youto  the historical Ben Thanh Market,where  you can shop among the busy Vietnamese traders and sales people. In the evening, dinner will be on  your own account, and  you will restin the heart of Ho Chi Minh City."},{"title":"Ho Chi Minh city - Tay Ninh - Cu Chi tunnels","description":"After breakfastwe will proceed towards Tay Ninh, which is famous for their unique religion Cao Dai. The religion is a fusion of several old religions such as Buddhism, Hinduism, Confucianism, Taoism, and Christianity. We will arrive at the Cao Dai temple just before noon, so you will have an interesting chance to experience their local ceremonies. After visiting the Cao Dai Temple we will proceed towards the CU Chi Tunnels. However, before leaving Tay Ninh, \nwe will have lunch at a local Vietnamese restaurant. Arriving at the Cu Chi Tunnels, you will have a look into the guerilla warfare used by the Vietnamese in the Vietnam-America war. At the sight you will havea chance to crawl into the small tunnels as well as have a taste at the humble food and preparations they could manage underground. Upon returning to Ho Chi Minh City, dinner will be at the guest’s own account."},{"title":"Ho Chi Minh City – Cai Be Floating Market","description":"Waking up inHo Chi  Minh City your breakfast will  be served at the hotel  before departing  for the  Cai Be  floating market  at the  Mekong  River. On  the  way we  will  make  a short  stop  at  the Tan An town, where youcan have a magnificent morning view over the rice fields. On arrival inCai Be, a motor boat will be waiting for us, and  bring us to  the Cai Be Floating  Market, whereyou can  experience  the  locals  as they  do  theirtrading of  commodities  from their boats  andvessels. Continuing to a small, nearby village, youcan have a walkin the orchard and get a feel of the rural life and as we continue by the Mekong River to a small Coconut Candy Factory you will have a chance to taste some of the local delicacies such as the candy itself andrice popcorn. Continuing by the streamsof the Mekong River, we will arrive at Binh Hoa Phuoc Village, which is also known as the Green Pearl. Here  youcan  immerse  yourself completely  into  the  nature  while  you  enjoy  your  lunch to  the tunes of local Southern folk music. We will have a delightful walk to meet our driver, who will bring us back to Ho Chi  Minh City.  In  the evening  youcan spend  your timein  the  heart of HoChi Minh City as  you please, and dinner will be on your own expense."},{"title":"Ho Chi Minh city - Da Nang - Hoi An","description":"In the morning you can enjoy your breakfast at the hotel before we depart will bring you to theNoi Bai Airport and bring youto Danang International Airport. When you arrive at Danang International Airport we will continue towards Hoi AnTown. In the afternoon youcan enjoy the charming streetsofthis UNESCO heritage town, with the bright yellow colors and streets with lanterns. You will visit the Japanese Bridge, Pottery museum and Tan Ky’s old house. In the evening dinner is at the guest’s own cost"},{"title":"Hoi An - Hue","description":"In the morning you can enjoy the breakfast at the hotel before departing for Hue. On the way we will  visit  the Marble  Mountains  and  the Cham  Museum, where  youcan  get  a  fantastic  insightinto  the  local  history and culture.  We  will  also  make  a  stop  at  the  stunning  Hai  Van  pass  andLang Co  Beach  where  you can take  some memorable  pictures  before  proceeding to  a  local restaurantwherewe will have lunch. When we have arrived in Hue City, we will in the afternoon visit theDong Ba Market  and the Imperial City and the  Purple  Forbidden City, from where theNguyen  Dynasty  ruled  from  1802 to  1945.  In  the  evening  you  will  enjoy  a  beautiful  boat  trip, while locals will play their folk music. Dinner is at the guest’s own cost"},{"title":"Hue City - Hanoi","description":"After a  good  night’s  restbreakfast  will be  served  at the hotel.  We will  bring  youon  a  morning tour by boat fromwhere youwill visit the royal tomb of Emperor Tu Tuc followed by the Thien My Pagoda  and  mausoleumof Emperor  Minh  Mang.  All of  the sights  are  located in  beautiful garden  scenery  with  small  lakes  and  greeneries. You  will  enjoy  lunch  at  a  local Vietnameserestaurant, before we proceed towards the airport to depart for Hanoi. When you arrive at Noi Bai international Airportin Hanoi, your tour guide and driver will pick you up and bring youto your hotel in the Old Quarter of  Hanoi City.  In Hanoi  you will be welcomed with a dinner of Hanoi specialties."},{"title":"Hanoi City Tour","description":"Before beginning an interesting day with the history of Vietnam, breakfast is served at the hotel. To begin with we will bring you to visit the Ho Chi Minh complex, where you can see Uncle Ho’s humble house onstilts and then continue to the nearby One Pillar Pagoda inspired by the lotus flower.  Continuing we  will  visit  the  stunning architectural  Temple  of  Literature, where  youcan  see  the  old scripture on massive stone plates, while walking through the symmetric gardens alongside the small lakes inwhat is known as the first university inVietnam. Cross the red bridge over the lakes in the heart of Hanoi to the Ngoc Son Temple and afterwards  you can relax while being taken  around in  the  Old  Quarter of  Hanoi  by  Rickshaw.  After  a  tour in  the  charming streetsof Hanoi’s Old Quarter,we will bring  youto your hotel. For the restof the evening  youare free to enjoy Hanoi furthermore anddinner is on guest’s own account."},{"title":"Hanoi - Halong Bay","description":"Following breakfast at your hotel, we will depart towards the Halong Bay. When arriving in Halong City, you will board a junk boat, and while departing for the stunning sights of Halong Bay’s limestone formations, lunch will be served. At the four-hour cruise we will also visit the Thien Cung Cave, which was opened for the public in 1998. Visitors can then admire the newly-discovered Dau Go grotto where wooden stakes were set deep inside the cave prior to a battle with an invading Mongol army. Boat ride back to Ha Long city. Road trip back to Hanoi. Dinner on guest's account. Stay overnight at your hotel of choice in Ha Noi city"},{"title":"Departure","description":"In the morning you will enjoy your breakfast at the hotel before getting ready to leave Hanoi. While waiting for your flight, you are free todowhat you please, and as you will leave, we will bring you to the Noi Bai International Airport. This will be the endof our services, andwe truly hope that you have had a journey of a lifetime"}]}]