[{"name":"South Vietnam Getaway (Basix)","duration":4,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Easy","Holiday"],"oldPrice":0,"price":487,"summary":"Observe the contrast between Vietnam’s urban and rural regions while taking in cultural highlights of the south. For a welcome change of pace, jump on a boat and explore the meandering waterways, islands and fruit orchards of the mighty Mekong Delta. Then negotiate the labyrinthine streets of Ho Chi Minh City on a morning walk, make a sobering visit to the War Remnants Museum and make your tastebuds swoon over lunch at a traditional Vietnamese restaurant. Head to the city’s outskirts to scramble through the infamous Cu Chi Tunnels before diving back into the fray at one of Ho Chi Minh City’s lively markets. This short break adventure can run with a minimum of 1 person, so please be aware that there may be instances when you are the only person on this trip.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/12013_6ae23f3f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/12013_6ae23f3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_8473ed3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_8a0e5e89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_5b2b3f35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_320871f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_236af990.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_4c96ccc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_0bb73856.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_07483fad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_55c7dae7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_10fd20b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_31402673.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_080cd233.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_34182150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_8d295d4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/12013_9fbc87ce.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Mekong Delta","description":"Xin chao! Welcome to Vietnam. Escape the city for a tour of the Mekong Delta, where you'll see what life is like beyond the urban centre of the south. This morning, please make your way to the Opera House (Intersection of Dong Khoi street and Le Loi street, District 1) to meet your Intrepid representative at 8.00am before setting off for the Mekong Delta. Please bring with you an overnight bag ready for the one night homestay. Your main luggage can be stored at your hotel. \n\nAbout 2.5 hours away is the city of My Tho, a former naval base that is now a bustling port city in the Mekong Delta. The area is the final destination of the mighty Mekong River, which winds its way from Tibet, through China, Myanmar, Laos, Cambodia, and finally into Vietnam. An incredibly fertile region, the Mekong Delta's prime industry is food production, producing approximately half of Vietnam's total agricultural output. Local life for villages in the area revolves around the rivers and canals that make up the delta, so much so that people are more likely to transport by river than road. Upon arrival into My Tho, board a private boat for a cruise on the Mekong River. Your first stop is Unicorn island where we'll visit an island with lush tropical gardens where we have a chance to sample tropical fruit. Continuing to another island in the Mekong Delta, you'll learn more about another cottage industry, coconut candy. Your local guide will take you to a factory and explain the process of making the sweet. As you meander down the Mekong, you will have a chance to visit local villages in the area and learn more about the traditional lifestyles, culture, and customs of people who call the Delta their home.\n\nNext, travel by Xe Loi (motorised cart), and visit a bee farm, from where you will transfer to a smaller rowing boat to delve into the smaller canals of the Delta. For lunch, hit up Vuon Dau restaurant, where your local guide will provide you with some advice on the finer points of local cuisine and assist with ordering some of these delicacies. Sometimes you may transfer to the homestay by tuk-tuk. Mid-afternoon you will arrive at the home of a local family, where you’ll stay in dormitory-style accommodation. The pleasant surroundings consist of a 2 hectare garden with seasonal tropical fruits such as longan, durian, mangosteen, banana and grapefruit. This is a great opportunity to relax after a busy day so make sure you bring a book or deck of cards. The local owners will be your welcoming hosts for the evening and can tell you more about life in the Delta.\nAccommodation: Homestay"},{"title":"Day 2: Mekong Delta/Ho Chi Minh City","description":"Rising early to the sounds on the Delta, jump on a bicycle to visit the local market, then back to the homestay to help your host prepare lunch or to do some gardening. After lunch, say goodbye to your friendly host and return to Ho Chi Minh City. Formerly known as Saigon, Ho Chi Minh City is characterised by a vast array of sights and sounds, and is a fascinating blend of old and new, East and West. The huge number of people rushing about their daily lives in Vietnam's largest city gives it a dynamic atmosphere and the French influence is evident in the excellent baguettes and coffee on offer. Much of city life takes place on the busy streets lined with shops, stalls and vendors, who have their wares spread out on the footpath and sell everything from soup to sophisticated electronics. There is plenty to do here in free time before your tour of Ho Chi Minh tomorrow. Maybe explore the frenetic heart of the city, or get bargaining at the historic Ben Thanh Market.\nAccommodation: Hotel"},{"title":"Day 3: Explore Ho Chi Minh City","description":"This mesmerising full day Ho Chi Minh City tour, by bus and on foot, gives you a fun and fascinating insight into the history, culture, and the daily life of the locals in this busy, buzzing city. An Intrepid representative will meet your at your hotel at 8.00am, then start the HCMC tour by heading to Chinatown and wandering through the fascinating back streets near Cho Lon. This area is one of the busiest commercial districts of Ho Chi Minh City and its atmospheric streets are home to some of the city’s most interesting sites. From there, pay a visit to Thien Hau Temple, which was built in the early 19th century and dedicated to the goddess of seafarers. Delve deeper into Chinatown, visiting the amazing Cholon and Binh Tay Markets, which are full of energy and dazzling array of goods. You can stop at a local café for a coffee (not included) to watch the hectic pace of life pass by in Ho Chi Minh City. Following your market visit, have a traditional local Vietnamese lunch, ‘pho’ or noodle soup. Then after all that soupy goodness, visit the War Remnants Museum and check out all the major Ho Chi Minh City sights like Reunification Palace, Notre Dame Cathedral, General Post Office, and the Opera House. You'll also get to see downtown Saigon, and get a real feel for local life in the past and present. At the end of your HCMC tour, your guide will assist you in getting a taxi back to your hotel, or will provide you with tips and suggestions if you'd like to continue exploring the area.\nAccommodation: Hotel"},{"title":"Day 4: Cu Chi Tunnels","description":"This morning, please make your way to the Saigon Central Post Office - 2 Cong Xa Paris St, District 1 (next to Notre Dame Cathedral) to meet your Intrepid representative at 7.15am before departing at 7.30am. Built by local fighters during the Indochina conflict, the Cu Chi tunnels served as a base from which the Viet Cong could operate from close to the Southern Vietnamese capital. For this HCMC tour, leave the hustle and bustle of Ho Chi Minh City to explore one of the relics from one of the most significant local historical events in recent memory. Journey 2.5 hours west towards the Cambodian border. Before arriving at the Cu Chi tunnels, visit with some local friends and gain an insight into local life in the area, both past and present. Learn about their lives, culture, and customs and get an insight into the recent past through local eyes.\n \nContinue on to the Cu Chi tunnels. The location of the tunnels was of significant strategic importance: they're at the end of the infamous Ho Chi Minh Trail, and within striking distance of the southern Vietnam capital. Initial construction started in 1948 when the Viet Minh required somewhere to hide from French air attacks, and by 1965, the tunnel complex was estimated to consist of 200 km of tunnels. It included, hospitals, schools, meeting rooms, kitchens, and sleeping quarters. Life was difficult for the inhabitants, and to protect against outside intruders, booby traps were laid throughout the complex. Today, the Vietnamese government have preserved approximately 75 km of the Cu Chi tunnels as a memorial park, and in some areas the tunnels have been widened and low powered lights installed so that visitors can now fit through the complex.\n \nYour local guide will take you on a fascinating tour of the Cu Chi tunnels, where you'll learn more about the conditions the people lived in, the hardships they faced, and the amazing ingenuity employed to maintain life in the tunnels. Walk past huge bomb craters, evidence of the heavy bombing campaigns in the region during the Indochina conflict, discover hidden entrances right beneath your feet, wander past tiny little chimneys in the ground that dispersed smoke from the underground kitchens, sample some of the simple cuisine that local fighters would have survived on, and have an opportunity to venture into the tunnels and explore the complex. You'll end this historical Ho Chi Minh City tour with a greater understanding of the local impacts of the conflicts of the 20th century. Following this step back into modern history, return to the chaos of Ho Chi Minh City. Your South Vietnam Getaway adventure ends upon arrival in Ho Chi Minh at around 2pm."}]},{"name":"Best of Northwest of Vietnam 14 Days Soft Trek","duration":14,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":1678,"price":1007,"summary":"For many travelers, the Northwest of Vietnam is a real feast for the eyes, not only because of its awe-inspiring nature, but also because of its colorful ethnic culture. This beautiful region is a superb mosaic of vibrant colors. Impressive mountains, amazing terraced rice fields, agricultural activity in rhythm with the seasons and fascinating ethnic markets make up a magnificent travel destination.  ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187088_b308b1f8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187088_b308b1f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_f0e02a8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_62c00d2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_176ec474.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_a17805cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_8e58fda5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_5ca1394c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_f84659c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_5e3769fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_80c10e76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_ada25c97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_659fb581.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_4dfd019d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_21c615a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_a3c18a5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_97fa7d11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_bd33b3ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_8aefd434.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_09744a01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_e7fbb293.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_dc57a2b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_5ff9e9fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_4b766525.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187088_26df0e50.jpg"],"destinations":["Hanoi","Mai Chau","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village, Mai Chau Valley via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight in Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Trek to the East Mountain (B, L, D)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Arrive at a local Muong house where lunch is prepared.\n13h00. Continue afternoon walking through the valley and the villages Khan Ho & Khan Thuong\n15h30. Back to the resort. Rest and relax.\n19h00. Dinner & overnight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 4: Bakhan Village - Son La (B)","description":"After breakfast prepared by Bakhan Village Resort, you will drive toward Son La, the fifth largest province in Vietnam, located in the far north. Take a short hike to Pa Co village 30km form Mai Chau where you will meet the Black H’mong ethnic group. Continue the drive past lush tea plantations in Moc Chau. This is an incredible chance to shoot great photos. Cross a bamboo bridge to visit  Na Ken village, 80 km from Son La, home to the Black Thai ethnic group. To this day, their houses are built in an ancient structure with thatched roofs shaped like a tortoise carapace and unique decorations called \"khau cut\" at each end of the ridge. Arrive at Son La in the late afternoon. Overnight in hotel. \nSao Xanh Son La Hotel 2* or similar"},{"title":"Day 5: Son La - Dien Bien Phu (B)","description":"Today you travel to Dien Bien Phu crossing the Pha Din Pass, the highest and longest pass in Vietnam with an altitude of 1,500m. At the middle of the pass, stop to visit a multi-ethnic primary school and a village of the White H’mong hill tribe where children in colorful traditional costumes will welcome you with warm smiles. You then drive to Dien Bien Phu, site of the most legendary battle in Vietnam’s struggle for independence from the French in 1954. Visit famous sites of the Indochina War, the Ellianne Hill and the War Museum, which vividly describes the fight. Relics from the battle on display include old French tanks and artillery pieces, and most interestingly a reconstruction of the bunker in which the French commander, Colonel de Castries, surrendered to Viet Minh forces. Overnight at Dien Bien Phu Hotel. \nMuong Thanh Hotel Dien Bien Phu 3* or similar"},{"title":"Day 6: Dien Bien Phu - Lai Chau - Tam Duong (B)","description":"Transfer to Lai Chau, a town due to be flooded when the plans for a large hydroelectric dam become reality in the near future. Continue the drive to Tam Duong along Nam Na River, a major tributary of the Black River. Visit a village of the Black Thai, Chan Nua Thai with its large wooden houses on stilts. Arrive in Tam Duong. Overnight in hotel.\nPutaleng Tam Duong Hotel 2* or similar"},{"title":"Day 7: Tam Duong (B)","description":"Tam Duong is a frontier town situated in a beautiful valley amongst limestone peaks. This place is the home of many hill tribes such as the H'Mong, Man Tien, Lu and Cu Chu people. Authentic in lifestyle and colorful in costumes, most of these tribes have migrated from South China during the 17th - 18th century. A full day of trekking through their villages, nestled at the foots of the mountains and hills, enables you to discover the differences among these ethnic groups.  Overnight in Tam Duong Hotel.\nPutaleng Tam Duong Hotel 2* or similar"},{"title":"Day 8: Tam Duong - Sapa (B)","description":"In the morning, discover the most fascinating cultural activity of hill tribe people, at the local market held every Sunday. You will meet many different minorities from the surrounding regions of Tam Duong that come to exchange their goods, drink rice wine and meet friends. This is a great photo opportunity.  En route to Lao Cai, you take a hike through Ban Hon, a village of the Lu ethnic group. Lu women take great pride in their shining lacquered teeth and traditional costumes adorned with metal jewelry. Arrive in Sapa, once a mountainous town during the colonization by the French. Check into the hotel. Free time to explore the little town with its market and remains of colonial architecture. Overnight in Sapa hotel.\nBamboo Sapa Hotel 3* or similar"},{"title":"Day 9: Trek to Y Linh Ho-Lao Chai-Ta Van Villages (B, L)","description":"9:30 am, start from Sapa Ethnic (04 Hoang Dieu Str) on the main road to go down to Muong Hoa valley. Begining of the trip is the moment for admire the panorama view of the town and then the valley from the main road. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields to get to Y Linh Ho hamlet, a small village of the Black Hmong people.\nFrom Y Linh Ho village, we go along the river to go to Lao Chai village (means \"old village\" in the local dialect). It is time for you to visit the local families, listen to your guide's explanation about the local culture: how they live, way of building the traditional house, techniques of making clothes... or listen about the way of treatment for a sick person.\nStop for lunch. The lunch is served in one of the local refreshment restaurants on the side of the river.\nIn the afternoon, we leave Lao Chai to continue to Ta Van village, the Giay people's residence. The guide to bring you into some family: listen about their life, enjoy some green tea, learn about the differences of their culture from the other hill tribes even they leave close to each other.\nQuitting Ta Van, we head up to the main road where the car will pick up us to transfer back to Sapa. \nBamboo Sapa Hotel 3* or similar"},{"title":"Day 10: More Sapa discovery - Hanoi (B)","description":"Trekking from Sapa to Cat Cat Village to see its waterfall and meet H’mong family and learn more about their way of life.\nCat Cat is a small but bustling village situated at the foot of Fansipan Mountain. Here you will see traditional H’mong homes at their best, and you will be able to meet a H’mong family to learn more about their way of life. The village is also the perfect place to see traditional clothing being made, hemp being dyed and women weaving. From Cat Cat we will follow the Muong Hoa Valley for 3km through rice terraces and small dwellings to Sin Chai. This village is a little off the usual trekking route and less visited, but offers the opportunity to see traditional wooden homes built using the indigenous Pumu tree. Transport will be waiting in Sin Chai to take you back to Sapa.\n15:30: Our car and guide will pick you up at the Sapa Tourism Information Center (inside) for departure back to Hanoi towards new Noi Bai - Lao Cai Highway by luxury public Bus. There will be 2 stops on the way for restroom (max 20mins/stop)\nArrive in Hanoi at 8:30pm to 9:00pm. End of the trip with sweet memories about our Sapa and Hill-tribe village of the north of Vietnam.\nCheck in hotel & overnight in Hanoi\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 11: Hanoi - Halong Bay with overnight on Cruise (B, L, D)","description":"At 9:00 am we will pick you up, by mini-van/bus, at the hotel and begin our journey to Halong city. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the at port. Board your private boat, an authentic Chinese Junk, and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave”, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck. Overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 12: Halong Bay - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs, We stop to visit a floating fishing village and listen to some legendary stories of the fishermen’s daily life. Have lunch on boat while cruising back to the Halong city pier, return to Hanoi.\nCheck in hotel & overnight in Hanoi!\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 13: Hanoi City Tour full day (B, L)","description":"Depart at 9:00 am from your hotel by van. We will begin our day by visiting Uncle Ho, learning about his great life at the Ho Chi Minh Mausoleum, Presidential Palace, and his residential place. Next stop is the nearby Temple of Literature. The site of Vietnam´s first University, built in twelfth century, to teach Confucius’s theory to royals. Here we will also have a chance to see a traditional music performance. Lunch will be served at a local restaurant for a taste of authentic Hanoi Pho (noodle soup). In the afternoon, choose one from the numerous museums or temples around Hanoi (Museum of Ethnology, Women´s Museum, History Museum or Quan Thanh Temple). In the late afternoon walk around Hoan Kiem lake and Hanoi´s fascinating Old Quarter for some great fun, shopping, and street side traditional food, may be to try one “Hanoi bia”. This is your chance to be part of typical Hanoian style and its traditional Vietnamese culture. We finish our relaxing but informative day by attending a Water Puppet Show, a favorite experience for all visitors to Vietnam. \nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 14: Hanoi - Concluded/ Departure home (B)","description":"Breakfast at your hotel, then transfer to Airport for your International flight to back home!\nEnd of services with great memories about Vietnam with us. Thank you so much and hope to see you again soon!"}]},{"name":"Vietnam North","duration":10,"travelStyle":["Adventure","Group","Fully Guided"],"oldPrice":1045,"price":941,"summary":"Join us on our Vietnam North trip, where we’ll show you all the best bits the northern half of the country has to offer. Begin your adventure in the cultural hotspot of Hoi An, enjoy exploring the area by bike and bamboo boat; then head north to Hue in open-top jeeps along the Hai Van Pass. Explore caves in Phong Nha National Park, and learn how to cook Vietnamese cuisine, before finishing off in the stunning Ha Long Bay.","highlights":["Explore Hanoi by bike and gliding on a bamboo boat","Head to Hue in open-top jeeps along the Hai Van Pass","Go on explorations in caves at Phong Nha National Park","Learn the art of how to cook classic Vietnamese cuisine","Cruise the aquamarine waters of stunning Ha Long Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143394_963f8834.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143394_963f8834.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_be4b187c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_0990658d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_d9b98ca9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_7f46a6ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_c7f19cfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_32984ab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_514cb0da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_f4e31005.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_2017a33d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_532dbc73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_1f40af98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_9a0aa510.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143394_9f4c0626.jpg"],"destinations":["Hoi An","Hue","Phong Nha-Kẻ Bàng National Park","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: Hoi An","description":"Today is arrival day; feel free to arrive any time. You will be picked up from Da Nang airport by one of our drivers, who will be waiting for you. Then head to the hotel where your group leader will be waiting for you. Get excited to meet your new travels buddies for dinner and drinks in the evening."},{"title":"Day 2: Hoi An (1B, 1L)","description":"Start the day with a bike tour around Hoi An old town and lunch at the locals family home. Then spend the afternoon crab fishing with the locals as we explore the 7 hectare water coconut woods in traditional bamboo basket boats. The late afternoon is free to chill or explore the lantern filled streets."},{"title":"Day 3: Hai Van Pass (1B, 1L)","description":"An adventure filled day as we leave Hoi An in open-top Jeeps & hit the Hai Van Pass, featured as the ‘Top Gear Experience’ it’s the perfect way to travel to Hue. Stop for a spot of lunch (included) and enjoy a nice swim in the sea before heading off again. On arrival to Hue we check into our new hotel & head into town for dinner and a few drinks in the evening."},{"title":"Day 4: Huế/Phong Nha (1L)","description":"Today it’s time to explore the historic imperial city of Hue. We head off to the Royal Palace where we take in the history of the nation`s former capital city before joining a local cooking school to learn how to make some traditional Vietnamese dishes. After we’re full of delicious food, we then head over via bus to the small town of Phong Nha, where we arrive early evening & just in time to enjoy a few drinks in one of the local bars."},{"title":"Day 5: Phong Nha National Park (1L)","description":"Paradise Cave is a UNESCO World Heritage site, & is famous for being one of the longest cave systems in the world at 31 km. We spend the day exploring the caves and doing a little ziplining, both of which are situated inside Phong Nha National Park. In the evening we jump on an overnight bus to Hanoi."},{"title":"Day 6: Hanoi","description":"We arrive early morning into Hanoi & head straight to our hotel to check in. As the rooms are still being prepared, we check out a local cafe and experience how to make traditional egg coffee which is a famous dessert in Hanoi. In the early afternoon, we’ll visit the famous Hanoi train street and then have the rest of the afternoon free for you to chill or explore the city on your own."},{"title":"Day 7: Hanoi/Ha Long Bay (1L, 1D)","description":"We leave early by bus & boat to head to the famous Castaway Island in Ha Long Bay. Once checked into our beachside accommodation, we enjoy lunch with the most amazing view before an afternoon of watersports & an evening of beach partying."},{"title":"Day 8: Ha Long Bay (1B, 1L, 1D)","description":"We spend our full day aboard a traditional junk boat cruising through Ha Long Bay. During the trip we stop off to kayak through ancient caves & a network of lagoons whilst looking out for monkeys, before relaxing on the boat during the afternoon with plenty of swim stops."},{"title":"Day 9: Ha Long Bay/Hanoi (1B, 1L)","description":"After a few big nights on our private island, we enjoy another lay in before enjoying our last beachfront lunch, before making the journey back to Hanoi where we check in to our accommodation for our final night together as a group."},{"title":"Day 10: Hanoi","description":"It's time to say goodbye to one another as everyone heads off on their separate ways. Whether you’re continuing around Southeast Asia, or heading to the airport to go home, your Group Leader will help you to get you where you’re going."}]},{"name":"Complete Vietnam - 10 Days","duration":10,"travelStyle":["Adventure","Independent","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":712,"summary":"\n\tGuaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!\n","highlights":["Explore vibrant Hanoi and bustling Ho Chi Minh City","Visit the ruins of My Son and the Cham kingdom","Cruise the emerald waterways of Ha Long Bay","Treat yourself to tailor-made clothes in Hội An","Challange yourself to crawl through the Cu Chi Tunnels"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100046_1862e3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100046_1862e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_6f82f4ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_3b026f2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_8c24015c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_1ee1a962.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_cd4ab95e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_4e671238.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_5d61f345.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_fe90413d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_4b6f5b97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_795525d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_7373ad63.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_cfd0e23c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_7f670618.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_67459d7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_ca960af3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_ea6f507a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_207a5c82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_d6d3186a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_718cfb38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100046_84ace838.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1 HO CHI MINH ARRIVAL","description":"Meal not included\nOn arrival Ho Chi Minh City, we will see at the airport and transfer to center for check in hotel. You are free time for leisure.\nOvernight in Ho Chi Minh city."},{"title":"Day 2: 1 DAY MEKONG DELTA (MY THO & BEN TRE)","description":"Meal included: Breakfast, Lunch\n8.00am depart to My Tho city, 1.5 hours drive.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people.\n• The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake.\n• The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree.\n• Having lunch at local restaurant. After lunch, we will freetime for biking, walking.\n• 3.00 Back Saigon. On the way, we will stop at vinh Trang Pagoda. 5pm get back to Saigon."},{"title":"Day 3 CU CHI TUNNEL HALF DAY MORNING","description":"Meal included: Breakfast.\n08:30 We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh City. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\n14:30 The bus back HCM.\nFree time in the afternoon until 18:00pm\n18:00: Private car pick up to train station, depart for Da Nang – Hoi An.\nOvernight on train - soft sleeper, air condition, 4 berth/cabin."},{"title":"Day 4 DA NANG &ndash; HOI AN TOWN","description":"Meal not included\n02:00 PM: Arrival Da Nang train station, transfer to Hoi An Town.\nYou are free to discover the ancient town: Japanese Bridge, lantern road, traditional tailor shop, enjoy the specialities. Besides, you can view sunset at Cua Dai beach.\nSpend overnight in Hoi An."},{"title":"Day 5 MY SON HOLLYLAND DELUXE TOUR","description":"Meal included: Breakfast, Lunch\n8.00 – 8.30: our guide pick you up at your hotel and depart to My Son holy land - the world cultural heritage. \n10.00: Arrive at My Son and we'll have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the Champa's traditional performances.\n11.30: Get back to mini van and move to a local house to learn how to make ricepaper, you will enjoy your own hand-making product later on!\n12.00: Back to  the van and have lunch at another local house. relax with cold herbal tea,  nice foods and fresh air.\n13.30:  take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of vietnam named as Thu Bon River.\n14.30: arrive at Hoi An, we will drop you at your hotel. Tour ends!\nOvernight in Hoi An"},{"title":"Day 6 HOI AN - DA NANG BY CAR THEN FLIGHT TO HA NOI","description":"Meal included: Breakfast.\nAfter breakfast, you are free until airport transfer. You take a flight to Hanoi and stay in a touristic area of Hanoi Old Quarter. \nSpend overnight in Ha Noi."},{"title":"Day 7 HA NOI - HA LONG BAY","description":"Meal included: Breakfast, Lunch, Dinner.\n(Your hotel – Tuan Chau marina – Halong bay – Lunch– Surprising Cave – Titop Island – Sunset party – Dinner – Onboard night activities)\n07.45 – 08.15 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta\n– Get your camera ready to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 approx\n– Arriving Tuan Chau marina. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is served\n– Join us for a typical local lunch in the dining room or at the outdoor dining area.\n\nAfternoon\n– Arrive at Surprising Cave (Hang Sửng Sốt), explore the cave and find out how the cave was named a Surprising.\n– Heading to Titop island area. Drop anchor in the calm water surrounded by beautiful islets. Visit Titop island for swimming and snorkeling or do the short trek to the top of island to have the overview of Halong bay from here\n– Heading back toward the sleeping area\n\nEarly evening\n– Summit on the sundeck watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset\n– An authentic Vietnamese menu is served\n– After dinner, reward yourself with a large selection of cocktails at our bar, or take for you one of our onboard activities: book reading, games, movies, and squid fishing…"},{"title":"Day 8 HA LONG - HA NOI","description":"Meal included: Breakfast, Lunch\n(Tai Chi – Breakfast – Luon Cave – Cooking Demonstration – Lunch – Farewell at your hotel)\n06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n\n07:00 – 08:00\nLocal breakfast is served\n\n08:00\n– Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n– Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n\n09:00\nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12:00\nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nArrival back at your hotel approximately 16:30 – 17:00.\nStay overnight in Ha Noi."},{"title":"Day 9 HA NOI CITY TOUR","description":"Meal included: Breakfast, Lunch\nIn the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n17:00pm Tour end "},{"title":"Day 10 HA NOI DEPARTURE / SEE YOU","description":"Meal included: Breakfast.\nYou will have breakfast at hotel. Relax time in Ha Noi until transfer to the airport for the flight back home. See you again!"}]},{"name":"Northern Vietnam Highlight","duration":7,"travelStyle":["Discovery","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":608,"summary":"From Sapa to Halong to Hanoi, Northern Vietnam is hands down the winner when it comes to crowd-pleasing destinations. Start with its capital – Hanoi with its trademark colonial architecture, a labyrinth of tree-lined avenues and narrow alleyways, the ubiquitous presence of street vendors, etc. The very heart and soul of Vietnam possesses a wealth of cultural and historical treasures spanning over a thousand years vividly etched on its every corner and waiting to be uncovered. Take an overnight train and veer off the urban centers to the dreamy, poetic Sapa Town – known for some of the most ravishing terraced landscapes and trekking trails on earth, as well as its hotpot of exotic ethnic minority cultures. Then, proceed from Sapa to Halong – characterized by thousands of limestone outcrops towering over and reflected off its emerald waters, to treat yourself to a perfect mix of indulgence and immersion in one of the New 7 Wonders of Nature.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146376_84bbba18.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146376_84bbba18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_e80097ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_36b12c61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_622c28d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_9cf685f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_746a5fd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_227b5c4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_4b55a5fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_79cfc49f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_448e27d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_5ca7e316.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_03d9bccd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_e5c1f817.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_a3df4402.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146376_1d165bf6.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Cai","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Meals: N/A –  Accommodation: Hotel in Hanoi.\nXin Chao! Welcome to Hanoi, the capital of Vietnam. On your arrival, our tour guide will transfer you to your hotel. You are free to relax at the hotel."},{"title":"Day 2: Hanoi City Tour","description":"Meals: Breakfast, Lunch – Accommodation: Overnight on the train.\nToday you have a full day to explore the capital of Vietnam. You will visit main attraction site in Hanoi like: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum, Stilt house, One Pillar Pagoda; the Presidential Palace); the Temple of Literature; the Quan Thanh Temple, Tran Quoc Pagoda & West Lake; and the most attraction museum in Hanoi is the Ethnology Museum or History Museum. Later in the afternoon enjoy a traditional Water Puppet Performance – a unique Vietnamese Art form hailing from Southeast Asia’s wet-rice culture. Transfer to the railway station for night train to Lao Cai. "},{"title":"Day 3: Hanoi – Sapa – Cat Cat Village – Sapa","description":"Day 3 Sapa- Ta Van- Giang Ta Chai- Sapa\nMeal: Breakfast- Accommodation: Hotel in Sapa\nUpon arriving at the Lao Cai Railway Station, you will be picked up and transferred to the hotel for check-in (If room available). After breakfast, you will start a lovely trekking in the spectacular landscape of Lao Chai Village, home of the Black H’mong, to have a glimpse of tribal life on the mountain. Enjoy a pleasant picnic lunch and continue your highland adventure to visit the Dzay people in Ta Van village, whose houses nestled in a beautiful valley that provides the best view of intoxicating rice terraces in Vietnam. Keep trekking through a bamboo forest; you will finally reach Giang Ta Chai village of Red Dzao tribe for a tour. Later in the day, you will head back to the Sapa Town and enjoy some free time in the Sapa Market."},{"title":"Day 4: Sapa – Lao Chai Village – Ta Van Village – bus to Hanoi","description":"Meal: Breakfast - Accommodation: Hotel in Hanoi\nAfter breakfast in Sapa, meet up our guide and driver at your hotel and transfer to Fansipan Cable Car station to begin the journey conquering Fansipan by modern cable car system. The cable car system in Sapa is the world’s longest and highest cable car, running up from sleepy Sapa Town in Lao Cai Province to the peak of 3,143-meter. Fansipan Mountain, known as Indochina’s rooftop.\nReaching Mount Fansipan used to mean a full-day hike at least. But from Feb 2016 the trek up will be reduced to a 25-minute flight by cable car. The 6.5km long cable car can carry a maximum of 2,000 passengers an hour, with each cabin accommodating 35 passengers.\nWhile traveling by cable car, you can enjoy the scenery and magnificent views to Sapa and swallow views of Muong Hoa valley, Hoang Lien National Forest as well as beautiful landscapes of Lai Chau province. After conquering the Fanipan Peak, you will also take able car to get back the foot of mountain. Then you will be transferred back to Sapa, take the shuttle bus to Hanoi. You arrive at the hotel at 10 PM. Overnight in hotel."},{"title":"Day 5: Hanoi – Halong Bay – Overnight on cruise.","description":"Meals: Breakfast, Lunch & Dinner – Accommodation: on cruise\nAfter breakfast, about 8:00 am we will pick you up at your hotel, it takes you about 4 hours to the UNESCO World Heritage Site – Halong Bay.\nEmbark on the cruise by transfer tender boat. Listen to cruise briefing and receive the room key.\nSavor a delectable lunch when the boat cruises further along the limestone islands of Ha Long Bay, heading to Centre of the World Heritage  – on the way, you will have a chance to take the most beautiful pictures and enjoy the best sightseeing from your private room or sundeck. You will pass through the magical bay, where thousands of sculpted limestone islands rise from the waves like dragons’ teeth. After lunch, you will take a short trek to a nearby summit for a panoramic view of the bay, swimming on a quiet beach or sunbathing on the sundeck. You will stay overnight onboard."},{"title":"Day 6: Halong Bay – Hanoi","description":"Meals: Breakfast, Brunch – Accommodation: hotel in Hanoi\nRising to the sound of lapping bay waters, you will have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave (8 a.m. to 9 a.m.), swim and relax at Soi Sim beach. At 9:30 a.m., your boat cruises back to the jetty while brunch is served from 10:30 a.m. to 11:30 a.m. You will continue cruising through the bay, along the way seeing more of the fascinating formations. Cabin check-out is at 11:45 am. The boat arrives at the harbor around noon and you will drive back to Hanoi."},{"title":"Day 7: Hanoi Departure","description":"Meals: Breakfast, Brunch – Accommodation: n/a\nAfter breakfast at the hotel, the guide will accompany you to the airport to catch your scheduled flight."}]},{"name":"Vietnam Highlights - 11 Days","duration":11,"travelStyle":["Discovery","Family","Custom","Group","Fully Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1071,"summary":"The best quality and unbeaten price for 11 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional\nStart in Hanoi and finish in Ho Chi Minh City\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nLearn about Vietnam history of Kings throughout Hue Imperial City\nExplore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\nTaste wonderful Vietnamese local cuisines along the trip\nDiscover 4 World Heritage Sites: Halong Bay, Hue, Hoi An and My Son Sanctuary\nChillout and shopping in Ho Chi Minh City - the biggest City in Vietnam\nAnd more...","highlights":["Be amazed by the vibrant Floating Market of the Mekong Delta","Kayak past limestones in the aquamarine waters of Halong Bay","Wander through the bustling streets of Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95474_575ec0e3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95474_575ec0e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_49d9d6f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_89584683.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_73f5a547.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_8568c7e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_8e8a7ef6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_e62fbcd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_f00e52f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_0f669790.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_bb530d2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_0b43ed66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_d418ba02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_b355c5cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_558cb34e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95474_e1a02ad5.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Hanoi arrival","description":"Today you’ll land in Hanoi. Warmly welcome by our tour guide & driver at the airport & then transfer to hotel for check in. Stay overnight at hotel in Hanoi.\n(Check in time: From 14:00)\nDistance: Noi Bai airport - Hanoi city center: 30 km (~ 45 minute drive).\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi full day city tour (B, L)","description":"After breakfast at hotel, we enjoy a full day city tour of this charming capital city including the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Stay overnight at hotel in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay (B, L, D)","description":"Breakfast at hotel.\nAround 8:00 a.m.: Depart for one of the most magnificent scenic environments in the world, Halong Bay. Halong covers 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on cruise.\nDistance: Hanoi central - Halong Bay: 180 km (~ 3.5 hour drive).\nGarden Bay Cruises or similar"},{"title":"Halong Bay - Hanoi - Hue (Brunch)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Turn back to Hanoi for the evening flight to Hue, the last capital of Vietnam feudality. On arrival, pick up & transfer to hotel for check in. Stay overnight in Hue.\nDistance: Phu Bai airport - Hue City: 18 km (~ 30 minute drive).\nCherish Hotel Hue or similar"},{"title":"Hue full day city tour (B)","description":"After breakfast at hotel, take a boat trip on the romantic Perfume River to visit the Hue’s oldest and most revered site, Thien Mu Pagoda & the mausoleum of Emperor Minh Mang.\nHave lunch at local restaurant (lunch fee is not included in the package).\nIn the afternoon, visit the Imperial Citadel, the Purple Forbidden City, the elaborate mausoleum of Emperor Tu Duc and the Dong Ba market. Stay overnight in Hue.\nCherish Hotel Hue or similar"},{"title":"Hue - Da Nang - Hoi An (B)","description":"After breakfast at hotel, drive to Hoi An town, a recognized World Heritage Site. Stop in Da Nang to visit the famous My Khe Beach and Cham Museum which contains the finest collection of Cham sculpture in the world.\nOn arrival in Hoi An, visit the 200 year-old Tan Ky house, Phuc Kien Pagoda, the Assembly Hall, the former merchants’ houses, the 400 year-old Japanese Covered Bridge and the colorful riverside market. Stay overnight in Hoi An.\nDistance: Hue - Hoi An: 130 km (~ 3 hour drive).\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - My Son Sanctuary (B)","description":"After breakfast at hotel, our guide and driver will pick you up at your hotel to transfer to My Son Sanctuary – once the capital city of Champa Kingdom (around the 4th to 12th century). My Son is a large complex of religious relics that comprises more than 70 architectural works. They include temples and towers connecting to each other with complicated red brick designs. The major structure of Cham architecture is tower, built to reflect the divinity of the king. Drive back to Hoi An at noon.\nThen free for shopping or relaxing on Cua Dai Beach. Stay overnight in Hoi An.\nDistance: Hoi An town - My Son: 50 km (~ 1 hour drive).\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - Da Nang - Ho Chi Minh City (B)","description":"Free at leisure until transfer to the airport for the flight to Ho Chi Minh City. On arrival, pick up & transfer to hotel for check in. Stay overnight in Ho Chi Minh.\nDistance: Tan Son Nhat Airport - Saigon center: 7 - 8km (~ 30 minute drive).\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City - Cu Chi Tunnels (B)","description":"After breakfast at hotel, we will visit Cu Chi tunnels - an immense network of connecting underground tunnels during American War. Back to the city for lunch. (lunch fee is not included in the package)\nAfter lunch at local restaurant, we will visit Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Our last stop is Ben Thanh market, the biggest whole sales market in Saigon. Stay overnight in Ho Chi Minh.\nDistance: Saigon – Cu Chi Tunnel: 75 km (~ 1.5 hour drive)"},{"title":"Ho Chi Minh City - Mekong Delta - Cai Be Floating Market (B)","description":"Breakfast at hotel.\n7:30 am: Depart for Cai Be, stopping to take photos in Tan An town overlooking the picturesque flat rice fields. On arrival in Cai Be, take a motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Then wander into the small villages to visit the orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy lunch of fresh river food served (lunch fee is not included in the package) in the heart of the garden accompanied by traditional southern Vietnamese folk music. Take a delightful walk through the bonsai garden. Meet the driver again in Vinh Long. Return to Ho Chi Minh City. Stay overnight in Ho Chi Minh.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City Departure (B)","description":"Free at leisure until transfer to the airport for the departure flight. Driver will take you until airport for your International Flight. Good bye and see you again!\nEnd of services."}]},{"name":"Vietnam Snapshot","duration":8,"travelStyle":["Discovery","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1615,"summary":"Spend eight days in Vietnam discovering the highlights and traditions of this colourful country. This short adventure samples the old-world charm in this pocket of Asia, with its diverse Chinese, French and colonial influences. Get lost in the districts of Hanoi, cruise past the limestone karsts of Halong Bay, discover the colonial charm of Hoi An, and navigate the winding streets and chaotic traffic of Ho Chi Minh City. Vietnam is sure to surprise, delight and excite, so discover places of eternal beauty that have also played crucial roles in history. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/101920_1e482535.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/101920_1e482535.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_c40caca5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_ff622e42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_7bf6eddc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_12534cff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_57012e30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_d87debbf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_11c748ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_59ea13c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_c7c78a88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_229a05f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_03136cae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_6f59b074.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_afe49897.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_c9bfe067.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_74fd0a8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_4e482ed4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_dba9d8ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_a12f07d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_93fd94dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_a879d539.jpg","https://cdn.tourradar.com/s3/tour/1500x800/101920_dd5c79d5.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to Hanoi. You will be met on arrival and transferred to your hotel. There will be a welcome meeting at 6 pm where you’ll meet your group leader and fellow travellers. If you can't arrange a flight that will arrive in time for this meeting, you may wish to arrive a day early so you're able to attend. We’ll be happy to book additional accommodation for you (subject to availability). Until this meeting we encourage you to head out and get your first taste of what Hanoi has to offer.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 2: Halong Bay","description":"Today, you will leave Hanoi and drive north (approximately 4 hours) to the renowned Halong Bay. You can leave your luggage behind at your hotel in Hanoi and pack an overnight bag for staying on the boat. Halong Bay is listed as a World Heritage site and is one of Vietnam’s most spectacular natural wonders. The views of sailing junks navigating past thousands of limestone islands with rocky outcrops are nothing short of spectacular. You will travel to Tuan Chau Port (Halong City West) where you will board a boat for an exploration of the bay, enjoying a seafood lunch and dinner (non-seafood also available), as well as spending a night on board. We visit Surprise Cave, and, in the warmer months, you can enjoy a swim from Ti Top Island Beach or go on an optional kayak tour. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. A night on the boat under the stars is very special, but another highlight of this evening is a delicious candlelit dinner out on deck (weather permitting). This is the perfect way to enjoy the beautiful surroundings, dining on a seafood feast.\nAccommodation: Halong Bay Boat (feature stay)"},{"title":"Day 3: Hanoi","description":"After breakfast at Halong Bay, return by bus to Hanoi (approximately 3.5 hours). Later this afternoon, you will enjoy a unique Peregrine experience when you sit down to a traditional Hat Xam performance. Hat Xam is an art form of Northern Vietnam dating back to the Tran Dynasty, and literally translates to ‘singing in darkness’. Originally, this was performed by blind performers, and was enjoyed by local working-class audiences, right up until the late 1950s, when a wave of communism deemed all art forms to be corrupting influences. Today, this style of performance occurs rarely, but you and your group will be taken to a private club house for an exclusive performance; one of the few places where such artists still perform acoustically. The performance takes around 90 minutes, and includes some story telling aspects, performances and possibly interaction with guests, so be ready to get involved!\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 4: Hoi An","description":"This morning, take a half-day tour of Hanoi with your leader. Enchanting Hanoi stands in contrast to its southern counterpart in Ho Chi Minh City – it is relaxed rather than frantic, and full of lakes and parks to escape to. The tour will take in the major sites, including the Temple of Literature, One Pillar Pagoda, and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. The tour will also include lunch at the KOTO café, an amazing project aimed at providing vocational training and experience in the hospitality industry for disadvantaged young people. In the afternoon, you will leave Hanoi and fly south to Danang (approximately 1 hour). You will have the chance to enjoy some spectacular scenery on the drive to Hoi An (approximately 1 hour). Arrive in Hoi An late this afternoon and check into your accommodation.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 5: Hoi An","description":"This morning you will take a tour of the unique town of Hoi An, influenced over the years by myriad traders from various cultures. Originally a busy Cham Port, the town also has Chinese influences scattered about, with pagodas and assembly halls found down the streets. For a small town it has a liveliness alongside its charm and serenity. The tour will take you down the streets of low tiled buildings, taking in a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. There is some free time this afternoon to further explore the Old Town or surrounds at your own pace.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 6: Ho Chi Minh City","description":"The morning is free for you to enjoy more of delightful Hoi An and the surrounding area. Perhaps browse the market for silk and other materials or collect any garments that you might have had crafted by the efficient tailors or hire a bicycle and ride along the lanes and out to a nice nearby beach. In the afternoon, transfer back to Danang and fly to Ho Chi Minh City. Check into your hotel and enjoy a free evening – perhaps spent exploring the bustling food stalls at Cho Ben Thanh market. Delicious!\nAccommodation: M Boutique Hotel (formerly the Millennium Boutique Hotel)  or similar"},{"title":"Day 7: Ho Chi Minh City","description":"This morning, head out of the city to the nearby Cu Chi Tunnels. Cu Chi is the name of the district that covers the extensive network (approximately 200 kilometres) of underground tunnels dug by the Viet Minh and later expanded by the Viet Cong. The tunnels contained hospitals, accommodation and schools, and were used for refuge, storage and as a military base for the Viet Cong close to Ho Chi Minh City. A section of them has been widened to allow visitors to enter and get a feel for what the life underground must have been like. Please note that these tunnels will be hot, sweaty, and claustrophobic for some, and so, you can choose to participate in the tunnel walk or continue to explore the complex from above. Afterwards, return to Ho Chi Minh City for a tour of the city, where daily life plays out on the streets and the dynamic atmosphere is a fascinating blend of old and new. Your leader will take you to the Reunification Palace, formally the Presidential Palace and the site of South Vietnam’s surrender in 1975, before visiting the War Remnants Museum. In the evening, perhaps spend some time with your fellow travellers and have dinner at a local restaurant. Your leader will know of some great options.\nAccommodation: M Boutique Hotel (formerly the Millennium Boutique Hotel) or similar"},{"title":"Day 8: Ho Chi Minh City","description":"As there are no activities planned after breakfast, you are able to leave the accommodation at any time. If you wish to spend some more time in Ho Chi Minh city, we would be happy to organise additional accommodation for you (subject to availability)."}]}]