[{"name":"Full Moon Festival, Hoi An - 10 days","duration":10,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Discovery"],"oldPrice":0,"price":2105,"summary":"Vietnam’s Full Moon Festival is as fascinating as it is beautiful. Join us to celebrate the Full Moon Festival in the charming riverside town of Hoi An, where thousands of locals release beautiful lanterns into the night sky or onto a river filled with their hopes and wishes for the future. There is also tasty Mooncakes to be eaten too!","highlights":["Learn about the Vietnam’s Full Moon Festival","Explore Halong Bay","Visit the Thien Mu Pagoda in Hue","Take a boat trip on Mekong Delta","Enjoy the sights of Saigon"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/75898_46d5fd2a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/75898_46d5fd2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_9c436f94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_e41587fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_45f4687e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_89c8010c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_46ee2d3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_a61e7a86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_2fab1340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_32fbc736.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_309bab6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_2d5a1da8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_586a4c24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_4c6327ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_6b7fe194.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_943c9eb4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_104332d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_3f5c7241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_b9e53553.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_6edbfec6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_40af09a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/75898_4ae9a9c7.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Vinh Long","Can Tho","Cai Rang"],"timeline":[{"title":"Day 1: Hanoi","description":"Friday 25th September 2020. Welcome to Hanoi, perhaps the most graceful, atmospheric and exotic capital city in Asia. Airport to hotel arrival transfer. This morning offers free time for you to explore the wide tree lined avenues, beautiful lakes and ancient pagoda’s and thriving old city. Meeting our guide at 2pm we set of on foot to explore Hanoi’s charming Old Quarter known as the ‘36 streets of the old Hanoi’. There is Silver Street, Silk Street, Comb Street, Paper Street and importantly Hang Ma street where we’ll browse and learn about the history and traditions of Vietnam’s Full Moon Festival. There may even be deliciously sweet traditional Mooncakes to be shared. "},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay. After breakfast this morning we leave Hanoi and transfer to the crown in Vietnam's scenic crown - the incredibly beautiful Halong Bay. We'll explore the jade waters studded with karst islands aboard a traditional wooden junk boat and after embarkation there's time for lunch soaking up the views. This afternoon we will visit the spectacular Tien Ong Cave which was opened to the public in 2010, with its stunning stalagmites and stalactites. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner. "},{"title":"Day 3: Halong Bay","description":"Halong Bay - Hanoi - Hue. Early birds can start the day with a relaxing Tai Chi class on the sundeck or a traditional massage - the perfect way to start the day. Before heading back to port we'll explore by kayak the Floating Village of Cua Van, which is home to generations of fishing families. Here we’ll see the traditional and colourful floating wooden houses and the locals going about their daily lives. On arrival back into Hanoi mid-afternoon we’ll explore the maze of streets in the French Quarter on our very only cyclo (rickshaws), taking in highlights such as the Opera house and Ly Thai To park. We then swap our wheels for a leisurely walk through ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street from silk tailors to traditional medicine shops. Later this evening there's a chance to freshen up before boarding the train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available. "},{"title":"Day 4: Hue","description":"Upon arrival to Hue we embark on a guided sightseeing tour of the 19th-century Nguyen empire capital. We visit the Thien Mu Pagoda, home to the oldest monastery in the city, whose 21m high tower has become something of a symbol for Hue and the citadel. Within the citadel is the Imperial Purple Palace, an exact copy of the Forbidden City in Beijing, with its impressive ramparts, formal moats and imperial palaces, some of which lay in ruin. In the countryside lies the Royal Tombs of the Nguyen kings, here we’ll view the elaborate mausoleum of Emperor Tu Duc. As the sun sets there's an optional cruise in a long boat along the gentle Perfume River, beautifully illuminated at night."},{"title":"Day 5: Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. Today we take the scenic Hai Van Pass (Road of the Ocean Clouds), which offers magnificent views of beaches to one side and lush hills to the other. En route we stop for a walk along China beach, featured in Francis Ford Coppola’s movie ‘Apocalypse Now’. Perhaps enjoy a refreshing swim in the sea before continuing our journey south along the coast to Hoi An. The charming, old-world trading port of Hoi An with it cobbled streets, traditional homes and tiny shop houses is a perfect place to lose yourself in a by gone era. Boutique restaurants, hip cafes along the waterfront, delightful craft shops and artisans including some of Asia’s best bespoke tailors (whose services come at a nominal price), all can be found here. On a short walking tour of the enchanting historical town, we’ll visit the Chua Ong Pagoda, Chinese Assembly Hall, 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. During your stay in Hoi An, we offer a unique optional Hoi An Street Eats add-on, which explores the city’s most popular local haunts. Cruise the city the way the locals do, by vintage Vespa and enjoy lots of tasty Vietnamese Cuisine. Book early with your reservation consultant, as numbers are limited."},{"title":"Day 6: Hoi An","description":"Today marks the height of the Full Moon Festival and we will be celebrating with the locals. This morning we ride by rickshaw to a local home on the outskirts of Hoi An where we will learn about the family’s long tradition of lantern-making and handcraft our own lanterns for tonight’s festivities. Heading into town we explore the local market stalls and authentic lantern shops before free time to visit one of the many great tailor shops, take a row boat down the river or spend the afternoon relaxing by the hotel swimming pool. Tonight we make our way to the water's edge with hundreds of locals to release our lanterns and enjoy the spellbinding spectacle of hundreds of sparkling lights sailing down river and lighting up the night sky."},{"title":"Day 7: Hoi An","description":"A leisurely bicycle ride into the countryside, leads us to Tra Que village this morning. Here we discover age old farming practices and learn about traditional medicine. It’s a fun hands on experience today as we don conical hats and test our farming skills in the fields. Then we watch an entertaining cooking demonstration and help to cook up a tasty lunch."},{"title":"Day 8: Can Tho","description":"Hoi An - Ho Chi Minh City - Can Tho. Early morning flight to Ho Chi Minh City. Drive to the Mekong Delta. Often referred to as the ‘rice bowl’ of Vietnam, the fertile Mekong Delta is famous for its abundant harvests of tropical fruits, flowers and rice, as well as it fantastic views while boating along the canals. Taking our sampan from Cai Be we cruise through the maze of waterways watching the hubbub of daily life on the river. Passing colourful trading boats, house boats and children swimming we stop to visit some of the local cottage industries that produce popcorn, coco candies and paper along the way. Lunch is served today in a traditional wooden home on Dong Hoa Hiep Island."},{"title":"Day 9: Ho Chi Minh City","description":"Can Tho - Hoi An - Ho Chi Minh City. Early today we visit the ever lively Cai Rang floating market. Watch as melons, pineapples, fresh greens, sacks of rice and children's toys get tossed from one sampan to another at great heights and speed before driving back to Ho Chi Minh City. Once called the Pearl of the Orient, modern Ho Chi Minh City is a thriving metropolis on the move. Sleek sky scrapers, gourmet restaurants, designer malls and swanky bars and spas are scattered between ancient pagodas, colonial era landmarks and lively street markets. On our walking tour of the city we see the Notre Dame Cathedral and the Old Post Office before visiting the sobering War Remnants Museum. Evening at leisure."},{"title":"Day 10: Ho Chi Minh City","description":"Sunday 4th October 2020. Today offers free time in Ho Chi Minh City till your departure transfer to the airport. Opt for a relaxing foot massage, shop for souvenirs at Ben Thanh Market or visit the grand Independence Palace, with its secret bunker and military command centre beneath! You could also extend your stay and join us on a day trip to the Cu Chi Tunnels Here you can go underground to explore the vast network of tunnels and hideouts used by Viet Cong guerrilla fighters, see booby traps, trap doors or test your skill with an AK 47 at the firing range."}]},{"name":"Highlights of Vietnam - Private Tour","duration":10,"travelStyle":["Discovery","Boat","Private","Fully Guided","Historical","Holiday"],"oldPrice":0,"price":1820,"summary":"In just 10 days, this private tour encompasses the very best that Vietnam has to offer. Using a range of handpicked hotels, you will experience lush landscapes, discover harrowing history and sample incredible fresh food.   Halong Bay - Cruise around the island cliffs on a traditional junk boat Hoi An - Take a cookery course or try out traditional lantern making. Saigon - Learn about the resourcefulness of the Viet Cong at the Cu Chi Tunnels, visit an underground weapons bunker and explore old Saigon's bustling back alleys ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/202133_559ee2d4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/202133_559ee2d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_5f18f58216d59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_5f18f58216d5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_2b1fb7fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_dc371edf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_ec2f512f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_3ff0c716.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_8e373963.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_9ae07e97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_6df26b28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_971a6c4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_665b813c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_30550261.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_1537d78d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_ebfed614.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202133_8249e2db.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: Trip begins in Ho Chi Minh City","description":"Still commonly referred to by locals as 'Saigon', the city is the largest in Vietnam and the country's commercial hub. You will find an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit.\n \n You will be met on arrival at Tan Son Nhat International Airport (SGN) by a local guide, and driven to your centrally-located hotel, approximately a 30 to 40 minute journey. There are no activities planned today, so feel free to arrive in Ho Chi Minh City at any time. For those booking their own flights, you will just need to let us know your flight details no later than three weeks prior to departure, in order to be met on arrival. \n \n Many museums in Vietnam are closed on Mondays, so we advise you to take that into account when booking, if there is something that you particularly want to visit."},{"title":"Day 2: Visit to the Cu Chi Tunnels; afternoon walk in Old Saigon","description":"No visit to Ho Chi Minh City would be complete without exploring something of its tragic recent history, and the poignant reminders of what the Vietnamese refer to as the American War can still be seen amongst many of the buildings in the city. You'll explore something of this today. Take a short drive with your local guide out to the infamous Cu Chi Tunnels in the morning. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops and were a major part of the Tet Offensive. This area was the centre of intense fighting during the war, much of it falling prey to the incessant carpet bombing, napalm and defoliants utilised by the Americans in an attempt to dislodge the Viet Cong from their underground shelters. There is little evidence of any of that now and the landscape has returned to something of its pre-war beauty, but exploring the tunnels of Ben Dinh and Ben Binh gives some idea as to the conditions that the Vietnamese and their American adversaries had to endure. Be warned, the tunnels are low and narrow and can be claustrophobic. \n \n In the afternoon, walk around the central sights of Ho Chi Minh City with a local guide, taking in the Notre Dame Cathedral and the GPO building as well as some of the old Colonial hotels such as The Rex. Drive to the Independence Palace (renamed the Reunification Hall) and the graphic War Remnants Museum, where you will learn about the Vietnam War from a very different view point to that of Hollywood."},{"title":"Day 3: Morning flight to Danang, drive to Hoi An and afternoon tour of the Old Town","description":"Transfer to the airport for a short flight to Danang in Central Vietnam, meeting a local guide on arrival to continue the journey by car to Hoi An. Given the early hour of arrival at the hotel you might not be able to check-in, so the plan is to store bags and then embark on a walking tour of Hoi An. First colonized by the Portuguese in the 16th century, by the 17th and 18th centuries Hoi An had become one of the busiest international trading posts in southeast Asia and, even today, it still retains the engaging charm of a medieval port, with many of its old buildings superbly preserved. Highlights include the Phuc Kien Assembly Hall, a pagoda dedicated to the worship of Buddha originally built by the Vietnamese people in the 16th century and the 400 year old Japanese covered bridge. End at the colourful riverside market, which is a perfect setting for you to continue exploring solo."},{"title":"Day 4: In Hoi An, free day to enjoy the Old Town, visit nearby beach or hire bicycles to explore surrounding countryside","description":"Today is free to wander through the historic heart of this World Heritage Site at your leisure. An early morning visit to the fish market presents a riot of noise and colour that is perfect for some great photo opportunities and some choice local interaction. You might also like to pay a visit to the Japanese Bridge, Hoi An's emblematic symbol, believed to have been constructed to quell the violent rumblings of a restless monster, or perhaps explore the traditional wooden houses and Chinese temples that line the streets. There are numerous tailors shops in Hoi An providing an incredibly cheap and quick service and almost all visitors have at least one item made before they depart. Hoi An is also a great place to hire a bicycle as the roads are relatively quiet. There's a good beach just a few kilometres from the town or alternatively why not set out to explore nearby villages. Cooking classes are yet another option available in this popular traveller's hangout."},{"title":"Day 5: Drive along the coast via Hai Van Pass to Hue; free afternoon","description":"Head along the coastal road towards the historic setting of Hué, crossing part of the Truong Son Mountains and travelling via the Hai Van (Sea Cloud) Pass. This stunningly scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and the journey should get you into the old imperial city around lunchtime, after which the rest of the day is free for personal exploration. Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hué is divided by the waters of the Perfume River, which separate the city's 19th century citadel from the suburbs that radiate from the eastern shore and, even today, its easy air of leisurely ambience makes it one of the most engaging cities in the country to explore."},{"title":"Day 6: In Hue, cruise along Perfume River; Afternoon flight to Hanoi.","description":"Take a morning tour with your guide today. Cruise along the Perfumed River, paying a visit to the iconic Thien Mu Pagoda, home to the oldest monastery in the city whose 21m high tower has become something of a symbol for Hué. Dedicated to the Manushi- Buddha, the existing temple was constructed in the middle years of the 19th century, under the auspices of the Emperor Thieu Tri, and within its confines you can find a number of superb Buddhist statues, as well as an enormous cast bell that weighs in at over 2000kg and is reputed to be audible over 10km away. Farther afield, amongst the forested landscapes of the Perfume Valley, you can find the Royal Tombs of the Nguyen kings, and visit the mausoleum of Emperor Tu Duc. \n \n Later this afternoon, drive to the airport and fly to Hanoi, Vietnam's vibrant and historic capital.  You'll be met by a guide and transferred to your hotel."},{"title":"Day 7: Morning free in Hanoi. Afternoon drive to Halong Bay.","description":"Vietnam's capital is famous for its rich culture, bustling life and colonial influences on their centuries-old architecture.  Little lakes dotted around the city are encased by busy streets and secret alleyways, which are waiting to be explored. With the morning free to explore, visit the Ethnology Museum or Ho Chi Minh's Mausoleum and museum (closed on Mondays). The city showcases superb French architecture from its colonial days, with large tree-lined boulevards and low-built mansions and houses. Your local guide will provide you with a map of the Old Quarter should you wish to walk through the narrow lanes of this fascinating district, where the streets are named after various crafts or specialties: Paper Street, Silk Street, Basket Street and so on. The shops themselves have very narrow frontages but are actually quite deep; they are known locally as tube shops. On the pavements food sellers sell noodles, snacks and stir-fries from shoulder panniers, all adding to the charm of this historic quarter of the city.\n \n In the afternoon, transfer by road towards the Bay of Tonkin on Vietnam's northeast coast. Your destination is the breathtaking setting of Halong Bay, one of Vietnam's, and indeed Southeast Asia's, most spectacular natural attractions, whose staggering beauty has seen it listed as one of the eight natural wonders of the world. A UNESCO World Heritage site, Halong Bay presents a quite extraordinary vista of hundreds of limestone islands (over 1600 at last count) that rise from the jade green waters of the bay like the scales of some great submerged dragon. Indeed Halong means 'where the dragon descends to the sea' and local legends tells of a time when this rugged landscape was created by the pounding tail of a mighty dragon as he ran from the mountains into the glittering waters of the bay below."},{"title":"Day 8: Cruise through the turquoise waters aboard a traditional junk boat; Return to Hanoi","description":"This morning, board a junk and set sail, threading your way through a flotilla of boats, junks and wooden sampans as they ply their way across the gentle waters of the bay. The plan for today is to sail through this stunning seascape, stopping off to swim and visit some of the limestone caverns that pepper the landscape, as well as enjoying a traditional seafood lunch. Disembark in the late afternoon and drive back to Hanoi."},{"title":"Day 9: In Hanoi; free day with option to visit the French Quarter or Hoan Kiem Lake","description":"Architecturally styled like a French provincial town, with tree-lined boulevards and substantial low-built houses, Hanoi is a wonderfully nostalgic city to enjoy and amongst its more interesting sights are the charming One-Pillar Pagoda, the Temple of Literature and the Presidential Palace. Ho Chi Minh was a spartan-living and scholarly man, who chose not to live in the Presidential Palace itself, but instead preferred a simple teak 2-storied stilt-house specially built for him in the grounds. You can visit his museum and this austere mausoleum, said to resemble that of Lenin in Moscow, or perhaps taking another walk through the engaging streets of its Old Quarter. The city's French Quarter is a great place to explore by bicycle, its grandiose colonial architecture offering up a rich contrast to the more frenetic pace of the old city, whilst those looking to discover something more of the colonial wars might like to pay a visit to the Museum of Vietnamese Revolution or the Military History Museum."},{"title":"Day 10: Trip ends in Hanoi","description":"Your trip ends today, and you will be taken to the airport to meet your international flight. There are no activities planned today, so you are free to depart from Noi Bai International Airport (HAN) at any time. If your flight is departing later in the day, luggage storage facilities are available at the hotel. \n \n If you have time, you may wish to take another wander through the fascinating Old Quarter or stroll along the shore of Hoan Kiem Lake."}]},{"name":"6-Day Best of Northern Vietnam: Hanoi - Ninh Binh - Halong Bay","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":600,"summary":"6-Day Best of Northern Vietnam: Hanoi - Ninh Binh - Halong Bay\nOverview:\nDiscover 6-day Best of Northern Vietnam where ancient history and stunning landscapes collide. Travel from the modern capital to the first capital city, Hoa Lu and admire ancient relics. Explore the limestone karsts and rice paddies of ‘Halong on Land’ before boarding a boat to cruise the real Halong Bay. This trip offers great value as it introduces the region’s main sights, providing plenty of flexibility so you can experience an adventure you'll never forget.\nHighlights:\nCast away on a traditional junk boat and set sail through hundreds of limestone karsts that rise dramatically from the emerald waters of Halong Bay\nGet a glimpse of countryside in Vietnam, enjoy the peace with endless rice paddy fields and fresh air","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/162923_ccc6f37b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/162923_ccc6f37b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162923_15e054a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162923_ee71b4d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162923_f5256fc1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162923_d41c60fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/162923_e876f8a8.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi arrival","description":"Upon arrival at Noi Bai Airport, pick you up and transfer to Hanoi center. Check in hotel and then free time at your leisure. Overnight at hotel in Hanoi.\n\nMeals: N/A\nAccommodation: 3-star hotel in Hanoi"},{"title":"Day 2: Full day hanoi city Tour","description":"This full day tour takes you around Hanoi’s most interesting sights. Firstly, you will visit Ho Chi Minh Complex including Ho Chi Minh Mausoleum, House-on-Stilts, the Presidential Palace, One Pillar Pagoda. After that we explore the Temple of Literature – the first university in Vietnam. Have lunch at a local Restaurant with traditional Vietnam cuisines.\n\nAfter lunch time, Visit the Ethnology Museum – an interesting museum offers informative and well-documented display about 54 ethnic groups in Vietnam.\n\nReturn to city center, continue to discover Hoan Kiem Lake and Ngoc Son temple, listen to a special legend story about Hoan Kiem Lake.\n\nEnding trip with a Warter Puppet show. Go back to hotel. Free time for dinner and overnight at hotel\n\nMeals: Breakfast, Lunch\nAccommodation: 3-star hotel in Hanoi"},{"title":"Day 3: Hanoi - Ninh Binh - Hanoi","description":"Just a couple hours’ drive outside of Hanoi and the tour heads deep into Vietnam’s picturesque countryside. Discover Hoa Lu, the ancient capital of Vietnam during the Dinh and Le dynasties, before taking a sampan trip down the Tam Coc River. Also called the ‘Halong Bay on Land,’ this region is famous for its charming grottoes and limestone karst mountains.\n\nDepart from the hotel around 08:00 for the 2-hour drive through rural northern Vietnam. Stop off at Hoa Lu, where there are temples dedicated to Emperor Dinh Tien Hoang of the Dinh Dynasty (968-80) and Emperor Le Dai Hanh of the Le Dynasty (980-1009).\n\nIf time permits after visiting Hoa Lu, take a half-hour walk up one of the surrounding limestone karst hills; a difficult but highly rewarding climb with spectacular views. (A moderate level of physical fitness is required.)\n\nContinue on for Tam Coc Town where a Vietnamese-style lunch will be waiting; there will be ample opportunity to stop for photographs of the villages and landscapes along the way.\n\nFor those feeling adventurous, climb up to the 15th century Bich Dong Pagoda on nearby Ngu Nhac Mountain, comprising three structures: Ha, Trung, and Thuong Pagodas (in ascending order).\n\nThen get on bus and our driver will take you back to Hanoi.\n\nMeals: Breakfast, Lunch\nAccommodation: 3-star hotel in Hanoi"},{"title":"Day 4: Hanoi - Halong Bay","description":"After breakfast, depart the capital for the drive to Halong Bay. Arrive to Halong City’s jetty (around noon) and proceed with check-in formalities. After a welcome onboard, lunch will be served while cruising towards the bay. In the afternoon, enjoy some sightseeing, on-board activities (depending on each boat’s itinerary) or just spend some time relaxing on the vessel. Towards the end of the day the boat sets anchor for the night among the karst formations. Dinner is served on board.\n\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Midrange cruise in Halong Bay\nOur tour guide will not accompany aboard the cruise in Halong Bay. Resident English speaking guide on board available."},{"title":"Day 5: Halong Bay - Hanoi","description":"Early risers can enjoy a memorable sunrise over the karst formations of Halong Bay. Breakfast will be served shortly thereafter.\n\nEnjoy breakfast (brunch on some boats) while the vessels cruises slowly through the magnificent rock formations back towards port. Arriving at the harbor, you will be picked up for transferring back to Hanoi.\n\nDrop off at your hotel. Free evening and overnight at hotel.\n\nMeals: Breakfast, Brunch\nAccommodation: 3-star hotel in Hanoi"},{"title":"Day 6: Hanoi deparrture","description":"Our tour guide and driver take you to Hanoi airport – Say goodbye to Hanoi. End 6-Day Best of Northern Vietnam Tour.\n\nMeals: Breakfast\nAccommodation: N/A"}]},{"name":"Vietnamese Artist Experience","duration":12,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1630,"summary":"\"There is no better way to begin to know a country than by exploring its unique art forms. Whether it is a lovely inlaid lacquer piece or a exquisite hand embroidered painting, you’re sure to be delighted by the art of Vietnam.\n\nOnce a lesser-known nation, Vietnam has grown to become an increasingly popular choice for international travellers keen to soak up the sights and sounds of the Far East. It is not difficult to see why they are attracted to Vietnam. Along with the experience and knowledge that they desire first hand, this small country is blessed with some of the most spectacular scenery in South East Asia. Any fan of art, crafts or ancient traditions need look no further than the art of Vietnam for inspiration and awe inspiring works.\"\t\t\t\t\t\t\t\t\t\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150510_d30e59b1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150510_d30e59b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_b5b112f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_24f8e8c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_9bc6e10c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_80d2e6a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_176b2a99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_5e73344f95b73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_5e73344f95b76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_5e73344f95b79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_5e73344f95b7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150510_5e73344f95b7e.jpg"],"destinations":["Hanoi","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Hanoi Arrival (-/-/D)","description":"Xin chao! Welcome to Hanoi, Vietnam. Hanoi, one of Asia’s most enchanting cities, full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted in Noi Bai airport by your guide and driver for your transfer to the hotel. \nEnjoy dinner at either the famous Bun Cha restaurant where Obama visited or a warm home hosted dinner with typical Hanoian cuisine. Briefing at the hotel lobby or at the local family house after dinner.\nOvernight in Hanoi.\n"},{"title":"Art & Culture of Hanoi (B/L/-)","description":"We will start our journey in Vietnam with the Temple of Literature, dedicated to Confucius was built in the 11th century. It was the first university in Vietnam and students still come here to burn incense. You will find a peaceful atmosphere tinged with incense smoke, and sunken lotus ponds populated by fish and turtles. You will have the opportunity here to peacefully sit for 30-min as you capture the beauty of the Temple of Literature by sketching this monument and its surroundings in charcoal. Stroll along the pavements of Hanoi to the Vietnam Museum of Fine Arts. Its solid Introduction to the Vietnamese art world, this museum has 2 sections: one displays the decorative arts and sculptures, carvings of the Vietnamese in the past; the other displays the Vietnamese lacquer ware and paintings, sculptures in late modern period. \nLunch is at a non-profit training restaurant where disadvantaged youths are given on the job training for future careers and following, we head to the Vietnam Art Gallery to have an inside look of Vietnam art movement in Hanoi. The gallery was founded by Ms. Suzanne Lecht who has lived and worked in Asia since 1982, with a lifelong commitment to working in the arts worldwide, she is recognized as a leading authority on contemporary art in Vietnam and dedicated to discovering exceptional artists who are singular and passionate in their expression. Spend some time here discussing the various artists and their works with the knowledgeable Ms. Suzanne Lecht (please note: meeting with Ms. Lecht needs to be pre-arranged and is at an additional charge). Bid farewell to Vietnam Art Gallery and take the urban trail to a very special district. It suddenly feels like stepping back in time, into the 1960’s when Hanoi was a quaint capital populated mostly by modest workers. Take some time to enjoy wandering around this fascinating district. The last stop for the day allows you to have \"bia hoi\" while you can witness the daily life of the passing locals. We return to the hotel in the late afternoon.\nOvernight in Hanoi.\n"},{"title":"Roots of Vietnamese Art (B/L/-)","description":"Dive with us into the fantasy world of Vietnamese water puppetry. This art originated from the Red River Delta and has developed through the ages. What many people see as a simple 1-hour representation is actually one of the richest and most iconic arts in Vietnam. Today, we have pulled some strings to open for you the doors leading behind the scene. We travel to one of the villages where everything started. A place where water puppetry is deeply rooted and where locals have been preserving the art in its traditional form. Meet the artisans who make the puppets out of wood, as well as the puppeteers who give them life. Attend a private show and enjoy lunch with the troupe.\nThis afternoon, we will continue our journey to seek the roots of Vietnamese art pieces. Our first destination of today is But Thap Pagoda, built under King Tran Thanh Tong (1258-1278). The pagoda is famous for its masterpieces of Vietnam traditional architecture, woodcarvings, amazing stone tower and all above of that is the unique Guan Yin statue with a thousand arms and eyes. At this pagoda, you will also learn about the influence of Buddhism in Vietnamese religious life. Go a bit further to the East to reach Dong Ho Village is famous for its long-preserved art of woodcut painting. Dong Ho folk painting uses woodcut prints depicting the daily activities and religious practices of farmers in the Red River Delta. Meet Mr. Nguyen Dang Che, one of the few remaining artisans specializing in Dong Ho folk painting and his studio to learn more about the procedures of carving and printing these paintings, and learn about the local folk tales represented in the paintings. \nOvernight in Hanoi.\n\n"},{"title":"Hanoi - Lacquer Art - fly to Hue (B/L/-)","description":"Wake up early today and enjoy a hearty bowl of Pho for breakfast on the street before strolling around Hoan Kiem Lake. You may want to bring your charcoal & paper with you to capture the landscape of the lake or a moment of the Hanoi morning. After that is time to discover the special Vietnamese lacquer technique. Meet an enthusiastic lacquer artist in a small studio with hundreds of lacquer paintings; you'll hear a short introduction of Vietnam lacquer art history. He will help you to distinguish Vietnamese lacquer from that of China & Japan, and clearly demonstrate the 3-step process of lacquer painting. Using the lacquer techniques, you have just learnt, you can try your hand at creating a lacquer painting (size 30cmx30cm), from drawing and painting to adding materials like seashell, mother of pearl, eggshell, gold leaf or silver dust. It’s a fantastic hands-on experience for your creative side. This workshop will last the whole day and once the artist has finished with the final touches of grinding and polishing, your artwork will be delivered back to you in Hanoi.\nDepart Hanoi around 4pm for your evening flight to Hue.\nOvernight in Hue.\n"},{"title":"Hue Heritage and People (B/L/-)","description":"Hue was Vietnam’s last feudal capital, and today is your insider day trip to the Hue Imperial Citadel, the best-preserved remnant of a vast citadel and royal quarters that once existed on the site. Here you can see the ravages of time and war on what was the carefully designed capital of the Nguyen Dynasty. Built in the early 19th century by armies of conscripted labourers under Emperor Gia Long, the citadel was surrounded by a ten kilometer moat, and earthen walls formed the outer perimeter. We exit the citadel and move on to the boat pier to visit a local garden house where your host will welcome you with hand-made ginger jam and tea before enjoying some traditional dishes of Hue; you can even join in setting up the home meal if you wish. After a delicious home hosted lunch, you then veer off the common path and go for an easy cycling ride around the village to explore the daily local life in the peaceful countryside. Next spot is Tu Duc Tomb, a sprawling compound cantered on a lake and several\nwaterways, and including numerous separate memorials connected by pleasant walkways.\nHead back to the city to Dong Ba Market to take photos of Hue’s daily life.\nOptional Service: During this full day excursion, you will be accompanied by a local photographer (or the experience photographer – Etienne Bossot, subject to his availability) who will guide you through the best photographic approaches of capturing this ancient town, its people and the traditional foods.\nOvernight in Hue. \n"},{"title":"Mordern Art of Hue (B/-/-)","description":"Today we will reach out for art pieces and significant artists of Hue in modern period and modern times. We start with Le Ba Dang Art Centre. Le Ba Dang was an artist best known for his densely textured mixed-media paintings of moulded pasteboard, limestone, and pigment on burlap or canvas surfaces. He perfectly fused the cultural influence of Europe and the Orient in his poetic visions articulated in watercolour, sculpture and lithography. Continue walking along the Perfume River to Diem Phung Thi Art Museum. Diem Phung Thi was a world class sculptress who was famous for creating her own 7 modules in sculpture. She had her first exhibition at age of 46 years and almost instantly soared to fame in France in 1966. Moving to the famous Truc Chi Art centre. \"Truc Chi\" is the art of making objects from imprinted bamboo paper. This contemporary art combines the tradition of paper manufacturing with new techniques and creative processes. You will have the opportunity to learn about the process of formation and development of Truc Chi, and admire this creative new expression of Vietnamese culture. You will now have the opportunity to pick up the \"water pen\" and create your own masterpiece from bamboo paper, or a picture frame (20cm x 40cm) from raw materials. By the end of the day you will have a series of our own creative artworks (20cm x 40cm or 30cm x 40cm) to take home with you to remember this wonderful artistic tradition.\nOvernight in Hue.\n"},{"title":"Hue - Hoi An (B/-/-)","description":"Today you continue by road south to Hoi An. The scenery is remarkable, as the route hugs the coastline of the East Sea before winding up the spectacular Hai Van Pass. Here you can stop to admire the stunning views: north over Lang Co Beach and south over Da Nang. The Museum of Cham Sculpture features extensive and diverse displays of Hindu-influenced Cham sculpture dating from the 7th to the 15th centuries. Designed in 1915 by two French architects, Delaval and Auclair, your visit here will introduce you to the most common features of Cham towers and temples from throughout the region. Then continue driving along My Khe Beach to Hoi An.\nOvernight in Hoi An\n"},{"title":"Orientation Walk of Hoi An town (B/L/-)","description":"We start our walk across the enchanting ancient town of Hoi An. Follow your guide as you meander your way through the beautiful streets and narrow alleys, which are bordered by ancient yellow-walled houses. We reach a market where you can spend some time exploring the colourful stalls and the variety of foods and souvenirs on offer. Try some local delicacies before we venture further into the town. The guide will show you various places of interest and will also arrange some spontaneous food tastings as we walk. Food, drinks and culinary legends are all on the menu today.Later in the afternoon, we will visit the home of Mr. Huynh Van Trung, descendant of a family which has been making lanterns for generations. After a brief introduction to the history, shape, and colour of the lanterns, as well as the many stages of making them, you will make your own lantern. Discover your inner skill and keep your handiwork as a souvenir of beautiful Hoi An.\nOvernight in Hoi An\n"},{"title":"Leisure in Hoi An (B/-/-)","description":"A full day at leisure to enjoy some shopping in Hoi An town or to go to the beach. We recommend An Bang beach, located about 4-kilometres North of Hoi An. If you want to try some typical local food, here are some helpful hints: street food addicts, we highly recommend you to get a Banh Mi sandwich at Madam Khanh’s stall (115 Tran Cao Van street), a legendary Cao Lau soup or a plate of crispy Hoanh Thanh. If you crave seafood, look for the little Huyen Tran Cong Chua street that goes along the River to the East of the Old Quarter; grab a seat at Song Thu restaurant and ask them to hand you a menu with prices on it.\nOvernight in Hoi An\n"},{"title":"Hoi An - Danang - fly to Ho Chi Minh City - Poetic Trail of Ho Chi Minh city (B/-/-)","description":"This morning is at leisure until we take the flight to Ho Chi Minh City. The very first place to visit is Ho Chi Minh Fine Arts Museum; it is the major art museum in the South of Vietnam. The museum itself was the private residence of Hua Bon Hoa - one of the wealthiest in Saigon in early 20th Century. The museum is indispensable for those who are keen on Vietnam arts and culture with its abundant collections.\nToday, we will take a trip to visit some galleries, studios to be inspired the latest trend of art in Saigon. This evening you will have the option to continue discovering this vibrant city (its nightlife and street food) from the back of a Vespa scooter (at additional charge) or enjoy leisurely sun downers from a local rooftop bar.\nOvernight in Saigon.\n"},{"title":"Creation and celebration (B/L/D)","description":"With a brush in one hand or whatever medium you choose and a glass of wine in the other, facing the canvas and releasing your imagination and letting your inspiration flow to create an art piece of your Vietnam experience. This is a full day of fun artistic classes for all - no matter your painting level. This evening we will enjoy a final cocktail party at a local studio. Here we can share our memories with each other and mingle and network with some local artists.\nOvernight in Saigon.\n"},{"title":"Saigon Departure (B/-/-)","description":"The day is free at your leisure until transfer to Tan Son Nhat International Airport for your departure flight. We wish you a pleasant flight!"}]},{"name":"North Vietnam bird watching tour 6 days/ 5 nights","duration":6,"travelStyle":["Wildlife","Group","Partially Guided","Holiday"],"oldPrice":0,"price":245,"summary":"Hanoi - Cuc Phuong - Van Long - Trang An - Thung Nham - Xuan Thuy - Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/30391_677e32e3.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/30391_677e32e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_9291100f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_22c1b600.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_f57561b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_6909ff68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_2bf1d6db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_2e56f66f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/30391_77b0d876.jpg"],"destinations":["Hanoi","Ninh Binh"],"timeline":[{"title":"Day 1 : Hanoi - Cuc Phuong national park (L,D)","description":"Morning drive to Cuc Phuong National Park 130km south of Hanoi. Short visit to the Endangered Primate Rescue Centre with a specialist guide from the park. Check in the Guest House inside the park. Have Lunch. In the afternoon we observe the birds gathering in the Botanical Garden and in the lush rain forest.\nThese are some kinds of birds you can find at Cuc Phuong national park: Chestnut-necklaced Partridge, Silver Pheasant, Grey Peacock Pheasant, Red-collared Woodpecker, Red-vented Barbet, Brown Hornbill, Spot-bellied Eagle Owl, Pied Falconet, Malayan Night Heron, Bar-bellied Pitta, Eared Pitta, Blue-rumped Pitta, Rachet-tailed Treepie, White-winged Magpie, White-tailed Flycatcher, Spotted Forktail, Limestone Wren Babbler, Rufous-throated Fulvetta and Black-browed Fulvetta.\nDinner and relax. \nOvernight at the Park Guest house. "},{"title":"Day 2 : Cuc Phuong national park - Bird watching(B,L,D)","description":"6:00am - 8:30am - Rise early to bird watching with a special bird watching guide from the park.\n8:30am - Have breakfast.\nAfter breakfast, continue viewing a variety of endangered bird species. Trekking the trail through a wood of giant trees. Return to the guesthouse in late afternoon. Dinner, relax and overnight inside the park. \nOvernight at the Park Guest house. "},{"title":"Day 3 : Cuc Phuong national park - Van Long natural reserve (B,L,D)","description":"Rising early this morning with the sounds of the forest all around us. After breakfast, we will leave Cuc Phuong for Van Long Natural Reserve. Do some biking around the country side of Van Long. Have lunch in a local restaurant.\nIn the afternoon, We will take a rowing boat trip along this beautiful wetland of Van Long Natural Reserve, enjoying spectacular scenery surrounded by rice paddies and towering limestone mountain peaks. These are some kind of birds you can find at Van Long natural reserve: Pheasant-tailed Jacana, White-browed Crake, Asian Openbill, Yellow Bittern, Cinnamon Bittern, White-throated Kingfisher.\nOvernight at Van Long Garden resort. "},{"title":"Day 4 : Van Long - Trang An complex - Thung Nham bird park (B,L,D)","description":"After breakfast we leave Van Long to Trang An. Visit Trang An Scenic Landscape complex nearby which recently recognized as an UNESCO World natural heritage, get on a rowing boat (small sampan) traveling along the small river with scenic mountain and green fields landscape. Boat takes you to visit cave complex of Trang An: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, the scenery of mountain and rivers – Halong bay on land of Ninh Binh.\nHave lunch at a local restaurant.\nCheck in your hotel then do biking to Thung Nham bird park. Thung Nham is a living space of many birds such as stork, heron, mallard, Forktail, etc. Especially, there are also two rare species in the Red Data Book, flamingo, and Phoenix. \nBack to the resort late in the afternoon. \nOvernight at Tam Coc Garden resort. "},{"title":"Day 5 : Tam Coc - Xuan Thuy Ramsar (B,L,D)","description":"After breakfast, we will leave Tam Coc for Xuan Thuy national park - the first Ramsar site in Vietnam. Check in and have lunch at the guest house of the park.\nIn the afternoon, you will be going around for bird watching with a park bird guide. Dinner and overnight at the Park's Guesthouse. "},{"title":"Day 6 : Xuan Thuy - Hanoi (B,L,)","description":"Almost a full day of bird watching started with a boat trip around the wetland area, including Lu and Vanh Islets and thru mangrove forest. This area is the seagate of the Red River, the second biggest one in Vietnam, originated from China mainland which makes the fertile Red River Delta. If we come here in wintertime, we could have very potential chances to see special species of birds of East Asia - Australia flyway such as Black-faced Spoonbill, Spoon-billed Sandpiper, Spotted Greenshank, Saunders's Gull, Asian Dowitcher etc. Packed lunch served during the trip.\nDrive back to Hanoi late in the afternoon. "}]},{"name":"Family Discover Vietnam - Private Tour","duration":11,"travelStyle":["Discovery","Family","River Cruise","Private","Fully Guided","Holiday"],"oldPrice":0,"price":2030,"summary":"This exciting introduction to Vietnam hits all of the so-called 'Five H's' as you travel privately with your family from Hanoi to Ho Chi Minh City. Along the way, cruise around Halong Bay, take part in a martial arts lesson in Hue, discover historic Hoi An and stay in a traditional homestay in the Mekong delta.    Hanoi - Free time to wander through the bustling narrow streets of the Old Quarter lined with shop-houses  Hoi An - Charming ancient merchant's town on the banks of the Thu Bon River  Ho Chi Minh City - Learn about the resourcefulness of the Viet Cong at the Cu Chi Tunnels, visit an underground weapons bunker and explore old Saigon's bustling back alleys  ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/202121_043daa94.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/202121_043daa94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_5f192d1cd131d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_5f192d1cd131f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_5f192d1cd1320.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_a3a72aa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_9fcc4f62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_a31a14e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_e0040bda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_de6b7c15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_0565de27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_a8279de4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_da1f3528.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_f29b8844.jpg","https://cdn.tourradar.com/s3/tour/1500x800/202121_d4efbda5.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Trip begins in Hanoi","description":"Arrive in Hanoi. Vietnam's bustling capital is architecturally styled like a French provincial town, with tree-lined boulevards and low-rise buildings. It's a wonderful city to explore on foot.\n \n You will be met on arrival at Hanoi's Noi Bai International Airport (HAN) by a local guide, and driven to your centrally-located hotel, approximately a 30 minute drive away. There are no activities planned today, so feel free to arrive in Hanoi at any time. For those booking their own flights, you will just need to let us know your flight details no later than three weeks prior to departure, in order to be met on arrival. \n \n If your flight arrives earlier in the day, perhaps you might choose to head to the Old Quarter, a maze of narrow lanes named after the various crafts and specialities of the city's artisans. The pavements are filled with food sellers tempting you with steaming noodles, snacks and stir-fried delights."},{"title":"Day 2: Tour of Hanoi; free afternoon with optional cooking class","description":"This morning, take a guided sightseeing tour of Hanoi, visiting the One-Pillar Pagoda, the Temple of Literatures and the Mausoleum of Ho Chi Minh. The afternoon is then free to perhaps take an optional cookery class, or explore Hanoi's elegant French Quarter on foot. In the evening there is the chance to witness a remarkable performance of traditional water puppetry. Set on a flooded stage, the stories tell tales of legendary heroes and everyday life, with dragons and unicorns often sharing the stage with fireworks and naval battles."},{"title":"Day 3: Free morning; afternoon drive to Halong Bay","description":"With a free morning in Hanoi, visit the Ethnology Museum or Ho Chi Minh's Mausoleum and museum (closed on Mondays). \n \n In the afternoon, transfer by road towards the Bay of Tonkin on Vietnam's northeast coast. Your destination is the breathtaking setting of Halong Bay, one of Vietnam's, and indeed Southeast Asia's, most spectacular natural attractions, whose staggering beauty has seen it listed as one of the eight natural wonders of the world. A UNESCO World Heritage site, Halong Bay presents a quite extraordinary vista of hundreds of limestone islands (over 1600 at last count) that rise from the jade green waters of the bay like the scales of some great submerged dragon. Indeed Halong means 'where the dragon descends to the sea' and local legends tells of a time when this rugged landscape was created by the pounding tail of a mighty dragon as he ran from the mountains into the glittering waters of the bay below."},{"title":"Day 4: Cruise the island-studded waters of Halong Bay; fly to Hue","description":"Today, raise anchor and head out of Halong Bay on one of its famous junk boats. Cruise past towering limestone cliffs and take the opportunity to drop anchor, exploring eerie caves, gottos, floating villages and even beaches. Enjoy a traditional seafood lunch on board, before disembarking and returning to Hanoi. This evening, transfer to the airport for a flight south to Hue, where a local guide will meet you to take you across to your hotel."},{"title":"Day 5: Visit Royal Tombs; martial arts lesson; kite making and flying","description":"This is a full day of fun as you experience the beating heart of Vietnamese culture. Do a little historic exploration first, driving out of the city this morning and visiting the enormous Royal Tomb of Tu Duc, set in a palatial landscape of lakes, pine trees and well-maintained grounds. \n \n Next up, take a martial arts lesson with a visit to a dedicated martial arts school that practices the Vietnamese art of Kinh Van, the countries equivalent to Kung Fu. This ancient art is based upon defence techniques from the actions of a tiger, cobra, and bird. The owner of the school's ancestors were chosen to guard the Vietnamese king and he now teaches this ancient art. \n \n In the afternoon, visit the house of a national champion kite flier for Vietnam where we are shown how to make traditional Vietnamese kites. Taking time to decorate our kites with iconic symbols such as dragons, birds and peacocks, we take our completed kites to the nearby Citadel grounds to try them out. The Citadel is an impressive monument that is almost 10 km in circumference with the Imperial City located in the centre of the Citadel which is more than 600m long on each side. Access to the Imperial City can be made by four entrance gates although the Noon Gate is only used for the King."},{"title":"Day 6: Cycle around the countryside, traditional wood painting lesson; drive to Hoi An","description":"Travel to Trieu Son village with your local guide, located by the Perfume River on Hue's outskirts. Take a short walk in the village before bording a boat to travel 15 minutes upstream to Sinh Village. Hear, meet a local family that specializes in making wood paintings - they will teach you how to make these traditional artefacts. Take a leisurely cycle ride around the village and along countryside lanes to Thanh Tien village which is famous for paper flowers. Continuing through paddy fields and the Vietnam countryside, arrive at Tien Non village and board a cruise boat to journey back to Hue (total cycling distance is approximately 6km). In the afternoon, travel over the Truong Son Mountains and through the Hai Van Pass, as seen on the TV programme, Top Gear, to the historic merchant seaside town of Hoi An."},{"title":"Day 7: Free in Hoi An; optional bike hire or visit the town's famous tailors","description":"The day is free to wander through the historic heart of this World Heritage Site, taking in the wonderfully preserved buildings of what was once one of the busiest trading outposts in South East Asia. Discovering this delightful town, we recommend an early morning visit to Hoi An's fish market which presents the perfect setting for some great photographs and some priceless interaction with the locals. Visit the city's famous Japanese Bridge, before wandering through its historic collection of traditional wooden houses and Chinese temples. This afternoon you could hire bicycles and explore the surrounding countryside, experience a gentle river cruise, spend time at the beach, or grab the chance to visit some of Hoi An's famous tailor shops."},{"title":"Day 8: Drive to Danang, fly to Ho Chi Minh City. Explore Old Saigon, and discover 'Secret Weapons Bunker'","description":"The drive to Danang this morning takes you past the five peaks of the Marble Mountains, originally believed to have been islands that were said to represent the five elements of water, wood, fire, gold and earth. On arrival in Danang, board the morning flight to Ho Chi Minh City, and meet your Ho Chi Minh guide at the airport.  \n \n Experience a different side of Ho Chi Minh City to the classic Old City tour. Cyclo drivers (cycle carriages with a seat at the front) will take you to District 3, turning off the main thoroughfare and into the maze of narrow streets of this bustling district. Descend the cyclos and walk through this eclectic area, navigating local markets selling anything from colourful fruit to bootleg DVDs, and ambling past ramshackle shopfronts, houses, churches and schools, all squeezed into the small buildings that line the narrow alleys. It's a fascinating inter-connected community here that is a stones-throw from the city centre, yet feels a far cry from the modern buildings and throngs of tourists. Stop at a local stall for a traditional Vietnamese coffee (brewed coffee served sweet with condensed milk) and sample 'Banh Mi' - a Vietnamese take on the humble French baguette - freshly baked and packed with a combo of traditional and more exotic, aromatic ingredients.\n \n The walk ends at the so-called 'secret weapons' bunker'. A small unassuming 'tube house' nestled in a quiet neighbourhood hides a trap door in the floor, concealing a basement stocked full of rifles, grenades and ammunition. The bunker played a key role in the TET Offensive of 1968, it was the base from which the Viet Cong's \"Team 5\" launched their assault, and its location was only revealed after the end of the war. Explore the house and bunker, filled with decommissioned weapons and photographs, news clippings and memorabilia from the wartime."},{"title":"Day 9: Morning visit to Cu Chi Tunnels; Afternoon free with optional visit to a water park","description":"After breakfast this morning, head out to visit the infamous Cu Chi tunnels. First constructed by the Vietnamese during their colonial war with the French, the tunnels were later greatly expanded and went on to achieve notoriety during the Vietnam War, when they served as an underground command base for 10,000 Viet Cong troops. Exploring Cu Chi gives some idea as to the conditions that the Vietnamese and their American adversaries had to endure (the tunnels are narrow and can be quite claustrophobic). The afternoon allows for more time in the city including an optional visit to the waterpark, a great way to cool off from the mid-day sun."},{"title":"Day 10: Drive to the Mekong Delta, homestay and boat trip","description":"Leaving the city, drive to Ben Tre, in the Mekong Delta. Surrounded with lush and fertile land the area is home to small villages and swaying coconut palms. Take a local ferry to Tam Hiep island where you will spend the night in a local homestay. After lunch, explore the local village by trishaw (a sort of rickshaw-style bike where the carriage is on the front of the bike), relaxing in the carriage as you move along the island roads to a farm that grows Suong Sam - a native plant in South East Asia which is used mostly in local refreshments. Pick the leaves and learn how to make a typical dessert jelly. After visiting the village, boart a sampan craft, a small traditional boat that is regularly used by villagers to travel along the delta, and return to the homestay via the coconut palm-lined canal. This evening, relax by the Mekong River before enjoying a typical Mekong delta dinner.\n \n with shared facilities and dorm-style accommodation\n Set in a lovely garden setting with a main lounge area and dining room, accommodation is en-suite (shower and toilet) with traditional décor throughout. Your local guide will also be staying with you in the homestay."},{"title":"Day 11: Morning cruise on the Mekong Delta. Drive back to Ho Chi Minh City where the trip ends","description":"Leaving the homestay behind, cruise back along the Mekong delta passing small floating markets and soaking up the atmosphere of this unique trading point, a vast network of rivers and islands that crisscross agricultural villages, paddy fields and mangrove swamps. Bidding farewell to your boat crew, drive back to Ho Chi Minh City.\n \n The aim is to be back at Ho Chi Minh City around 3pm, and as such the earliest that your flight can depart is 5pm. For those of you with later evening flights, a day use room will be provided before your transfer to the airport.\n \n Why not extend your trip to Indochina with three nights on the tropical white sand beaches of Phu Quoc Island? Nestled in the warm waters of the Gulf of Thailand this Vietnamese island is 90% national park, a thick-rainforest interior framed by idyllic white sand beaches. Easily accessible by a short flight from Ho Chi Minh City, this is a great way to unwind after an action-packed trip in Indochina."}]}]