[{"name":"Hanoi and 2 Nights on Margaret Cruises 5*","duration":6,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"Spread over 4 decks with 25 spacious cabins\nBrand - New and luxury 5 star boat\nHi-end services by well-trained staffs\nSpend 2 Nights on Luxury Margaret Cruises\nIncluded 3 Nights in Quoc Hoa Premier Hotel 4*","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161345_40ed8c95.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161345_40ed8c95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_2c43a0ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_a1f07614.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_f11fc1b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_8d4799de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_b3f62ed8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161345_2ee8a15c.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Margaret Cruise Halong Bay","description":"7: 30 - 8: 00 Pick up at your hotels in Hanoi Old Quarter\n10: 00 - 10: 30 Stopover at Hai Duong province for refreshment about 20 – 30 minutes\n11: 30 Arrive at Tuan Chau harbor\n12: 00 - 12: 30 Transfer to Margaret Cruises. Check in your cabin\n13: 30 Enjoy a nice buffet lunch at our restaurant while the cruise goes ahead to Halong Bay\n15: 00 Continue to explore Halong Bay. Only 1 option will be chosen depending on the weather conditions and seasons:\nOption 1: Visit Titop Island for swimming and trekking\nOption 2: Visit Pearl Farm Village\nAfter that, visit Luon cave area by kayaking\n17: 15 Enjoy Sun Set party with Juices, Tea, Coffee and fruits on Margaret Sky Bar.\nOption: Massage service available.\n17: 45 join cooking demonstration: How to make Vietnamese spring rolls - traditional Vietnamese food.\n19: 00 Enjoy set-menu dinner (unique blend of Asian and European food)\n20: 30 join the Squid Fishing activity. Free time on the boat."},{"title":"Day 3: Halong Bay - Lan Ha Bay","description":"6: 30\tPractice Tai Chi class. Tea and coffee are served.\n7: 30: Light breakfast is served\n8: 30: A day boat takes you to Lan Ha Bay. Activities here: fishing, swimming and kayaking. Lunch served on day boat\n16: 00: Come back to Margaret cruise\n17: 30: Enjoy Sun Set party with Juices, Tea, Coffee and fruits on Margaret Sky Bar.\nOption: Massage service available.\n18: 30: Join cooking demonstration: How to make Vietnamese spring rolls -traditional Vietnamese food.\n19: 30: Enjoy set-menu dinner (unique blend of Asian and European food)\n21: 00: Join the Squid Fishing activity. Free time on the boat."},{"title":"Day 4: Margaret Cruise - Hanoi","description":"6: 30 Practice Tai Chi class. Tea and coffee are served.\n7: 30 Light breakfast served\n8: 30 Visit Sung Sot cave\n10: 00 Check - out time\n10: 30 Enjoy buffet brunch\n11: 30 Disembark to Tuan Chau Wharf\n12: 15 - 16: 30 Return to Ha Noi. End of the trip"},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOr you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Tour 7 days Ho Chi Minh City - Nha Trang","duration":7,"travelStyle":["Flexi","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1020,"summary":"A specially designed tour to experience the diversity of landscapes and culture from the bustling Ho Chi Minh city to peaceful Mekong Delta and colorful Nha Trang beach. Nha Trang boasts some of Vietnam’s finest boutique beach resorts and a choice of family-friendly beach hotels.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d41.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199246_5ec3b41753d4b.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Cai Rang"],"timeline":[{"title":"Ho Chi Minh City arrive – Sai Gon Night Life On Vintage Vespa (D)","description":"Welcome to Vietnam!\nAt your arrival, you are warmly welcomed by our driver and transfer privately by the comfortable car to the hotel in Ho Chi Minh.\n17:30 Join tour Sai Gon Night life on Vintage Vespa. It’s a chance to see many interesting landmarks in Saigon where most tourists do not know of.\nOvernight in Sai Gon"},{"title":"Ho Chi Minh City – My Tho – Ben Tre – Can Tho (B,L)","description":"This day, you join a group tour for 2 day tour of Mekong Delta with Floating Market\nStart from Ho Chi Minh City to depart for My Tho.\nOvernight at your proposed hotel in Can Tho."},{"title":"Explore Cai Rang Floating Market – Nha Trang (B,L)","description":"Join group tour\nYour activities of the day will be:\nArriving at Cam Ranh airport in Nha Trang, you are picked up from airport and transferred to the hotel. Overnight in Nha Trang."},{"title":"NhaTrang Island tour (B, L)","description":"Join group tour\nIn the morning: Pick up from your hotel by air-conditioned van to transfer to the Cau Da port to start the 4 islands trip.\nYou will be fun, exciting experience with swimming, fresh water shower, rest and relax at a unique island with natural beauty, unspoiled extremely impressed !\nBesides, you can enjoy the water sports: water motor, parachute, banana float, diving, sea walker, and kayaking…\nAround 12:00: Lunch time will be serviced on local Restaurant.\nAround 17:00 Come back to hotel and overnight in Nha Trang"},{"title":"Nha Trang City (B)","description":"Join group tour\nAround 08:00: Car and guide will pick up you at the hotel to begin a Nha Trang city tour.\nAround 12:00: Enjoy Vietnamese lunch.\nAfter that: Shopping in Dam Market and come back to hotel"},{"title":"Nha Trang (B)","description":"Option 1: Breakfast at the hotel. You have a free day today to enjoy the white sand beaches or explore the surrounding or enjoying local food of Nha Trang\nOption 2: Join group tour Vinpearl Land (Extra fee: 85$)\nHead to Vinpearl Land Nha Trang to be part of a surprising and joyful exploration! Vinpearl Land Nha Trang is currently the first 5-star quality recreation zone in Vietnam:\nYou will enjoy all kind of games: Outdoor games and Indoor games.\nVinpearl Land Aquarium with an area of over 3,400m2 is the miniature ocean with over 300 species of beautiful fish, rare and fancy.\nWater Park with thrilling games: adventure game area, children’s play area, wave pool, lazy river, family adventure zone…\nAround 18:45: Take the cable car back to the port and comeback hotel\nIncluded"},{"title":"Nha Trang – Depart (B)","description":"Have breakfast. Free relax in Nha Trang.\nThen Transfer to the airport for your return flight home."}]},{"name":"Hanoi Tour plus 2 Nights on 5* Genesis Legal Cruise","duration":6,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":172,"summary":"02 Nights on Luxury 5* Genesis Legal Cruise in Halong Bay\n04 Nights in Quoc Hoa Premier Hotel in Hanoi\nFree Round-trip airport pick up and transfer by Private Car\nOptional Day excursions around Hanoi and Ninh Binh\nEnglish speaking Tourguide included","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161315_12bd5e84.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161315_12bd5e84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_f963a917.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_e4db52c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_b8eb1074.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_867effb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_03d4c0e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_3710589e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_49fc4971.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_8a688ceb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_cec1d453.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_1287ae21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_95916c7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_141fb878.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161315_7ce3a2d0.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Genesis Legal Cruise Halong Bay","description":"09.00 - 09.30 Pick Up - Starting the journey, Genesis Tour guide will pick you up at the hotel lobby in Ha Noi as scheduled.\nIf not using our limousine shuttle, we will greet you at Genesis guest station, Got pier, Cat Hai district, Hai Phong city.\n09.30-11.30 On road - Moving on expressway 5B, tourist will be introduced about the culture, live…of Vietnamese by our Tour guide.\n11.30 - 12.00 Check in and set sailing Genesis team will welcome you at lounge and register for your trip.\nYou will embark Genesis Regal Cruise in the warmly greeting of the team who will accompany you guys in the trip.\nReceive the room key, check in and take a rest at your reserved room before lunch, while Regal Cruise set sailing.\n12.40 Lunch time - relax Back to the Tonkin restaurant, you enjoy set menu lunch with delicious food and drinks. Regal Cruise slowly glides between the numerous small islands and the sea-green color of the bay. After that, it would be relax and leisure.\n14:10 – 15.10 Visit a floating house Tour guides and tender will take you to visit a floating house on the bay. The local host will welcome you as home-guests, visitors will be exchanged with the owner, to understand the information about culture, history ... of the fishing village on Halong Bay - Lan Ha Bay. Guests enjoy traditional dried fish and traditional wine offered by the local host.\n15:10 - 16:00 Relax and Sightseeing Return to Regal Cruise, visitors continue the journey to explore the other hidden beauty of Halong Bay – Lan Ha Bay. You can choose to sip coctails on the sundeck or relaxing in the cabin with an extra-large view to the small green islets.\n16:00 Kayaking – Sampan boat in Dark – Light cave Reaching Dark- Light area of 3 underwater caves.\nIn this activity, visitors have two choices, either by themselves creating separate roads for exploring by kayaking or sit on boats that rowed by the local people to soak in the peaceful atmosphere.\nGuests have about 1 hour here to have the opportunity to admire closest to nature of wonder.\n17.00 Swimming - relax Regal Cruise will move to safe anchorage. Visitors can choose to swim in emerald water or going on sundeck to enjoy the magnificence of the bay where were voted as one of the top 20 beautiful sunset in Asia by CNN.\n18.00 Sunset hunting- Sunset Party Especially, visitors do not forget to join the sunset party on the open sundeck area of the ship. In the rhythm of the music, boldly add the party atmosphere of the trip. Do not miss the special offer Happy hours - buy one get one free to enjoy the memorable moments in the trip.\nMoreover, Regal Chef will guide you how to make one of the 50 best dishes in the world, voted by CNN – “Nem” – Deep Fried Spring Rolls in Vietnam.\n19.30 Dinner on board Guests will enjoy the delicate dinner in the warm and cozy ambience. The freshly cooked seafood dishes, mixed by Vietnamese and Western styles, promise to bring guests an unforgettable dinner on this memorable trip.\n21:00 Relax on board A free time for some activities such as: films; playing chess, reading books, listening to music, trying your luck with squid fishing, tea culture learning, or enjoy the starlight of night sky in the bay on sundeck.\n22:00 Sleeping Cruise goes to overnight point at the quietest part of the wonders. Finishing the first day with a good night’s sleep."},{"title":"Day 3: Halong Bay - Viet Hai Finish Village - Cat Ba Island","description":"06.30 Preparing for a day of outdoor activities, you can get up early to start the day with 30 minutes of Taichi practice. Get the dawn on the bay.\n07:30 Breakfast time\tEnjoy breakfast with a menu including: sandwiches, pastries, eggs, ham, sausage.... fulfill the energy to be ready to discover the Cat ba island – Lan Ha bay.\n08:30 Move to day boat for Cat ba island. Transfering guests to Genesis day boat and taking to visit Lan Ha Ba, Ba Trai Dao beaches, sail straight to Viet Hai Village where is located on the valley of Cat Ba National Park, Cat ba island.\n10:00 - 12:00 Discover Viet Hai village\tThe boat to Viet Hai wharf, you get bicycles to Viet Hai Village about 4km. A small village deep in the valley, surrounding mountains, beautiful scenery with rice fields, buffalo ... You stroll around the village, meet with local people, visit the school of the local children, or discover the village by walking around.\n12:00 - 13:00 Cycling back to Viet Hai wharf. Enjoying lunch on board. Then take relax, sunbathe. Boats will take you away on Lan Ha Bay, directly overlooking Ba Trai Dao beaches area.\n14:00 - 16:00 Swim/kayak. You go kayak explore the area of the Ba Trai Dao. Guests can sunbath and swim on the private beach.\n17:30 Day boats will take visitors back to the Regal Cruise, back to the point overnight on the bay.\n18:00 Relaxing on the sundeck and enjoying the bay after a long day. joining the mini cooking class, today we will make fried spring rolls, another traditional taste.\n19:30 Enjoy dinner on board with an all-new menu that includes local seafood delights combined with some Western-style cooking.\n20:00 You will have time for rest, drink, listening music or take some massage to refresh the body also ideal."},{"title":"Day 4: Genesis Legal Cruise - Hanoi","description":"06.30 Tai Chi wake up to new days are practiced out on the sundeck. This is also the moment visitors can pick up the dawn on the bay.\n07.30 A light and nutritious breakfast served at the restaurant will help you enjoy the last day on the bay, which is always full of energy.\n08.30 Visit karst cave on Cat Ba National Park Regal Cruise move to Gia Luan wharf, a path for tourists to visit Cat Ba National Park. After leaving the boat, the van will take visitors down the asphalt road through the forest, the stop point is a typical karst cave which were formed from million years ago. Have chance to meet the red list Cat ba langur.\nYou will have an hour to discover this area with much of interesting information and stories about Cat ba island, Lan ha bay…\n9.30 - 10.30 Guests return to the boat, stay and check out procedures. Enjoying the scenery of the Bay and a delicious buffet brunch while cruising back to the harbor.\n11:45 Regal Cruise arrives in Got Pier. Guests will relax at the private lounge, preparing luggage and depart back to Hanoi.\n14.00 Return to Hanoi Hotel after moving quickly by the highway.\nFinishing your memorable journey with Regal Cruise"},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Kms).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork \n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Fully Hanoi Tour plus Serenity Cruises 5*","duration":6,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":194,"summary":"Free Round Trip Transfer Hanoi - Halong and Airport\nHanoi City Tour full day with Water Puppet Show\nDiscover Trang An - Bai Dinh Pagoda full day trip\nSerenity is Luxury Brand New Cruise\nCruise through Halong Bay and Lan Ha Bay ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecaf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecafa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecafb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecafd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161731_5e536ecbecafe.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Halong Serenity Cruises","description":"8.30- 9.00 am: Pick-up time\nFor those who book our transfer service, you will be picked up at your hotels in Hanoi Old Quarter. Instead of spending 4 hours following the traditional route to Halong city, we travel through the newly opened express way Halong - Hai Phong and shortly arrive at Tuan Chau Wharf in only 2,5 hours.\n11.30: Arrive in Tuan Chau Wharf\nFrom here, you will transfer to SERENITY CRUISE\n12.00: Relax on SERENITY CRUISES\nWarmly welcome to SERENITY CRUISE!\nEnjoy the welcome drink while listening to our cruise manager briefly delivers safety introduction. After that you will check in your cabin\n12.45: Enjoy International buffet lunch\nFantastic buffet lunch is served. In the meantime, the cruise will get you far away from the frequented areas of Halong bay and head to the magnificent scenery in Lan Ha Bay – a hidden charm who has lived in the quiet shadows of its famous twin Halong Bay for a long time. The ship cruised past Finger Islet, Frog Islet and hundreds of uniquely shaped limestone pinnacles.\n15.00: Explore Lan Ha - Ha Long bay, hit the water on kayak and go swimming\nSERENITY CRUISE reaches Dau Be Island, one of the most beautiful islands located in the South East of Ha Long bay. It is time to discover Halong bay on your own with your travel buddies – sharing kayak. Go explore the beauty of nature in hidden lagoon with lots of stalactites hanging down from the cave ceiling. This activity might depend on the tide level of the bay. In case the tide level is too high or too low, we will do kayaking in Dark Cave, Bright Cave area. There is a stop for those who wish to swim and go snorkeling in the lush green water.\n16.30: Cook like local, eat like local\nBack to SERENITY CRUISES after outdoor activities, it’s time to relax with a cocktail. Special deal “Happy Hour” is available from 16.30 – 18.30. You can also join a traditional cooking class presented by our crew onboard.\nBefore dinner, our experienced captain will choose the most tranquil area to anchor for overnight.\n19.00: Taste the life with Deluxe Dinner Set Menu\nEnjoy dinner infused with all energy of our experienced chefs. After the incredible dinner, the rest of the evening is free time for SERENITY CRUISES’ guests to relax on sundeck with a drink, enjoy spa treatment, watch a movie in the restaurant, etc…"},{"title":"Day 3: Serenity Cruises - Hanoi","description":"6.30: Do Taichi on sundeck\nWake up in tranquility and start your second day on SERENITY CRUISES with TAICHI on sundeck. Afterwards, light breakfast is served.\n7.45: Visit Viet Hai village\nOur crew will take you to Viet Hai village, located in the central valley of Cat Ba National Park. Spending around 30 minutes for biking along, you will feel the peaceful atmosphere, charming scenery of a traditional village in the coastal North of Vietnam.\n9:15: Return to SERENITY CRUISES\nYou may simply relax on the cruise then spend few minutes to settle your bill and check out from 9.15-10.00 am\n10:00: Enjoy delightful brunch\nLight brunch will be served while SERENITY Cruise slowly navigates back to the harbour.\n11.15: Disembark SERENITY CRUISES\n12.00 - 12.15: “Goodbye Lan Ha - Ha Long bay”\nReturn at Tuan Chau Wharf and get ready for driving back to Hanoi (available for booking in advanced)\n15.00: Arrive back Hanoi Old Quarter, end of unforgettable trip"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOr you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi City Tour full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOr you can join: Hanoi City Tour full day: 50 US$/ Per Person\n8.00: We’ll pick you up from your hotel take you to visit the Ho Chi Minh Complex, which includes Ho Chi Minh’s Mausoleum - the final resting place of the beloved national hero, Uncle Ho - and President Ho Chi Minh’s stilt house where he lived off and on from 1958 to 1969.\n9.30: You’ll visit the One Pillar Pagoda, which is actually a group of structures that collectively make up a pagoda built over the water in the middle of a square lake.\nAfter that, you’ll have a chance to explore the Tran Quoc Pagoda on the shore of west lake. From there, it’s onto the Temple of literature, which was Viet nam’s first university and is dedicated to Confucius.\n12.30: You have lunch at the restaurant in the Old Quarter. Afterwards, you’ll visit Hoan Kiem Lake - the heart and soul of Hanoi.\nOPTION 1: TUE, WED, THU, FRI, SAT, SUNDAY\nYou’ ll stop in at MUSEUM OF ETHNOLOGY.This superb museum showcases the depth of Vietnamese cultural diversity with an astounding collection of 15,000 artifacts gathered from throughout Vietnam. Maps, displays and dioramas are labelled in Vietnamese, French and English.Displays portray a typical village market, the making of comical hats and a Tay shamanic ceremony; videos show the real thing. You can also check out a traditional Black Thai house reconstructed in the museum. There's also a centre for research and conservation where scientists from all over the world study traditional Vietnamese cultures.\nOPTION 2: MONDAY\nDepart for Bat Trang ceramic village which is about 20 km away from Ha Noi, this is pottery village with a half- milleary historic development.\n15.30 - 16.00: Take the car come back your hotel.\nFinish unforgettable full day Hanoi Sightseeing!\nAdd some options: Enjoy Water Puppet Show from 15.30 to 16.15 or Electric Car or Cyclo around Hanoi's Old Quarter.\nCome back your hotel at 17.00"},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Hanoi Stopover with 2 Nights on Stellar of the Seas","duration":6,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"Airport pick up and airport transfer included\n02 nights on luxury cabins with private Balcony\nStellar of the Seas is leading line in 5-star cruises in Lan Ha Bay\nFree Kayaking & Free Round Trip Transfer\nHi-end services by well-trained staffs ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161703_c877e3a2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161703_c877e3a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_32b693a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_910870f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_c47190c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_be943fee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_008b1e99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_1cd3cc6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_5c0b3296.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_4aa5dcf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_44e06e83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_f4e46f8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_b219cfa8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_8ac434c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_a6b445d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_488b5087.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161703_fe9fc3ca.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Halong Stellar of the Seas Cruise","description":"08:45 - 09:10 approx\n- Pick up at your hotel in Hanoi old quarter\n- Start 2,5 hour road journey via 5B highway on ultra-luxurious limousine (for the guests use our transfer service)\n11:30 - 12.00 approx\n- Arriving Tuan Chau marina, transferred by speedboat to Stellar of the Seas. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing, safety instruction.\n- Set sail as lunch is served\n12:30\n- join us for a typical lunch in the luxury dining room with indoor or outdoor dining area.\n- Check into your cabin. Time to refresh and unwind\n- Continue cruising through Con Vit islet, Thumb islet and Gia Luan habour where belonged to Cat Ba area.\n- Discover lagoon natural area belonged to Lan Ha bay. drop anchor for swimming or just simply sunbathe on our cruise (private, wild and fresh air).\n- Heading back toward the sleeping area\nEarly evening\nSummit on the sundeck for watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset or just relax in the seasonal swimming pool, or enjoy your time in our golf course.\n18:00: join us for a short class of cooking demonstration. Our chef will guide you how to make famous traditional Vietnamese spring rolls. Here you will understand the culinary culture of the Vietnamese\n19:00\n- BBQ dinner is served with fresh food menu outside of swimming pool area.\n- After dinner, reward yourself with a large selection of cocktails at panoramic bar with seasonal pool view, at wine and cigars cellar, or take one of our onboard activities: games, movies, and squid fishing… or relaxing with massage services.\nOvernight on board"},{"title":"Day 3: Halong Bay - Lan Ha Bay Cruise","description":"6:30: join us for a Tai Chi session for the early risers on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands.\n07:30: joining light breakfast in a panorama view of the world heritage site. After breakfast, enjoy your time for relaxing in amazing view of the Lan Ha bay while the boat continues cruising further for sightseeing.\n11:30 approx: Lunch is served before getting on the speed boat to explore some unique area where the main boat cannot go through.\n13:15 approx: Transfer to the speed boat heading to Viet Hai Village.\nAfternoon:\nTake the bicycle ride to enjoy gorgeous sceneries along village roads and go through rain forests. We also visit a local family’s house to see the daily life of local people. Back to the day boat to continue cruising further in Lan Ha Bay.\n15:00: Arrive to Ba Trai Dao Beach area for swimming and kayaking, guest will have chance to see fish farm at the typical Lan Ha bay floating village.\nEarly evening\n- Back to Stellar of the seas, take time to refresh or play some short game in our golf course or relax with massage services as we cruise to sleeping area. BBQ dinner (different menu) is served.\n- After dinner reward yourself with a large selection of cocktails at our bar, swimming pool, wine and cigars cellar or enjoy the landscape of the bay at night. Relax with massage services. Take one of our on-board activities like squid fishing, watching movies in the restaurant.\nOvernight on board"},{"title":"Day 4: Stellar of the Seas Cruise - Hanoi","description":"06:30: join us for a Tai Chi session on the sundeck for early riser. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the new day.\n07:00 - 7:45: Local light breakfast is served\n08:00\n- Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Dark & Bright Cave (Hang Sang & Toi)\n- Take your option either exploring the cave yourself on kayak or comfortably on local bamboo boat rowed by the locals.\n09:30: Check out the room\n10:00: Vietnamese cuisine is served.\n12:00\n- Disembark from the cruise as our crew say farewell, back to Tuan Chau Marina by our speedboat\n- Transfer to ultra-luxurious limousine returned to Hanoi.\n- Arrival back at your hotel approximately 15:00"},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Hanoi Tour with 1 Night on Stellar of the Seas Cruise 5*","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":169,"summary":"Airport pick up and airport transfer included\n22 luxury cabins with private Balcony\nLeading line in 5-star cruises in Lan Ha Bay\nFree Kayaking & Free Round Trip Transfer\nHi-end services by well-trained staffs","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161691_68376530.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161691_68376530.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_f86ae2e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_1cf11a3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_b289a153.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_bf584fe7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_8161103e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_0d8d2e08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_cc4af3b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_078bb0cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_eafebfee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_c01cc659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_fd8438a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161691_fd9a8c59.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - Halong Stellar of the Seas Cruise","description":"08:45 - 09:10 approx\n- Pick up at your hotel in Hanoi old quarter\n- Start 2,5 hour road journey via 5B highway on ultra-luxurious limousine (for the guests use our transfer service)\n11:30 - 12.00 approx\n- Arriving Tuan Chau marina, transferred by speedboat to Stellar of the Seas. Welcome aboard the cruise. Refresh with our welcome drink. Meet the captain, crew in the cruise briefing, safety instruction.\n- Set sail as lunch is served\n12:30\n- join us for a typical lunch in the luxury dining room with indoor or outdoor dining area.\n- Check into your cabin. Time to refresh and unwind\n- Continue cruising through Con Vit islet, Thumb islet and Gia Luan habour where belonged to Cat Ba area.\n- Discover lagoon natural area belonged to Lan Ha bay. drop anchor for swimming or just simply sunbathe on our cruise (private, wild and fresh air).\n- Heading back toward the sleeping area\nEarly evening\nSummit on the sundeck for watching the sunset, enjoy Sunset party. It’s ideal time to make acquaintance with new friends, sharing your traveling experience or simply watching the sunset or just relax in the seasonal swimming pool, or enjoy your time in our golf course.\n18:00 join us for a short class of cooking demonstration. Our chef will guide you how to make famous traditional Vietnamese spring rolls. Here you will understand the culinary culture of the Vietnamese\n19:00\n- BBQ dinner is served with fresh food menu outside of swimming pool area.\n- After dinner, reward yourself with a large selection of cocktails at panoramic bar with seasonal pool view, at wine and cigars cellar, or take one of our onboard activities: games, movies, and squid fishing… or relaxing with massage services.\nOvernight on board"},{"title":"Day 3: Stellar of the Seas Cruise - Hanoi","description":"06:30 join us for a Tai Chi session on the sundeck for early riser. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the new day.\n07:00 - 7:45 Local light breakfast is served\n08:00\n- Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Dark & Bright Cave (Hang Sang & Toi)\n- Take your option either exploring the cave yourself on kayak or comfortably on local bamboo boat rowed by the locals.\n09:30 Check out the room\n10:00 Vietnamese cuisine is served.\n12:00\n- Disembark from the cruise as our crew say farewell, back to Tuan Chau Marina by our speedboat\n- Transfer to ultra-luxurious limousine returned to Hanoi.\n- Arrival back at your hotel approximately 15:00"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOr you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]}]