[{"name":"A Short Trek of Sapa and Fansipan","duration":5,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":404,"summary":"Highlughts:\nWith one days touring Sapa’s highlights, and 2 days hard trekking, This option offers an easiest track to conquer Fansipan Mountain. You will start your trekking from Tram Ton Pass along a tough trail up and down the steep mountains through primitive forest and take the same way back. Stay overnight in a tent for one night in the middle of the forest.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156110_a4376ebe.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156110_a4376ebe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_df9529e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_568d5de1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_df9e45a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_127ed226.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_38d59125.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_7be4ac37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_792d9b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_261782bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_6b64abca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_16012ec6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_da2f1f9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_be61c402.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_7b228758.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_16e31ca3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156110_a4e2b777.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1:Take overnight train from Hanoi to Lao Cai","description":"Take overnight train from Hanoi to Lao Cai \nPlease, be ready at your hotel lobby at 20.00 for a short transfer to Hanoi railways station for taking the overnight train (first class 4 beds cabin with air-condition) which arrive in Lao Cai city, near the Chinese border next morning. "},{"title":"Day 2: Hanoi - Sapa Town’s Highlights ( B,L,D)","description":"\nThe train arrives at Lao Cai station early at about 06.00, meet your guide and driver upon your arrival to Lao Cai station and an hour transfer uphill the Hoang Lien Son mountains to Sapa. Great views of valleys and terraced rice fields! After Breakfast, you will enjoy a walk around Sapa for a brief introduction of this charming town. At the market, you will meet ethnic minority peoples of different groups wearing their traditional costumes made by themselves who come every day selling local products includes vegetable, bamboo shoot, mushroom, medicinal herbs and souvenirs…there are chances for getting intact with them and taking photos. Later you will follow the footsteps uphill to the top of Ham Rong Mountain for over viewing beautiful scenery of the town and surrounding area, paying visit to an orchard garden and a mini museum which tell you a lot about ethnic minority people living in Sapa and the northwest region. The rest of the day is set at your leisure.\n• Accommodation: hotel in Sapa "},{"title":"Day 3 : Sapa - Tram Ton Pass - 2,900m Mount camping (B,L,D)","description":"Take a jeep transfer 18 km via Silver Water Fall to Tram Ton Pass at 1,900m. From here trek through thick tropical jungle, passing some isolated Black H’mong hamlets. Stop for Lunch at a nice sport with great view of the west side area.\nContinue through the thick jungle, the trail gets narrower and steeper. Some part is really slippery and dangerous but the nature get wilder and wilder. We reach to the top of a mountain at 2,900m where our camp will be set for staying overnight. \n• Accommodation: Overnight in tent"},{"title":"Day 4: Mount 2,900m camp - Fansipan Mount - Tram Ton - Sapa ( B,L,D)","description":"Wake up and Breakfast, we follow a narrow trail passing through forest and bamboo bushes, which get smaller and shorter as we approaching to the peak. After 2 hours challenging up the steep path, you will reach to the top Fansipan Mount. Congratulation! Staying here to enjoy your success as well as great view of a ever green scenery stretching under your feet.\nThe way back, of course less hard but still dangerous. Arriving back to the 2,900m camp at noon, we have long break for Lunch and recovery and then continue the same way back to Tram Ton pass where our car will pick us up for a transfer back to Sapa at your hotel. \n• Accommodation: hotel in Sapa"},{"title":"Day 5: Full day at your leisure - Bus back to Hanoi ( B,L,D)","description":"Today is set at your leisure in Sapa but be kindly notice that your hotel room is not booked for late check out. Pick up and transfer  to bus station to be back Hanoi. Arrive in Hanoi at 10p.m."}]},{"name":"Impression of Vietnam with Sapa","duration":11,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":0,"price":772,"summary":"Your 10-days Impressions of Vietnam will take you from the North to the South of Vietnam visiting attractions across the country, including history, culture, nature and a bit of adventure. ","highlights":["Pass through the narrow 1000-year-old alley of Hanoi Old Quarters","Enjoy the sublime natural beauty of Sapa's mountains and valleys","Discover tranquil mountains, graceful villages, and untouched areas"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177076_8e7f53a0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177076_8e7f53a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_6c533650.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_5ed71493.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_93c3a365.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_50fd661b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_cda05117.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_95771195.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177076_686a54d3.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"DAY 1: ARRIVAL IN HANOI (-/-/-)","description":"Welcome to Hanoi - Vietnam!\nUpon arrival, picked up by our local tour guide and transfer to your hotel for check-in. Free time to rest after your long haul flight. Accommodation in Hanoi.\nNote: check-in at the hotel is at 2pm. Early check in is subject to availability with supplement."},{"title":"DAY 2: HANOI – SAPA (B/-/-)","description":"Early morning, board on our limousine bus to Sapa which is an incredibly picturesque town that lies in the Hoang Lien Son mountain range near the Chinese border in northwestern Vietnam, known as \"the Tonkinese Alps\". Sapa and its surrounding region is host to many hill tribes, as well as rice terraces, lush vegetation, and Fansipan, the highest peak in Vietnam.\nUpon arrival, check in your hotel and at leisure in the rest of the day to explore Sapa at your own pace. \nOvernight in Sapa. \n"},{"title":"DAY 3: SAPA – HANOI (B/-/-)","description":"The 100-year-old hill station with magnificent landscape of mountains, pinewoods and mysterious mist, Sapa, always  inspires every artist and photographer who used to stopover or hear about this unique place. This morning, you are free to stroll around the marketplace of Sapa and Sapa church to discover this special ambiance of hill tribal minorities. \nOur limousine bus will take you back to Hanoi in the afternoon. Overnight in Hanoi. \n"},{"title":"DAY 4: HANOI – ORIENTATION CITY TOUR (B/-/-)","description":"Breakfast at hotel. \nOur first stop today will be Ho Chi Minh Complex, which includes the Ho Chi Minh Mausoleum (exterior) and the house of President Ho Chi Minh. Visit the One Pilar pagoda, which is actually a set of structures that form a pagoda built on water in the middle of a square lake. Move on to the Temple of Literature, which was the first university in Vietnam and is dedicated Confuncion.\nFree time in the afternoon for your own discovery of Hanoi.\nOvernight in Hanoi.\n"},{"title":"DAY 5: HANOI – HALONG BAY/ LAN HA BAY (B/L/D)","description":"If you wish to see how the Hanoi people rise and shine in the morning, wake up early and run to a lake close by your hotel, you can join an exciting scene of hundreds of locals, passionately attentive in their morning exercises of Tai Chi quan, jogging, martial arts, classical dance and so on. \nAfter breakfast at the hotel, on shuttle bus, we will head to Halong Bay, a Natural World Heritage as designated by UNESCO since 1994 and 2006, and check-in our overnight boat. Enjoy a trip on Halong with stops to visit caves or to swim and enjoy the sunset on the sea. Dinner with fresh seafood! Overnight onboard.\nNote: the program may vary slightly depending on the final confirmed cruise \n"},{"title":"DAY 6: HALONG BAY – HANOI – FLIGHT TO DANANG – HOI AN (B/Brunch/-)","description":"The Vietnamese call the “South China Sea” by a point-oriented name “Eastern Sea”, so you may guess how miraculous it is seeing the sunrise over the islets of the Bay. The boat will take us to go about marvelous areas, where almost each islet has its own name, adopting its shape or reminiscent, including the Fisherman’s Head, Turtle, the Sail, the Incense Burner Rock, the cute Sea Dog Rock or Cock Fighting Rocks and so on. \nDisembark and transfer back to Hanoi around noon time by shuttle bus. \nOn the way, pick up by car to Noi Bai airport for your onward flight to Da Nang. \nUpon arrival at the airport, welcome from the local driver and transfer to the hotel in Hoian. Overnight in Hoian.\n"},{"title":"DAY 7: HOI AN ANCIENT TOWN (B/-/-)","description":"Breakfast at hotel. \nThis morning is for Hoian ancient town – when walking over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls and Trading Houses, Pagodas, and stroll around the market located by Thu Bon river, you may find out the same feelings of the artists, who see the charm of Hoi An a magical old world of Oriental feel and source of inspiration. \nAt leisure in the afternoon. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. Late afternoon is open for our optional tour by boat to a small ceramic village in Thu Bon River. Dinner at your own arrangement. Overnight in Hoian. \n"},{"title":"DAY 8: HOI AN – DA NANG – HUE (B/-/-)","description":"After breakfast at hotel, we will check out and depart to Hue by shuttle bus.  \nBeing recognized by UNESCO as the 1st Cultural World Heritage for Vietnam, Hue is highlighted by the old royal architectural works and the most traditional Vietnamese lifestyle. We will discover the charm of the city from the Royal Citadel, Forbidden City and Hue Royal Museum. Move on to the town of Phu Mong along the Perfume River to visit  Thien Mu Pagoda. Overnight in Hue.\n"},{"title":"DAY 9: HUE – HO CHI MINH (B/L/-)","description":"Breakfast at hotel. Rest until the time of transfer to the airport to take the morning flight to Ho Chi Minh. \nWelcome at Tan Son Nhat airport and transfer to the hotel to drop off luggage. We begin the city tour at the Reunification Palace. This large building is now a museum and Reception Hall for official visits. Near the Palace are the Central Post Office and the Notre Dame Cathedral in colonial style, the latter being built between 1877 and 1883 and one of the main attractions of the city. Lunch at local restaurant. Overnight in Saigon.\n"},{"title":"DAY 10: HO CHI MINH – FREE AT LEISURE (B/-/-)","description":"Breakfast at hotel.\nUnlike other towns in Vietnam where you often drive from one to another venue to choose different favourite goods, lots of typical oriental products can be collected in Saigon downtown. So today is your own day to walk and shopping around. Overnight in Saigon.\n"},{"title":"DAY 11: SAIGON – DEPARTURE (B/-/-)","description":"Breakfast at hotel. Free at leisure till transfer to the airport for your flight back home.\nEnd of services!\nPlease note: Hotel check-out time is at 12:00\n"}]},{"name":"Hanoi - Oasis Bay Classic 5Days/4Nights","duration":5,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":409,"summary":"Free packaged round trip transferOvernight on Board with Cooking classFree kayaking to explore tunnel cavesVery boutique hotel in Hanoi Old QuarterAll taxes & services charge included","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100147_40bbb1db.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100147_40bbb1db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_cd59773a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_7aa6e3da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_58a1ba4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_2d146bda.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_138610eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100147_f8a57112.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to your central hotel which is in the perfect location to explore Hanoi Old Town at your leisure. "},{"title":"Hanoi - Oasis Bay Classic Cruise (B, L, D)","description":"7:30 am to 8:30 am: Pick up at your hotel in Hanoi Old Quarter \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch local crafts being produced and grab a bite to eat\n12:00 pm reach Tuan Chau International Port and prepare for boarding\n12:30 pm Welcome on board have time to explore the vessel\n13:00 Welcome drinks, cruise information and check-in\n13:15 - 14:45 Lunch is served at the restaurant\n15:00 Visit Sung Sot Cave (1 hour)\n16:00 - 17:00 Cruise along Halong Bay\nAfternoon tea on the sundeck\nEnjoy an afternoon spa treatment*\nKayaking * option in Tung Sau Pearl Farm or Luon Cave\n17:00 17:45 Cooking demonstration on the sundeck\nAnchor at Coconut Tree Island for overnight stay\n17:45 - 18:45 Happy Hour on the sundeck*\n19:15 Dinner is served at the restaurant\n21:00 Happy Hour on the sundeck*\nEnjoy a spa treatment*\nBoard games & darts\nSquid fishing"},{"title":"Oasis Bay Classic Cruise - Hanoi (B, L)","description":"06:30 Tai Chi on the sundeck\n07:00 Coffee & tea with freshly baked pastries in the restaurant\n07:40 Visit Ti Top Island\n08:45 - 09:15 Bill settlement and check out\n09:00 Breakfast at the restaurant\n10:10 Traditional Vietnamese Tea Ceremony\n10:45 Return to Tuan Chau Marina\nCheck out before 11:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: We shall drop you back off at your hotel in Hanoi’s old quarter. We hope you had a legendary journey and hope to see you again! \n* Payable upon bill settlement and cabin checkout"},{"title":"Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). \n"},{"title":"Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Sapa and Ba Be lake 5 days 4 nights","duration":5,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":656,"summary":"If you are looking for an adventurous mountain trip packed with trekking and outdoor activities, this five-day trip in Sapa and Ba Be is the perfect tour for you. The rich and diverse landscapes combine mountains, rice paddies, lakes, rivers, waterfalls and caves giving you plenty of options for exploration. As well as the great range of activities on offer you will also develop your understanding of the rich varieties of cultures in Vietnam as you visit many different local villages.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/180489_278dcd28.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/180489_278dcd28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_5e43c3e812aad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_5e43c3e812ab0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_5e43c3e812ab1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_93e2a67d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_f708e5fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_05a4f124.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_de054192.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_bf35a735.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_e51f8ab9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_eed56b90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180489_5e43c3e812abe.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Hanoi - Sapa (L, D)","description":"Remote mountains and Halong Bay, trekking in Ba Be\nYou will be collected from your hotel in Hanoi at 08:00 for the five-hour drive to Sapa arriving around midday for lunch in a local Sapa restaurant. After lunch, you drive to Su Pan where you will start your trek to Ban Ho through rolling scenery of rice paddies and mountains. After two hours of trekking, you will arrive in a Tay village next to the stream in Ban Ho where you will have the opportunity to share cultural experiences with the families that live in the area. You will also enjoy local hospitality with dinner and an overnight stay in a homestay in Ban Ho.\n\nHighlights and activities: Sapa, Su Pan, Ban Ho, a 3- 5 km trek\nAccommodation: local homestay\nMeals: Breakfast, lunch, dinner"},{"title":"Sapa Trekking (B, L, D)","description":"Remote mountains and Halong Bay, Tay ethnic villages\nAfter breakfast, you will trek from Ban Ho to the villages of Thanh Kim and Thanh Phu where Dzao and Day ethnic minority live. These villages are not on the usual tourist route so you can enjoy the immensely beautiful views undisturbed. After stopping for a picnic lunch, you will drive approximately 30 minutes to Lao Chai – Ta Van. Here you will have time to appreciate the terraced rice fields belonging to the H’mong community and walk through the villages on the hill. You will return to Sapa Town in the late afternoon where you can enjoy dinner and stay overnight at a hotel in Sapa.\n\nHighlights and activities: Lao Chai, Ta Van, 10- 12 km trek\nAccommodation: Sapa Horizon Hotel\nMeals: Breakfast, lunch, dinner"},{"title":"Sapa - Ba Be National Park (B, L, D)","description":"Remote mountains and Halong Bay, Dau Dang waterfall\nTo reach Ba Be National Park from Sapa, you will travel through the wild and mountainous region of Ha Giang. After breakfast, the car will take you Bac Me where you can stop to enjoy the view of small villages and rice terraced fields, visit a local market and take some fantastic photos. You will stop for lunch along the way before continuing the journey through the Na Hang Nature Reserve, and finally arriving in Ba Be. Although this day is mainly spent driving the diverse and incredible landscapes more than make up for it. You will arrive in Ba Be in the late afternoon where you will have dinner and spend the night in Tay homestay in Coc Toc village.\n\nHighlights and activities: Ha Giang, Bac Me, Na Hang Nature Reserve, Ba Be Lake\nAccommodation: Mr Linh's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"Ba Be Trekking (B, L, D)","description":"Remote mountains and Halong Bay, forging village in Caobang\nToday you will trek through the sublime forests of Ba Be to some of the small and welcoming villages in the park. Firstly, your local guide will take you to visit Coc Toc Village where the Tay people make an income from fishing on the lake. You will cross the Pelu stream and on to more difficult and hilly terrain which will lead to a great vantage point with fantastic views of the park. As you journey further towards the uplands, you will stop in a H'mong ethnic village where you will have a picnic lunch. Your guide will then take you through the vast mountain ranges and valleys to see the stilt houses and school of the Dzao people along the trail to visit another H'mong ethnic village. You will then return to your homestay where you can enjoy a dinner of local home cooked food.\n\nHighlights and activities: Ba Be forests, H'mong ethnic village, a 13- 15 km trek\nAccommodation: Mr Linh's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"Ba Be Lake - Ha Noi (B, L, D)","description":"Remote mountains and Halong Bay, Ban Gioc waterfall\nAfter enjoying breakfast at the homestay, you will set out on foot to Bo Lu Harbour where you will board a boat for a three-hour boat trip touring peacefully around the lake.  This is a great time to jump into the water for a swim to cool off if the mood takes you. The trip will take you along the slow flowing river, giving you gorgeous views of the dramatic mountains, valleys and natural caves.  There is also a good opportunity here for some bird and butterfly spotting with Ba Be National Park being a haven for hundred of different species of wonderful winged creatures.  The boat will then take you through the tunnel of Puong Cave, with its spectacular array of stalactites and stalagmites. You may also get the chance to see some bats here as there is a large colony living in amongst the rock formations of the cave. You will then get the chance to rest on the trip back to Hanoi, stopping for lunch at a local restaurant on the way, arriving in Hanoi at about 17.30  where you will be let off at your hotel.\n\nHighlights and activities: Ba Be Lake, Boat trip, Puong Cave\nAccommodation: Not included\nMeals: Breakfast, lunch"}]},{"name":"COMBO: “ Mt. Fansipan – Lan Ha Bay Tour” 5Day","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":490,"summary":"As Southeast Asia’s highest peak, Mountain Fansipan (3,143 m) providing the perfect backdrop for some great trekking routes. Reaching the summit you be one of the few who have reached up and touched the clouds, marking the roof of Indochina.\nAnd Kayaking & Cruise Adventure Lan Ha Bay tour offers you great access to discover Lan Ha Bay different from regular tours. The cruise will escape crowded Halong bay, keep sailing toward Lan Ha Bay & Bai Tu Long bay where less touristy, quiet & cleaner, take you deep into natural wonders with various interesting activities: kayaking, swimming, biking, photographs, etc…\nThis COMBO: “Mt. Fansipan – Lan Ha Bay Tour” will give you the exciting experience to discover the best of Northern Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/188795_518462c9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/188795_518462c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_7261127c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_c8122b7a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_06c6bf70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_1fac92b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_dc1fba43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_5e509f37dde71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_5e509f37dde73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_5e509f37dde74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_5e509f37dde76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188795_5e509f37dde77.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Halong Bay"],"timeline":[{"title":"NIGHT 1: OVERNIGHT TRAIN TO LAO CAI","description":"9 pm: Our guide will pick-up you at the hotel, transfer to Hanoi Railways station for overnight train to Lao Cai"},{"title":"DAY 1: SAPA – TRAM TON – 2800M (B, L, D)","description":"5-6am: Arrive at Lao Cai Station. You will be greeted by our local team and transferred to Sapa. Breakfast will be provided in a local restaurant in town.\n\n8:30 am: After breakfast, Begin“ Mt. Fansipan – Lan Ha Bay Tour”, you are having a couple of interesting trekking days waiting ahead.\n\nYou travel pass by car toward the Silver & Love Waterfall. You will then drive further to Tram Ton Gate, the highest peak of roads on O Quy Ho Pass – one of the four greatest passes in Vietnam. From there you can see Mountain Fansipan, the highest peak of Indochina mountains as well as enjoy stunning views. The trek will be relatively soft until lunchtime. After a couple of hours of hiking, you will have a break at a nice spot in the forest and enjoy a good lunch.\nWith new energy, you start ascending as well as descending towards the campsite. En route, you have many opportunities to enjoy the scenery and magnificent views to Sapa area and beautiful landscape of Lai Chau province. You will arrive at the campsite at 2800m ASL in the late afternoon. Now it is time to relax and enjoy a well-prepared dinner.\nSummary\nTrekking:   5 hrs/ascend 2,800 m from 1,900 m\nAccommodation:  Camping\nMeals:    Breakfast, Lunch, Dinner"},{"title":"DAY 2: 2800M – THE TOP OF MOUNTAIN FANSIPAN – TRAM TON – SAPA (B, L, -)","description":"After having breakfast, you climb to the top, where you can celebrate your victory. From there, you can enjoy the best view of beautiful sceneries.\n\nYou will then trek through the rainforest to go back to the campsite for lunch.\n\nAfter lunch, you start your journey back. You follow the trail as well as stone steps built by Hoang Lien National Park until you meet your car, which is there to take you back to Sapa. In the afternoon you will arrive back in Sapa, where you can celebrate your achievement and relax.\nCheck-in hotel and  Free dinner and night at Sapa Town.\nSummary\nTrekking:   7,5 hrs/ascend 3,143 m to Sapa\nAccommodation:  Hotel\nMeals:    Breakfast, Lunch"},{"title":"DAY 3: MOTORBIKE (OR TREKKING) AROUND SAPA. TAKE THE TRAIN BACK TO HANOI (B, L, – )","description":"Wake up in Sapa town, breakfast at the hotel then enjoy a motorbike day tour to explore the other side of Sapa Town…\n\nIn this morning, we’ll start our motorbike tour by riding our motorbikes down the valley to visit Lao Chai village of BlackH’Mong people. Experiencing the richest traditional culture of Black H’Mong people in the region. Then continue riding a bit to visit the Zay minority at Ta van, where is far 12km Sapa town.\n\nSpend time to enjoy the picturesque scenery along the way, a mountainous area of stunning natural beauty and diverse ethnic minorities. We will keep on riding down the hill, enjoy the fantastic open views in Ban Ho the most beautiful valley in which we spent a night on the bamboo house of Tay people. The rest of the time, we’ll take a short walk to the nearby waterfall for sightseeing and experiencing the daily activities of the locals.\nCome back Sapa Town by 4:30 pm, take the sleeping bus OR train back to Hanoi .\nSummary\nMotorbike: 20km\nAccommodation: Train\nMeals:    Breakfast, Lunch"},{"title":"DAY 4: HA NOI – LAN HA CRUISE (B, L, D)","description":"7h45 – 8h15: Our professional tour guide and experienced driver will pick you up at your hotel. Driving you through the red delta river which you have a real chance to see more about local life, especially our driver will make stops on halfway for the rest where we can check-in onboard for you & you also can might deeply understand how hard the disable and the agent orange manage to do hand made to their save life.\n\n12h – 12h15: Arriving ha long harbor we will transfer you to the cruise by speed boat. Enjoy welcome drinks & fresh towel.\n\n13h00: Check-in your cabin. Enjoy fresh seafood lunch. The cruise will escape crowded Halong bay, keep sailing toward Lan Ha Bay & Bai Tu long bay where less touristy, quiet & cleaner than Halong Bay. You will have a chance to take photographs when we passing amazing islands, islets, beaches: Finger islet, Frog islet, Teapot islets, Dark & Bright cave…\n15h00: Kayaking around Dark & Bright cave area which are located underwater millions of years ago & you may even see wild monkeys. This is also the most beautiful lagoon in Lan Ha bay for kayaking activities. If you don’t like to do kayaking, you can sit on the sampan boat which is controlled by fisherman to go around.\n17h00: back to the boat, go up the huge sundeck & enjoy small sunset party with local fruits & tea. You will have a chance to jump off from the boat into the emerald water, swimming in freestyle.\nThe Cruise will anchor at the tranquil lagoon among Bai Tu Long Bay & Lan Ha Bay\nOur Barbecue dinner will be served on the top deck (if the weather permits) or at the cozy restaurant with fresh seafood\nEvening: You can enjoy Squid fishing, karaoke, dancing, using bar services, play funny games…\n17:00:  Bar opens for Happy Hour(buy 2 get 1 for free) while cruising to Ho Dong Tien area where the boat with anchor overnight.\n18:00: Cooking demonstration with traditional Vietnamese food on the sundeck\n(Will be in the restaurant if the weather does not allow)\n19:30:  Dinner will be served with Authentic Vietnamese Cuisines\n21:00: Free time to joining movies in the restaurant, board’s game or squid fishing.\n"},{"title":"DAY 5: LAN HA CRUISE – HA NOI TOUR THE END (B, L)","description":"Waking up for a new day to enjoy the sunrise and recharge your energy with fresh breakfast, tea, a coffee & cake which is ready to serve you from 7h00 – 8h30.\nFollowing the unique route will lead you to visit a small beautiful lagoon with some original floating house where we experience daily life & culture, go catching fishes with nets & local people. If you catch fishes, you & our chef will cook for a fun meal. This is amazing activities which only our cruise arranges. Or you can relax & enjoy a calm morning on the boat, swimming around the cruise in the emerald water.\nAround 9h30: Back to the Lan Ha Legend boat, check-out time & enjoy a cooking class (Vietnamese Spring Roll making) when the boat cruising back to Harbour\nAn early lunch will be served on boat before arriving at the Habour.\n12h30: Disembark & back to Hanoi\nCheck out before 12:30 am\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: We shall drop you back off at your hotel in Hanoi’s old quarter. We hope you had a legendary journey and hope to see you again!"}]},{"name":"Vietnam Family Holiday Comfort","duration":13,"travelStyle":["Family","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1695,"summary":"With its friendly locals, delicious food and incredible scenery, Vietnam is the ideal place for a family adventure. Stroll the winding streets of Hanoi’s Old Quarter, laugh yourself silly at the water puppet theatre at Hoan Kiem and see ancient temples and pagodas alongside modern houses from a cyclo. Barter with stallholders at a floating market, explore the Forbidden Purple City and eat all the pho you can handle. With 13 days to adventure from the towering limestone karsts of Halong Bay to the frenetic markets of Ho Chi Minh City, you and your gang will get all the highlights of vivacious Vietnam in one neat package. This is Vietnam, so days are hot and sticky, and nights can get quite cool! Be sure to wear layers, use adequate sun protection and drink plenty of water.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/83441_2f522d85.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/83441_2f522d85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_6144a077.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_62264ef9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_c2909dae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_a3b87ae2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_6780de60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_2dd8f948.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_e0f578c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_f58708e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_9a931bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_bdafe401.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_5acaa185.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_32db8701.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_369b99f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/83441_bcbf6b09.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. You will be transferred from the airport to your hotel, and your adventure begins with a welcome meeting at 5pm. Afterwards, enjoy a welcome dinner with your fellow families. Hanoi is famous for its beautiful lakes, shaded boulevards, verdant public parks and thriving Old Quarter. The latter is a veritable architectural museum piece that feels like a 1930s provincial French town – a great place to explore today if you have time.\nAccommodation: May de Ville City Centre Hotel or similar"},{"title":"Day 2: Hanoi","description":"Embark on a full-day tour of the city. You will visit the Ho Chi Minh Mausoleum and Museum, and the tranquil Temple of Literature – an oasis of calm in the heart of town. Also head to the Museum of Ethnology to learn more about the diverse heritage of Vietnam. Enjoy some lunch at the KOTO restaurant – an excellent establishment and long-time friend of Intrepid which lives by the philosophy of 'know one, teach one'. It supports underprivileged local youth by giving them a chance at making a career in hospitality. In the evening, sit down to a traditional water puppet performance. This northern tradition, dating back nearly a thousand years, is performed alongside traditional Vietnamese music that employs drums, wooden bells, horns and bamboo flutes.\nAccommodation: May de Ville City Centre Hotel or similar"},{"title":"Day 3: Halong Bay","description":"Travel by minibus to the spectacular World Heritage-listed site of Halong Bay (approximately 4 hours). The bay is a breathtaking secluded harbour with some 2000 limestone islands jutting out of the waters of the Bac Bo Gulf. Board your private boat and cruise among the dramatic limestone peaks. There's an opportunity to swim in the famous Vietnam East Sea and explore caves filled with stunning stalactites and stalagmites. Spend a peaceful night on board, beneath a sky alive with stars.\nAccommodation: Overnight Boat "},{"title":"Day 4: Hue","description":"Enjoy breakfast on the boat this morning and perhaps head out for an optional early morning kayak. Return to Hanoi by bus (approximately 3.5 hours). From there you will board an overnight train bound for Hue. As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past. It's a curious mix of bustling streets and tranquil settings. Although conditions are basic on your train journey, overnight trains are a classic South East Asian experience and the best way to travel long distances with the locals. Lie back and enjoy the ride! Most trains have a dining carriage serving simple food, but it's a great idea to stock up on fresh bread, cheese and fruit before you head off.\nAccommodation: Overnight Sleeper Train"},{"title":"Day 5: Hue","description":"As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past. It's a curious mix of bustling streets and tranquil settings. As well as the Imperial Citadel, you will visit the Forbidden Purple City, which was almost totally destroyed during the American War's Tet Offensive. The gaping holes left by bombs give an idea of the destruction wreaked upon the country during the war. Thankfully the ruins are now World Heritage protected and being restored.\nAccommodation: Cherish Hotel Hue or similar"},{"title":"Day 6: Hue","description":"Enjoy a dragon boat cruise along the Perfume River to visit the royal tomb of Emperor Tu Duc. The tomb is set amongst 12 hectares of parkland that has been carefully decorated with frangipani and pine trees, tranquil lakes and impressive architecture – much of which survived the ravages of time and war. While you're here, take the opportunity to learn a little more about this figure who opposed the French involvement in Vietnam. You can also try your hand at making incense sticks and see how Hue’s unique conical ‘poem’ hat is made from palm leaves. You will also visit Thien Mu Pagoda, considered by many to be the unofficial symbol of Hue. It has been an active Buddhist site since 1601.\nAccommodation: Cherish Hotel Hue or similar"},{"title":"Day 7: Hoi An","description":"Travelling by bus (approximately 4 hours), head south through coastal rice paddies before traversing the spectacular Hai Van Pass. You'll all be treated to some stunning mountain scenery en route. After a brief visit to the beautiful China Beach, arrive at Hoi An. Recently declared a World Heritage site, Hoi An and its delicate beauty is being restored and preserved. Known as Faifo to early Western traders, it was one of South East Asia's major international ports during the 17th, 18th and 19th centuries. Today, parts of it look exactly as they did more than a century ago – it's the sort of place that grows on you the more you explore it.\nAccommodation: Hoi An Riverside Resort & Spa or similar"},{"title":"Day 8: Hoi An","description":"After breakfast, head out to spend the morning at Cua Dai beach. This beach is known for its stunning palm-fringed white sand and views of the Cham islands. Transfer back to town for lunch, before spending the afternoon learning how to make wonton cake. This hands-on experience is one the whole family will enjoy!\nAccommodation: Hoi An Riverside Resort & Spa or similar"},{"title":"Day 9: Hoi An","description":"The rest of your time is left free to relax in this beautiful area. You could take a taxi or make the easy five-kilometre bicycle ride through the rice paddies and shrimp ponds to Cua Dai beach. Alternatively, Hoi An is one of the best places to shop for souvenirs, especially if you’re looking for t-shirts, paintings or ceramics. For those interested in getting clothes tailored, this is definitely the place to shop. You might also like to speak to your leader about arranging a cooking lesson and learn about the many layers of fresh herbs and flavours that can be found in Vietnam's fresh and tasty cuisine.\nAccommodation: Hoi An Riverside Resort & Spa or similar"},{"title":"Day 10: Ho Chi Minh City","description":"Take a short flight to Ho Chi Minh City (approximately 1 hour). Formerly known as Saigon, this bustling metropolis is full of vibrant sights and sounds; a fascinating blend of old and new. Check out Ben Thanh Market and feast on a delicious lunch of local street food, and take an orientation walk. Afterwards, you're free to explore the city as you please. Your leader will have plenty of interesting ideas for you and your family. Consider scooting off on cyclos to Cholon, the Chinatown area of Ho Chi Minh City, or for a bit of temple-hopping. Otherwise, you could visit the Vietnamese version of a department store for some serious shopping.\nAccommodation: Huong Sen Hotel or similar"},{"title":"Day 11: Mekong Delta","description":"Head down to the Mekong Delta and visit unexplored Ben Tre where coconut is everything and anything. The journey to Ben Tre is south by private bus (approximately 2.5 hours). The fertile delta is famous for its abundant harvests of tropical fruits and flowers. On arrival, board your private boat and cruise along the maze of waterways to visit some local cottage industries. This is a fascinating behind-the-scenes look at a different part of the local economy. Then head to your overnight homestay by the water. Be invited into a family home for a true local experience – a chance to see daily life from the inside. You'll be sleeping on simple camp beds in dorm-style rooms, with all meals included. Bedding and mosquito nets are provided.\nAccommodation: Homestay"},{"title":"Day 12: Ho Chi Minh City","description":"Rise early, as the locals do here on the delta. Enjoy a leisurely morning before heading back to Ho Chi Minh City on the bus. On arrival, you'll have free time to further explore the city at your own pace. This is an opportunity to do anything you might have missed the first time around. District 1 is a great place to walk around with the family. If you've fallen in love with Vietnamese food, sample some of the culinary delights you haven't got around to yet – perhaps some grilled cuttlefish or, for the adventurous, street-barbecued sea snails.\nAccommodation: Huong Sen Hotel  or similar"},{"title":"Day 13: Ho Chi Minh City","description":"There are no activities planned for the final day and you are able to depart the accommodation at any time, provided you comply with the hotel’s internal check-out policies."}]},{"name":"Vietnam at a glance: Hanoi - Ninh Binh - Halong Bay - Mekong Delta - Ho Chi Minh City.","duration":7,"travelStyle":["Flexi","Group","Partially Guided","Holiday"],"oldPrice":1060,"price":541,"summary":"Good morning Vietnam! \nThis excursion brings you to Vietnam at a glance within 7 days. You will have a unique experience of Vietnam's two largest cities of Vietnam including Hanoi capital city and the bustling Ho Chi Minh city, plus the UNESCO world natural heritage site Ha Long bay and the nature beauty of countryside Ninh Binh province. Lets go!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/192807_5e3952576d6ce.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/192807_5e3952576d6ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e39525784fed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e395257894a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e3952578da20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e39525792145.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e39525796dbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e3952579b87b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e3952579fefa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e395257a5c73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192807_5e395257aab3a.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Hanoi Capital.\nUpon arrival, please go to custom desk as your first point of entry into the country and\npresent these documents for visa upon arrival. After collect visa and luggage, Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag.Or You can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.( Meal None/ Overnight in Hanoi Hotel)"},{"title":"HANOI - HIGHTLIGHT SIGHTSEEING FULL DAY(B/L)","description":"The pick-up starts from 7.30 am to 8 am.  The colonial capital city Hanoi is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago. This full day tour takes you around Hanoi's most interesting sights, including the Ho Chi Minh Complex: Ho Chi Minh's Mausoleum and his Stilts House, Presidential Palace and the One Pillar Pagoda nearby, and the Old Quarter also known as the 36 streets and guilds. Also on the tour - the Lake of the Restored Sword and Ngoc Son Temple, the Temple of Literature, peaceful West Lake with lovers street Thanh Nien, the sedate Tran Quoc Pagoda and one of the city's museums, either the History Museum or the Ethnology Museum.  Please note that the HCM Mausoleum is closed on Fridays and Mondays and most museums are closed on Mondays. (Meals: breakfast, lunch/ overnight in Hanoi Hotel)"},{"title":"NINH BINH DISCOVERY WITH HOA LU ANCIENT CAPITAL AND TAM COC SAILING(B/L)","description":"8.00-8.30 am: Tour guide will pick you up from your hotel in Old Quarter to depart to Ninh Binh city\n10.30-11.00 am: You will reach Hoa Lu Ancient Capital.\nIn 968, Dinh Bo Linh declared himself as the King. Since then Hoa Lu existed as the capital for the next 41 years (968 – 1009), of which 12 years was under the Dinh dynasty – King Dinh Tien Hoang, the country named Dai Co Viet, and 29 years later was under the Le dynasty – King Le Dai Hanh. In 1010, King Ly Thai To moved the capital from Hoa Lu to Thang Long – present day Hanoi. Hoa Lu became the old citadel. In Hoa Lu there are now 2 temples have been built on the ground of the old royal palace, one is dedicated to King Dinh Tien Hoang, the other is to King Le Dai Hanh. The visit offers a chance to know more about part of feudal dynasties and historical periods in Vietnamese history.\n12:00 pm: Today you will enjoy buffet lunch at local restaurant in Tam Coc. The food is served with Asian style, local dishes, organic vegetable. The restuarant is located on the river overview Tam Coc, you can enjoy the view of overall riverside until you finish your lunch\n1:30 pm: After finishing your lunch, you will be taking the rowing boat at Tam Coc Harbour. Arranged by local people here, the boat is rowed by both hand and legs. The boat will take you to 3 specular caves with hundreds of limestones on the way. If you travel during harvest season, you will see many terrace rice fields in golden colors.\nThe boat rowing will be in around 2 hours. Not only you could see the peaceful scenery of mountain, rice paddy fields, temples, you also have chances to learn about local people cultures on their daily life.\nBefore going to the bus, you will have a chance to biking throungh local village to discovery the village daily life in the nature beauty of linestone mountain among waterway.\n4:00 pm: leave Tam Coc and drive back to Hanoi. Arrive Hanoi at around 6:30 pm. Finish unforgettable full day trip at your hotel in Hanoi(Meal: Brekfast and Lunch/ Overnight in Hanoi Hotel)\n\n"},{"title":"A JOURNEY TO THE WORLD HERRITAGE SITE - HALONG BAY(B/L/D)","description":"•\t07h45: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n•\t10h00: Stopover on the way for a refreshment break.\n•\t12h00: Embark at Ha Long wharf – Break and photography time\n•\t12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n•\t13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n•\t15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n•\t19h00: Vietnamese style set dinner is served on board.\n•\t21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat.(Meal: Breakfast, Lunch and Dinner/ Overnight on Cruise)\n"},{"title":"HALONG BAY MORNING ACTIVITIES - FLY TO HO CHI MINH CITY AFTERNOON(B/L)","description":"•\t07h30: Have breakfast and enjoy sunrise on the bay.\n•\t09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n•\t10h30: Have lunch while cruising back through Ha Long Bay to the pier\n•\t11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n•\t12h00: Return from Ha Long to Hanoi.\n•\t14h00: Stopover on the way for a refreshment break.\n•\t16h00: Arrive in Hanoi. End of the trip.\nNote: in case of bad weather (the boat is not allowed to push off or not allowed to overnight in the sea), the Ha Long bay tour could be cancelled without notice. We will consider other replacement tour or refund based on the specific circumstances.  Go straight to the airport for your flight to Ho Chi Minh city – called by Sai Gon. (Meal: Breakfast, Lunch. overnight in Ho Chi Minh city Hotel) "},{"title":"MEKONG DELTA DISCOVERY WITH BEN TRE COCONUT LAND(B/L)","description":"Mekong Delta Gateway Day Trip starts at 8:00 am from the lobby of guests's hotel in Saigon with a drive to My Tho, the capital of Tien Giang Province 72 kms from Ho Chi Minh City (Former Saigon) Guests will take time to visit Vinh Trang pagoda, the most beautiful pagoda of the province with mixture structure of many styles. Then take a boat trip around 4 beautiful islets: Dragon, Unicorn, Phoenix and Tortoise. These evergreen islands among the Mekong River still remain unknown to many people. You will discover beautiful landscapes along the river and observe the typical Mekong delta rural life. Stops on the way can be made upon request for particular visits or photos making. Visit traditional house at Quoi An village (all made of coconut). See coconut collection set and how locals make handicrafts from trunk and shell, guests can see that they waste nothing, coconut is even useful for weddings and funeral. Enjoy seasonal fruit and listening to traditional music. Take horse cart on village path and stop at Ben Truc orchard, taste honey with tea or Mekong whisky (they have a funny rule for guests to get in). Take rowing-boat on water palm creek. Take boat to visit coconut candy mill (special product of Ben Tre province). Enjoy fantastic lunch at local restaurant before coming back to Saigon. (Meals: breakfast, lunch/ overnight in Ho Chi Minh city Hotel)"},{"title":"HO CHI MINH DEPARTURE TO HOME(B)","description":"Depending on your flight time, you will have leisure time which is arranged by yourself for the last waking, cycling around, shopping souvenirs or handicraft products or having coffee as a local for the last time before we take you to the airport for your flight.  End of the service at the airport Goodbye and safe travel. (Meals: breakfast)\nThank for traveling with us!!!"}]}]