[{"name":"Vietnam Scenic Tour from Hanoi, Halong Bay via Hoi An to Saigon, Mekong Delta","duration":12,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1280,"summary":"This unique 12-day tour covers all the highlights of Vietnam (from north to south). Start in the Vietnam’s Capital to admire its hidden charms followed by the tranquility among the amazing limestone karsts of Halong Bay. Whisper to the ruins of the Purple Forbidden City in fascinating Hue to track back the history. Shop in the colorful Hoi An. Then heading south to the bustling city of Ho Chi Minh, the mighty Mekong Delta and the legendary Cu Chi tunnels. This Tour is perhaps the most comprehensive travel experience on offer anywhere in Vietnam...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129806_86598538.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129806_86598538.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_da30378b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_81986d50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_fe6a97c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_1a6c3d0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_76474bf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_123d6e32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_9e50dc94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129806_971ec909.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"DAY 1: HANOI ARRIVAL (-/-/-)","description":"Upon arrival in Noi Bai Airport, you’ll receive cordial welcome and comfortable transfer to hotel. If time permits, enjoy an orientation tour by cyclo around the old quarter streets, an interesting introduction of the city. Like other big cities, Hanoi is hustling and bustling, with thousands of people riding motorbikes, the most convenient means of transportation in the city.\n\nO/N in Hanoi."},{"title":"DAY 2: HANOI FULL DAY OF SIGHTSEEING TOUR (B/-/-)","description":"Today you’ll be on a full day tour to discover the most outstanding attractions of Hanoi. First, pay a visit to Cho Hom, the local market, to get caught up in the lively atmosphere. This is where the city dwellers come daily to purchase the local food, fruits, vegetables, flowers, fish, seafood, meat, and household appliances.\nThen, continue to the complex of memorials to Ho Chi Minh to know his amazing life. Next is the One Pillar Pagoda and the Temple of Literature to gain understanding of the two driving forces in Vietnam culture. Afternoon we visit the Museum of Ethnology which exhibits a large collection of artifacts about the cultures of the 54 ethnic groups in the country. Alternatively, you can swap to visit the historical museum instead, an excellent collection of artifacts illustrating the Vietnamese history.\nHustle back to the peaceful Hoan Kiem area since there is a water puppet show at the popular Thang Long Water Puppet Theater awaits. Water puppet is a unique traditional art form and expression of cultural identity. The shows capture Vietnamese traditions; farming, tending buffaloes, and catching fish; entertainment, like swimming contests and lion dancing; and historical legends with traditional music. The one-hour show is a fun and insightful look into Vietnamese culture enjoyed by both adults and children.\n\nO/N in Ha Noi"},{"title":"DAY 3: HANOI –HALONG BAY –OVERNIGHT ON BOAT (GROUP TOUR) (B/L/D)","description":"07:45 :    Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30 :   Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30 :    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding our Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30 :   Great lunch is served while cruising passing by islets.\n15:00 :   Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30 :   Happy Hour. Buy 2 beverage get 1 for free\n18.00 :   Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30 :  Enjoy Sunset Party with fruits and tea\n19:30  :  Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00 :   Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\n\n* Meal code: (B,L,D)\n * Services: Bus transfer, English Speaking Guide, Entrance fees, Boat trip"},{"title":"DAY 4: HALONG BAY- HANOI (B/L/-)","description":"06:15 : Tai Chi class on the Sun-Deck\n07:15 : Have light breakfast with Coffee, tea, and bakeries on board\n07:45 : Arrive at the Surprising cave , the biggest cave in Ha Long Bay with 10,000 square meters, when you visit the cave like our Vietnamese house with three chambers as lobby, dining room and bedroom with most beautiful stalagmites and stalactites. We will tour the cave for about 60 minutes.\n09:00 : Upon return to the boat you will have time to freshen up and finish packing. When checking out please remove all of your belongings from the cabins, you may leave heavy luggage outside of the cabins.\n10:00 : Relaxing on the sundeck or in the dining room enjoying the bay scenery as we approach the pier\n10.45 : Lunch is served.\nAfter lunch, relax on the sundeck or in the dining room enjoying the bay scenery as we approach the pier.\n11:45 – 12:00: Shuttle Bus back to Hanoi\nFree time to visit and relax in Hanoi\n\n* Meal code: (B,L)\n* Services: Boat trip, English Speaking Guide, Entrance fees, Bus transfer, Daily room in Hanoi hotel, Train ticket.\nO/N in Ha Noi. "},{"title":"DAY 5: HANOI – FLIGHT TO HUE –HUE SIGHTSEEING TOURS (B/-/-)","description":"After breakfast at hotel, transfer to Noi Bai airport for a short domestic flight to Hue. Upon arrival we visit the Imperial Citadel. And then we enjoy a boat trip on the Perfumes River to visit the beautiful riverside Thien Mu Pagoda – one of the oldest ancient architectural structures for religious work ship in Hue. We also have an enjoyable visit to the mausoleum of Emperor Minh Mang in a tranquil setting of gardens and lakes.\nThis impressive landmark reflects the beautiful architecture, intricate decor and mysterious statues. The sightseeing tour of Hue also includes with a walk to the bustling Dong Ba Market that sells a wide variety of local goods and handicrafts. Along the way we pass many fantastic eating spots, all ideal for visitors to sample some local delicacies. \n\nO/N in Hue."},{"title":"DAY 6: HUE CITY TOURS – DANANG STOPOVER TOURS – HOI AN SIGHTSEEING TOURS (B/-/-)","description":"In this morning, before leaving for Danang we will take a short drive though the rolling hill to see the elaborate royal tomb of Emperor Tu Duc and the famous Tu Hieu Pagoda. The scenic 4-hour drive via Hai Van Pass offers spectacular views of mountains, the sea, idyllic beaches and villages (we can choose the shorter way by driving through the tunnel).\nUpon arrival Da Nang, we will take a visit to Cham Museum formerly known as the Ecole Francaise d’Extreme Orient. This museum contains many exquisite limestone carvings from the vanquished Kingdom of Champa which has been the central coastal littoral prior to the march of the Vietnamese nation southward. Then a visit to Marble Mountains with its beautiful grottoes and temples whose peaks represent the five elements of the universe. Later on, we keep on rolling further southward to Hoi An, which was originally one of major trading centers of Southeast Asia in the 16th century.\n\nO/N in Hoian.\n"},{"title":"DAY 7: HOI AN SIGHTSEEING –RELAXING (B/-/-)","description":"This morning is spent visiting Hoian, which was originally one of major trading centers of Southeast Asia in the 16th century. Hoian that is peacefully located by the Thu Bon River attracts the visitors by its low tiled houses of Chinese appearance, Japanese covered bridge, brightly painted temples and pagodas.           \nThis afternoon is free and easy for your independent exploration.\nO/N in Hoi An."},{"title":"DAY 8: HOI AN –FREE &EASY (B/-/-)","description":"Today is free. After breakfast at hotel, you will spend the time as you wish. You may relax by the hotel beautiful pool, walk in the town market or enjoy yourself on the sandy beaches.\nO/N in Hoi An."},{"title":"DAY 9: HOI AN –FLIGHT TO SAIGON –SIGHTSEEING TO CU CHI (B/-/-)","description":"After having breakfast at hotel, you will be transferred to Da Nang airport for a short morning flight to Ho Chi Minh. On arrival you are met by our guide and transferred to the legendary Cu Chi like –web underground tunnel network which was used as the base from there the Vietnamese mounted their operations of the Tet Offensive in 1968.\n5The Cu Chi tunnels consist of more than 200km of underground tunnels. This main axis system has many branches connecting to underground hideouts, shelters, and entrances to other tunnels, the tunnels are between 0.5 to 1m wide, just enough for a person to crawl along.\n\nO/N in Saigon."},{"title":"DAY 10: SAIGON –CAI BE, VINH LONG IN MEKONG DELTA (B/L/-)","description":"Head south to the Mekong Delta, where evergreen islands stand amidst the intricate network of meandering rivers. The Cai Be floating market is unlike any you’ve ever seen, with the vendor’s wares being displayed as they hang from large poles on the bow of the boat. Lunch in a superb colonial villa nestled inside a quaint village before returning by boat and car to the big city.\n\nOvernight in Saigon."},{"title":"DAY 11: SAIGON CITY TOUR ½ DAY –FREE AFTERNOON (B/-/-)","description":"This morning is spent discovering Saigon. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. Start with a visit to the Reunification Palace. This mansion was the former residence of the President of South Vietnam until end of April 1975.\nClose to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. The final stop is Ben Thanh Market where anything and everything is for sale!\nThis afternoon is free at your leisure.\nOvernight in Saigon."},{"title":"DAY 12: DEPARTURE","description":"After breakfast, free until transfer to the airport for your departure flight home."}]},{"name":"Classic Vietnam 21 days 20 nights","duration":21,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2180,"summary":"The classic tour in Vietnam 21 days allows you to experience the finest spots that Vietnam has to offer. During the tour, you will discover not only the wonder’s of Hanoi but also the see the stunning beauty of Halong Bay, the rolling green mountains of Sapa, the historical Hue and Hoi An, the mighty Mekong Delta, and the bustling city of Ho Chi Minh.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186428_92936c8b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186428_92936c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_0b653f65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_af7b4209.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_e7ec44d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_54e40033.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_fce5b455.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_88ab2424.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_4be0948d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_5beff4b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_7eb8ff4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_1893db55.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_565cb417.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_e12f059a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_86efdd6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_9db1152b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_a8c32869.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_5e3d40757e930.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_5e3d40757e932.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186428_5e3d40757e934.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Ninh Binh","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre","Can Tho"],"timeline":[{"title":"Hanoi Arrival","description":"You will be met at the airport by your guide who will be on hand to make sure your trip gets off to a fantastic start. We will then take you to the heart of Hanoi, The Old Quarter. Be sure to look out for the world’s longest mosaic which depicts some iconic Vietnamese traditional stories and offers a glimpse into the vibrancy and creativity of Hanoian culture. Once in the Old Quarter, you will be escorted to your three-star hotel where you are free to relax and take in the atmosphere. The architectural melting pot of Hanoian buildings creates an eclectic and fascinating glimpse into its history and the city pulses with the energy of the streets."},{"title":"Experience Hanoi (B/L)","description":"This first day allows you to explore Hanoi at your leisure. During this time you can really drink in the ambience of downtown Hanoi. Whether you choose to delve deeper into Hanoi’s history at the many museums, sample the local delicacies at the plentiful restaurants or shop for beautifully crafted souvenirs, you won't be short of inspiration. Allow yourself to become immersed in the culture and you will be astonished what it has to offer. After a day of exploring, you can take well-earned rest in your hotel."},{"title":"Hanoi City Tour - Lao Cai (B/L/D)","description":"During day three you will visit the highlights of Hanoi on our carefully composed tour. Your first stop will be the Buddhist temple of Tran Quoc Pagoda which is one of the oldest temples in Hanoi.\n\nAfter this, you will take a glimpse into Vietnam’s history with a trip to the Ho Chi Minh complex. This vast park is home to Ba Dinh square where Ho Chi Minh read the Independence Declaration, the Mausoleum of Ho Chi Minh, Ho Chi Minh’s stilt house and the Presidential Palace.\n\nYou will then stop for lunch at one of our favourite spots for some flavoursome Vietnamese food.\n\nAfter lunch, you will unearth some Vietnamese culture in Hanoi’s Temple of Literature.\nThe stunning traditional architecture of this temple plays host to some of Vietnam’s finest creative minds. The beautifully preserved gardens and statues of Confucius will escort your mind back to the 11th century when this Temple was founded by Confucius (Khong Tu). \n\nThe finale of day three is a trip to the theatre where you will enjoy the water puppet performance, a traditional form of entertainment loved by Vietnamese people and tourists alike. The wooden puppets are used to tell stories of daily life in rural Vietnam.\n\nAfter dinner, you will travel to Hanoi’s train station where you will embark the night train at 21:30, reaching Lao Cai station."},{"title":"Trekking In Sapa (B/L/D)","description":"You will arrive at Lao Cai train station at 06:00, the perfect time to discover the rambling mountains and undulating rice paddies. From here you will trek to the H’mong ethnic villages of Lao Chai and Ta Van. The breathtaking scenery really comes to life when you meet the people that living there. You will trek approximately 12-13km over the course of one day. This will really allow you to experience the stunning scenery. The trek will be rewarded with an overnight stay in a homestay in Ta Van village."},{"title":"Sapa - Hanoi (B/L/D)","description":"Your adventure will continue as you trek to Giang Ta Chai and Supan village both inhabited by H’mong ethnic locals. You can drink in the fresh countryside air as you trek through the luscious countryside and uncover the local traditions of the of the mountains and it’s inhabitants. After sampling some of the local delicacies, you will travel back to Lao Cai train station for your return journey to Hanoi."},{"title":"Hanoi - Ninh Binh (B/L/D)","description":"You will be welcomed by your guide and driver who will take you to a local restaurant to have some breakfast and relax. After that, a 90km drive south of Hanoi will lead you to Ninh Binh, the site of the first capital city of ancient Vietnam before Hanoi took its leading role in the 11th century. The area famed for its dramatic and invigorating scenery of large flat land punctuated by karst peaks, glassy rivers and caves. \n\nThe discovery of Ninh Binh starts with a boat trip in Van Long where spectacular limestone karsts jut out from the green paddy fields reminding us of Guilin (China) and Halong Bay of Vietnam. The trip will continue with a visit to the site a 10th-century palace belonging to the king of Vietnam where you can walk amongst the wooden temples dedicated to the kings of the Dinh and Le Dynasties. Dinner and overnight at hotel in Ninh Binh."},{"title":"Ninh Binh - Halong Bay (B, L, D)","description":"After breakfast, you will travel to Halong Bay, one of the two earliest World Heritage Sites in Vietnam as designated by UNESCO in 1994. You will take a short break on the way and board your boat at noon. Enjoy a lunch of fresh seafood whilst floating amongst the breathtaking bay which is decorated with thousands of picturesque rocks, islets, beaches and hollow islands. You can stop to visit some karst grottoes, go swimming or explore the beaches. Your day will end with enjoying the sunset over the sea and eating a delicious dinner onboard the boat. You will stay overnight on the boat."},{"title":"Halong Bay - Hanoi (B/L/D)","description":"The climax of your Halong Bay trip is a visit to Titop Island, its sandy beaches and crystal clear waters create a relaxing ambience to end the cruise. You will disembark the cruise at midday and return to Hanoi for another night in the hotel in Hanoi."},{"title":"Transfer to Hue (B)","description":"Day nine will be spent travelling from Hanoi to Hue. You will be met at Hue airport where you will be transferred to your next hotel. Our staff will be on hand to ensure a straightforward and stress-free journey."},{"title":"Hue City Tour (B/L/D)","description":"Our driver will pick you up between 07:30 - 08:30 and will take you on a sightseeing tour of Hue. \n\nThe first stop is the tomb of the emperor Tu Duc. A fantastic example of Vietnamese architecture, the tomb is set in two main areas; the tomb area and the temple area.\n\nSecondly, you will visit the tomb of Khai Dinh, the twelfth king of the Nguyen Dynasty. This tomb, although smaller than some others, is known for its intricacy. The mix of architectural styles exhibits both the European and Oriental influences which are present in Vietnamese culture.\n\nAfter lunch, our tour guide will accompany you to the Imperial Citadel. The majestic architecture, built by Gia Long, has faced destruction over the years during the fierce conflicts which took place here. It is the scars on these buildings that tell the stories of the battles fought here.\n\nThis day tour will unwind with a cruise along the romantic Perfume River aboard a dragon boat. You will visit the Thien Mu Pagoda which has seven stories, making it the tallest in Vietnam. The elegance of the pagoda and gardens combined with the aroma of the of the orchids which bloom in Autumn will transport you to a place of tranquillity. This relaxing final part of the tour will end at approximately 16:30 and from then on you are free to continue your discovery of Hue City and enjoy your stay in the hotel."},{"title":"Hue - Hoi An (B/L)","description":"You will continue your journey South from Hue to Hoi An and take in some exquisite scenery along the way. The first beauty spot is Lang Co beach with its delicate white sandy beaches nestled in between staggering mountains and crystal waters.\n\nNext along the journey is the Hai Van pass. This mountainous stretch of road affords fantastic views of the azure water below. It is famed around the world as being one of the most beautiful coastal roads.\n\nThe journey will also take you through Marble Mountain and the stone carving village of Non Nuoc, another example of Vietnam’s many artisan trades.\nThe journey will end at your hotel in Hoi An where the evening is yours to enjoy the next city on this fantastic tour."},{"title":"Hoi An City Tour (B/L/D)","description":"The tour will commence with a visit to the Phuc Kien assembly hall where you can enjoy the intricate and colourful architecture and lose yourself in the oriental celebration of artistry and mythology.\n\nThe tour will continue with Tan Ky and Phung Hung ancient houses. Tan Ky house represents a more traditional Hoi An style architecture whereas Phung Hung house combines elements of Chinese, Japanese and Vietnamese architecture into one building. It is symbolic of the cultural heritage of the town and will transport you back to the sixteenth century when it was an international trade port.\n\nYou will then have another taste of Japanese design when you visit the serene Japanese covered bridge that was built as a connection between the Japanese and Chinese living quarters in Hoi An.\n\nAfter stopping for lunch in Hoi An town, you will travel the temple of My Son Sanctuary. It owes it’s unique location and appearance to its Hindu origins. After absorbing the effects of the sanctuary and it’s locale you will travel back to Hoi An town where you will have free time to explore."},{"title":"Free days in Hoi An (B)","description":"This is your chance to discover some of what Hoi An has to offer in your own time. You can soak up the charming ambiance of Hoi An and wander down it’s winding alleyways, imagining the lively port that once operated here. \nYou can visit the museums of Hoi An to uncover more of the town’s rich heritage or you can indulge your more adventurous side with boat trips through the water coconut groves. You are free to discover this enchanting and exceptionally beautiful town at your leisure."},{"title":"Free and easy (B)","description":"This is your chance to discover some of what Hoi An has to offer in your own time. You can soak up the charming ambiance of Hoi An and wander down it’s winding alleyways, imagining the lively port that once operated here. \nYou can visit the museums of Hoi An to uncover more of the town’s rich heritage or you can indulge your more adventurous side with boat trips through the water coconut groves. You are free to discover this enchanting and exceptionally beautiful town at your leisure."},{"title":"Hoi An free and easy (B)","description":"This is your chance to discover some of what Hoi An has to offer in your own time. You can soak up the charming ambiance of Hoi An and wander down it’s winding alleyways, imagining the lively port that once operated here. \nYou can visit the museums of Hoi An to uncover more of the town’s rich heritage or you can indulge your more adventurous side with boat trips through the water coconut groves. You are free to discover this enchanting and exceptionally beautiful town at your leisure."},{"title":"Hoi An - Ho Chi Minh City(B)","description":"Your journey will once again move South through Vietnam from Hoi An to Ho Chi Minh city. You will be taken from Hoi An to Da Nang airport by car. You will then fly to Ho Chi Minh city where you will be driven to your hotel."},{"title":"Mekong Delta Tour - Ho Chi Minh (B/L)","description":"This two-day tour will take you on a spectacular tour of three towns, My Tho, Ben Tre and Can Tho, in the vast and legendary Mekong Delta. The flotilla of wooden boats will usher you through the winding canals to see the fruitful and fertile towns that farm on this incredible stretch of water. During the tour, you will taste many of the delicacies produced and prepared along the river from the fresh, succulent fish served daily to the famous coconut candy. Your taste buds will be tantalised as will your eyes on your journey through the delta and its culture."},{"title":"Me Kong Delta - Ho Chi Minh (B/L)","description":"This two-day tour will take you on a spectacular tour of three towns, My Tho, Ben Tre and Can Tho, in the vast and legendary Mekong Delta. The flotilla of wooden boats will usher you through the winding canals to see the fruitful and fertile towns that farm on this incredible stretch of water. During the tour, you will taste many of the delicacies produced and prepared along the river from the fresh, succulent fish served daily to the famous coconut candy. Your taste buds will be tantalised as will your eyes on your journey through the delta and its culture."},{"title":"Ho Chi Minh City (B)","description":"This is your chance to encounter all that Ho Chi Minh has to offer. This dynamic, metropolitan city has all of the attractions of any major city but with a distinctive Vietnamese allure. It’s energy hums all around you and you cannot help but be absorbed by this vivacious city. The two worlds of traditional Vietnamese markets, tranquil temples and tempting street side eateries collide with the contemporary designer malls all watched over by ultra-modern skyscrapers."},{"title":"Cu Chi Tunnel (B/L)","description":"You will be collected at 08:00 or midday and escorted back through time in a unique opportunity to voyage through the Cu Chi tunnels. This is your chance to experience the passageways that were once used by soldiers during the Vietnam war. This mesmerising maze of underground tunnels spreads across the country reaching as far as the Cambodian border in some places. It was used as a hiding spot for the troops and the main route for sending communications and supplies. You will return to Ho Chi Minh at 17:00 where you can absorb as much of the city’s energy as you can on your last night in this incredible country."},{"title":"Ho Chi Minh City Departure(B)","description":"After 21 days exploring Vietnam and discovering many of its wonders, you will be driven from your hotel in Ho Chi Minh City to Ho Chi Minh airport for your return flight with memories of all of the amazing places and souvenirs for your loved ones. We are happy to have been part of your remarkable journey."}]},{"name":"Vietnam Vacation Package - 16 Days","duration":16,"travelStyle":["Discovery","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1902,"summary":"The best Package Tour along Vietnam to discover from the North (Hanoi) to the South (Ho Chi Minh City)","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c245c4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c245c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_fa800c78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_4f65fdc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c0aad9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c2af8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c3cf50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d43c43873.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d48f110e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d48f1d5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d48f260ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d48f2c247.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d48f3351b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4a8d13ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4a8e7e65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4a901f24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4a91648b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4cfdc71c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4cfef2a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4d00db67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4d01620f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4d024947.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4d03211e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4d03fb6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95433_5e01d4eb5b113.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hue","Hoi An","Ho Chi Minh City","Can Tho","Mekong Delta","Cai Rang"],"timeline":[{"title":"Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi Sightseeing full day (B, L)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l’Ecole Francaise d’Extreme Orient, which includes artifacts from Vietnam’s turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises or similar"},{"title":"Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi free for leisure - Depart to Hue Imperial City (B)","description":"Today free to go shopping in the Hanoi Old Quarter or sightseeing by your own until noon time. Leave Hanoi to airport for Hue City`s flight. Arrive Hue City in the afternoon. Transfer to hotel & check in. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Full day sightseeing in Hue City - Old Imperial City. (B, L)","description":"Spend full day to visit Hue City, Vietnam’s political capital from 1802 to 1945 under the 13 emperors of the Nguyen Dynasty. Traditionally, the city has been one of Vietnam’s cultural, religious and educational centers. Visit the Imperial City, which is located in the Citadel. Modeled after the Forbidden City in Beijing, the Imperial City was built in the early 19th century. Explore the Thai Hoa Palace, with its spacious hall and ornate roof of huge timbers supported by 80 carved and lacquered columns. See the Halls of the Mandarins, the Nine Dynastic Urns and the site where the Forbidden Purple City once stood. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Thien Mu Pagoda/Tomb of Emperor Minh Mang. (B, L)","description":"Just outside Hue, visit the Thien Mu Pagoda on the bank of the Perfume River, which was a hotbed of anti-government protest during the early 1960s. Next, visit the complex of the Tomb of Emperor Minh Mang, built in 1840, which is known for its magnificent architecture and elaborate decorations and is considered one of Hue’s most beautiful pagodas. After lunch at a local restaurant, visit Tu Duc Tomb, which was built for meditation, reading and theater performances in a tranquil setting of forested hills and lakes. Your final stop is at Khai Dinh, the last monument of the Nguyen dynasty. It has a remarkably long staircase flanked by dragons, ceiling murals and ceramic frescoes. Return to your hotel on the riverbank where your Art Deco inspired rooms are reminiscent of the 1920s and 1950s. Overnight in Hue City.\nCherish Hotel Hue or similar"},{"title":"Leave Hue to Danang/City Sightseeing. (B, L)","description":"Today, journey south past the Hai Van Pass and Land Co, over a spur of the Truong Son Mountain Range that juts into the South East Sea, with spectacular views along the way. Upon arrival in Danang, visit the Cham Museum, which features a fine collection of openair sandstone carvings. Stop at My Khe Beach, made famous in the American TV series of the same name. It stretches for many miles north and south of the Marble Mountains. The Marble Mountains surrounding the area are five stone hillocks – once islands made of marble - and each is said to represent one of the five elements of the universe. There are many natural caves in which Buddhist sanctuaries have been built over the centuries. Transfer to Hoi An Ancient Town. Check in hotel & overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An Excursion/Thu Bon River Boat Trip. (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as “Faifo” to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An’s history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Return to your haven on world-famous “Cua Dai Beach,” with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"My Son Sanctuary half day Tour & free go shopping (B)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town for lunch. In afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Leave Hoi An to Saigon/City Sightseeing. (B, L)","description":"Fly to Ho Chi Minh City, Saigon, the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Colon, which means “Big Market.” Notre Dame Cathedral, in the heart of Saigon’s government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as “Hotel de Ville,” is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Discover Mekong Delta/River. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Check in hotel & overnight in Can Tho City.\nIrish Can Tho Hotel or similar"},{"title":"Visit floating Markets & Village (B, L)","description":"Wake up in early morning to take the boat trip to Cai Rang Floating Market – one of the most bustling floating markets in Mekong Delta with hundreds of small boats barging and jostling for space to sell their goods and to experience the Mekong rural lifestyle. After sampling local fruits, our guide will escort the guests back to the hotel through myriad canals. Lunch at local restaurant before return to Ho Chi Minh City. Arrive Ho Chi Minh City at 4:00pm. Free for leisure. Overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Conclude Saigon/Ho Chi Minh City. (B)","description":"You have the morning free to relax before your return flight home. Tour Guide & Driver will take you until Airport for your International Flight! Finish your unforgettable Vietnam Package Tour with Legend Travel Group! Good bye & see you in the next times!\nAirport transfer included"}]},{"name":"Mekong Delta 3 days/2 nights From Saigon","duration":3,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":235,"summary":"Amazing trip  From Saigon /Ho Chi Minh - My Tho - Ben Tre - Chau Doc - Long Xuyen - Can Tho - Phong Dien - Cai Rang - Saigon/Ho Chi Minh","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/192439_5e3351478bd01.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/192439_5e3351478bd01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e3351420322e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e335147a43f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e3351421bdfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e335147aa336.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e335142210f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e335147b03da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e33514226077.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e335147b56aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/192439_5e3351422ac59.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Chau Doc","Can Tho","Cai Rang"],"timeline":[{"title":"Saigon– My Tho – Ben Tre – Can Tho","description":"7 : 45 AM Pick up at your hotel in Ho Chi Minh City or 220 De Tham street"},{"title":"Can Tho – Chau Doc – Tra Su Sanctuary","description":"Breakfast at the hotel. Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to Cai Rang floating markets (& Phong Dien is optional), which are the liveliest in the whole religion."},{"title":"Chau Doc - Saigon","description":"\n  After breakfast, take a nice boat trip through the floating village to visit a fish farm to see how the Mekong Delta people raise fish in their floating houses. \n  Visit the Cham minority with their traditional weaving village, followed by a local Islamic Mosque.\n  –  Trip back to Hochiminh city. \n  Drop off at your hotel\nEnd point\n Your accommodation, Hồ Chí Minh, Vietnam "}]},{"name":"Hanoi - Hoa Lư Tam Cốc - Halong Bay 4 Days 3 Nights","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":290,"summary":"Short Excursion to Vietnam and visit Highlight Tourist spots in the North with capital. Halong Bay one of 7 World wonder, Tam Cốc full day with sailing on sampan to explore the yellow paddy fields, enjoy local food , cycling around the village, little trekking to  the rocky mountain. Budget Tours and suitable for all","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594573.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f40259457b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f40259457c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f40259457d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f40259457f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594580.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594582.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594583.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594585.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594586.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194427_5e4f402594588.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"hanoi","description":"Start the tour by visiting Ho Chi Minh Mausoleum and Museum. Enjoy the architectural and historical aspects of Uncle Ho's final resting-palace. Just next door is Ho Chi Minh's house on stilts where he used to live in the past. Lying to one side of the Mausoleum is the One Pillar Pagoda, built by King Ly Thai To in 1049 the structure has become an important symbol for the people of Hanoi. Continue to visit the Literature Temple and Quoc Tu Giam - Vietnam's first University constructed in 1070. Its gardens and well-preserved architecture offer a relaxing glimpse into Vietnam’s past.\nHave lunch at local restaurants.\nProceed to visit the Ethnology Museum. After that we will take you to Hoan Kiem Lake, enjoy the peaceful Hanoi atmosphere and it's speciality,  visit Ngoc Son Temple. End the trip."},{"title":"hanoi - halong bay","description":"Morning 8:00: Guide and Luxury Bus will pick you up at your hotel, make sure that you have finished your breakfast before we come. spending 3 hours and a half on Bus, and 15 minutes for softbeak in the midway to Halong bay\n- Taking photos, watching both green and yellow rice fields to halong bay\n11:00 : Arrive halong Bay and get on Cruise, welcome drinks. Enjoy Halong Seafood on Cruise while moving to the Surprising Cave, Wooden Grotto in the middle of Halong Bay\n- 4 hours on Cruise and visiting the most beautiful places, islets on the Sea\n- You have opportuniy to walk up to visit natural caves which created by million years ago by up and down of Earthquakes...\n4 : 00 Pm: arrive the Habour and return hanoi, finish Tour"},{"title":"Hoa Lu Tam Cốc","description":"AM: Meet at your hotel. Transfer to Ninh Binh province - 100 Km south of Hanoi – is known to travelers as Vietnam’s “Inland Halong Bay”. You will be offered a leisurely sampan cruise on a creek across three vast stretches of rice field. Upon arrival, visit Temples of the Dinh King and Le King built on the site of the Hoa Lu Ancient Citadel.\nSampan trip along the stream to Tam Coc caves (Three limestone caves) all adorned with beautiful stalagmites and stalactites. Later on, you visit Bich Dong Pagoda – a very nice temple located in the harmony surrounding landscape. Lunch at local restaurant.\nPM: transfer back to Hanoi."},{"title":"Departure","description":"Today is Relaxing time for your family in Hanoi, arrange your luggage before leaving for home"}]}]