[{"name":"Treasure of Vietnam","duration":10,"travelStyle":["In-depth Cultural","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":986,"summary":"Our Treasure of Vietnam tour is designed to give you the best Vietnam holidays in 10 days, offering you a taste of the country","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119778_ef0085b6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119778_ef0085b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_9fbf5898.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_9394cd33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_b2c77f2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_6cd7f335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_e4c90d23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_2f9f61b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_2cca76e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_f2668a18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_50f1a807.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_6faacea0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_2931bfe1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119778_6b0d0a81.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Meal: Dinner- Accommodation: Hotel in Ho Chi Minh City\nWelcome to biggest city in Vietnam – Metropolis Ho Chi Minh City.\nOn arrival, our car and guide will pick up and transfer you to your hotel in city central. Enjoy the rest of the day at your leisure to recover from jet lag and explore the city on your own.\n"},{"title":"Day 2: Ho Chi Minh City - Cu Chi Tunnel","description":"Meal: Breakfast, lunch- Accommodation: Hotel in Saigon\nAfter breakfast, you will visit Cu Chi tunel, where human knowledge has been enriched by experiencing an web-like tunnels system of more than 200 km in length which used to be the shelters of guerrillas during the war against American troops .Return to Ho Chi Minh City for lunch by your own arrangement.\nAfter lunch, a take a short sightseeing tour of Ho Chi Minh City with War Museum, The Hundred Years Red Cathedral (Notre Dame Cathedral), The Old Post Office and The People’s Committee Hall.\n"},{"title":"Day 3: Ho Chi Minh City - My Tho - Ben Tre- Ho Chi Minh City","description":"Meals: Breakfast, Lunch/Accommodation: Hotel in Ho Chi Minh City\nEnjoy the scenic journey along the National Highway bordered by green rice fields.\nOn arrived at My Tho, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by locals.\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC.\nThis trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.\nTransfer back to your hotel."},{"title":"Day 4: Ho Chi Minh City - Flight to Da Nang - Hoi An","description":"Meals: Breakfast/Accommodation: Hotel in Hoi An\nHoian is one of the rare Vietnamese towns which can remain relatively intact through the destruction of war. Once a vibrant hub of silk and ceramic trading, Hoian used to be the residence of the Chinese, Japanese and Portuguese. They left when the Thu Bon River silted-up, which put an end to Hoian’s importance as a trading post, leaving behind centuries of legacy and culture. \nHoian is best experienced on foot, so don’t hesitate to stretch your legs and weave through the town numerous back roads. Some of the highlights on the way are Chua Ong Pagoda, Chinese Assembly Halls, the 200- year old Tam Ky ancestral house, and the Japanese Bridge. \nIt’s worth bringing a spare bag on a trip to Hoian to bring back some beautiful traditional folk art, and especially clothes. Hoian is known as the city of tailors, so why don’t take this chance to upgrade your wardrobe.\n"},{"title":"Day 5: Hoi An / Hue","description":"Meal: Breakfast, lunch- Accommodation: Hotel in Hue\nEnjoy breakfast at the hotel then check-out and drive over the 500m-high Hai Van pass to Hue – a UNESCO World Heritage Site and Vietnam’s former capital. Afternoon, you will spend to visit ancient city with the Royal Citadel, the Imperial Museum, as well as the Mausoleum of King tu Duc (a replica of the king’s palace built for the next reincarnation of the king).\n"},{"title":"Day 6: Hue / Hanoi","description":"Meal: Breakfast, lunch- Accommodation: Hotel in Hanoi\nSpend the morning on a private boat cruise down the romantic Perfume River to visit the Lady Pagoda(Thien Mu Pagoda), Dong Ba Market and the ornate Minh Mang’s tomb. Drive to the airport in the afternoon to catch your short flight to Vietnam’s capital city, Hanoi. Upon arrival, get transferred to your hotel in the city center. Free at your leisure.\n\n"},{"title":"Day 7: Hanoi","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Hanoi. \nHanoi with its strategic position has gone through all the ups and downs of history to retain its core values and at the same time, embrace the foreign impacts to enrich itself. Starting with Ho Chi Minh Mausoleum, the final resting place of modern Vietnam’s founding father, find your way to Presidential Palace and Ho Chi Minh’s stilt house get a piece of the country contemporary history. \nDig a little deeper into ancient Vietnam by paying a visit to One Pillar Pagoda, an exotic architecture that resembles a lotus. \nTake a step into the ancient religious-governed Vietnamese society by a trip to Temple of Literature, the very first university of the country, Tran Quoc Pagoda, and Quan Thanh temple, the worship place of two of Hanoi’s protecting gods. \nAfter lunch, hop on a rickshaw and weave through Hanoi’s 36 streets and guilds. \nYour guide will then escort you back to your hotel where the remainder of your evening can be enjoyed at your leisure. \nDinner by your own arrangement. \n"},{"title":"Day 8: Hanoi / Halong Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nRide through the rich farmland of the Red River delta, which has nurtured the ancient Vietnamese civilization to reach Halong Bay, the spectacular scenery that makes it one of the world’s new natural wonders. \nBoard a cruise ship and watch the legendary karst limestone mountains of Halong passes by. The names of the mountains are deprived of their shapes so let your imagination runs wild and try guessing what mountains you’ve just seen. \nHalong Bay is peppered with caves so don’t leave without paying them a visit. Overnight on board and let the sound of the ocean lures you into sleep. \n"},{"title":"Day 9: Halong Bay / Hanoi","description":"Meal: Breakfast-Brunch/Accommodation: On Cruise\nWake up your every sense with a Taichi session on the cruise’s deck and watch sunlight fills the sky. Spend the last few hours on the bay by visiting a limestone grotto before getting back to the dock. Bid the staff goodbye as you will head back to Hanoi at noon. \n"},{"title":"Day 10: Hanoi","description":"Meals: Breakfast/Accommodation: NA\nSpend your last hours at your leisure in Hanoi before transferring to the airport for a trip home. \n\n\n"}]},{"name":"Hanoi & Halong Bay- 4 Days North of Vietnam","duration":4,"travelStyle":["Ocean Cruise","Group","Partially Guided","Relaxing","Holiday"],"oldPrice":0,"price":179,"summary":"Don't have time for long package, North Vietnam 4 Day is the best 4-day package tour which is highlighted with one night on Halong cruise. Whichever way you choose to experience Vietnam on this family holiday, a warm welcome from the local people is practically guaranteed as well as a cultural adventure that can be as active, relaxing or as downright exciting as you want it to be.\nHighlights\n\n  Check out Hanoi's Old Quarter, tranquil city lakes, historic temples and museums\n  This tour pulls out all the stops to ensure you see the very best north of Vietnam has to offer!\n  Cruise Ha Long Bay aboard the Halong cruises, a new deluxe junk, which includes all onboard meals, sea kayaking and more!\n  Indulge in delicious Vietnamese cuisine - most meals are included in this tour!\n","highlights":["Check out your reflection in beautiful Hoan Kiem Lake","Wander into the serene Temple of Literature at Hanoi","Weave between the magnificent limestone mountains","Swim in the turquoise waters of UNESCO Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130301_bdbde4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130301_bdbde4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_32504c90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_30707110.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_c9852607.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_d5a0d828.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_75ade281.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_eaf445e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_acc35dc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_a82de4aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_d4a434c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_273ea85b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_f58ef696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_aa10b2fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_514c0766.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_d7819f97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_3bebe263.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130301_29e6c87b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Hanoi Arrival (Meals: No)","description":"Arrive in Hanoi. Check in hotel. Then you will have time for discovering by yourselves the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum. Our Hanoi private city tour, Lovers Foodie Private Tour or My Village Show Hanoi can be good options for you. \nhttps://swallowtravel.com/tours/hanoi-day-tours-c466\nOptional Activities ( Not Included)\nHanoi Foodie Tour (Special local food tour and Old Quarter Sightseeing | only 26USD)\nMy Village Show (Vietnamese Bamboo Circus with live traditional music| from 29USD)\nPlease contact us if you want to join tours with us.\nNight 1: Overnight at 3 star hotel in Hanoi(HM Boutique Hotel/La Santé Hotel & Spa/Le Foyer hotel)"},{"title":"Hanoi - Halong – overnight onboard(B,L,D)","description":"7.45-8.15:  Our tour guide and driver will pick you up at the hotel.\n\n10.00:  Having short break at stop over in Hai Duong Province.\n\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n\n13.15:  Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30: Do kayaking through the magnificent landscape with Limestone Mountains, visit Titop Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay\nBack to Lavender Cruises and join sunset party\n\nPass by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\nJoin our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities:\nJoin squid fishing on boat with our crews. You can enjoy the squid cooked with assistance from our chef, Playing card, karaoke…Or Laze yourself with our happy-hour drinks at the bar.\n\nNight 2: Overnight on Lavender Cruise/ Majestic cruise"},{"title":"Halong Bay – transfer back to Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck.\n\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n\n08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n\n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi.\n\n16:30: Arrival Hanoi. Drop you off at your hotel. \n\nNight 3: Overnight at 3 star hotel in Hanoi(HM Boutique Hotel/La Santé Hotel & Spa/Le Foyer hotel)"},{"title":"Hanoi departure(Meals: B)","description":"You will have breakfast at the hotel then have free time to explore Hanoi city before getting picked up to the airport by our driver. Trip ends. Please contact us if you want to extend your stay or want to visit other places in Vietnam, Cambodia, Laos, Myanmar, Thailand."}]},{"name":"Wonders of Vietnam Tour from Saigon to Mekong Delta, Da Lat, Nha Trang, Hue, Hoi An, Halong Bay and Hanoi","duration":15,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2303,"summary":"This north bound journey contains all major attractions of Vietnam. You drive through the vibrant streets of Ho Chi Minh to see the famous Cao Dai temple in Tay Ninh and get the a taste of local life in a Mekong Delta. Heading out of the city chaos, you soak up the fresh climate in Da Lat hill station and relax on the beaches of Nha Trang. You visit the delightful Hoi An Town and experience the life in Hue before continuing north to Hanoi. You explore the scenic Halong Bay on a cruise and enjoy a cyclo ride around the old quarter streets of Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171027_4213c51f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171027_4213c51f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_44d17773.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_074a4e96.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_18f67472.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_0c6c2653.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_89ba46d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_22416d60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_8f51a139.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_1b5a00e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_d6f31c11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_d3e60901.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_9c7d444d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_f624337c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_f38fdf62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_90879bc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_9d275e2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_d1c140fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_fc7a9ef1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_b2ee6d42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_554aff21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_17214511.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_3eab6286.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_3e514d47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171027_589f9e6d.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Can Tho","Vinh Long","Dalat","Hoi An","Hue","Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"DAY 1: ARRIVAL – HO CHI MINH PACKAGE TOUR (-/-/-)","description":"On arrival at Tan San Nhat Airport, you are met by our guide and transferred to hotel. The bustling Ho Chi Minh City, still called Saigon by many locals, is a center of commerce, finance, culture and tourism in Vietnam. This metropolis, contradiction of its northern counterpart, is crowded with bikes and motorbikes, excited by numerous shopping areas and sidewalk cafes. (If time permits) we stroll around the down town to explore the different local ways of life.\nO/N in Ho Chi Minh."},{"title":"DAY 2: SAI GON SIGHTSEEING + CU CHI TUNNELS TOURS (B/-/-)","description":"Morning: We spend a half day exploring the captivating Ho Chi Minh City. The most places of interest are located near the town center. We pass by the now-demolished wartime American Embassy on our way to the Reunification Palace. This famous edifice was a former residence of the President of Southern Vietnam until end of April 1975. Close to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. We follow these with a visit to the Jade Emperor Pagoda and the War Remnant Museum with a wealth of images from the notorious conflicts. The sightseeing ends up with a walk around the retail Ben Thanh Market where anything and everything is for sale!\nAfternoon: Transfer about 30km north-west of Ho Chi Minh City to Cu Chi town. Cu Chi tunnels were used as the base from which the Vietnamese mounted their operations of the Tet Offensive in 1968. The incredible underground network in Cu Chi stretched over 200 kilometres and became legendary during the American war. The extensive tunnels have been specially constructed with living areas, weapon factories, filed hospitals, command centres, plus accommodation. Today we have an excursion to Cu Chi Tunnels to visit an exposition hall and a widened section of the tunnels to get a feel of the underground life. There are also possibilities to fire off rounds from an AK47 or MK16 at the nearby rifle range.\nTransfer back to Ho Chi Minh City.\nO/N in Ho Chi Minh City."},{"title":"DAY 3: HO CHI MINH CITY – MEKONG CRUISE TOURS TO MY THO & BEN TRE – CAN THO (B/L/-)","description":"Pick up at your hotel in Ho Chi Minh city and start the trip to My Tho. Upon arrival, visit Vinh Trang pagoda which sated back to the late 19th century. Then  boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking in the village paths to contemplate orchards, enjoy tropical fruits, and Vietnamese folk music performed by the local people. Visit the fruit plantation. Be rowed in a small sampan through the Thoi Son canal and treat yourself to the beauty of the countryside, visit the family business & bee-keeping farm, enjoy honey tea and coconut candy workshop.\nHave lunch at the local restaurant. Break time.\nThe afternoon is time for cycling around the Tan Thach village, meeting the local people to experience their daily life in the Mekong delta. Relaxing on hammocks to enjoy the cool breeze is for those do not want to join the cycling trip. Proceed to Can Tho City and overnight in Can Tho.\nO/N in Can Tho. "},{"title":"DAY 4: CAN THO SIGHTSEEING TOUR – VINH LONG TO HO CHI MINH (B/L/-)","description":"The lively floating market is a major part of sightseeing tour in Mekong Delta. Upon leaving Can Tho we set off on a short drive to Vinh Long and board a boat for an exciting excursion around the tributaries of the mighty Mekong River. Along the way we explore various local industry cottages including rice paper makers and bonsai nurseries.\nThe next stop is Cai Be floating market, whose trading way is unique since each boat usually sells one particular item such as pumpkins, pineapples, sugar canes,.. In order that the customer knows where to shop, they hang that item from the highest part of the boat. On arrival in Cai Be Town we meet up with our waiting vehicle and drive back to Ho Chi Minh, stopping off en route to see the beautiful Vinh Trang Pagoda and the Saigon’s Chinatown, locally named Cho Lon. This bustling area is crammed with fascinating temples and mysterious, narrow lanes.\nO/N in Ho Chi Minh."},{"title":"DAY 5: HO CHI MINH – DA LAT SIGHTSEEING TOURS (B/-/-)","description":"After having breakfast at hotel, you’ll be escorted to the airport for a short flight to Da Lat which is sometimes known as the “City of Eternal Spring”. Once arriving in Da Lat we can soak up the cool climate as much as we want by spending our time to wander around and catch our first glimpse of this town. The influence of the French is evident in local culture and architecture since Da Lat was founded as a hill retreat for the colonials to escape the oppressive heat in the coastal plains and the chaos of Saigon. This charming town is set around a lake and surrounded by forests, waterfalls and rolling countryside.\nO/N in Da Lat."},{"title":"DAY 6: DA LAT PACKAGE TOUR TO NHA TRANG (B/-/-)","description":"Today we enjoy a drive through the charming pine hill to the summer residence of Vietnam’s last Emperor Bao Dai. He was forced to abdicate in 1945, shortly after the end of the World War II. This mansion displays a lovely collection of Vietnam treasures. We follow it with a trip to the sacred Lam Ty Ni Pagoda and the Hang Nga Guesthouse. This construction is well known as the Crazy House because of its bizarre architecture. The lively central market and the old rail station are also visited before we travel by roads passing through the undulating terrains to the picturesque coastal town of Nha Trang. En route we make stopover at the scenic Ngoan Muc Pass and the Po Klong Jarai Cham Towers. These amazing structures represent an interesting culture and a colorful history of the Cham people in central coast areas.\nO/N in Nha Trang."},{"title":"DAY 7: NHA TRANG BEACH TOUR (B/L/-)","description":"The turquoise water surrounding a string of islands and the white sandy beach stretching the whole length of Nha Trang City make it one of Vietnam’s premier beach resorts. We board a boat to explore the coastal islands. The aquarium lake is our first stop before we head out to Hon Mun Island. Today we have plenty of time to enjoy swimming and snorkeling on the blue and clear water or simply lazing on a beach.\nThe thrilling boat trip continues towards Hon Tam Island, giving us a choice of various water sports and good restaurant for lunch. By mid afternoon we cruise back to Nha Trang Pier and complete our day with a short city tour. The impressive Ponagar Cham Towers overlooking the colourful fishing port, and the famous Long Son Pagoda with its huge Buddha image are a major part of our sightseeing.\nO/N in Nha Trang."},{"title":"DAY 8: NHA TRANG – FLIGHT TO DA NANG (NOT INCLUDED) – DA NANG & HOI AN SIGHTSEEING TOUR (B/-/-)","description":"The following destination of our trip is Danang via a short flight from Nha Trang on\nVJ580 (12:10 13:10)\nOn arrival we are greeted by our guide and driven to Danang Center for an interesting visit to the famous Cham Museum, formerly the Ecole Francaise d’Extreme Orient.\nThis museum contains many exquisite limestone carvings from the vanquished Kingdom of Champa which has been the central coastal littoral prior to the march of the Vietnamese nation south. We continue driving to Hoi An which was originally a Cham seaport but has been influenced down centuries by a myriad of traders from various cultures.\nThere are plenty to see in this tranquil and delightful town, some of which are the famous Japanese Covered Bridges, the Pottery Museum, the 200 years old Tamky House, the Chua Ong Pagoda and the vibrant market. We include these sites in an enchanting walking tour past many low tiled houses scattered along the small streets and assembly halls which reflect the town’s multi-cultural past.\nO/N in Hoi An."},{"title":"DAY 9: HOI AN – HUE SIGHTSEEING TOURS (B/-/-)","description":"Heading out of town we drive towards Hue, which was once the feudal capital of Vietnam from 1802 to 1945. Along the way we visit the Danang Beach and the sensational Marble Mountains, whose peaks represent the five elements of the universe. The winding road begins as we make our way up the spectacular Hai Van pass.\nA view from the top of the pass is one of Vietnam’s most impressive panoramic scenes. On arrival in Lang Co, we make a break by the beach for a leisurely swim. The impressive drive will deliver us to Hue by early afternoon. We start our sightseeing tour with the massive citadel, containing the Imperial City and the Purple Forbidden City.\nThis royal residence was all but destroyed during the 1968 Tet Offensive, however it is still fascinating to walk among the ruins. Close to this masterpiece is Hue Imperial Museum which displays an interesting collections of bronzes, Chinaware, court robes and various emperors’ personal belongings.\nO/N in Hue."},{"title":"DAY 10: HUE – SIGHTSEEING VACATION (B/-/-)","description":"At 8:00 am our guide and driver welcome you at hotel and start day trip to explore Hue Imperial City. This morning, you will start your tour by making a dragon boat trip on Perfume River and enjoy the fresh atmosphere of Hue. Visit the famous Thien Mu Pagoda upon arrival at the dock to discover Buddhism in Hue. Then you will be transferred to visit the Imperial City (Citadel), the Royal Palace of Nguyen Dynasty. Explore the glory history and stunning architecture inside this complex. Next, you are free to go shopping at Dong Ba Market, you can also discover the interesting local life here while looking for souvenir for friends and family. Have lunch at the restaurant. \nAfternoon is the time for Nguyen Emperors’ Mausoleums. You will have chance to visit two of three most famous tombs. Visit Khai Dinh Mausoleum to admire the spectacular architecture which was influenced by Oriental and Western styles. Then visit Minh Mang Mausoleum and discover its traditional style with a peaceful atmosphere. Back to Hue city and end tour at your hotel.\n\nO/N in Hue."},{"title":"DAY 11: HUE – FLIGHT TO HANOI (NOT INCLUDED) – HANOI CITY TOUR (B/-/-)","description":"Upon leaving Hue we set off on a short drive to airport for flight to Hanoi on VN1542 (10:25 11:40).\nOn arrival at Noi Bai Airport, you are met by our guide and transferred to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere.\nLater on, We follow it with a visit to the Temple of Literature, which is well known as the first university of Vietnam and the History Museum with an excellent collection of artifacts illustrating the Vietnamese history. Later on, we will take a short visit at Hilton Prison where Vietnamese soldiers did captured & detained American pilots from 1967 till 1973 to learn more about the history of Vietnam war against American Imperialists.\nAfterwards we drive to the Tran Quoc Pagoda and Quan Thanh Temple. They are some major highlights set by the beautiful West Lake. We also visit the old quarters and the peaceful lake of Hoan Kiem with its sacred temple. In front of this lake is the famous water puppet theatre where we will see a fantastic performance.\nIf time permits we enjoy a short cyclo ride through the bustling old quarter streets named after the specific goods once offered for sale at these places.\nO/N in Ha Noi."},{"title":"DAY 12: HANOI – HALONG BAY CRUISE (B/L/D)","description":"7:30 – 08:30: Our SHUTTLE BUS with tour guide will pick you up at your hotels.\n10h30: Stopover in Hai Duong city  where you can experience our hand-made Vietnamese handicraft products.\n12h30: Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities:\n+ Boarding HALONG BAY CRUISEs for departure.\n+ Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager.\n+ Great lunch is served while cruising passing by islets, through Hoa Cuong floating village.\n+ Exploration of Halong Bay passing by Soi Sim Beach, Coconut Three Island. Then arrive in the area of Surprising Cave.\n+ Kayaking & swimming or climbing up to the mountain and getting a complete view of Halong Bay at Titov Beach\n+ Joining our COOKING CLASS on the sun-deck. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n+ Enjoy sunset party with fruits and wine.\n19:30: Under the magnificent night sky, Our luxury set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities include:\n+ Join the SQUID FISHING on boat with our crews. You can enjoy the squid cooked with assistance from our chef.\n+ Or Laze yourself with our happy-hour drinks at the bar.\nOvernight on Cruise."},{"title":"DAY 13: HALONG CRUISING TOUR – HANOI (B/L/-)","description":"06:15: Tai Chi class on the Sun-deck.\n07:15: Have breakfast with Coffee, tea and Bakeries on board.\n08:00: Visit the SURPRISING CAVE (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery.\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier.\n12:00: Disembarkation at Tuan Chau Pier. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00: Arrive in Hanoi. End of the trip!\nO/N in Ha Noi."},{"title":"DAY 14: FULL DAY TOUR TO HOA LU & TAM COC (B/L/-)","description":"08.00 – 8.30: We pick you up at your hotel\nDeparture for Hoa Lu –Tam Coc. The area of Tam Coc and Hoa Lu is characterized by the limestone geology that gives rise to the towering karsts that make this picturesque area so unique ... There is beautiful roadside scenery on the way.\n10.30: After arriving in Ninh Binh province, the guide takes you to visit Hoa Lu – the Ancient Royal capital of Vietnam.\n12.10: You’ll have lunch at a nice restaurant before boarding a small boat to visit Tam Coc which means literally: “Three Caves”. With HaLong type views of majestic limestone cliffs and mysterious yet inviting caves, as well as countryside sights like peaceful streams, rice paddies and deserted green fields, Tam Coc really has it all.\n17.00: Depart for Hanoi and arrive back in the city around 19.00\nO/N in Ha Noi. "},{"title":"DAY 15: HANOI – DEPARTURE (B)","description":"There is a free time to relax or further explore Ha Noi. The tour ends after your transfer to Noi Bai Airport for departure."}]},{"name":"South Central Vietnam - 9 Days","duration":9,"travelStyle":["Discovery","Group","Partially Guided","Sightseeing","In-depth Cultural"],"oldPrice":0,"price":1080,"summary":"\n  Visit the neo-Romanesque Notre Dame Cathedral and the magnificent Saigon Opera house in Ho Chi Minh City. Saigon Post Office, the historic French colonial buildings. And the Ben Thanh market with plenty of fantastic food.\n  See the daily activities of locals who live along the Mekong canals; the Cai Rang floating market. \n  Visit Cham Museum & Tu Duc Tomb. The Old City of Hoi An, one of the most important trading ports in Southeast Asia in the 15th century. The Imperial City & 19th-century Citadel in central Vietnam. \n  In order to make your journey most memorable, we highly recommend you extend your trip to Hanoi & Halong Bay in northeast Vietnam, known for its emerald waters and thousands of its amazing limestone islands, rock formations and caves.\n","highlights":["Marvel at the magnificent Saigon Opera house in Ho Chi Minh City","Tantalise your tastebuds with the culinary delights of Ben Thanh market","See the daily activities of locals who live along the Mekong canals"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158076_1506d1dd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158076_1506d1dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_3cdbd90c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_d587966f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_67dadd24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_bc6adfcf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_07d01d38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_519dd307.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_270381e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_00120c7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_5751f570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_bfefb59c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_d0d9d879.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_9b5d7f35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158076_9aeb4a51.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Mekong Delta","Can Tho","Cai Rang","Hoi An","Hue"],"timeline":[{"title":"Day 1 Arrive Ho Chi Minh City (Breakfast)","description":"Xin chao! Welcome to Ho Chi Minh City, also known as Saigon – the most dynamic city of Vietnam where modern high-rise buildings sit next to ancient temples. You are greeted at Tan Son Nhat International airport and transfer to your hotel. The rest of day is free at your leisure for jetlag recovery.\nOvernight in Saigon."},{"title":"Day 2 Ho Chi Minh City","description":"Enjoy the morning at leisure or join the optional half day tour to Cu Chi Tunnels. \nOur tour start in the afternoon with the visit to Notre Dame Cathedral, built between 1877 and 1883, is a major center of Catholicism in modern Vietnam, and one of the city’s major landmarks.Next to the cathedral stands the Saigon Post Office, a classic French colonial structure, is still a functioning post office today and features huge ceilings, a giant portrait of Uncle Ho, and many beautiful details.Then, visit The People’s Committee Hall which were all built during the French colonial period. Continue to see The Municipal Theater of Ho Chi Minh City, also known as Saigon Opera House, is an opera house in Ho Chi Minh City. It is an example of French Colonial architecture in Vietnam. And the last visit of the day is to Ben Thanh Market – a symbol of the city, stands in the center of District 1 packed to the rafters with everything from fruits to nuts, from tourist kitsch to true bargains, it is a definite must-see.\n\nOptional tour: Cu Chi Tunnels Half day $49/pp (Min. 2 passengers to operate)\nDepart Ho Chi Minh City in the morning, you head out to Cu Chi Tunnels. After an introductory video, viewing various mantraps, the remains of an American tank and numerous bomb craters, you will spend the next hour exploring the maze of tunnels to see how the Viet Cong survived in this underground network."},{"title":"Day 3 Saigon - Mekong Delta/ Ben Tre - Can Tho (Breakfast, lunch)","description":"In the morning, travel from Saigon to Mekong Delta. Upon arrival in Ben Tre, take a boat on the river. Stop at brickwork to see how to make bricks in handy traditional method - soil brick is molded from clay, arranged inside a kiln and became brown after baking. Visit coconut processing workshops located along the canal. Go on natural scissors creeks where they look narrower to the village. Take a short walk to a family workshop run by women making sleep mats and enjoying some fruits and tea and chatting with local people to know about their rural life.\nTake a motor cart (xe lôi) or biking on the shady road, pass by rice fields and vegetable plains to be able to touch on real life and find out about the tropical culture from Peasants.Lunch at a local restaurant in Ben Tre.\nIn the afternoon, take a rowing boat along water palm creek. Head out to Can Tho, where you will spend the rest of the day at leisure. \nOvernight in Can Tho."},{"title":"Day 4 Can Tho - Saigon - Danang - Hoi An (Breakfast)","description":"In the morning you step onboard a boat to visit Cai Rang floating market. Take in the daily activities of the locals who live along the Mekong canals. Then meet your driver for the trip back to Saigon and to the airport for the flight to Danang. Upon arrival, meet with your guide and be transferred to the hotel in Hoi An.\nOvernight in Hoi An."},{"title":"Day 5 Hoi An (Breakfast)","description":"In the morning, visit the ancient streets of Hoi An, lined with Chinese traders’ homes and wooden houses reincarnated as restaurants, cafés, and outlets for local artists, craftsmen, and tailors. Explore the beautiful 16th century Japanese Bridge. Hoi An's unique fusion of Chinese, Japanese and Vietnamese architecture is well displayed here, in what is arguably Vietnam's most tourist-friendly town.\nHoi An is very famous for its silk costume and product tailor-made for tourist, this is a great chance for you to have a reasonable price tailor-made suit or any other silk products. The group will shop in one of the most authentic shops in Hoi An where quality is assured.\n\nThe rest of the day is free at leisure for your own exploration of Hoi An or you can simply enjoy the hotels’ facilities and amenities. \nOvernight in Hoi An."},{"title":"Day 6 Hoi An (Breakfast)","description":"Day free at leisure or join our oprional tour Farming & Fishing Life with lunch.\n\nOptional tour: Farming & Fishing Life with lunch $89/pp (Min. 4 passengers to operate)\nStart the day cycling along back roads witnessing Vietnamese rural life first hand, working the ground with a farmer in an organic vegetable village and riding a water buffalo in a rice paddy field. Later, you will board a boat to join local fishermen doing traditional net fishing. You will also experience paddling the unique Vietnamese bamboo basket boat, rounding out your experience with the local farming and fishing communities. Lunch will be on boat with cold beer or soft drink."},{"title":"Day 7 Hoi An - Da Nang - Hue (Breakfast)","description":"Leaving Hoi An in the morning, you head out to Hue, the Vietnam’s last feudal capital. The scenery is remarkable, as the route hugs the coastline of the East Sea before winding up the spectacular Hai Van Pass. Here you can stop to admire the stunning views: north over Lang Co Beach and south over Da Nang City. Once in Da Nang, you will stop by the Cham Museum, housing the most complete collection of Cham artifacts anywhere in the world. Upon arrival in Hue, keep driving to Tu Duc Tomb. Tu Duc's tomb is a sprawling compound centered around a lake and several waterways, and including numerous separate memorials connected by pleasant walkways.\nOvernight in Hue."},{"title":"Day 8 Hue (Breakfast)","description":"In the morning, take a trip to Hue Imperial Citadel. The imperial city of Hue is the best-preserved remnant of a vast citadel and royal quarters that once existed on the site. Here you can see the ravages of time and war on what was the carefully designed capital of the Nguyen Dynasty. Built in the early 19th century by armies of conscripted laborers under Emperor Gia Long, the citadel was surrounded by a ten-kilometer moat, and earthen walls formed the outer perimeter.\nSpend the rest of the day at leisure or join the optional half-day tour to Thuy Bieu village.\n\nOptional tour: Thuy Bieu Village & dinner with local family $59/pp (Min. 2 passengers to operate)\nIn the afternoon, board a boat for a scenic cruise to Thuy Bieu village. The quiet Thuy Bieu Village, 6.5 km from the city center, is famous for growing Thanh Tra fruit (a kind of small pomelo). You will visit many garden houses, a unique feature of the Hue countryside, and enjoy relaxed walking and biking around the village. Visit an old communal house, pass by several ancient ancestral temples and chat with local people. Visit an incense making family and discover the daily life of locals, who working strenuously but with joy and enthusiasm. You can join them in gardening, or simply drinking tea. Enjoy a dinner at a local family in Thuy Bieu and drive back to hotel. "},{"title":"Day 9 Hue - Saigon","description":"Our 10 days tour ends today, you will be transferred to airport board your domestic flight from Hue to Saigon (included) to connect the international flights back home. \nOr you may choose to extend your trip to 4 days 3 nights Hanoi & Ha Long Bay excursion at extra cost. \n\n*Depending on the air availability, international flight out from Ho Chi Minh may depart in the early morning today or next day.\t\n\n*Optional Extension: 4 Days 3 Nights HANOI & HA LONG BAY EXCURSION $499 per person (Single Supplement $200 per person) \n(Min. 4 passengers to operate, airfare difference might be applied)\n\nDay 1: Hue - Hanoi\nFly to Hanoi, one of Asia’s most enchanting cities, full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. After arrival, you are greeted at Noi Bai International airport and transfer to the hotel. In the afternoon, head out to Ba Dinh Square and start our day with The Presidential Palace (passing by only, formerly Palace of the Governor-General of French Indochina), Ho Chi Minh’s house-on-stilt and nearby One Pillar Pagoda. Next is a visit to the Museum of Ethnology, which gives an excellent overview of the country's ethnic groups, their customs, and ways of life. The highlight here is the large, beautiful outdoor area featuring genuine houses and compounds as built and used by the many different ethnic groups.\nChalcedony Hotel\n\nDay 2: Hanoi – Ha Long Bay (Breakfast, Lunch, Dinner)\nBreakfast at hotel before heading out to Ha Long Bay, a UNESCO World Heritage Site. In Ha Long, you will board an overnight cruise amongst the more than 3,000 limestone islands rising majestically out of the turquoise bay. You pass grand rock formations and quaint fishing towns and sample a delicious lunch of freshly caught fish and seafood. \nIn the afternoon, you can choose from several interesting activities: a cooking demonstration with the chef on board, an optional traditional massage, or a refreshing swim. End the day with a spectacular set-menu gastronomic dinner. Overnight on a boat in Ha Long Bay (Remarks: cruise itinerary is subject to change depending on the weather condition).\nV Spirit Cruise \n\nDay 3: Ha Long Bay – Hanoi (Brunch)\nStart the day with calming Tai Chi, often accompanied by an amazing sunrise and the quiet breath-taking beauty of the bay’s landscape. The cruise passes beautiful spots such as Trong, Trinh Nu, and the Me Cung Caves, and you will have a chance to explore Surprise Cave before having buffet brunch on board.\nBack at the dock, where you will be met and transferred to Hanoi. Arrive in Hanoi at around 14.30 and start visiting highlights of Hanoi, Visit the Temple of Literature – the first university of Vietnam built in the 11th century. Then drive to Hanoi Center and explore the city's lively Old Quarter. This is a place you must see to experience Hanoi, where exciting shopping opportunities and vibrant cultural and historical sites share the same small area. Close your day by attending a wonderful performance of Water Puppet Show. \nChalcedony Hotel\n\nDay 4: Hanoi – Hometown (Breakfast)\nDay at leisure until transfer to the airport of Hanoi for your departure flight."}]},{"name":"Cycle Saigon to Hanoi (2020)","duration":14,"travelStyle":["Bicycle","Adventure","Group","Fully Guided","Discovery"],"oldPrice":0,"price":1990,"summary":"On this adventurous and active trip we experience Vietnam on two wheels. Along the way we discover Saigon, Hoi An, Hue, Hanoi and the majestic beauty of Halong Bay on an overnight cruise. What better way to fuel your ride than with the delicious Vietnamese cuisine.    Cycle the Central Highlands - Explore Vietnam's lush hill country and cycle over the Hon Giao Pass  Saigon - Cycle out to the Cu Chi Tunnels and explore the Mekong Delta   Hoi An - Visit the beautiful World Heritage town. ","highlights":["Cycle out to the Cu Chi Tunnels of Saigon","Explore the beautiful waters of the Mekong Delta","Visit the beautiful World Heritage town of Hoi An","Take a cruise and discover island paradises"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143436_3a3b2892.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143436_3a3b2892.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_f32ab76f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_ae6ee9ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_bdf1d291.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_90475b86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_5f7c187d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_5fa2b24f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_85b570da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_5fd76218.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_ca6ff095.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_f06c22c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_eb438b11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_68ced720.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_8b094b26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_d0b36285.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_e061441e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_56a6ac24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_c5939be9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_56cc2cd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_2a372b79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_7cdfcdd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_2a7fb04e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_a85c9324.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143436_cee165a8.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Quy Nhon","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Join trip Saigon; afternoon orientation tour","description":"We arrive in Ho Chi Minh City today and, after a chance to freshen up, late this afternoon (16.00) we take an orientation stroll which includes the prominent sights of old Saigon with the Hotel de Ville (home of the city's People's Committee), Notre Dame Cathedral and the impressive French style architecture of the GPO building. If arriving earlier in the day then you may choose to relax or visit some sites such as the Reunification Palace or the emotive War Crimes Museum. Alternatively you might like to explore the bustling stalls of Binh Tay Market, the largest wholesale market in southern Vietnam. Please note that although we spend the first three nights in Saigon there will be little free time as we spend the following days cycling in the Mekong Delta and Cu Chi tunnels area, returning in the early evening. You have the option of arriving earlier today or booking an extra night at the start of your trip."},{"title":"Day 2: Cycle to Cu Chi Tunnels","description":"Driving for 1.5hrs away from Saigon's remarkable rush hour traffic to reach the quieter suburbs this morning, we collect our bikes near the remains of an old US military base (25th infantry division) and start our ride for about 30 km to Ben Duoc, the site of the infamous Cu Chi Tunnels. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops. We will explore the tunnels with a local guide this morning. Be warned though, the tunnels are low and narrow and can be claustrophobic. After lunch we continue cycling for about 20 km towards Ben Nay to further explore the area. We drive 2hrs back to Saigon arriving in the early evening. It is possible to spend a free day in Saigon if you prefer to see more of the city. For the cycle ride today, and on subsequent rides, water is provided and you can top up your water bottle from the support truck.  Our total cycling distance today is approximately 50 kilometres (total accumulated ascent 50 meters, total accumulated descent 40 metres)."},{"title":"Day 3: Drive to Mekong Delta then cycle backroads to Cai Be","description":"Today gives us an opportunity to journey down into the Mekong Delta, to explore the fertile hinterland between the South China Sea and the Gulf of Thailand. Leaving Saigon, a 2 hour drive takes us into the Mekong Delta to Binh Duc (My Tho), from where we begin cycling through an interesting landscape of waterways, markets, orchards and riverside villages. The first 30km of today's ride are on roads with moderate traffic and the remaining 20km are on narrow pathways and routes that our support bus cannot follow. Here we can see local cottage industries making rice paper or coconut sweets as they have been for generations. After a tasty lunch of local produce we cycle on through Tan Phong and visit a beautifully restored traditional house in Ut Kiet, before finishing our ride at Cai Be's famous market. From here we drive for about 2 or 3 hours, depending on traffic, back into the centre of Saigon arriving in the early evening.  Our total cycling distance today is approximately 51 kilometres, flat cycling."},{"title":"Day 4: Exploring Vietnam’s Central Highlands","description":"Departing Saigon this morning we head north into the southern Central Highlands towards the mountain town of Dalat (set at 1500 metres elevation). After an initial 2 hour drive we commence today's cycling with a picturesque 30 kilometre ride through the hills of the Langbiang Plateau, negotiating our way along reasonably quiet, gently undulating back roads to the town of Gia Kiem and then Bao Loc. After a relaxing lunch in Bao Loc we board our bus again for a very scenic 2 - 3 hr drive right across the mountains, giving us stunning views over the forested hills and tea and coffee plantations, to finally reach the bustling mountain town of Dalat in the late afternoon. The city has a European feel in its architecture and a cooler climate due to the higher altitude.   Our total cycling distance today is approximately 30 kilometres (total accumulated ascent 210 metres, total accumulated descent 150 metres)."},{"title":"Day 5: Cycle over Hon Giao Pass then drive to Nha Trang","description":"We leave Dalat this morning by bus and drive for about half an hour to the start of today's ride. The beginning of the ride is on relatively quiet mountain roads with plenty of ascent and descent for the first 20km before we stop for a break. From here the next 30km culminates with an ascent of the Hon Giao Pass (1,700m), a challenging ride that takes us up through forests of pine and across a landscape of dramatic mountain scenery. After celebrating reaching the pass and a chance to rest at the top, the remainder of today's ride is a superb 30km of virtually uninterrupted descent towards the town of Khanh Vinh, where we plan to stop for lunch. We finish the rest of the journey to Nha Trang by bus and it should take us around 1.5 hours.  Our total cycling distance today is approximately 80 kilometres (total accumulated ascent 1140 metres, total accumulated descent 2962 metres)."},{"title":"Day 6: Boat trip to tropical islands","description":"Nha Trang's beautiful bays, golden beaches and turquoise waters have seen it quickly grow into a bustling town and popular tourist destination. Weather permitting, this morning we take a cruise out to explore the surrounding seas and islands. We aim to stop near one of the islands where you have the option to have a swim from the boat (possible to hire snorkelling equipment). We move on to another tiny island where we plan to spend a few hours to relax and swim. The island is privately owned and it is possible to rent a sun lounger and parasol. There will also be the option to enjoy drinks, a seafood lunch or snack on the island (at your own expense). Returning to Nha Trang later this afternoon the rest of the day is free.   No cycling today - rest day."},{"title":"Day 7: Cycle and drive from Nha Trang to Quy Nhon","description":"Using a combination of bus and bicycle this morning we continue along the coast to the city of Quy Nhon. We commence our ride from the hotel in Nha Trang, encountering heavier traffic as we leave the city which thins out as we head along the Pham Van Dong road and continue along the coastal road to Ninh An toll fee station (a journey of some 18 kilometres). From here we then take the bus for one hour to Dai Lanh, where we have a chance to swim and relax, before continuing by bus over Ca Pass to Bai Tien Song Cau. From here we resume our journey by bike with a 42 km ride to complete the final leg to Quy Nhon and our hotel for the night.  Our total cycling distance today is approximately 60 kilometres (total accumulated ascent 640 metres, total accumulated descent 775 metres)."},{"title":"Day 8: Pedal over the Thi Nai sea bridge; drive to Hoi An","description":"Departing Quy Nhon this morning we cycle out across Thi Nai Bridge, the longest sea bridge in Vietnam, which connects the city with the Phuong Mai Peninsula. Once across, we continue by bike along the Quy Nyon lagoon towards Phu My some 50 kilometres away. From Phu My we then travel by bus to Quang Ngai, the scene of the My Lai massacre - one of the most infamous episodes of the Vietnam War. After visiting the site and visitor's centre, we complete the final leg to Hoi An by bus, a journey of some 2 to 3 hours.  Our total cycling distance today is approximately 59 kilometres (total accumulated ascent 395 metres, total accumulated descent 390 metres)."},{"title":"Day 9: Morning walking tour of Hoi An; free afternoon","description":"The historic, merchant town and safe harbour of Hoi An had become one of the busiest international trading ports of Southeast Asia by the 17th and 18th centuries. Colonised by the Portuguese in the 16th century, it still retains its charm today, with many of its old buildings superbly preserved. This morning we take a walk through the historic heart of this World Heritage Site, taking in the city's famous Japanese Bridge and its museum, before wandering amongst its traditional wooden houses and Chinese temples. This afternoon is then free to perhaps take a gentle river cruise, try your hand at Vietnamese cooking or pay a visit to one of Hoi An's renowned tailors' shops, or maybe explore further afield by bike.    No included cycling today - rest day."},{"title":"Day 10: Cycle and drive to Hue via the Hai Van pass","description":"Leaving Hoi An after breakfast, we travel by bus up the coast to Danang followed by a twisting drive up to the lofty heights of the Hai Van (Sea Cloud) Pass. This stunningly scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and, as we reach the summit of the pass, the panoramas before us are simply spectacular. Descending by bus we head next for Lang Co where today's ride starts. We cycle along scenic back roads as we wind our way alongside the Cau Hai Lagoon to end the ride finally at Phu Bai. Meeting our bus in Thuan An, we then drive for about an hour on to Hué on the shores of the Perfume River.  Our total cycling distance today is approximately 80 kilometres (total accumulated ascent 100 metres, total accumulated descent 100 metres)."},{"title":"Day 11: Cycling around Hue then overnight train to Hanoi","description":"Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hue is still a thriving and important city. First thing this morning we drive to the impressive Old Citadel that still dominates the left bank of the river. After visiting the citadel we commence our final cycle ride. Our route follows the Perfume River and leads us to the 19th century Nguyen Tomb of Ming Mang. After visiting the mausoleum we return to our hotel to freshen up before the mid- to late-afternoon departure of the overnight train to Hanoi. We plan to stay in 'soft-sleeper' four berth cabins, bunk bed style and bedding is provided. Both Western and Asian style toilets are at the end of each carriage as well as a basin. The Leader will allocate beds keeping people together as far as possible but it may be necessary to share with other travellers.  Our total cycling distance today is approximately 20 kilometres (total accumulated ascent 130 metres, total accumulated descent 115 metres)."},{"title":"Day 12: Arrive in Hanoi; Drive to Halong bay for overnight cruise","description":"Arriving in the Vietnamese capital early this morning we drive to the hotel in time for breakfast. Later this morning we then drive (2.5hrs) to the Gulf of Tonkin and the breathtaking scenery of Halong Bay, a UNESCO World Heritage Site and one of the most visually impressive landscapes in South East Asia. Boarding the boat in time for lunch we set sail and visit Sung Sot Cave, spending this evening aboard the junk in twin-share, en suite cabins. Please note - the boat is not exclusive to Explore and we may be sharing with other tourists. You have the option to leave the majority of your luggage in the hotel in Hanoi and take only an overnight bag. If you prefer to take your main luggage it is fine but please note that the cabins are inevitably small.  No cycling, rest day."},{"title":"Day 13: Morning cruise then drive to Hanoi then city tour","description":"This morning we continue cruising through this wonderfully scenic landscape, enjoying the serenity of its limestone islands and visiting some of the caves (the optional cave visits can involve climbing some slippery steps). Returning to shore mid-morning we then drive back to Hanoi, a 2.5 hour journey that gets us into the capital in time to enjoy a short tour of the city. Our late afternoon walking tour includes a visit to the Ba Dinh Square and the Temple of Literature, as well as a chance to explore a little something of the city's fascinating Old Quarter.   No cycling, rest day."},{"title":"Day 14: Trip ends Hanoi","description":"The trip ends in Hanoi this morning after breakfast."}]},{"name":"Vietnam - Beach to Mountain 12 days","duration":12,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":914,"summary":"Guaranteed to depart! This tour is guaranteed to depart, so even if you're the only passenger confirmed, your tour will still go ahead as planned!","highlights":["Enjoy a traditional water puppet show","Experience the coconut candy mill","See Lady Thien Hau Temple in Saigon"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100049_228b7b92.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100049_228b7b92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_e5fff1dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_06c00364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_37b7ef42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_631ec10d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_d7554d18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_aec1ac99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_07b92b97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_5e55f6e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_8ffafad9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_84463a10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_f431e561.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_ee7be564.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_3fdab5f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_b2d5b4c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_a8b8a83a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_0b7a8b31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_6334b0b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_6d75697a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_99254c2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_c5ab09d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_0fc14761.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_7b0db106.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100049_a343ab2e.jpg"],"destinations":["Ho Chi Minh City","Can Tho","Cai Rang","Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1 Ho Chi Minh arrival","description":"Meal is not included\nOur car will pick you up at airport and takes you to hotel. After check in hotel, you have free time for relax or you can go sightseeing the life in Ho Chi Minh City such as: Ben Thanh Market, Central Post Office, Notre Dame Cathedral\nSpend overnight in Ho Chi Minh city."},{"title":"Day 2 Cu Chi Tunnels - Ho Chi Minh night life tour","description":"Meal included: Breakfast, Dinner\n8:30AM We depart from Ho Chi Minh City to Cu Chi Tunnels for 60km from Ho Chi Minh city. Cu Chi is now considered a heroic district for its role in the anti – American war in Vietnam. It is legendary for its tunnels system of over 220 km and is a popular spot for both Vietnamese and foreigner.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers along the side of road. You will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, when Cu Chi was “A Free Target Zone “. The remnants you will see that Cu Chi still has her evidence to prove the fierce battleground that took place there. Ever wonder what it feels like to fire an AK-47? Visit Cu chi tunnels, you have a chance to find out!\n\n03:00PM The tour finish at our company.\n\n6:00PM We depart by cycle, take you go around city, and then going to Water Puppet Theater. Enjoy Water Puppet Show at the theater.\n\nWater Puppetry – part of Vietnam’s Cultural Heritage. A living portrait of Vietnam’s history and culture… Watching the Vietnamese Water Puppetry is also the best way to discover the history and traditional cultural life of Vietnamese people. This program has been presented in various international festival and carried our cultural exchanges activities with other countries.\n\nAfter show, you will together take cycle or car to Bach Dang riverside, have a look before going ship. Take some picture with cruise. Then we start boarding one of the ships: Bonsai, Indochina Junk, Ben Nghe Cruise, …. The ship leaves Bach Dang port and leisurely cruises around Saigon River. Dinner will be served on board while tourists are being stunned by the colorful view of Saigon riverside by night. We can also experience Southern Vietnamese fork music or dance with fire by dancer or sing together show or live music….\n\n09:00PM After dinner, back to your hotel.\n\nOvernight in Sài Gòn"},{"title":"Day 3 Mekong Delta (My Tho - Ben Tre)","description":"Meal included: Breakfast, Lunch\n8:00 Am Begin the trip. It takes for one and half hours by bus to drive from Ho Chi Minh to My Tho City.\n• A smooth pass the rice fields to the beautiful rural. Start boat on the Tien River to islet. View the Dragon, Phoenix and Unicorn Islet. Walk into the village, visit fruit garden, enjoy the tropical fruit while folk music is performed by the local people.\n• The cruise will lead to Ben Tre province, “the country of coconut”, visit coconut candy workshop, bee house, enjoy honey tea and take a picture with snake.\n• The amazing rowing boat trip on the small canal – fully covered by the shadow of the water coconut’s tree.\n• After lunch, you have freetime for biking, walking. Next journey is Can Tho. Spend overnight in the hotel (or family home-stay with dinner can be arranged on request).\nOvernight in Can Tho."},{"title":"Day 4 Mekong Delta - Largest Floating market","description":"Meal included: Breakfast\nAfter having breakfast, you have chance to take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river, visit Cai Răng floating market which are the liveliest in the whole Can Tho City. Your experience will be full fill when you go and see how vermicelli’s soup is made. Wander around the village and meet the friendly local people and see a “Monkey bridge” – A bridge was built by only one stem of bamboo. Visit the orchard garden. Make a stop for lunch. Final trip is coming back to HCM City."},{"title":"Day 5 Half day Cyclo Tour in China Town","description":"Meal included: Breakfast, Lunch\n08:00Am (4 hours tour) \nExplore Ho Chi Minh City’s historic Chinatown, named Cho Lon, or “Big Market,” by the locals, and experience the city as it was before the war. Chinatown was established as early as Saigon, and is where the Ming Dynasty Chinese first settled in Vietnam. They live their lives much as they did before 1975, doing business and continuing their traditions as the country develops around them. Travel by cyclo which is the typical pedicabs of the city – experiences of local life up close, stopping to enjoy tasty food. Feel the hustle and bustle of street vendors selling a mixture of herbs for traditional medicine. Snake your way down tiny alleys on the agile vehicles, passing many small, family-run businesses. Along the way, you will come across the 250-year-old Lady Thien Hau Temple (God of the Sea), as well as the historic South Saigon Cha Tam Church. Then you have time for shopping at Binh Tay Market before you come back to hotel. We let you try Vietnamese local food at our restaurant. After lunch, go back hotel, take a shower and relax.\n03:00PM Our driver take you to Tan Son Nhat Airport.\n05:00PM Flight from Saigon to Ha Noi.\n07:00PM Arrive to Noi Bai airport, car transfer to the center, check in hotel and free time.\nStay overnight in Ha Noi. "},{"title":"Day 6 Ha Noi - Ha Long Bay","description":"Meal included: Breakfast, Lunch, Dinner\n(your hotel – Tuan Chau Marina – Halong bay – Lunch – Amazing Van Gia floating village – Sunset party – Soi Sim island – Dinner – Fishing)\n7.45 – 08.20 approx\n– Our guide will meet you at your hotel. The shuttle bus or private car pick up.\n– Enjoy the peaceful scenery as we travel through the countryside, farmlands and Red River delta.\n– You will have a chance to take photos. Comfort break. The time from Hanoi to Halong bay is approximately 3 ½ hours.\n\n12 – 12.30 noon approx\n– Arriving Tuan Chau Marina. Welcome aboard the cruise. Meet the captain, crew and join us for welcome cocktail as we tell you about life onboard.\n– Check into your cabin. Time to refresh and unwind\n– Set sail as lunch is prepared by our chef.\n– Join us for a relaxing lunch in the restaurant or on the outdoor dining area. Enjoy the stunning views of the Bay, its dramatic limestone islands as we sail through the calm waters.\n\nAfternoon\n– While we make our way to the amazing Van Gia fishing village, relax on the sundeck and watch the world go by or take an afternoon nap in your cabin. Middle afternoon arrive at Van Gia floating fishing village.\n– Drop anchor.\n– Our guide will give you some information and interesting facts about this fascinating village and its local community.\n– Disembark and you can choose which options when you visit the village by Kayak or local bamboo boat to visit the village. They will be your guides through their fishing village where you can meet the locals, see at first-hand what life is like living on the water, we are proud of our working partnership with, and support of this community.\n– Our cruise will take you to the Soi Sim natural beach for swimming and snorkeling, you can enjoy our interesting games such as football, basketball. On the way cruising, you will enjoy with us the sunset party with fruits and wine as our complimentary\n– Back on board the cruise, we head towards the sleeping area.\n\nEarly evening\n– Take an opportunity to refresh and then join friends for a pre-dinner drink in the bar.\n– Dinner is served in the restaurant or outdoor dining area if the weather is permitted, which is a gastronomic delight. After dinner, unwind in the bar where there is a selection of books, magazines and board games or watch a movie on our plasma TV; join some of our team to go cuttle fishing at night. Accommodation and overnight on boat"},{"title":"Day 7 Ha Long Cruise","description":"Meal included: Breakfast, Lunch\n(Tai Chi – Breakfast – Surprising Cave – Cooking Demonstration – Lunch – Your hotel and Farewell)\n06:30 am\n– For the early risers join us for a Tai Chi session on the sun deck. Tai chi helps focus the mind and condition the body and there is no better environment to practice this than amongst the limestone peaks and islands.\n– Breakfast, coffee, tea served.\nAfter breakfast, we sail through the waters and pass by a number of caves and we drop anchor at Surprising (Sung Sot) Cave.\n– Disembark and visit Surprise Cave located on Bo Hon Island. It is one of the widest grottoes in Ha Long Bay with thousands of stalactites and stalagmites\n\n09:30 am\nWe board the cruise again. Take time to refresh and relax before checking out. Bags can be left in the luggage store. You will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n\n12 noon\nReturn to the shore and disembark from the cruise as our crew say farewell. Transfer to minibus or private and return to Hanoi. Arrival back at your hotel approximately 16:30/17:00.\nSpend overnight in HaNoi."},{"title":"Day 8 Ha Noi city - Train to Sapa","description":"Meal included: Breakfast, Lunch\nIn the morning:\n07:30 - 08:30: Our bus & tour guide will pick you up at the hotel in Ha Noi old quarter depart to Hanoi city tour full day.\n09:00: Visiting first place named Tran Quoc pagoda on the West Lake the oldest pagoda in Vietnam.\n09:30: Visit the Ho Chi Minh Mausoleum and Museum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Just next door is Ho Chi Minh’s house on stilts and lying to one side of the Mausoleum is the One-Pillar Pagoda which was founded by King Ly Thai To in 1049 - the structure has become an important symbol for the people of Hanoi. \n11:00: Visit the Bat Trang  Pottery Village\nIn the afternoon:\n13:00: Bus takes you to a local restaurant in Hanoi Old Quarter, have a rest and enjoy the lunch.\n14:00:  Visit Temple of Literature, the most famous temple situated in Hanoi, also functioned as Vietnam's first university. It was first constructed in 1070 under King Ly Nhan Tong and dedicated to Confucius, sages and scholars. A vast structure that has existed to present day.\n15:30: Drive to legendary Hoan Kiem Lake, visit Ngoc Son Temple dedicated to Van Xuong saint and former general commander Tran Hung Dao for his struggle against Mongolians. You also see the beautiful Vietnamese and French architecture around the lake.\n16:00: Arrive back to your hotel. Tour ends !\nNotes:\n•\tHo Chi Minh Mausoleum Ethnology Museum and  close on Monday and Friday morning.\n•\tThe itinerary can be changed due to weather, tide levels and operating conditions.\n\nAdd some options:\n15:30- 16:15:\nEnjoy Water Puppet Show or go sightseeing by Electric Car or Cyclo around Old Quarter in Ha noi\n17:00: End of City tour\nHighlight: Ho Chi Minh Mausoleum and Ethnic museums will be closed on Monday to Friday morning.\nLeave for Ha Noi and take a shower at hotel in Ha Noi.\nUntil 19:30 pm: Our guide will pick up you at your hotel for boarding the train to travel Lao Cai."},{"title":"Day 9 Sapa Trekking","description":"( Lao Cai-Sapa- Lao Chai-Ta Van village) 10km trek\nMeal included: Breakfast, Lunch, Dinner\nOur driver pick you up from Lao Cai station and transfer to our office in Sapa for breakfast. Relax and have a shower before start the tour. Trek to Catcat village, the village of H‘mong tribe in the valley, which remains very generally uncorrupted outside forces. Excellent views of the valley, the magnificent limestone and paddy fields of H‘mong village.and panorama of the village. Enjoy some visits to local families and reach their customs. After the village down into the valley, The village is surrounded by flowery valley and deep-green pines. The rocks near the river and waterfall provide a marvelous place for picturesque photos and sunbathing during good weather. Walking back Sapa for Lunch and free time in afternoon for discovering beautiful town, see ethnic people activities and life in Sapa.\nDinner will be served at local restaurant.\nOvernight in Sapa"},{"title":"Day 10 Sapa Trekking - Train back to Ha Noi","description":"(Cat Cat village) 7km trek\nMeal included: Breakfast, Lunch, Dinner\nAfter Breakfast in the hotel, we take a bus to Lao Chai village, a village of Black H‘mong. Short trek down to river to visit hill tribe house to see their living style and the local woman made their handicraft clothes. Further on along the trail, the Tavan village where Dzay people staying can be seen. Visit the village and reach their customs and colorful from black Hmong and red DZAO people. Lunh in local restaurant, after that we continue up and down to rice paddy field , it is one of best view place in sapa and walk through bamboo forest, relaxing in waterfall to have a swimming and a panorama of Giang Ta Chai village. Turn back to Sapa by bus in afternoon for hot shower, relax before take a bus back to Laocai railways station for night train back to Hanoi.\nDinner at local restaurant nearby Train Station.\nStay overnight on train."},{"title":"Day 11 Back Ha Noi - Relaxing time","description":"Meal is not included\n06:00 am : The train will arrive in Hanoi. Our driver pick you up at train station, transfer to hotel (early check in). Relax in Ha Noi city. Stay overnight in Ha Noi."},{"title":"Day 12 Ha Noi Departure","description":"Meal included: Breakfast\nAfter breakfast, free for leisure until the car transfers you to the airport. Have a good flight  and see you again."}]},{"name":"Sapa Tour By Night Train From Hanoi","duration":3,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","Moderate","Train & Rail","In-depth Cultural","Holiday"],"oldPrice":0,"price":150,"summary":"•\tExperience the night train to Sapa- the best mountain range in the northern Vietnam and learn more about the ethnic minorities' rural life.\n•\tOur private pickup service at the hotels located in Hanoi Old Quarter or some districts nearby\n•\tEnjoy a comfortable overnight journey between Hanoi and Lao Cai with fully equipped cabins with air-conditioning \n•\tEnjoy deluxe accommodation at My Boutique Hotel & Spa/Sapa Relax Hotel & Spa  \n•\tExplore Muong Hoa valley and ethnic’s villages sightseeing with local English-speaking guide to learn more about the ethnic minorities' rural life.\n•\tTrek through the amazing landscapes and get breathtaking views\n•\tEncounter friendly locals in scattered villages and learn more about a lifestyle that the everyday stresses of modern life has yet to touch.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e57bdc5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e57bdc5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5869bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5894cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e58ba77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e58daf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5901ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e59c2e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5ab6ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5af2dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5b20d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5b3890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5b6540.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5b8b58.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5bb2ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5bd96e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5bfb60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5c1c3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e2041e5c45a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e20414a27614.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e20414a31cb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130299_5e20414a3d6b3.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Hanoi – Night train to Sapa(Meals: No)","description":"8:00pm: Our guide picks you up at your hotel in Hanoi Old Quarter then leave for Hanoi Railway Station for night train to Lao Cai. We will keep the train tickets for you and guide you how to get into train cabin and get out of the train from Lao Cai Railway Station. \n\nNight 1: Overnight on train to Sapa( Deluxe cabin with A/C on King Express train)"},{"title":"Sapa – Y Linh Ho - Lao Chai - Ta Van Village trekking tour (B,L,D)","description":"The train arrives at the Lao Cai train station about 6:00am. Our driver will hold your name welcome board at the exit gate of Lao Cai Railway Station. He will pick you up and transfer you along the beautiful road to Sapa town. You will have breakfast at the hotel.\nAfter breakfast, we leave the hotel and start trekking. After 4km on the main road, we start going down to the valley by the small trails through the terrace rice fields to get to Y Linh Ho hamlet, and from here to the Black H'mong village - Lao Chai village (Black H'mong is one of the biggest minority groups in the Sapa). After that, you will continue your trekking along Muong Hoa stream, paddy field to Ta Van village, visit and understand about \"Zay\" ethnic people. You will see houses of The Zay people which are built of wood and bamboo with a clay floor. You will have picnic lunch at the village when enjoying beautiful sightseeing of paddy fields around.\nGo back to Sapa in the afternoon.\nNote: If you don’t want to go hiking, we will organize private car and tour guide for you. Please contact us for this service.\nEvening: Have dinner at the hotel then you will have time to go around discovering Sapa town.\nNight 2: Overnight at 3 star hotels in Sapa( Deluxe room at My Boutique Hotel & Spa/ Sapa Relax Hotel & Spa)"},{"title":"Sapa tour – transfer to Lao Cai railway station (B,L,D)","description":"7:00: Have breakfast at hotel.\nOption 1: Cat Cat village trekking tour\n\n9:00: Trekking from hotel to Cat Cat  village of H’ mong, you have a chance to visit a waterfall and the hydroelectric power station built by the French, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools.\n\n12:30: Enjoy lunch at the hotel's restaurant.\nAfternoon, you will have free time to visit Sapa town, market, church then have diner at the restaurant near Lao Cai railway station before catching night train back to Hanoi.\n\nNight 3: Overnight on train back to Hanoi( Deluxe cabin with A/C on King Express train)"}]},{"name":"Road Biking the Ho Chi Minh Highway","duration":11,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":2300,"summary":"On this Ho Chi Minh bicycle tour, your road bike takes you up mountain passes, along glistening rivers, and through jagged valleys. It’s the beauty of Vietnam's landscape that will make you happy to be riding on the newly-built Ho Chi Minh Highway. Of course, other sites on this historic road will make you pause and contemplate the past, but let the scenery wash over you as you explore this remote area of Vietnam.","highlights":["Ride up mountain passes and along glistening rivers","Enjoy smooth cycling on the newly-built Ho Chi Minh Highway","Let the scenery wash over you as you explore beautiful Vietnam"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/80902_f4d4e56b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/80902_f4d4e56b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_6851b8c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_91293282.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_4d819c5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_641e7d40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_d3237034.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_dc43cf15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_eb8cc134.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_899157a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_971f27b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80902_e126bfcd.jpg"],"destinations":["Hanoi","Mai Chau","Phong Nha-Kẻ Bàng National Park","Hue"],"timeline":[{"title":"Day 1","description":"We meet at the hotel for a trip briefing and a welcome dinner."},{"title":"Day 2","description":"We leave Hanoi, transferring just outside the city to start our riding."},{"title":"Day 3","description":"We ride along the undulating valley of the Song Ma River as we head towards Hoi Xuan."},{"title":"Day 4","description":"Take a short transfer to avoid the main road, then we start to ride on the wide and newly-built Ho Chi Minh Highway, which we’ll have virtually to ourselves."},{"title":"Day 5","description":"Back on the Ho Chi Minh Highway, we wind through lush jungle and beautiful villages nestled under the Truong Son mountain range."},{"title":"Day 6","description":"From Pho Chau, the Ho Chi Minh Highway is still a dream to ride on and you’ll appreciate the smooth tarmac as the mountains rise and the road winds up and down along the hillsides."},{"title":"Day 7","description":"We take a boat to visit part of Phong Nha Cave, then get back on our bikes to cycle a gentle ride on a flat road to the seaside village of Dong Hoi."},{"title":"Day 8","description":"Today, there will be many reminders of the as our ride today takes us across the DMZ (Demilitarized Zone, also known as the 17th Parallel) to Cam Lo."},{"title":"Day 9","description":"We visit to the Khe Sanh combat base, where relics of the war are exhibited. Then we enjoy a traffic-free ride undulating along the Dak Rong River."},{"title":"Day 10","description":"We ride downhill to Hue, Vietnam’s Imperial City, a UNESCO World Heritage Site. We ride through the middle of Vietnam for 60 km on backroads before hitting Highway 1, just a few kilometres south of Hue."},{"title":"Day 11","description":"We end the tour, but you can extend your travels."}]}]