[{"name":"Cycling Vietnam’s Backroads 12 Days","duration":12,"travelStyle":["Bicycle","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1579,"summary":"This fourteen-day cycling tour will take you from Hanoi in the north of Vietnam to Ho Chi Minh City in the south. The itinerary has been designed for leisure cyclists seeking a pleasurable means of discovering the best of the country’s rich cultural and natural heritage. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147237_3df87583.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147237_3df87583.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147237_d82b289e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147237_62feb2f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147237_c7ece983.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147237_1c704012.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Quy Nhon","Mui Ne","Ho Chi Minh City"],"timeline":[{"title":"Arrival at Hanoi","description":"Arriving at Noi Bai airport in Hanoi, you’ll be met and driven to your hotel. You’ll have time to relax after your journey before a ‘Welcome’ dinner at a restaurant in a restored French colonial building. In the evening, you’ll have tickets for a performance of traditional Water Puppetry, an art form unique to northern Vietnam, and a good, light-hearted introduction to its rural culture. You’ll spend the night in Hanoi.\n"},{"title":"Hanoi - Halong (Lunch, Dinner)","description":"After breakfast, you’ll leave for Ha Long Bay, one of the most spectacular UNESCO World Heritage Areas and the world’s largest marine limestone ‘karst’ landscape. There you’ll board your boat, a wooden junk built from the model of the old Vietnamese court vessels with sails, a wide transom and rectangular superstructure, that will take you first to the busy World Heritage area and then to some of the less well-known grottoes and caves. Weather permitting, you’ll be able to swim, fish, climb a hill (not a mountain!) for an overview of the Bay’s remarkable seascape, or venture into some of the sea level caves in a small sampan. All your meals will be provided on board, usually based on fresh seafood, and you’ll sleep in a twin cabin with an en suite toilet and shower."},{"title":"Ha Long/Hanoi/Hue (Lunch)","description":"You’ll spend the morning cruising Ha Long Bay, followed by lunch just before docking around noon and leaving for Hanoi thence to the Noi Bai airport for a late afternoon flight to Hue. When you arrive, you’ll be met by our guide and driven to your hotel for check-in. You’ll spend the night in Hue.\n"},{"title":"Cycling day (40km)- Imperial Hue (Lunch)","description":"In the morning, your bicycles will be at your hotel ready for you to ride through Hue’s rural villages towards the Thanh Toan Bridge (roofed in Chinese style). Nearby, a local market will provide you with views of daily life and local products. You'll then return to Hue’s city centre with en-route visit the Ngoc Son Princess ‘garden house’. It has an attractive family altar and the owner is an expert on Hue’s culture and history – he will be pleased to explain the geomantic principles underpinning the building and garden’s construction.\nAfter lunch, your route will take you past the Imperial Citadel to visit some of the garden houses in Phu Mong Kim Long village, followed by a visit to the Thien Mu Pagoda. From there, you'll cross the river by boat to ride along a country lane to one of the handicraft villages in Hue’s hinterland that specialises in a single product range of ‘Huong Tram’ (incense sticks) village before looping back to your hotel. \nIn the evening, you’ll sit down for dinner in the pleasant surroundings and a comfortable atmosphere of another of the garden houses. The owner will prepare and serve a traditional meal based on the distinctive characteristics of classic Hue cuisine. You’ll spend the night in Hue.\n"},{"title":"Cycling day (80km)- Hue to Hoi An (80km cycling) (Lunch)","description":"A classic cycling trail for people with average fitness - taxing, but not exhausting! You’ll be driven to the coast, about 18km (or 2O minutes) beyond Hue’s city limits. The first 40km is off the beaten track along a picturesque lane shaded by coconut palms running alongside a peninsula from Thuan An beach to Vinh Loc. A pause to explore the hundreds of ancestral tombs scattered across the high sand dunes is a welcome break. \nUpon reaching the end of the peninsula, a local ferry will take you across the Perfume River’s estuary and, after reaching dry land, the route takes you a further 11km arrive at Highway 1. At this point you have two options – brave the traffic on Vietnam’s busiest road or be transferred to the start of today’s three hill climbs. Unless you enjoy following heavy juggernauts belching diesel fumes, we recommend the latter!\nAfter the first two moderate climbs, each about 3km, a break to relax, sunbathe, splash in the azure waters of Lang Co beach and seafood lunch, you’ll be ready for the Hai Van Pass. You’ll ignore the tunnel, full of commercial traffic and noxious gasses, in favour of the 11km mountain road. Since the tunnel was built, it’s very quiet - the gradient is manageable and the views breathtaking! \nFinally, you’ll then be transferred the rest of the way to Hoi An Ancient Town, a historic old port and trading post where you’ll spend the night. "},{"title":"Cycling day (35km)- My Son (B, L, G) (Lunch)","description":"A gentle ride westward to the World Heritage My Son Sanctuary, mostly on quiet level roads following the banks of the Thu Bon River!\nSeven kilometres after setting off, you’ll cross the river to visit a fishing village. After remounting and dropping in at a local market, a further 11km takes you to Bara bridge for a break and refreshments. Revitalized, you’ll soon need to push your cycles across a couple of major roads, then it’s more back roads until you reach My Son. \nYour guide will show you the remains of the remarkable towers constructed by the Cham builders, many centuries ago - their origins and purpose have yet to be fully explained. In the afternoon, you’ll return to your hotel via your support vehicle rest of the day to do what like.\n"},{"title":"Cycling day (47km)- Hoi An to My Lai (Lunch)","description":"After a hearty breakfast, you’ll drive along Highway 1 to Quang Ngai and My Tra Hotel, your overnight accommodation. Your bicycles will be waiting for you. The first stage is gentle - quiet country lanes leading to the coast and fishing villages. A short 2km ascent to the top of Thien An Mountain offers striking views of the surrounding countryside with time to visit an ancient Pagoda dating back to 1650 and still an active place of worship. The monks living in the pagoda are always welcoming - have a small donation ready!\nThe gradient is now downhill towards the site of the infamous My Lai massacre, now a shrine dedicated to the unarmed 550 villagers, mainly women and children, slaughtered by the Americans in March, 1968. Many were raped, beaten, tortured, or maimed before they were killed. A museum and gardens commemorate the event, but the silence broken only by the sighing of the breeze in the trees is its own memorial. \nAfter a guided tour to reflect on the war, the quiet roads take you to the beach for relaxation and perhaps a swim. After a picnic lunch, you can loop round through the fishing villages to return to Quang Ngai or, if you’re tired, take the direct route back to your hotel. \n"},{"title":"Cycling day (73km)- My Lai to Quy Nhon (Lunch)","description":"\nToday, the serious cycling begins, hence an early breakfast! A drive takes you to the start point, 99km south of My Lai. The first section meanders alongside the coast from Binh Duong, Tung Giang and Tuy Phuoc on a small provincial road passing many villages, far from the main highway. There’ll be plenty of time to dismount to experience the warmth and friendliness of Vietnamese people. The surface varies from reasonable to rough, so the support vehicle may have to detour to avoid hazards. Eventually, you’ll arrive at Tuy Phuoc, 9km to Quy Nhon City, your destination and accommodation. You can cycle this last stage if you wish, but you may prefer to be driven as this the section of the road is quite busy. "},{"title":"Cycling day (67km)- Quy Nhon to Nha Trang (Lunch)","description":"Another early start and a transfer well away from the main highway! The day’s route mostly follows the lanes and tracks alongside the Reunification Express railway. The first stage will be on an isolated but well-surfaced road. The gently rolling terrain and views of the Highland foothills make a splendid backdrop for the potbellied pigs and barefooted children dashing across your trail as you pass ethnic minority and Vietnamese communities’ en-route. You’ll be quite a spectacle for the villagers, so expect plenty of offers of hospitality.\nAs your ‘off the beaten track’ route begins to converge with the highway, you’ll transfer to four-wheel transport and head to Nha Trang where you’ll spent the night, stopping at Dai Lanh Beach for a dip and refreshments on the way. \n"},{"title":"Cycling day (80km)- Nha Trang to Mui Ne (Lunch)","description":"As usual, you’ll drive to the outskirt of the city to avoid the traffic. Once on your cycles, the route continues southward towards Cam Ranh (32 kilometres, about two hours) until you join Highway 1 and dismount. After driving to Ca Na for lunch, you’ll drive to Luong Son, where you re-mount. At 48km, (about one and a half hours) the last stage is the longest. Although the terrain undulates from time to time, the road is good quality so you can make good time. As you near Mui Ne and your hotel, the last section is hilly with high sand dunes and ocean views.\n"},{"title":"Mui Ne free (B)","description":"Your time will be your own.\n"},{"title":"Mui Ne/Ho Chi Minh City Departure","description":"Your time will be your own until your driver arrives to take you to Ho Chi Minh City. (approx. 4.5 hours) for your departure flight.\n"}]},{"name":"Highlight Ho Chi Minh City 6 Days 5 Nights","duration":6,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":287,"summary":"Discover the most beautiful and biggest City of Vietnam!  Sai Gon is a bustling, dynamic and industrious centre, the largest city in the country, the economic capital and the cultural trendsetter. Yet within the teeming metropolis are the timeless traditions and beauty of an ancient culture.The trip will take you to visit museums, Cao Dai and Cu Chi Tunnels. Discover Mekong Delta by Boat cruise! Try the best local food and enjoy your time !","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/175235_1caea198.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/175235_1caea198.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_9f709f62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_e57dc9e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_c3faa10d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_ff48d563.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_88be8c09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_18b53242.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_4169fa98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_f03ba038.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_7304ddf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_d131c97f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_ab8bc5a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175235_1d0ed5eb.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Ben Tre","Can Tho"],"timeline":[{"title":"DAY 1: SAI GON ARRIVAL (NO MEAL)","description":"Welcome to Sai Gon ! You will meet the driver, then transfer to hotel for check in. The rest of day is your own at leisure. You can visit Ben Thanh market, Old Central Post Office, Notre Dame Cathedral....\nOvernight in Sai Gon."},{"title":"DAY 2: CAO DAI - CU CHI TUNNEL (B/L/X)","description":"07.45- 8.00: The tour guide pick up at your hotel.\nIn the morning admire the colorful daily service and afternoon experience the Cu Chi tunnels\nThe Great holy See temple, built in 1926, is considered o¬ne of the most striking structures in all of Asia. It is the headquarter of Caodaism, a religion with colorful mix of Buddhism, Christianity, Confucianism. Visitors will attend the noon prayer session to witness the daily mass held by the Cao Dai followers, which is a great experience. After lunch, visitors will go to the Cu chi tunnels. \nLocated 60km from Hochimnh city, Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors. \nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was \" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there. \nOvernight in Sai Gon."},{"title":"DAY 3: MEKONG DELTA - MY THO - BEN TRE- CAN THO (B/L/D)","description":"Leave Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel (family home-stay with dinner can be arranged on request). Free time to visit bustling Can Tho market."},{"title":"DAY 4: CAI RANG FLOATING VILLAGE (B/L/X)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river (Bassac River), then proceed to visit Cai Răng floating market, which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to HCM city. \nOvernight in Sai Gon."},{"title":"DAY 5: CAN GIO MANGROVE FOREST - MONKEY ISLAND 1 DAY ( B/L/X)","description":"8h15: Our tour guides pick you up at booking agents and head to Can Gio, otherwise known as “Monkey Island”.\nOn arrival, we visit mangrove forest to see over 1,000 monkeys, living there, you also can feed and take photos with many monkeys surrounding and climbing on your shoulder. Continue with a short walk to an alligator farm, where local people have conserved many huge alligators since the “Vietnam war” and you can try “alligator fishing” (optional). Then take speed boats to “Sac” guerilla camp built in deep jungle. Today the camp has become a major tourist attraction giving the visitor a unique experience and a feel of what jungle life in the war must have been like. \nWe will then stop at a local seafood market with various kinds of fresh seafood regarding squids, lobsters, rays, etc and dried seafood. There, enjoy a welcome drink (sugar cane juice) before having a delicious Vietnamese lunch on a beach in a resort, where we are at leisure for swimming and sight-seeing.\nBefore heading back to Saigon, we can stop at mango gardens to buy some fresh mangoes & end the tour at approximately 5:30 pm.\nOvernight in Sai Gon."},{"title":"DAY 6: SAI GON DEPARTURE (B/X/X)","description":"Have breakfast at hotel. You are free until the driver transfer to airport for flight back home.\nEnd of the service !"}]},{"name":"Highlight Vietnam 7 Days 6 Nights ( Hanoi, Halong bay and Ho Chi Minh City)","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":375,"summary":"You will begin in charming Hanoi, Vietnam’s artistic and intellectual capital. Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Travelling to beloved Hanoi, you will not only be captivated by its ancient beauty but also feel the peaceful life here associated with rich of the nation. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/175657_682b34c2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/175657_682b34c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_46c3c78b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_9336f9ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_94c11303.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_3596b653.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_62d65f84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_db9a3fa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_c6704248.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_2d6bf4ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_25faf1f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_7fc4dc4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_1f02f696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/175657_e07c42ba.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: HANOI ARRIVAL (NO MEAL)","description":"Welcome to Hanoi ! You will be greeted by our guide and transferred to the hotel. The rest of day is your own at leisure. You can see water puppet show in the afternoon.\nOvernight in Hanoi."},{"title":"Day 2: HANOI CITY TOUR (B/L/X)","description":"You will visit Ethnology museum on Tue, Thu, Sat, Sun and Bat Trang village on Mon, Wed, Fri.\n7.30 – 8.30: Meet your tour guide.\n- Star the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.\n- Visit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father, his house- on – stil and  One pillar pagoda- modeled after a lotus flower, a symbol of Hanoi.\n- Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13.00: Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\n- Visit Temples of Literature constructed in 1070- dedicated to Confucius, sages ad talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam’s first university.\n- Leave for a legendary Hoan Kiem Lake and Ngoc Son temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians.\n16.00: Arrive back in your hotel. Tour ends\n"},{"title":"Day 3: HA LONG BAY 1 DAY (B/LX)","description":"07:30 - 08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields to Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:30 Board our Dragon Cruise and start cruising among limestone islands and photograph of stunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life. Cruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n 15:00 Visit Thien Cung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n 16:15 Stop at the harbor again to catch the bus to Hanoi.\n 19.30 Arrive back in Hanoi. Tour ends.\n"},{"title":"Day 4: HA NOI - HO CHI MINH CITY TOUR (B/X/X)","description":"Have breakfast at the hotel. You are free until the driver transfer to airport for flight to Ho Chi Minh.\nThe driver transfer to hotel for chek in. In the afternoon, you join Ho Chi Minh city tour half day. Afternoon: 13:30 to 17:00 pm\nStart the trip at travel office for visiting Reunification palace which was the residence of the President of South Vietnam until end of the war in April 1975. Continue seeing some impressive French colonial structures including Notre Dame Cathedral and the Old Central Post Office. After visiting the City Hall, take a break-time at Ben Thanh market where anything and everything is for sales. Return to District 1.Tour ends. Overnight in Ho Chi Minh.\n"},{"title":"Day 5: MEKONG DELTA 1 DAY (B/L/X)","description":"HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.30 )\nEnjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories. \nOvernight in Ho Chi Minh. \n"},{"title":"Day 6: CAO DAI - CU CHI TUNNEL 1 DAY (B/L/X)","description":"In the morning admire the colorful daily service and afternoon experience the Cu Chi tunnels\nThe Great holy See temple, built in 1926, is considered one of the most striking structures in all of Asia. It is the headquarter of Caodaism, a religion with colorful mix of Buddhism, Christianity, Confucianism. Visitors will attend the noon prayer session to witness the daily mass held by the Cao Dai followers, which is a great experience. After lunch, visitors will go to the Cu chi tunnels. \nLocated 60km from Hochimnh city, Cu Chi is now considered a heroic district for its role in the anti - American war in Vietnam. It is legendary for its tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors. \nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was \" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there. \nOvernight in Ho Chi Minh.\n"},{"title":"Day 7: DEPARTURE (B/X/X)","description":"Have breakfast at the hotel. You are free to go shopping until the driver pick up and transfer to airport for flight back home.\nEnd of the service !"}]},{"name":"Amazing Trekking Tour in Sapa 5 Days/5 Nights","duration":5,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":293,"summary":"Sapa is one of the most breathtaking hill stations in Vietnam which reflects the signature of French architecture and colorful hill tribal cultures. This is home to stunning mountain landscapes, verdant rice terraces, unique stilt villages and Indochina peak, the Fansipan. Travellers are invited to enjoy the best of Sapa all the year round with different taste of seasons and exciting outdoors.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/173940_87ed3691.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/173940_87ed3691.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_f7b8f384.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_04968509.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_1a67995f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_6262fb09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_24897981.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_5eb9bcbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_ad1c8895.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_aa7625ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_0d3bff4d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_ad5e09e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_57c0277f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_7e4f05ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173940_1d1e8faa.jpg"],"destinations":["Hanoi","Sapa","Lao Cai"],"timeline":[{"title":"Hanoi – Sapa (No Meal ) by train","description":"Driver will pick you up at hotel in Hanoi old quarter then transfer to train station to Sapa.\nOvernight on train."},{"title":"Sapa – Y Linh Ho – Lao Chai – Ta Van","description":"12 km of trekking, visit Y Linh ho, Lao Chai and Ta Van villages of the H’mong and the Dzay minorities. \nAfter lunch at a local family in Ta Van, we keep on hiking around the village of the Dzay & H’mong where we stay overnight in a local family for you to get to know their daily life of the local people: work, custom, embroideries, clothes...\n\n\n- B, L, D\n\n\n- O/N at the Dzay local house"},{"title":"Ta Van – Giang Ta Chai – Su Pan – Ban Ho","description":"After pancake made by your host family, we continue to discover Giang Ta Chai village, then Su Pan villages of the red Dzao minority. \nAfter picnic lunch, we keep on hiking to Ban Ho, the village lies within a beautiful valley, home to the Tay minority people who have their traditional house on stilts and we will spend the night here. \n\n\n- B, L, D\n\n\n- O/N at the Tay local house"},{"title":"Ban Ho – Nam Toong - Sapa","description":"2km walking to a very nice waterfall discovered and named “the Lavie” by the French during the colonial time in Vietnam. Enjoy swimming then go up to the mountain to visit a small hamlet of the Red Dzao people called Nam Toong, then get back to Ban Ho before get to Sapa by Car.\n\n\n-\tB, L,D\n-\tBus to Lao cai Station, take train back to Hanoi. Overnight on train"},{"title":"Hanoi Depature ( No meal )","description":"Arrival Hanoi early morning.\n\n \nEnd of services !"}]},{"name":"Hanoi, Sapa and Halong bay 5 Days 4 Nights","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":260,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Travelling to beloved Hanoi, you will not only be captivated by its ancient beauty but also feel the peaceful life here associated with rich of the nation. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/184554_2ff60080.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/184554_2ff60080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_cd97c6d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_3497557a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_26c64ce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_66d0aa5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_d1c2acb6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_1871d14b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_28ab451c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_f603795b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_034836ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_01ffabfc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184554_abe68d44.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Cai","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi arrival (no meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Ha Noi.\n"},{"title":"Day 2: Hanoi – Sapa – Cat Cat village (B/L/D)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\nOvernight at the hotel.\n"},{"title":"Day 3: Sapa- Lao Chai- Ta Van –Hanoi (B/L)","description":"8:00 – Have breakfast at the hotel.\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\n"},{"title":"Day 4: Ha Long Bay 1 day (B/L/X)","description":"07:30 - 08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields to Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board our cruise and start cruising among limestone islands and photograph of stunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life. Cruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n15:00 Visit Thien Cung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n16:15 Stop at the harbor again to catch the bus to Hanoi.\n18.:30 Arrive back in Hanoi. Tour ends.\nOvernight in Hanoi.\n"},{"title":"Day 5: Departure (B/X/X)","description":"Have breakfast at the hotel. You are free to go shopping until time the driver transfer to the airport for flight back home.\n\n----End of trip!-------\n"}]},{"name":"Northern Vietnam discovery 8D7N (Hanoi- Sapa- Ha Long - Ninh Binh)","duration":8,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":485,"summary":"Discover Vietnam with the trip 8 days 7 nights. It will give you full feeling when exploring the beauty of famous destination in the North (Ha Long, Sapa, Hanoi, Ninh Binh). Refresh soul in Sapa where you can find the beauty of nature in valleys, mountains, streams, waterfalls and the warmly welcome of the ethnic people, discover their daily life, enjoy traditional dishes. You are impressed by the spectacular scene of Ha Long Bay. I believe that you will be overwhelmed with Trang An complex, caves hidden between avatar -like hills. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/167726_cb384315.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/167726_cb384315.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_78ed4386.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_5b505f81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_ecfcb1d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_69ecba8d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_476b93f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_35a6d1a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_a55c77d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_420e07c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_2b420c6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_47aed9ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_75151335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/167726_c749544d.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi arrival (no meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.  Overnight in Hanoi."},{"title":"Day 2: Hanoi - Sapa - Cat Cat (Breakfast, Lunch, Dinner)","description":"6:30 - 7:00 – Our driver and tour guide will come and pick you up at your hotel in Hanoi to depart for Sapa.\n\n10:00 – Follow the highway to Lao Cai City with a comfortable short break on the way to Sapa.\n\n13:00 – Arrive at Sapa town and be amazed by the colorful traditional costumes of H’mong, Dzao, Tay ethnic people. Enjoy welcome drinks and itinerary briefing. Then, have lunch with local Vietnamese dishes before the hotel check-in.\n\n14:30 – Start hiking downhill to Cat Cat village at the bottom of Muong Hoa Valley. Enjoy the spectacular views of the beautiful valley towards Fansipan – the highest peak in Vietnam and Indochina. Upon arrival at the village, you will have a chance to visit the Black H’mong’s traditional stilt houses as well as watch people weaving, embroidering, and drying their clothes, etc. Then, keep walking to visit the dramatic and picturesque Cat Cat Waterfall, which is a great spot for photo-shoots.\n\n17:00 – Return to Sapa town for dinner. Enjoy your free time in the afternoon to explore Sapa Market and town.\n\nOvernight at the hotel \n"},{"title":"Day 3: Sapa – Y Linh Ho – Lao Chai – Ta Van – Sapa – Hanoi (Breakfast, Lunch)","description":"8:00 – Have breakfast at the hotel.\n\n9:00 – Begin trekking from Sapa towards another part of Muong Hoa Valley where you can see the magnificent landscapes of the mountainous region. Trek through Y Linh Ho, the village of the Black H’mong, then continue the adventure through lush rice terraces to visit Lao Chai village and experience the Black H’mong’s daily life and traditional culture.\n\n11:30 – Arrive at Ta Van village of Tay minority, which is exhibiting a strong influence from Chinese culture.\nTake a bus ride to return to Sapa.\n14:30 –Free time in Sapa for refreshment.\n15:15 – Catch a bus to travel back to Hanoi.\n21:15 – Arrive in Hanoi. The tour ends.\\\nOvernight in Hanoi.\n"},{"title":"Day 4: Hanoi - Ha Long- Sung Sot cave- (Breakfast, Lunch, Dinner)","description":"08:00  Hotel or private address pick up with our shuttle bus. Short break half way.\n12:30  Arrive Ha Long Bay, transfer by tender to the  cruise, and enjoy welcome drinks. Check in your cabin and enjoy a real Vietnamese lunch while beginning your sail through the fairy land of Ha Long Bay, passing by Stone Dog islet, Incense Burner islet, Fighting Cocks, Swan islet, and Duck islet…\n15:00  Explore Sung Sot “amazing” cave with millions of surprising stalactites and stalagmites for 45   minutes.\n16:00  Cruising to Titov Island. Go swimming and relax at the beach or climb up to the top of the mountain for a panorama view of Halong bay.\n18:00  Enjoy the complimentary sunset party on the sundeck with wine and fresh fruits.\n19:00  Dinner is served in the cruise’s restaurant.\n21:00  Retire to your cabin, have a drink at the bar, sing karaoke, join the fishing excursion or play exciting games.\nSleep on the cruise."},{"title":"Day 5: Ha Long - Hanoi (Breakfast, Lunch)","description":"07:00  Breakfast will be served in the cruise’s restaurant.\n08:00  Enjoy kayaking to discover Halong beauty.\n09:30  Check out your cabin and relax on the cruise while sailing on the bay.\n10:00  Join cooking class demonstration (teaching you how to make our speciality, Spring rolls) on the cruise.\n10:45  Lunch is served on the cruise (or at a local restaurant).\n11:45  Disembark at the harbor, Ha Long city. Take our shuttle bus to return Hanoi.\n17:00  Arrive back your hotel.\nOvernight in Hanoi\n"},{"title":"Day 6: Hoa Lu - Trang An - Mua cave (Breakfast, Lunch)","description":"7.45- 8.30: Tour guide picks up at suggested places around Hanoi Old Quarter. Depart for Ninh Binh province (90km south of Hanoi). Have a break 20 minutes en-routes for free your leg.\nArrival, you will start get a quick break at the restaurant before preparing your bicycle for a bike ride to the Mua cave.Then you ‘ll climb 486 steps at Hang Mua for panoramic views and photo opportunities before biking back to the restaurant for lunch.\n13.30: Depart to visit Trang An tourist attraction. Take a boat trip through cave chains: Lam cave, Thanh Truot cave, … with 3 spiritual places (Cao Son temple, Suoi Tien temple, Vu Lam historic area) and an exciting “Kong-Skull island” film studio.\nAfter finish boat trip, we visit the temples of King Dinh and King Le.\n19.00: Arrive in Hanoi. Tour ends.\nOvernight in Hanoi"},{"title":"Day 7: Perfume pagoda (Breakfast, Lunch)","description":"7.30- 8.40: Meet your tour guide then depart for Perfume Pagoda (60 km west of Hanoi). Have a break 20 minutes half way to relax and experience Vietnamese handicraft products such as lacquer wares, paintings, embroideries…\nTake a 50 minutes boat ride along the river side to enjoy beautiful landscape of streams and paddy fields. Start hiking up to a unique pagoda inside Huong Tich cave on the mountain summit (2.5km in height). You will have a feeling of entering the holy land of buddhism while experience the breath-taking views of surroundings.\n12.30: Go back down and enjoy lunch in a local restaurant nearby. Visit Thien Tru Pagoda. Board the boat back to Duc Dock and return Hanoi.\n18.30: Arrive in Hanoi. Get dropped off at your morning places. Tour ends\nOvernight in Hanoi."},{"title":"Day 8: Hanoi city 1/2 day- Departure (Breakfast, Lunch)","description":"Option1: Tuesday, Thursday, Saturday, Sunday – (Ha Noi City Tour - Ethnology Museum)\nConsidered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. \n07:45 - 8:30 Meet your tour guide .\n- Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. \n- Visit Ho Chi Minh's complex, the final resting place of Viet Nam's greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n- Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. Transfer to the airport for departure flight."}]},{"name":"Hightlight of Ho Chi Minh City And Mekong Floating Market with 5 Days 4 Nights Package","duration":5,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":225,"summary":"Get ready for a whole day discover the city. Ho Chi Minh City – former name Saigon is Vietnam’s largest city. Saigon is a fast paced city with a unique mix of French colonial architecture, Chinese influences, a modern entrepreneurial spirit and numerous temples.\nDuring 300 years history, under the name of Saigon, it was the capital of French colony of Indochina and later of the independent republic of South Vietnam. After the war, this city was officially renamed Ho Chi Minh City after President Ho Chi Minh. Today, Ho Chi Minh City is a modern developing urban but still remain its connection with the past. Not so hard to find an ancient pagoda or a building with French elements.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/178901_055866c5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/178901_055866c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_809da26a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_f4a8c19e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_e37a49a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_6d260af9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_93b08a46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_a7d946c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_4e5af5f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_912ed7a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_7e1c1a5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_0403c222.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_a2dfbbef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_6b99f9b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_9ca6977a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/178901_cdf0871f.jpg"],"destinations":["Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Day 1: Airport Pick Up - Saigon By Night & Food Tour on Scooter (Dinner)","description":"- Arrived to Ho Chi Minh City (Saigon) we pick up you at Tan Son Nhat Airport heading to your hotel to check-in and take a rest. \n- Our guide pick up you at your hotel for SaiGon By Night and Food Tour.  \nHightlight:\n . Thich Quang Duc Statue \n. Local market - Vietnamese traditional market \n. The oldest apartment  area in District 3 \n. The Biggest Flower market - District 10 \n. Cambodian market . Fashion Street - just for local \n. Floating market - try coconut juice and see how local live in the boat \n. The Slum area - See another life of local . District 7 \n- Explore the fantastic Saigon living area with full of light Go to unique island in district 4 \n- The smallest district, see our local life.  \n- After the trip we Drop-off you back to your hotel."},{"title":"Day 2: Cu Chi (Breakfast)","description":"- Have a breakfast at your hotel. \n- In the morning 7:30-8:00AM, we pick up you from your hotel for visit Cu Chi tunnels. Located 60km from Ho Chi Minh City, Cu Chi is now considered a heroic district for its role during the American war in Vietnam. It is legendary for its network of tunnels, which extends over 220km, and is a popular destination for both Vietnamese and foreign visitors. Today, Cu Chi is a tranquil place of rice paddy fields with ducks and water buffalos bathing in the rivers alongside the road. But this peaceful rural scene belies the terrible destruction and defoliation caused by bombing and mines when Cu Chi was a \"Free Target Zone\". Cu Chi still contains plenty of evidence of the fierce battle that took place here and all over this area you will find the remnants of war. - After the trip we have 2 Drop-off place: Ben Thanh Market or Bui Vien walking street. Free Time to visit HochiMinh City"},{"title":"Day 3: My Tho - Ben Tre (Breakfast/Lunch)","description":"- Have a breakfast at your hotel. - In the morning we pick up at your hotel. 8:00 AM Pick up at your hotel in HCMC. Depart for My Tho .Take a boat ride along the river, view the stilt houses and the fruit plantation along the river bank. Proceed to Tortoise island and have lunch among st the orchard. Enjoy a boat ride through Tan Thach natural canal in Ben Tre, cruising under the shadow of the water coconut trees. Visit a family business which epitomizes the idyllic rural lifestyle. Enjoy a rowing boat ride along the creeks. After taking a delightful walking through the fruit plantation, village. Proceed to Can Tho. Dinner on guest’s account. Overnight at your proposed hotel 3 stars in Can Tho."},{"title":"Day 4: Can Tho (Breakfast/Lunch)","description":"- 6:30 - 7:00 AM After breakfast, take the morning boat trip to visit the Phong Dien floating market which is at its busiest at this time of day. Keep cruising through the small channels system and visit a rice noodle making village. Experience the “Monkey Bridge” in the Delta. Visit a second floating market (Cai Rang). Return to Ho Chi Minh City.  \n- After the trip we have 2 Drop-off place: Ben Thanh Market or Bui Vien walking street. Free Time to visit HochiMinh City"},{"title":"Day 5: Ho Chi Minh City (Breakfast)","description":"- Have a breakfast at your hotel and check-out your hotel. Free time and easy until departure time, the driver takes you to the airport for your flight. End of services!End point\n We offer Pick up service with hotel located in center of district 1 near Ben Thanh Market, Bến Thành, 711100, Quận 1, Hồ Chí Minh, Vietnam 17:30 - 21:00"}]},{"name":"Crossing Vietnam By Train 10 Days 9 Nights","duration":10,"travelStyle":["Train & Rail","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1488,"summary":"Visit some of the most popular sites in Vietnam.\nLuxury junk cruise on the legendary Ha Long Bay.\nExploring Sapa is a small market town that has been a gathering spot for many local hilltribes for nearly 200 years. Hmong and Dao people, among others, still come here to conduct trade, socialize, and attend an ephemeral “love market,” where young men and women choose one another for marriage\nDiscovery the poetic city Hue & the ancient town Hoi An.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171269_3c217171.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171269_3c217171.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_787756a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_40028751.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_19999f76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_4d6114d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_0d194f25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_7abc5018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_13f54c35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_62dab018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_861359e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_cac979f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_d6aaba0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_e8e75e50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_0c4c8002.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171269_717ef13b.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Ninh Binh","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi Arrival (D)","description":"When arriving, welcome at the airport and transfer to your selected hotel.\nTake a rest after the flight.\n\n\nEarly in the evening, join a water puppet show, a distinct Vietnamese art in which a split-bamboo screen obscures puppets which stand in water and are manipulated using long poles hidden beneath the water.\n\n\nDinner at a local restaurant.Overnight in Hanoi."},{"title":"Day 2: Hanoi City Tour – Lao Cai - Overnight on Train (B/L)","description":"After breakfast, In the morning Have breakfast at your hotel\n\n\n7:30 -8:00am Pick up at your hotel then Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.Visit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.Relax and have lunch at a local restaurant in Hanoi Old Quarter.\n\n\nIn the afternoon:\nIf Tuesdays/Thursdays/Saturdays or Sundays:Visit Temple of Literature constructed in 1070 dedicating to Confucius, sages and scholars. It was also the first university of Viet Nam once.\nArrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians.\n\n\nIf Mondays/Wednesdays or Fridays:Explore daily life of traditional ceramics village of Bat Trang. Visit showrooms and see how they model the products. Arrive legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander for his struggle against Mongolians.Come back to your hotel. Dinner on your own.\n\n\nPick up at your hotel at 19h30 – 20h15 and transfer to Hanoi train station catch the night train to Lao Cai (Train time: SP7/20:35 – SP1/21:10 – SP3/21:50). Overnight on Train"},{"title":"Day 3: Lao Cai – Sapa – Lao Chai – Ta Van – Giang Ta Chai Village – Joining tour (B/L/D)","description":"05:30 – 06:00 Pick up at Lao Cai train station by our staffs for a drive to Sapa by bus.\n\n\n07:00 Have breakfast and relax at hotel. If hotel has available room, you can check in early, if not you join in tour first.\n\n\n09:00 Our guide takes you to visit two villages of the H’mong and Dzay People, called Lao Chai, Ta Van and Giang Ta Chai villages. Have lunch on the way or in a family of the ethnic people. (You will start trekking from hotel to the Lao Chai village with the distance about: 12km.\n\n\n17:00 When you finish the trekking trip at the end of the village, our bus will pick up you back to Sapa town.\n\n\nDinner and Overnight in Sapa."},{"title":"Day 4: Sapa –Cat Cat Village – Hanoi - Overnight on Train – Joining tour (B/L/D)","description":"Have breakfast at hotel.\n\n\nOur guide takes you to visit Cat Cat village of Black H’mong people. You have a chance to visit a waterfall and the hydroelectric power station built by the French, see the life of local through their houses, their handicraft products.\n\n\nBack to Sapa town and have lunch on restaurant. You are free and easy to discover Sapa town on your own.\nTransfer from hotel to Lao Cai train station. Have dinner at the restaurant, near the train station before getting on the night train to go back to Hanoi.\n\n\nOvernight on the train."},{"title":"Day 5: Hanoi – Ninh Binh – Bai Dinh Pagoda –Trang An (B/L)","description":"Arrive in Tran Quy Cap station at 5:00am early morning .Our driver take you to hotel ( You have 1 room for take shower and have breakfast from 5:00 -8:00 ) before starting to Ninh Binh.\n\n\n08:30 Tour guide picks you up at suggested places around Hanoi Old Quarter\nDepart for Bai Dinh pagoda and Trang An eco-tourism site. Have short break en-route to free your legs. Arrive in Buddha Sanctuary place of Bai Dinh pagoda, the biggest one in Vietnam.\n\n\n12:30 Have lunch in a restaurant with local special dishes including goat meat. Leave for Trang An eco-tourism attraction. You will be amazed by neglected area while having a boat trip through cave chains: Sang Cave, Toi Cave, Ba Giot Cave, Sinh Cave…experiencing mysterious views of the so-called “Ha Long Bay in land”\n\n\n19:30 Back in Hanoi, get dropped off at your morning address. Overnight in Hanoi"},{"title":"Day 6: Hanoi – Halong Bay – Joining tour (B/L/D)","description":"7:45 – 8:30 Meet your tour guide at suggested places around Old Quarter for Ha Long Bay.\n\n\n12:30 Embark at Tuan Chau habor, Ha Long city.Transferred by tender to the Viet Beauty Cruise.\nGreeted by crew members followed by welcome drinks, get cruise briefing and check in cabin.\n\n\n13:00 Savor lunch on board while cruise heads to center of Halong Bay.\n\n\n15:00 Explore Sung Sot Cave, the biggest cave in Halong Bay which famous for its wonderful stalactites and stalagmites.\n\n\n16:00 Visit Titop Island for swimming or take a short walk to the top for some overview photos of Halong Bay\n\n\n18:00 Enjoy sunset while local wine and fruit is served\n\n\n18:30 Attending cooking lesson to make some spring rolls by yourself.\n\n\n19:00 Having dinner on board, then free relax with other choices: Squid fishing, singing karaoke, relax on sundeck….\nOvernight on Cruise"},{"title":"Day 7: Halong Bay - Hue by train (B/L)","description":"06:30 Start your morning with the Tai Chi class up in sundeck\n\n\n07:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board\n\n\n08:00 Visit Me Cung Cave (Maze Cave) with layers of fosillized shells which present the history formation of Halong Bay.\n\n\n09:00 Stop by Pearl Farm to study the culture pearl making process.\n\n\n09:30 Check out your cabin. Time for brunch while Vietbeauty cruise heads back to habor.\n\n\n12:00 Disembark habor. Say goodbye to HalongBay.\n\n\n17.30: Leave at your hotel. Free time to relax, go shopping or eat.\n\n\n19:00: Transfer to the station to take the train SE3 at 7:30 p.m. to Hue\nWe will spend the night on the night train."},{"title":"Day 8: Hue City Full Day (B/L)","description":"After breakfast, take a boat for a cruise on the gentle Huong River passing Dong Ba market and visit Thien Mu pagoda on the riverbank and Emperor Minh Mang’s tomb, reminiscent of the Ming tombs in Chinese pavilions, ponds and gardens is known for its perfect harmony between architecture and its natural environment. It began to be built during his reign (1820-1841) and was completed only in 1843, two years after his death by his successor Thieu Tri.\n\n\nLunch at a local restaurant.\n\n\nIn the afternoon, visit the conical hats and incense stick making village.\nDiscover Emperor Khai Dinh’s mausoleum, which is unique among the royal tombs in Hue, Vietnam. Where other royal tombs are expansive and invite respectful reflection, The Nguyen Emperor Khai Dinh built his final resting place to be monumental in style and bombastic in execution.\n\n\nOvernight in Hue."},{"title":"Day 9: Hue - Da Nang - Hoi An (B/L)","description":"After breakfast, transfer to Da Nang through Hai Van Pass and through the picturesque fishing village of Lang Co.\n\n\nWhen arriving in Da Nang, visit the Cham Museum and Marble Mountain, (Ngu Hanh Son) is about 8km southeast of Da Nang City. This is a cluster of five marble mountains lying close to the sea. That is why, it is dubbed Hon Non Nuoc, which means Mountain and Water in Vietnamese.\n\n\nContinue to the riverside town of Hoi An, an important trading port during the 17th and 18th centuries and officially listed as a World Heritage Site.\n\n\nLunch in a local restaurant.\n\n\nIn the afternoon, walk around Hoi An ancient town and exploring its treasures :\nQuan Cong temple – the brave and loyal Chinese General.\n\n\nPhuc Kien pagoda, This is the most well-known assembly hall in the ancient town.Fukjianese were Chinese traders who first came to Hoi An in great number, at least in the XVII century. That was the reason why all above mentioned gods were worshipped in this pagoda after the collapse of the old pagoda.\n\n\nThe Japanese Bridge, Hoi An’s signature landmark used widely as an emblem of the town. It was built by Japanese merchants in the 16th century.\n\n\nTan Ky ancient house, the most popular of Hoi An’s old houses.\n\n\nHoi An port, the World Heritage listed by Unesco.\n\n\nDinner on your own.Overnight in Hoian."},{"title":"Day 10: Hoi An - Da Nang Airport (B)","description":"After an early breakfast, transfer to Danang Airport. \n\n\nEnd of services !"}]},{"name":"Discover the central of Vietnam 7D6N (Da Nang - Hue - Hoi An- Da Nang)","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":380,"summary":"Da Nang are a good mix of centuries-old pagodas, French colonial buildings, as well as tranquil beaches with clear blue waters, and verdant national parks.  Ba Na is always a sight-seeing where people must come,  enjoy 4 seasons (spring, summer, autumn and winter) in only one day, visit Golden Brigde. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/182754_6d3c15ef.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/182754_6d3c15ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_e1e50080.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_c6c0c6ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_37f1d99f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_ccd5cba1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_61536fcf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_6f252607.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_d3b234aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_7bc594f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182754_42406d5b.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Day 1: Da Nang arrival (no meal )","description":"Welcome to Da Nang ! You will be greeted by the driver and then transfer to hotel for check in. The rest of day is your own at leisure. You can visit My Khe beach by your self.\nOvernight at hotel in Da Nang."},{"title":"Day 2: Da Nang – Hue city 1 day (B/L/X)","description":"Depart: 07:00 am | End of tour: 06:00 pm \nPick up guests at the hotel in Da Nang transfer to Hue Ancien capital. On the way stop at Lang Co beach for relaxing and take picture.\n10:00 Visiting Khai Dinh tomb, unlike Hue’s other tombs, it being a synthesis of Vietnamese and European elements. Even the stone faces of the mandarin honour guards are endowed with a mixture of Vietnamese and European features.\nHave lunch in Hue city.\nAfternoon: Continue exploring the Imperial Citadel, where the 13 emperors of the Nguyen Dynasty lived. Then visit the symbol of Hue city - Thien Mu Pagoda, which built on a hillock overlooking the Perfume river.\nAfter visiting, free time shoping, then drop you off at the hotel.\nOvernight in Hue.\n"},{"title":"Day 3: Phong Nha cave 1 day (B/L/X)","description":"MORNING: Pick up guests at the hotel at 06:30 am and transfer to Quang Binh province by bus. On the way, stop take photos and visit La Vang Holyland. \n11:30 am: Arrive to Quang Binh. Enjoy lunch at a local restaurant at Xuan Son boat station.\nAFTERNOON: Begin the excursion by boat along The Son river to discover Phong Nha Cave and visit dry and wet caves.\n03:45 pm: Back to the boat station and turn back to Hue city on Ho Chi Minh trail, via Truong Son martyrs cemetery.\n07:30 pm: End of tour in Hue. Overnight in Hue.\n"},{"title":"Day 4: Bus Hue to Hoi An (B/X/X)","description":"After breakfast, transfer to Da Nang through Hai Van Pass and through the picturesque fishing village of Lang Co.\nContinue to the riverside town of Hoi An, an important trading port during the 17th and 18th centuries and officially listed as a World Heritage Site.Lunch in a local restaurant ( pay by yourself) \nIn the afternoon, walk around Hoi An ancient town and exploring its treasures \nOvernight in Hoi An.\n"},{"title":"Day 5: My Son holyland by boat (B/L/X)","description":"7.30: Pick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu capital which was the the former administrative centre of champa kingdom. Discover the majestic ancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock and board on boat cruise along Thu Bon river.\n12:15 am: Enjoy Local food on Boat (My Quang)\n02:00 pm: Back to your hotel. End the tour.\nOvernight at the hotel.\n"},{"title":"Day 6: Ba Na hill 1 day (B/L/X)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n09:00 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:00 pm. Drop-off at hotel. End of tour.\n"},{"title":"Day 7: Departure (B/X/X)","description":"Have breakfast at the hotel. You are free until the driver transfer to the airport for flight back home."}]}]