[{"name":"Vietnam Family Adventure","duration":12,"travelStyle":["Family","Adventure","Group","Fully Guided"],"oldPrice":1499,"price":1274,"summary":"Gifted with a staggering abundance of flavourful food, fascinating culture, untouched nature, and disarmingly friendly people, Vietnam has more than earned its rep as one of the world’s most popular travel destinations. This fun-focused family trip packs as much of the good stuff into 12 days as humanly possible – including cruising Halong Bay, exploring the Imperial Citadel, and even a boat trip to a floating market – yet still offers more than enough time to relax. Don’t forget to pack your smile; you’ll be needing it often here.","highlights":["Discover hidden gems in Hanoi's mazed old town","Stargaze on board a junk boat in Ha Long Bay","Explore the villages around Hoi An by bike","Chase fireflies in the Mekong Delta during a home stay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/51254_3159ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/51254_3159ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/51254_724195e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/51254_f40273c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/51254_6bfeacac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/51254_51c0ba53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/51254_1d59c314.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"If you have time take a walk through Hanoi's Old Quarter – a maze of streets, each one traditionally devoted to a different product or industry.\n\nAccommodation:\n- Golden Silk Boutique Hotel (or similar).\n\nTransport:\n- Airport Transfer\n\nIncluded Activities:\n- Meet Your CEO and Group\n\n\n"},{"title":"Day 2: Hanoi (1B)","description":"Enjoy a guided cyclo tour of the Old Quarter before seeing a Water Puppet Theatre performance. Opt to visit a museum or do some shopping.\n\nAccommodation:\n- Golden Silk Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Hanoi Cyclo Tour\n- Thăng Long Water Puppet Theatre Performance\n\n\n"},{"title":"Day 3: Hanoi/Ha Long (1B, 1L, 1D)","description":"Halong Bay cruise, cave visit and island lookout. Seafood lunch and dinner.\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Private Vehicle: Hanoi to Ha Long 04:00 Hr(s)\n\nIncluded Activities:\n- Halong Bay Overnight Cruise\n\n\n"},{"title":"Day 4: Ha Long/Huế (1B, 1L)","description":"After an early lunch on board we head back to Hanoi with time for shopping or further sightseeing until the overnight train to Hue.\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Private Vehicle: Ha Long to Huế 03:00 - 04:00 Hr(s)\n- Basic Overnight Train (beds) 13:00 - 14:00 Hr(s)\n\n\n"},{"title":"Day 5: Huế (1B)","description":"We arrive in Hue mid morning and take a tour of the Imperial Citadel which also contains the Forbidden Purple City. Afterward, there is free time to explore the city.\n\nOpt to pre-book the \"Hue Motorbike Tour\" activity on the checkout page ahead of time, to include this optional on your tour (please note that riders must be at least 12 years old).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Imperial Citadel Tour\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 6: Huế/Hoi An (1B)","description":"This morning take a scenic drive to Hoi An. After arriving enjoy free time to explore the city.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 7: Hoi An (1B, 1L)","description":"Enjoy a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project. Afterwards enjoy some free time to explore Hoi An.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 8: Hoi An (1B)","description":"Enjoy a free day to explore. Optional activities include taking a cooking class, riverboat trip, bike riding, heading to the beach, visiting the tailors or the UNESCO World Heritage listed My Son ruins.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\n\n"},{"title":"Day 9: Hoi An/Ho Chi Minh City (1B)","description":"A short flight takes us to Ho Chi Minh City, the sprawling metropolis that once was the capital of South Vietnam and remains the country’s commercial center.\n\nAccommodation:\n- Eden Star Saigon Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Plane: Hoi An to Ho Chi Minh City 01:00 Hr(s)\n\nIncluded Activities:\n- Ho Chi Minh City Cyclo Tour\n\n\n"},{"title":"Day 10: Ho Chi Minh City/Mekong Delta (1B, 1D)","description":"A boat trip through small villages shows a different side of Vietnamese life. Be amazed at how the locals rely on the Mekong for everything! \n\nWe spend the night in a small village in the delta—a great chance to interact with the locals.\n\nAccommodation:\n- Mekong Delta Homestay (or similar).\n\nMeals Included:\n- Breakfast\n- Dinner\n\nTransport:\n- Private Vehicle: Ho Chi Minh City to Mekong Delta 02:30 Hr(s)\n\nIncluded Activities:\n- Mekong Homestay\n\n\n"},{"title":"Day 11: Mekong Delta/Ho Chi Minh City (1B)","description":"Return to Ho Chi Minh City; free afternoon. Option to visit War Remnants Museum, Reunification Palace, and Ben Thanh Market.\n\nAccommodation:\n- Eden Star Saigon Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle: Mekong Delta to Ho Chi Minh City 02:00 - 03:00 Hr(s)\n\n\n"},{"title":"Day 12: Ho Chi Minh City (1B)","description":"Depart at any time.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]},{"name":"Authentic Vietnam tour for 12 days","duration":12,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1830,"summary":"Vietnam which is a beautiful country with breathless scenes along from North to South. Each of the places has a different prettiness. It's hard to find out anywhere which has all of the beauty: the majestic beauty of the mountain destination in the North such as Sapa or Halong; the peace with the ancient feature of Ninh Binh; the bustling of Hanoi or Ho Chi Minh; the rustic beauty of Hoian; or Idyllic beauty of Vietnamese,... All of them will be gathered in one Authentic Vietnam tour.\n\n\n  Enjoy the wild beauty of Sapa - one of the best mountain provinces in Vietnam\n  Explore the magnificent scenery of the World Heritage Site: Halong Bay\n  Appreciate the ancient history, architecture, and culture of Vietnam in two famous Old towns : Hanoi Old Quater and Hoian\n  Have a chance to immersed the life of a Vietnamese farmer\n  Discover of one the marvelous tunnel which was used in the Vietnam war\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/191837_5e24046498029.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/191837_5e24046498029.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d0386.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d24b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d3f14.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d5a19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d737d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464d8c94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/191837_5e240464da620.jpg"],"destinations":["Hanoi","Sapa","Ninh Binh","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi arrival ( no meal)","description":"Welcome up on arrival by Go Vietnam Travel‘s guide and driver, then we transfer to the hotel.\n\nRelax after the long flight and overnight in Hanoi\n\nA lot of amazing things are waiting for you in the next dat for a real authentic Vietnam tour."},{"title":"Hanoi Tour – Overnight train to Sapa (B, L, and Welcome Dinner)","description":"First and foremost, Hanoi is the capital of Vietnam which has ancient and model Vietnam features. We spend time  our this day to know how authentic Vietnam tour is.\nAfter breakfast today, we visit the Ho Chi Minh Mausoleum, His House on stilts, the One Pillar Pagoda, the outside of the Presidential Palace and the Temple of Literature which was Vietnam’s first University.\nHaving lunch and we get more Vietnam culture at the intriguing Ethnology Museum. Followed by an hour on a cyclo (a pedal rickshaw) being taken round the old quarter of Hanoi. Then we enjoy Welcome Dinner at nice restaurant in Hanoi. After that, we will come back hotel to take your luggage to transfer to train for overnight train to Sapa.\nOvernight on Train.\n\n"},{"title":"Sapa - Y Linh Ho - Lao Chai - Ta Van (B, L, D)","description":"Amazing Sapa sightseeing:\nArriving early to Lao Cai today we will transfer to Sapa for our trek, where we will enjoy spectacular scenery as we head to the Y Linh Ho village of the Hmong people. After lunch, we head to the Muong Hoa Valley, on the way passing through the villages of Lao Chai and Ta Van where we will have a chance to meet some of the locals.\n\nHomestay experience:\nTonight we enjoy a homestay at one of the hill tribe villages. Homestays are a great way to get a feel for the culture and really understand more about the daily lives of the local people. A common saying is…  ‘you will arrive as a guest but leave as a friend’. Your overnight accommodation will be in a homestay in Sapa.\nOvernight in Homestay Sapa.\n\n"},{"title":"Sapa – Bus back to Hanoi (B)","description":"This morning, we will visit Ham Rong Mountain – home to numerous kinds of flowers and orchard gardens. Wandering stone paths leads tourists to wild peach forest, then orchid gardens with more than 6000 orchid plants belonging to 194 kinds. Then a visit to Heaven Gate, the highest stretch of road in Vietnam as well as the provincial border of Lao Cai and Lai Chau provinces. Enjoy fantastic view over the valley! Then you can visit one more village in Sapa: Ma Tra or Ta Phin.\nIn the late morning, our tour guide and driver will take you back to Sapa Town for lunch. You will be free until our Limousine take you back to Hanoi city.\n\nOvernight in Hanoi\n\n"},{"title":"Hanoi – Truly Ninh Binh (B, L)","description":"At 8.00 AM, say goodbye to Hanoi and spend two-hour drive to the South, Ninh Binh Province.\n\nMua Cave hiking:\nOn arrival, we have trekking time at Hang Mua (Mua Cave). Climbing up hundreds of steps, you will reach a temple on top of a hill and enjoy the spectacular views from Hang Mua over Tam Coc and Ninh Binh’s stunning countryside are well worth the effort.\n\nSteps lead to Hang Mua was imitated from the architecture of the Great Wall of China with 486 stone steps. Traveling to Hang Mua, you will wallow in a wonderful landscape of mountain, valley and river.\nVisit Hoa Lu acient citadel:\nWe will visit Hoa Lu, the former capital of Vietnam under Dinh and Le dynasty with two temples worshiping Dinh Tien Hoang King and Le Dai Hanh King. Dinh Tien Hoang had successfully defeated Ngo Dynasty and made Vietnam officially independent from any ruler. We then stop at a local restaurant for lunch.\nRowing on Trang An Eco-Tourism complex:\nIn the afternoon, we will take a pleasant boat rowing in Hoang Long River to visit Trang An Eco-Tourism complex. The complex is surrounded by picturesque landscape with thousands of hectares with more than 100 caves which can be explored by boat. It is also a home of 600 kinds of flora and over 200 kinds of fauna that many of them in the Red book of Vietnam. On the rowing boat, we can enjoy the fresh air, clean and clear water with under water grass. Experience ourselves the feeling and emotion when we are on the water caves.\nThen we will come back to Hanoi capital.\n\nOvernight in Hanoi"},{"title":"Hanoi – Halong Bay (Overnight on deluxe junk) (B, L, D)","description":"Halong Transfer:\nUpon arrival Hanoi, guide will pick up and take you to a day use hotel for relax and refresh. Then, our shuttle bus will pick up and transfer you to Halong Bay. Arrive at Tuan Chau harbour and refresh at the Oasis Bay Lounge for about 20 minutes before boarding. Transfer to cruise. Welcome drink, cruise briefing, safety instructions, and check-in cabins.\n\nSpecial lunch will be served on board while passing by Dog islet, Fighting Cock islet (symbol of Halong Bay), Hoa Cuong fishing village, Swan islet. After having lunch, the Oasis Bay will continue exploring the wonders of Halong Bay.\nVisit Ti Top island:\nHiking & swimming in emerald coloured water. In the late afternoon, we return to the main boat and continue cruising to the quiet area. In the late afternoon, we enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set. After dinner, free time for socializing with other guests, take part in board games, fish for squid, or just laze around. Overnight on board.\n"},{"title":"Halong Bay – Hanoi (B, L)","description":"Get up early in the morning to enjoy fresh air of the bay and start the day with Tai Chi class. Coffee & tea with assorted homemade pastries, fresh juices. Relax or Visit Sung Sot Cave, hiking up and down 600 steps to the magnificent limestone formations of the most beautiful and biggest cave in Halong bay. Check-out cabins and settle bills. Relaxing time and cruising. The Lunch will be served while Oasis Bay is cruising back to the habor. Shuttle bus pick guest up at Oasis Bay Lounge. Our waiting vehicle will transfer us back to Hanoi.\n\nOvernight in Hanoi.\n\n"},{"title":"Hanoi – Flight Danang – Hoian walking tour ( B/L/-)","description":"After your breakfast at hotel, our tour guide will pick you up and transfer to airport.\n\nOn your arrival in Danang, we will meet local tour guide and driver at the airport then move to hotel in Hoian. After lunch and short rest, we have a walking tour in Hoi An town – one of the World Culture Heritages of Vietnam. This quaint riverside town still boasts a wealth of century’s old traditional architecture. The influences of several Asian cultures can be seen in the old houses and waterside buildings. It is also famous as a place to be instantly created inexpensive tailored outfits.\nOvernight in Hoi An.\n\n\n"},{"title":"Hoian – Farming & Fishing tour ( B/L/-)","description":"Local farming village:\nThis morning, we can choose bus or bike to cycle to a local farming village to join daily work life of local farmers – hoeing and a soil, watering veggie at an organic herb garden, riding water buffalo in the field and enjoy the freshest air of the countryside beauty. After that, board the Hoi An Eco-tour boat and cruise to the mouth of the river where it meets the Cua Dai Sea.\n\nCoconut palm village:\nWe also learn and try our hand at local traditional fishing techniques using round and cast nets, learn to paddle the strange and unique Vietnamese bamboo basket boats. Explore the now tranquil coconut-palm flanked waterways of a past war and hear of the extreme conditions endured by soldiers on both sides. Have a relaxed fun with catching beautiful purple crabs on bamboo basket boat.\nAfter visit a local water coconut palm village, we take a walk around the village and have some tea and snack with local talks…Back on-board our Hoi An Eco-tour boat, enjoy our lunch and cold beer or soft drink on boat, then back to hotel for our luggage packing.\n\nMeal Plan: Breakfast, Lunch.\n\nOvernight in Hoian"},{"title":"Hoi An – Fly to Ho Chi Minh city – Cu Chi Tunnel (B)","description":"We transfer back to Danang airport to take a short domestic flight to Ho Chi Minh city this morning. After 1 hour flight, we are welcome by local tour guide and driver in Ho Chi Minh city then transfer to hotel.\n\nIn the afternoon, we will leave Saigon for the Cu Chi tunnels, otherwise known as the “Iron Triangle” or “Iron Land”. On our way there we will drive through pleasant countryside; rubber plantations and rice paddies. Before entering the tunnels, we will see a short introductory video showing how they were constructed. Also on display are various mantraps and the remains of an American tank as well as numerous bomb craters made by 500lb bombs dropped by B52 bombers. After that we transfer back to Ho Chi Minh city.\nOvernight in Ho Chi Minh\n\n"},{"title":"Ho Chi Minh city – Cai Be - Vinh Long - Ho Chi Minh (B)","description":"Sightseeing Mekong Delta:\nMeet us at the pier in front of Cuu Long Hotel in Vinh Long where your crew will be ready to welcome you aboard with cold towels and a refreshing drink while the Cai Be Princess Sampan sets off for its leisurely cruise on the busy waterways of the Mekong Delta.\n\nExplore Phu Dong Canal:\nCrossing the Co Chien River, one of the original nine branches of the mighty Mekong in the Delta, enter the Dong Phu Canal. Cruise past the islands of An Binh and Binh Hoa Phuoc, famous for their fruit orchards. Observe from the comfort of your sampan life as it plays out on the riverbanks the people.\n\nVisit an ancient house and local villages:\nContinue cruising along narrow canals past rural, unspoiled landscapes and lush greenery while observing the activity along the banks. Visit an ancient house built in the 19th century. Continue towards Phu An Hamlet and stop in on local workshops to observe the traditional process of making coconut candy and puffed rice (the local equivalent of popcorn).\nHave lunch:\nYour cruise ends at Le Longanier Restaurant. Lunch is served in this exquisite colonial-style villa set in a lush tropical garden by the river and surrounded by fruit trees, giving you a sense of privileged life during Indochinese times. After lunch (at around 2:30 pm), take a short walk along a small canal back to Ba Bon Bridge where your personal vehicle awaits to drive you to Ho Chi Minh City.\n\nOvernight in Ho Chi Minh."},{"title":"Ho Chi Minh Departure (B/-/-)","description":"After your breakfast, we will start to move to airport. The guide say good bye to you.\n\nTour end."}]},{"name":"Halong 3days/2nights tour on UniCharm Cruise 4*","duration":3,"travelStyle":["Boat","Group","Partially Guided","Holiday"],"oldPrice":0,"price":558,"summary":"The iconic image of Ha Long Bay's karst peaks jutting from the blue waters epitomises the unique and incredible beauty of Vietnam. The stunning scene has a mythical attractiveness which reflects its depiction in local folklore. According to the age-old tale, Ha Long Bay was created by the descent of a mother dragon that, along with her children, came to protect the bay against a fearsome invasion. \nIt is said that the dragons spat emeralds from their mouths towards their enemies and that those jewels transformed into the jewel like islands and islets. It is from this legend that the area takes the name Ha Long Bay which translates as “Bay of the Descending Dragons”.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/171236_8af243b6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/171236_8af243b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_a05a2943.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_babc7436.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_6ed973fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_6f485e5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_22496a5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/171236_6f37d190.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 01: Hanoi – Hai Phong – Cat Hai Island – Cat Ba Island – Halong Bay – Lan Ha Bay (Boating - Kayaking – Snorkeling – Swimming)","description":"AM: View Halong Bay from its back side\n\n\n09:00 – 09:30 pick up at your hotel in Hanoi Old Quarter area or in front of Hanoi Opera House.\n\n\n09:30 leave Hanoi for Hai Phong city on the free-way AH 5B enjoying the peaceful landscape of rice field of the Red river Delta. Enjoy driving on the longest sea passing bridge of Vietnam of which front is Cat Ba Island – Huge mountain scene and green mangroves.\n\n\n11:30 arrival at the pier on Cat Hai Island where the river mouths meeting the sea with the local fishing boats are bustling out the sea and backwards ashore.\n\n\n12:00 UniCharm crew warmly welcome you on board. Visit the boat and check in the room and lunch on boat (We can cater Vegetarian or vegan food on your request).\nEnjoying the first fresh seafood lunch and cruising along the Mangrove of Cat Ba Island into the back of Halong Bay – Tuan Chau Island via Gia Luan gulf to Cap Bai Islet and then Ngon Tay Island (Finger Islet) where you can view the universal seascape of Halong Bay World Heritage such as Sung Sot Cave and Titop Island.\n\n\nOn the hidden route for different views of the bay, pass by Ao Ech lagoon (Frog Lagoon) to Ba Trai Dao (Three Peaches). We start discovering the most beautiful and peaceful bay called Lan Ha Bay, the bay with crystal water and round lagoons and the Hon Dua (the Stick Islet). The bay is the additional part of the Wonder of Halong Bay and the World Biosphere reserved area.\n\n\nPM: Open the Hidden charm\nDiscover the additional part of the Wonder of Halong and the world Biosphere reserved area by kayaking and snorkeling.\n\n\nOn each 2-seat kayak we will paddle through narrow lanes of the Karst Mountains to visit fishing villages, call on some local fishing families to get to learn more about the daily life of the local fisherman.\nPaddle to a stunning lagoon with tunnel grotto (depend on the tide, we may not be able to reach). Here we will dip into the emerald waters. Swimming and Snorkeling to see Corals are our highlight of this day. You can also reach some secluded beach for a while relaxing lying on sand….\n\n\nBack to the boat for “cooking class” (our tour guide will show you how to make some famous Vietnamese traditional dishes that you can easily demonstrate home for your family after this trip).\n\n\nEnjoy Dinner and overnight on the lovely peaceful bay once on your lifetime."},{"title":"Day 02: Lan Ha Bay – Viet Hai village – Cat Ba National Park (Biking – Swimming – Boating)","description":"Wake up among the smooth waves and Karst Mountains and fishing villages.\nEnjoy breakfast.\n\n\nTender ship to Cat Ba Island, reach Viet Hai dock for a bicycle trip to Viet Hai village. Riding a bike for 30 minutes on the shadowed paths, enjoying the landscape on the way to the village located in a beautiful valley of the National Park of Cat Ba. Visit some local house to get to know about the local people as well as their daily life of work or visit the island school…\n\n\nAfterward cycling back to the Cruise.\n\n\nTrekking and Swimming\n\n\nAnother small boat takes you to Cat Ba Island and then a car trip to the central of the Park\n\n\nVisit the hospital cave where Vietnam Army used as the hospital during the war.\n\n\nSpend 3 hours for trekking in the jungle. We trek up to Ngu Lam peak – the amazing view point for whole Cat Ba Island – Lan Ha Bay and Halong Bay.\n\n\nDrive back to the town for lunch.\n\n\nCheck in hotel and stay one night in hotel on Cat Ba Island – free time & dinner on your own.\n\n\nOption 2:  Drive to Beo dock then boat back to UniCharm Cruise for dinner and overnight on board.\n(There will be surcharge for choosing this option)"},{"title":"Day 03: Cat Ba Island – Lan Ha Bay – Cat Hai Island – Hanoi","description":"AM: Cat Ba Island – Lan Ha Bay\n\n\nBreakfast at the hotel.\nMorning exercises by walking up to the Canon Fort where you will visit the old battle base with the ruin canons and the tunnels. Here you also obtain a big view to the bay and the sea mouth.\n\n\nBoat back to UniCharm Cruise.\nSpend for a while for swimming in the bay from the cruise and then fresh up on the cruise sundeck Cruising back to our starting place on another hidden route.\nCruising pass by the fishing villages and thousands of limestone islands and islets, taking precious Uni pictures and enjoying our tasteful lunch.\n\n\nPM: Back to Hanoi – See off at your hotel\n\n\n12:00 – 12:30 arrival back, say goodbye to the bay and disembark UniCharm Cruise for another free-way AH5B back to Hanoi. Estimated to arrive back in Hanoi at 15:30 – 16:00 – end the tour at your hotel."}]},{"name":"Discover North Vietnam - 8 Days","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":369,"summary":"Start and end in Hanoi! With the Discovery tour Discover North Vietnam - 8 Days, you have a 8 days tour package taking you through Hanoi, Vietnam and 4 other destinations in Vietnam. Discover North Vietnam - 8 Days includes accommodation in a hotel as well as an expert guide, meals, transport and more.","highlights":["Weave between the limestone formations of Ha Long Bay","Trek through rice terraces and along Muong Hoa Stream","Delve into culture and meet the locals of Cat Cat village"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/80348_bd97a2cb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/80348_bd97a2cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_94f986b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_6769a8a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_590a85dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_e1fa4e5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_040894c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_a8e95d28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_f3abfb8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_8689b3d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_95bdbe69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_c03faefe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_5e263544.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_6f613755.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_1489f6ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_bbe866db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_1311d1a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_22cb8630.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80348_1963ae8f.jpg"],"destinations":["Hanoi","Halong Bay","Sapa","Cat Cat Village","Ninh Binh"],"timeline":[{"title":"Day 01 Airport pick up - Check in hotel in Hanoi (Meals: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nNote: Check in time is 13:00 P.M.\nOur people will greet and brief all information round the trip."},{"title":"Day 02 Hanoi – Halong bay – Overnight on cruise (Meals: B, L, D)","description":"08h00 – 08h30: Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12h30 – 13h00: Embark on cruise followed by a short cruise briefing.\n13h30 – 14h30: Savor a delectable lunch on cruises among the limestone islands.\n15h00 – 16h00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16h00 – 17h00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17h00 – 17h30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17h30 – 19h00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19h00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board\nNote: Above is itinerary of 3 star cruise, itineraries of 4 or 5 star cruises will be differen"},{"title":"Day 03 Halong Bay – Hanoi (Meals: B, L)","description":"06h30 – 07h15: Start your day with Tai Chi exercises or a photo hunt.\n07h30 – 08h30: Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n09h00 – 10h00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10h15: Return to the boat. Freshen up and check out of your cabin.\n10h15 – 11h00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11h00 – 12h15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12h15 – 12h30: Disembark V’Spirit Classic.\n12h30 – 13h00: Transfer back to Hanoi.\nNote: Itinerary can be changed upon the weather condition\n         Above is itinerary of 3 star cruise, itineraries of 4 or 5 star cruises will be different"},{"title":"Day 04 Hanoi - Sapa by bus - Cat Cat village – Sapa Hotel (Meals: L, D)","description":"6.30 – 7.00: Pick up from your hotel/stay, get on big bus and depart for Sapa.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa\n13.00: Arrive Sapa Town with colorful traditional costums of H’mong, Dzao, Tay ethnic People.\nWelcome drink and itinerary briefing\nEnjoy the lunch with local Vietnamese dishes, check-in procedures\n14.30: A short drive to the gate of Cat Cat village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station; stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\nTrekking distance is about 2.5 kms and it lasts for 2 hours\n17.00: Come back to Sapa Town. Have dinner and overnight in hotel with night activities."},{"title":"Day 05 Sapa - Lao Chai - Ta Van – Hanoi (Meals: B/L)","description":"7.00 – 7.45: Have breakfast at hotel and prepare light pack for trekking\n8.00: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain after that heading to Ta Van village - home of Dzay ethnic people.\nTrekking distance is about 9 kms and it lasts for 3.5 hours\n11.30: Bus picks you up at Ta Van Bridge to Sapa.\n12.00 – 15.00: Have a shower at hotel, check out and have lunch and time at leisure on your own.\n15.00: Meet all group members at hotel to get ready for Hanoi.\n15.15: Get on bus to go back to Hanoi with two comfort breaks.\n21.15: Check in hotel in Hanoi"},{"title":"Day 06 Hanoi Free Day (Meals: B)","description":"You are free today to relax after Sapa tour or you can visit some villages around Hanoi. please contact if you need any arrangement. Breakfast and hotel in Hanoi are included."},{"title":"Day 07 Hoa Lu Tam Coc 1 day tour (Meals: B/ L)","description":"08:00 - 8.30 AM Picking up from hotel/stay.\n08:30 Starting drive to Ninh Binh Province\n10:00 Arriving at Hoa Lu Ancient Capital\n10:15 Visiting King Dinh and King Le’s temples.\n11:30 Arriving in Tam Coc Wharf.\n11:45 Having buffet lunch with Vietnamese Cuisine.\n13:00 Getting on Sampan boats through caves and visiting countryside landscape\n15:00 Back to Tam Coc Wharf to chill out.\n15:15 Biking on country road around village\n16:00 Get on the bus back to Hanoi. Arrive in Hanoi around 18.30 \n"},{"title":"Day 08 Hanoi Departure (Meals: B)","description":"We will arrange car to airport for you, please advise your flight details.\nIf you need any further arrangement: tour to Hoi an, Ho Chi Minh City…please advise."}]},{"name":"Vietnam Highlights Package 21 days/20nights","duration":21,"travelStyle":["Discovery","Custom","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1780,"summary":"Are you still looking for that perfect trip to make a year to remember? Then look forward to this incredible almost three week tour around the stunning country of Vietnam! Fall in love with Vietnamese food, marvel at breathtaking landscapes and discover the rich and proud history of this incredible Southeast Asian nation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95471_c0ba778b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95471_c0ba778b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_83b9da89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_fe6b07b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_2db3092b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_c4589854.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_9c4d5461.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_a56dbb05.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_b239bb15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_c13ccde1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_5108b719.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_3663582b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_cd795515.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_4bf0e443.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_4d69eef4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_393668ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_f70e2fe7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95471_3d6a02a9.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay","Lao Cai","Sapa","Mai Chau"],"timeline":[{"title":"Day 1: Arrival in Ho Chi Minh City (called Saigon), Vietnam","description":"You land in Saigon, and this is where your adventure begins! You will be welcomed and taken from the airport by our representative to your selected hotel in Saigon. Free at leisure. Stay overnight in Saigon.\nDistance: Tan Son Nhat Airport  Saigon Central: 7  8km -> 30 minute transfer\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 2: Discover Saigon City (B, L)","description":"09.00 AM You pass by the now-demolished wartime American Embassy on our way to the Reunification Palace. This famous edifice was a former residence of the President of Southern Vietnam until end of April 1975. \nClose to the palace are some striking French colonial structures including the Notre Dame Cathedral and the Old Sai Gon Post Office. \nYou follow these with a visit to the Jade Emperor Pagoda and the War Remnant Museum with a wealth of images from the notorious conflicts \nThe sightseeing ends up with a walk around the retail Ben Thanh Market where everything is for sale.\nCheck in hotel and overnigh in Saigon\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 3 4: Mekong Delta Cruise to visit Cai Be Market 2Days/1Night (2B, 1L)","description":"Mekong Delta River Life Style  where people dont use motorbike/cars much, but boats, where the people live, work and even entertain on river boat. Take this trip and youll have the chance to see the most interesting, exotic rural life in Vietnam with a boat ride on the Mekong Delta River. And Cai Be floating market is typical.\nStay overnight in Can Tho.\nHere is the highlights of the trip that you will never forget:\nKeep your eyes on the green paddy fields existing on the way to Mekong Delta River\nCai be floating market  one of the biggest and famoust floating market in Mekong, enjoy the peaceful moment of local rural life\nWalk to visit Coconut Candy Farm, buy the hand-made items from coconut trees of Mekong Delta as souvenir.\nAfter lunch at seasonal fruit garden, you will be divided from motorized boat group into some 2-pax groups on smaller sampan to do zigzag through a maze of shadow canals to enjoy the fresh air along the canals and water coconut trees scenery.\nCruising along the small and picturesque tributaries by rowing boat, we will see the biggest floating market in Can Tho Province  Cai Rang floating market (the nicest one with heaps of rowing boats).\nVisit a rice husking mill and a rice noodles making shop.\nDistance: Saigon - Vinh Long - Can tho: 420km/2days \nIris Can Tho Hotel or similar"},{"title":"Day 5: Saigon - Cuchi Tunel half day trip (B)","description":"This morning explore the amazing network of the Cu Chi Tunnels with length about 200km, which housed entire underground guerrilla villages during the American War in Vietnam.\nFree for your own activities in the afternoon. Stay overnight in Saigon.\nDistance: Saigon - Cu Chi Tunnel: 75km -> 1.5 hours transfer\nLiberty Parkview Hotel Saigon or similar"},{"title":"Day 6: Ho Chi Minh City - Nha Trang by flight (B)","description":"Continue your trip with the next destination is our most beautiful sunny beach city  Nha Trang.\nThe afternoon is free at your leisure to stroll along the beach or explore this seaside town. Overnight in Nha Trang hotel.\nDistance: Saigon - Nha Trang by 45 minutes of flight.\nCam Ranh Airport - Nha Trang city central 30km -> 45 minutes transfer\nNha Trang Regalia Hotel or similar"},{"title":"Day 7: Nha Trang Islands Tour (B, L)","description":"In the morning you will transfer to Cau Da port for a cruise on the Nha Trang Bay to visit Tri Nguyen Aquarium on Mieu Island to enjoy hundreds of nice and precious marine creatures then continue the trip to Mun Island -the best island for snorkeling with lots of lives colorful corals and fish. Taking a fresh lunch at the Con Se Tre island and relax. Back to hotel. Overnight in Nha Trang.\nNha Trang Regalia Hotel or similar"},{"title":"Day 8: Nha Trang Hoi An by flight (B)","description":"Leave Nha Trang to Hoi An - an ancient town of Quang Nam Province. This journey need the domestic flight from Nhatrang to Danang airport. Arrive in Danang, you will be greeted to transfer to: Marble mountain, Cham Museum, hotel in Hoi An for check-in. Stay overnight in Hoi An. Discover Hoi An ancient town by night. Distance: Danang airport - Hoi An town: 35 km -> 45 minutes transfer\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 9: Hoi An Cooking Class & Ancient Town Trip (B, L)","description":"In the morning, you will be welcomed by the Chef. Visit Hoi Ans colorful market, and experience the amazing sights, sounds and aromas of this busy market. Here, you will have the opportunity to interact with the local sellers and learn about all the ingredients to be used in the cooking lesson later. We board the boat for a leisurely cruise (25 minutes) along the Hoi An River to the Cooking School. This is a chance to view local river life, so make sure your camera is handy. On arrival, we explore the cooking schools herb garden, before learning about some of Hoi Ans and Vietnams well-known dishes. The cooking lesson runs for about 2 hours  the chefs first demonstrate each dish before we prepare the same dish ourselves. Included in the class is a brief introduction to Vietnamese food carving (plate decoration). After the lesson, we sit down and eat what we have cooked.\nThen, The guide and driver met you when disembark boat to continue half day to explore Hoian town: the Japanese Covered Bridge-the symbol of Hoian. Step back in time to discover the Chinese street with stunning Phuc Kien Hall and Phung Hung old house typical of Hoian original architecture. We then visit Hoi An vibrant market and ancient port to explore the rythm of local daily life and savor the true color, flavor and taste of the oriental. Finally, we visit Phuc Thanh Pagoda  the oldest pagoda in Hoi An built in 1454 with Chinese bonze.\nCheck in hotel and overnight in Hoi An Ancient Town.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 10: Hoi An - My Son Holly Land Visit (B)","description":"In the early morning, our guide and car will pick you up at your hotel for transfer to My Son Holy land- once the capital city of Champa Kingdom (around the 4th to 12th century). My Son is a large complex of religious relics that comprises more than 70 architectural works. They include temples and towers connecting to each other with complicated red brick designs. The major structure of Cham architecture is tower, built to reflect the divinity of the king. Drive back to Hoi An around noon.\nFree in the afternoon. You could try some tailor-made Vietnamese Dress or shopping.\nOvernight in Hoi An.\nDistance: Hoi An town - My Son Holly Land: 50 km  1 hour transfer \nPhu Thinh Resort Hoi An or similar"},{"title":"Day 11: Hoi An Hue by Road (B)","description":"Our driver will pick you up at your hotel in Hoi An and drop you at your hotel in Hue. On the road, you will have chance to visit Vietnam’s famous spot  Hai Van Pass. Arrive in Hue, take the trip to visit the Formal Imperial City with famous sights as Imperial Citadel, Forbidden Puple City, Khai Dinh. Overnight in Hue. Distance: Hoi An town - Hue: 145 km -> 3 hours transfer\nHue Cherish Hotel or similar"},{"title":"Day 12: Hue - Hanoi by flight (B)","description":"After breakfast, take your morning trip to visit the Royal Tomb of Minh Mang and Thien My Pagoda by boat along the perfume river. After the trip, transfer to airport & take flight to Hanoi. Arrive Hanoi. Check in hotel & overnight in Hanoi.\nDistance: Hue Central  Phu Bai Airport: 14 km  20 minutes transfer\nPomihoa Hotel Hanoi or similar"},{"title":"Day 13: Hanoi Sightseeing full day (B, L)","description":"Having breakfast at hotel then start sightseeing Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to Hochiminh Mausoleum, One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong.\nAfter lunch, stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda.\nTake the outside visit to the Opera House, St. Joseph Cathedral and make sure your camera is handy. Conclude with a visit to Bao Tang Lich, once the museum of lEcole Francaise dExtreme Orient, which includes artifacts from Vietnams turbulent history. Optional for Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 14: Hanoi - Duong Lam Ancient Village (B, L)","description":"Today is such a peaceful day with the short trip to visit the most ancient village in the north of Vietnam  Duong Lam Village, well-known for its preserved ancient houses, some of which date back 400 years. Visit Mong Phu Temple in Mong Phu Hamlet and observe the daily lives of the locals. This evening watch a performance of the famous Water Puppets, which have a history dating back thousands of years.\nDistance: Hanoi central  Duong Lam Village: 60 km -> 1.5 hours transfer\nPomihoa Hotel Hanoi or similar"},{"title":"Day 15: Excursion to Halong Bay and Stay overnight on Board (B, L, D)","description":"Early this morning, well drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone peaks or karsts that jut from the deep blue water as far as the eye can see. Well spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since were overnight on the water, well be able to explore Ha Long Bays most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nDistance: Hanoi central  Halong Bay: 180 km  3.5 hours transfer \nGarden Bay Cruises or similar"},{"title":"Day 16: Halong Bay Cruise - Hanoi - Lao Cai/Sapa by Overnight Train (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi.\nRemark: The Halong itinerary is subject to change upon cruises management.\nThe great trip to Vietnam will be much interesting by extending to visit Sapa  northwest of Vietnams North.\n7:30pm: Embark on train for the night trip to Lao Cai  Sapa. The cabin is based on 4-berth sharing cabin, overnight on train.\nDistance: Hanoi central  Train Station: 3 km  10 minutes transfer\nLivitrans Express Train, 4 Berths Cabin (Soft Sleeper) or similar"},{"title":"Day 17: Lao Cai Arrival - Sapa by Road - Homestay (B, L, D)","description":"Arrive in Lao Cai Station early this morning. Be greeted at the train station, transferred to Sapa town.\nSapa is one of the most interesting sightseeing in the north of Vietnam, with the height around 1500-1650 m above sea level. Sapa is a land of modest, quietly but hides varies wonderful of natural scenes and Sapa is also a nest of hill tribe as: Black HMong, Red Dzao, Xa Pho, Tay, Zayetc. Travel to Sapa, people forget everything, just enjoy the fresh air, clouds, sky, romantic scenery, majestic place, that is the reason why Sapa town is also known as the town in the cloud. With an average temperature of 14-18C, cool in summer but a bit cold in winter. Sapa always attract tourists in whole year.\nArrive in Sapa around 9am, have a soft breakfast at local restaurant. The room for refresh/changing is confirmed upon availability. Otherwise you could book in advance with extra charge.\nAbout 10:00 am we leave the hotel and start trekking. The first part is on the road but we soon turn to the right and walk on a small path down the valley to the Muong Hoa River and from here to the Black Hmong village Lao Chai. Black Hmong is one of the biggest minority groups in the Sapa area. They are proud of their culture and keep their traditions and way of living. They have their own language and wear traditional indigo blue clothing. After this you continue to Ta Van Village (1.200 m) to visit Zay people. Zay is a fairly small minority group of about 38.000 people who live mainly in the mountains in Northwest Vietnam. The development has meant that some of their old customs have been lost but many women still wear traditional shirts with a purple, blue or green color. The Zay houses are built of wood and bamboo with a clay floor. We stay overnight with a local family in Ta Van and have our dinner here.\nRemark: if the homestay is not convenient for you, the hotel option is available with extra charge.\nDistance: Lao Cai  Sapa: 30 km  45 minutes transfer\nHomestay at the villages or Sapa Bamboo Hotel or similar"},{"title":"Day 18: Giang Ta Chai - Su Pan - Sapa - Night train to Hanoi (B, L)","description":"After the breakfast we continue to visit Red Dzao people at Giang Ta Chai where we also see a waterfall. The Red Dzao women have very colorful red embroidery and coins on their clothing. On their head they wear a red scarf. Some of the women have shaved off their eyebrows because of a nice Red Zao Legend.\nWe continue along small paths in the rice fields, cross the Muong Hoa River and trek up to Su Pan where you will meet the jeep and transfer back to Sapa.\nEvening take a transfer to Lao Cai station for a night train to Hanoi. Overnight on train based on 4-berth sharing cabin.\nLivitrans Express Train, 4 Berths Cabin (Soft Sleeper) or similar"},{"title":"Day 19: Hanoi Arrival - Bakhan Village (Mai Chau) (B, L, D)","description":"Arrive in Hanoi station in early morning, you need to take some step of walking to the mini hotel nearby the station for breakfast and refresh until 8:00am.\n08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 20: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 21: Hanoi Departure (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group! Have a safe journey home or to next destination. Goodbye and see you again in Vietnam and Southeast Asia.\nAirport transfer included!"}]}]