[{"name":"Vietnam Holiday beach 10days 09nights","duration":10,"travelStyle":["Beach","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1358,"summary":"- Visit Popular destination Vietnam\n- Halong Bay overnight on Cruise\n- Hue imperial citadel\n- Hoian Ancient town\n- Nha Trang & Mui Ne nice beaches\n-Saigon city","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/125672_a7bef79b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/125672_a7bef79b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_5cc19cc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_20ac31b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_d60fdf1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_873d2514.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_7e77e573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_4ded9160.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_06b0fb2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_df303935.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_d3171bd5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_2bf4111b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_287a1642.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_b6a375a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_4acab158.jpg","https://cdn.tourradar.com/s3/tour/1500x800/125672_e2a662b4.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Mui Ne","Ho Chi Minh City"],"timeline":[{"title":"Day 1 - Hanoi (D)","description":"Welcome to Ha Noi Capital, meet your tour guide and driver at Noi Bai airport, car transfer to the city for check in hotel. \n\n\nFree at leisure time after a longtime flight. Overnight in Ha Noi."},{"title":"Day 2 – Hanoi city tour (B,L)","description":"After breakfast, depart for a full day tour of Hanoi including Ho Chi Minh mausoleum and simple stilted house, the Confucian Temple of Literature, site of the first university in Vietnam, the One Pillar Pagoda, the Quan Thanh Temple and lovely Tran Quoc Pagoda.\n\n\n In the afternoon, you will visit the Ethnology museum (Close on Monday ) and ending at historic Hoan Kiem Lake, the social center of Hanoi. In the evening, you’ll enjoy a Water Puppet Show. Overnight in Ha Noi."},{"title":"Day 3 - Ha Noi - Ha Long (B,L,D)","description":"08.00 – 8:30: Our guide will pick you up at your hotel lobby in Ha Noi, being on a mordern shuttle bus heading to Bai Tu Long bay, Ha Long city\n\n\n12.00: Arrive at Swan office, you have a short time to relax in the office before embark Swan cruise\n\n\n12.45: Warmest welcome drinks from our staffs. Listen to a brief of safety on board then check in your cabin\n\n\n13.30: Enjoying delicious Vietnamese for lunch while leisurely cruising to the core of Bai Tu Long Bay. \n\n\n15.00: Leave the cruise to discover Cap La Island- the beautiful area in Bai Tu Long bay. Enjoy kayaking through the karst and breathtaking nature, swimming and relaxing.\n\n\n17.30: You are back to the boat to enjoy sunset party while our cruise's sailing to Cong Do area \n\n\n19.00: Sumptuous set-dinner on board.\n\n\n20.30: Free time for relaxing on the sundeck, listening to music, you may also try your luck with squid fishing. \n\n\nOvernight on board on Bai Tu Long bay"},{"title":"Day 4 - Halong - Danang/ Hoi An (B,L)","description":"06.30: Freshen up your new day with doing Tai Chi \n\n\n07.00: Breakfast will be served in Western style and furthermore with Vietnamese traditional food. Tea and coffee is available\n\n\n08.00: Explore Thien Canh Son cave. Your guide will explain the history of Ha Long Bay, Bai Tu Long Bay and this Cave, made by Mother Nature\n\n\n09.30: Back to your boat by tender then finish packing.   \nPlease remove all of your belongings from your cabin, you may leave heavy luggage outside of the cabin (staff will transfer directly to the pier). \n\n\n10.30: Join in Vietnamese cooking demonstration on boat.\n\n\n11.00: Enjoy a traditional Vietnamese lunch.\n\n\n12.00: Disembark in Hon Gai pier\n\n\n12.30: Say goodbye Halong Bay then returns to Hanoi. On the way pick you up then transfer to Noi Bai airport for flight to Da Nang. Arrival Da Nang, meet our guide and transfer to Hoi An ancient town.\n\n\nFree time to explore this small old town. Overnight in Hoi An."},{"title":"Day 5: Hoian – Danang city (B/L)","description":"Breakfast at your hotel then visit Hoi An ancient town. Walk to the old town, buy entrance tickets and begin the tour. Start visiting the Temple Kwan, Phuc Kien Temple, Tan Ky Ancient House, Phung Hung house, Japanese Bridge and cultural show rooms in Hoi An.\n\n\n Lunch at local restaurant then transfer to Danang visit Son Tra Peninsula (called by the other name: Monkey Mountain) & Linh Ung Pagoda. Jutting out into the sea, this is an beautiful place for sightseeing, tourism, convalescence and cultural activities.\n\n\n Then, the car lead you to The Marble Mountain, located in Ngu Hanh Son ward, south of Da Nang city.  Stop on the way a few minute to visit Non Nuoc marble village."},{"title":"Day 6: Danang - Nha Trang beach (B)","description":"Am : Breakfast at your hotel then transfer to  Danang airport for flight to NhaTrang (14h10 - 15h30), the guide will welcome you and escort you to the hotel. The left of the day is open for free sea bathing at NhaTrang beach. \n\n\nOvernight in NhaTrang"},{"title":"Day 7: Nha Trang Beach - Free & Easy (B)","description":"Breakfast at hotel. Free bathing with sun and white sand at the resort. Night at the resort in Muine beach."},{"title":"Day 8: Nha Trang – Mui Ne (B,L)","description":"8:00am starting boat trip to visit TriNguyen Aquarium and Hon Tam Island. Bathing at the beach on island. Have lunch on the island.\n\n\nPM: Departure for Phanthiet and across shrimp breeding fields. Phanthiet is well-known for its white sand beaches with many mountains and forests. arrive in Muine and then leisure. Overnight at a resort."},{"title":"Day 9 : Mui Ne Beach – Free & Easy (B)","description":"Enjoy the beach at sunrise. Visit the famous moving sand-hill of Phan Thiet. Night at the resort."},{"title":"Day 10: Mui Ne – Ho Chi Minh City (B,L)","description":"Afternoon, we have a half-day city tour. Highlights include the Reunification Palace, Notre Dame Cathedral, Central Post Office and Ben Thanh market. \n\n\nHave dinner before departure and see you again!"}]},{"name":"Easy South & Central Vietnam - 10 Days","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":748,"price":449,"summary":"Start from Da Nang and end in Ho Chi Minh! With the discovery tour 10 DAYS FREE & EASY IN SOUTH & CENTRAL OF VIETNAM, you have a 10-day tour package taking you through Da Nang, Hoi An to Ho Chi Minh City. Please note that minimum of 2 people per booking.","highlights":["Discover the secrets of the Vietnam war in the Cu Chi Tunnels","Fall in love with the cultures and traditions of the local people","Learn the art of how to cook traditional Vietnamese cuisine"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141236_e894c050.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141236_e894c050.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_a4e4a345.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_d368652e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_869879fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_b0018fb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_2b3d1c6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_60e02d1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_9d2573f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_d399a03b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_c11e89c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_8071727f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_f444c216.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_57a58e03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_ef73aa0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_aea10601.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_4ab3efc2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_c8a6c481.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_90f9bd73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_8a9c4ec1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_a5c9d50d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_379db6de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_26d3688b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_ae395c11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141236_32e969bd.jpg"],"destinations":["Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1 Da Nang – Hoi An – Arrival (-/-/-)","description":"Pick-up and welcome at the airport with transfer to Hoi An. Overnight in Hoi An."},{"title":"Day 2 Hoi An – Free a half day tour (B/-/-)","description":"Choose a free half day tour from below list:\nCHA0001\tHoi An City tour \nCHA0004\tHoi An and lantern making discoveries\nCHA0002\tMy Son Sanctuary \nCHA0006\tHoi An boat trip to traditional villages\nCHA0059\tMarble Mountain & Linh Ung Pagoda\nCHA0043\tFoodie tour\nand more than 50 other options with 20% discount.\nReturn to the hotel to relax. Overnight in Hoi An."},{"title":"Day 3 Hoi An – Free time with optional tours 20% Off – Free tailor made item of clothing at Ann Tailor (B)","description":"Free time in Hoi An. \t\nPlease use shuttle bus at your hotel to contact Ann Tailor at 30 Tran Hung Dao Street to have a free tailor made item of clothing. Overnight in Hoi An.\n"},{"title":"Day 4 Cooking Class & a free spa treatment (B/L/-)","description":"08:00    Our tour guide will pick you up at your hotel and transfer you to the meeting point. We will cycle through peaceful green paddies to reach the local market (Ba Le market). The tour guide will show you where the ingredients of the cooking courses come from and you will have chance to capture the hustle and bustle trading lives of local people. After that, we head back to the cooking school where the chef and the cooking course are waiting for you. Upon arrival, you will have a break with a Vietnamese coffee to cool down and relax. Then, let’s join a fun bamboo basket boat ride through small creeks in water coconut fields. Once you get back, we will start to cook a variety of local dishes following the given menu. Our Chef and Tour Guide will instruct and assist you to cook during the class. Afterwards we enjoy our delicious and mindful dishes together.\nAfter the tour, enjoy a free luxurious spa treatment up to 60 minutes. Return to the hotel to relax. Overnight in Hoi An."},{"title":"Day 5 Hoi An – Free a half day tour (B/-/-)","description":"Choose a free half day tour from below list:\nCHA0001\tHoi An City tour \nCHA0004\tHoi An and lantern making discoveries\nCHA0002\tMy Son Sanctuary \nCHA0006\tHoi An boat trip to traditional villages\nCHA0059\tMarble Mountain & Linh Ung Pagoda\nCHA0043\tFoodie tour\nand more than 50 other options with 20% discount.\nReturn hotel to relax. Overnight in Hoi An.\n"},{"title":"Day 6 Hoi An – Free time with optional tours 20% Off – Dinner (B/-/D)","description":"Free time in Hoi An. \n18:00     Have Dinner. Overnight in Hoi An.\n"},{"title":"Day 7 Hoi An – Da Nang – Ho Chi Minh City (B/-/-) by flight 01 hour","description":"Transfer to Da Nang airport for a short flight to Ho Chi Minh City. Upon arrival, pick up and transfer to your hotel. Overnight in Ho Chi Minh City."},{"title":"Day 8 Ho Chi Minh City – Free a half day tour (B/-/-)","description":"Choose a free half day tour from below list:\nSSG0001  \tGood morning Ho Chi Minh City\nSSG0002\tHo Chi Minh City Tour – Exploring Vietnam’s biggest & busiest city\t\nSSG0024\tHo Chi Minh City Tour – Discover China Town by Cyclo\nSSG0029\tHo Chi Minh City Tour – Shopping in Ho Chi Minh City\nSSG0003\tCu Chi tunnels\nSSG0042\tMotorbike Tour\nand more than 50 other options with 20% discount.\nAfter the tour, return hotel to relax. Overnight in Ho Chi Minh City."},{"title":"Day 9 Ho Chi Minh City – Free time with optional tours 20% OFF (B/-/-)","description":"Free at leisure day. Overnight in Ho Chi Minh City. "},{"title":"Day 10 Ho Chi Minh City – Departure (B/-/-)","description":"Transfer to the airport for the departure flight. \n\nEND OF SERVICES.\n"}]},{"name":"Hanoi - Ninh Binh - Ha Long Bay - Ho Chi Minh City - Mekong Delta (7 days 6 nights)","duration":7,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":420,"summary":"Hanoi impresses tourists by cool autumn air, crowded streets, colorful lights shimmering from ancient houses, and faint aroma of milky flower making up dreamy Hanoi by night. Hanoi charm is both ancient and modern, both vibrant and gentle, and extraordinarily peaceful.\n\nThe trip take you to visit the famous destination such as Hanoi, Ha Long, Sai Gon. It's suitable for traveler who does't have much time, wish discover the north and south of Vietnam. The tour is a good mixture of learning new skills, having a good time and getting more in depth knowledge of Vietnam .","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b402da17.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b402da17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b4037d0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b403a620.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b403c39d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b403e683.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b403ffe7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b40421cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b4044eaf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b40477f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b40493bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b404c1da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182642_5e185b404e2b3.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight at hotel in Ha Noi.\n"},{"title":"Day 2: Hanoi - Ninh Binh - Bai Dinh - Trang An (B/L/X)","description":"7.30 – 8.30: Pick you up at your hotel around Hanoi Old Quarter and then depart to Ninh Binh. On the way, take a short break.\n10:30 Arrive in Buddha Sanctuary place of Bai Dinh Pagoda, the biggest one in Vietnam with 500 Arhan statues. You can see a biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight. Tour guide also gives you an introduction of beliefs and religions in Vietnam.\n 12:30 Have lunch in a local restaurant with some special dishes such as goat meat, pork storage vessel….\n 13:30 Relax on a boat trip through Trang An's spectacular network of caves, archways, and grottoes, including Sang Cave, Toi Cave, Ba Giot Cave, and Sinh Cave. Alternate between darkness and light as you experience stunning views of the mainland's answer to Halong Bay.\n16:00 Get back to the bus and then return to Hanoi.\n 18:30 Back in Hanoi, you get dropped off at your address. Tour ends.\nOvernight at hotel in Hanoi.\n"},{"title":"Day 3: Ha Long Bay – Sung Sot cave- Titop island overnight on cruise (B/L/D)","description":"8.00 – 8.30: The tour guide will pick you up at the hotel.\n11.30: Arrive harbor, transfer by tender to Cruise, and enjoy welcome drinks, receive cruise briefing, safety instructions then check in to your cabin\n12.30: Lunch in Vietnamese cuisine of fresh seafood and an assortment of appetizing favorites are served while sailing through these islands\n14.30: Start visit Surprising cave is one of the most biggest and amazing cave in the bay\n16.00: Continue to Titop island where you can enjoy swimming on sandy beach and climbing up the Top for hall panorama view Ha Long Bay\n18.00: Come back to cruise later to enjoy sun set party on sundeck\n19.00: Dinner is served in the restaurant. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff.\n20.00: Join the fishing excursion or singing karaoke, have a drink or dancing at the bar.\nOvernight on board.\n"},{"title":"Day 4: Ha Long - Hanoi - Fly to Sai Gon (B/L/X)","description":"06.00: Waking up enjoying beautiful moments when a blazing sunrise breaks the clouds of the island on the bay (accept winter time have no sunrise)\n07.00: Your breakfast will be ready in quite bay.\n08.00: Our cruising to Pearl Farm where you can see real pearl raise in Ha Long bay\n08.30: Start doing kayaking paddle explore by your own way around the bay\n10.00: Check out your cabin, ready for housekeeping clean cabin to welcome new group\n10.30: You will have short cooking class fresh Vietnamese spring roll.\n11.00: Lunch is serve onboard\n12.00: Get on harbor take the bus back to Hanoi, say goodbye Halong Bay\n17.00: Arrive Hanoi drop off at my office and then the driver transfer to airport for flight to Sai Gon.\nSai Gon arrival, you will be greeted by the driver and transfer to hotel for check in.\nOvernight at hotel in Sai Gon.\n"},{"title":"Day 5: Mekong delta full day (B/L/X)","description":"HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.30 )\nEnjoy the scenic journey along the National Highway bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.  \nOvernight at hotel in Sai Gon.\n"},{"title":"Day 6: Sai Gon city and Cu Chi tunnel (B/L/X)","description":"( start 8.00 – return 19.30 )\nAM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \n\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. \nOvernight at hotel in Sai Gon.\n"},{"title":"Day 7: Departure (B/X/X)","description":"Have breakfast at the hotel. You are free to go shopping until time the driver transfer to the airport for flight back home."}]},{"name":"Discover Cat Ba Island and Ba Be Lake 5 days 4 nights","duration":5,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":976,"summary":"This excursion will take you to from the karst-studded Lan Ha Bay to the stunning Cat Ba Island and finally to the natural haven of Ba Be National Park. As well as taking in some of the most incredible areas in the north of Vietnam, this action-packed trip is full of unforgettable experiences: cruising on a traditional wooden sailboat, hiking through a pristine forest, staying with two different local families, discovering caves system and kayaking.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/183059_6b765076.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/183059_6b765076.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_19aab8d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_cc557054.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_9ff88912.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_90ad7686.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_82687659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_10c93376.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_229d3d57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_b078e27b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_ac35c73e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_45e9d72e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_58b5ae77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_8d5b3d7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_e84a0216.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_77434f91.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_bd7f1819.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_c8ddaf0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_6401fc10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_cd1060fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_4585ccb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_34f73ce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_bce3207f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_af01de78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/183059_39d8e99a.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"Ha Noi - Cat Ba Island (L, D)","description":"\nWe’ll start the day by collecting you from your hotel in the Old Quarter at 08:00. You will then drive approximately two hours to Dinh Vu Harbour where you will take a 45-minute high-speed boat to Cat Ba Island. After that, you will go to Cat Ba town for lunch. In the afternoon, you will trek to Viet Hai Village through Cat Ba National Park enjoying bird watching, and sightseeing in the pristine forest and at Frog Lake. Along the way, you will have the chance to see native cats, squirrels, spotted deer, snakes, thousands of butterflies, and if you’re lucky, a Cat Ba Langur. You will have dinner and stay overnight in a bungalow in Viet Hai Village.\n\nHighlights and activities: Cat Ba island, Viet Hai village, 3 - 5 km trek\nAccommodation: Bungalow\nMeals: Lunch, dinner"},{"title":"Viet Hai Village - Marine Hill - Lan Ha bay (B, L, D)","description":"Breakfast will be served at 07:30 followed by a walk to the top of Marine Hill which offers panoramic views of Ha Long Bay and Lan Ha Bay. On returning to Viet Hai Village, you can try a fish massage or take some time to relax before cycling to Viet Hai Harbour. From here you will board the boat to explore the beauty of Lan Ha Bay. Lunch on board followed by kayaking around Hang Luon Cave, and if it is hot, the boat will take to some beautiful wild beaches where you can enjoy swimming and snorkelling. You will have dinner and spend the night on the boat.\n\nHighlights and activities: Viet Hai village, Lan Ha Bay, 2-4 km trek, 30 minutes cycle, 1-hour kayak and 4-hour cruise\nAccommodation: Overnight on Cruise\nMeals: Breakfast, lunch, dinner"},{"title":"Lan Ha bay - Cat Ba island - Thai Nguyen (B, L, D)","description":"You can enjoy breakfast on board the boat with the sun rising in the background before continuing the cruise around Lan Ha Bay among the myriad of limestone peaks. Today you will visit a fish and shellfish farm and the colourful floating village of Cai Beo. Lunch will be served on board (or on land if we have to embark new passengers). You will disembark at around 11:30. From here you will travel north to Thai Nguyen City and spend the night there in a homestay in Thai Hai Village which still has more than 30 traditional stilt houses.\n\nHighlights and activities: Lan Ha Bay, Thai Hai village, Thai Nguyen city, 3 hour cruise\nAccommodation: Homestay in Thai Nguyen\nMeals: Breakfast, lunch, dinner\n"},{"title":"Thai Nguyen - Ba Be Lake (B, L, D)","description":"After breakfast, the car will take you to a museum of culture where you can discover more about the 54 ethnic minority groups in Vietnam. After, you will continue your journey north to Ba Be National Park. En route you will visit the amazing Hua Ma Cave which features thousands of stalactites and columns followed by the beautiful Silk Waterfall flowing over the mountain. At Ba Be Lake, you will have free time to kayak on the lake or cycle around the village. You will have dinner and spend the night in Mr Linh’s Homestay.\n\nHighlights and activities: Ba Be National Park, Hua Ma cave, a 2 - 4 km hike\nAccommodation: Mr Linh's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"Ba Ba Lake - Ha Noi (B, L, D)","description":"After breakfast at the homestay, you will walk to Bo Lu Boat Station to embark on a three-hour boat trip around the Ba Be Lake.  If you need to cool off, this is a great opportunity to jump into the river for a swim - so refreshing! The boat will take you along the slow flowing river, giving you plenty of time to gaze in awe at the dramatic mountains and valleys and natural caves. As well as the beautiful surroundings, you will also have the chance to spot some of the fascinating wildlife in the area, especially the large ion of birds and butterflies which flit overhead. The boat will venture through the tunnel of Puong Cave, through the fascinating displays of stalactites and stalagmites which are home to thousands of bats. After enjoying the boat ride, you will begin your journey back to Hanoi, stopping for lunch at a local restaurant on the way. You should arrive in Hanoi at about 17:30 where you will be ped off at your hotel.\n\nHighlights and activities: Ba Be Lake, Boat trip, Puong Cave, a 3 hour cruise\nAccommodation: Not included\nMeals: Breakfast, lunch\n "}]},{"name":"Halong Bay stay overnight on La Regina Royal Cruise","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":167,"summary":"Sail on Bai Tu Long Bay and Halong Bay\nSpend 03 Nights in Quoc Hoa Premier Hotel 4* in Hanoi\nFree round trip transfer Hanoi-Halong Bay and Airport\nFree Kayaking to explore tunnel caves\nExcellent service with well trained team\nSpend full day to visit Trang An and Bai Dinh Pagoda ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161932_d8a8c2f4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161932_d8a8c2f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_ca58115b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_d5e71e7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_c5d8e2bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_c0715fbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_e7d7fe7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_791416ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_2f80fb0b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_549596f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_40726313.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_9b9b1510.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_d20f8ae5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_e73ef0c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_93da69b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_e9645bc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161932_82f99aa1.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - La Reginal Royal Cruises","description":"8:00-8:30 Pick up at hotel in Hanoi Old Quater\n12:45 Check in aboard with Welcome Cocktail from crew member while manager introduce the safety briefing and the boat cruising forward to the Bai Tu Long bay.\n13:15 Let your vacation start with a delicious lunch set menu in restaurant\n15:30 Visiting Vung Vieng floating fishing village, one of the biggest village in HaLong Bay, you will have chance to learn about the living of fishermen and feel free with some option activities: bamboo boat or kayaking\n17:30 - 19:00 Enjoy your time with the beautiful sunset on the bay and join “Happy Hour” – 30% Discount off all drinks onboard\n18:30 Cooking class on sundeck with the Deep Fried Spring rolls, one of the unique flavor of Vietnamese food.\n19:30 Dinner will be served on sundeck.\n21:00 Feel free to relax on boat, join Squid fishing at the area of Reception deck or singing karaoke on sundeck."},{"title":"Day 3: La Regina Royal Cruises - Hanoi","description":"06:30 Start your day with the Taichi on sundeck.\n07:00 Light breakfast serve in dining room.\n07:45 Discover Thien Canh Son cave where located on top of mountain, contain the long history of geological value and the natural beauty. Recommend you bring camera and wear sport shoes for hiking.\n9:00 - 9:30 Back to the main boat for relaxing and check out at the reception, please put all your luggage at the outside of your cabin door, crew member will help to bring luggage on land.\n09:30 Brunch is served in the restaurant while the boat heads back to the harbor.\n11:00 Disembark at the harbor\n12:00 Leave Halong Bay for Hanoi.\n15:30 - 16:00 Arrive Hotel in Hanoi. Check in and stay overnight in Hanoi"},{"title":"Day 4: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 5: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Unique Heritage of Central Vietnam 7 days 6 nights","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":931,"summary":"On this unique heritage tour you will discover 3 world heritage sites of Vietnam; Hue Ancient Capital, Hoi An Ancient town and the My Son holy land with beach breaks on some of the most beautiful beaches in Vietnam including Lang Co beach. You will also visit the DMZ (Demilitarized Zone), the 17th parallel, Ben Hai River, Hien Luong Bridge, Vinh Moc Tunnel and Quang Tri Citadel, all influential outposts during the war which became part of the DMZ.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d143667f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d143667f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d1436686.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d1436689.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d143668a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d5d3b0c5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d5d3b0c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d5d3b0c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d5d3b0ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194193_5e4b8d5d3b0cb.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Hue Arrival (L/D)","description":"\nYou will be collected from Phu Bai Airport and driven to the Imperial Citadel from where the Nguyen Dynasty ruled between 1802 and 1945. Here you can see many parts of the impressive complex which have survived the battles that took place here.\nThe tour will take you to see the Flag Tower, Noon Gate, Nine Dynastic Urns, Nine Holy Cannons, Thai Hoa Palace, and Forbidden Purple City. After a day packed full of fascinating history, you can relax on-board a dinner cruise accompanied by the sounds of traditional Hue folk songs. You will stay overnight in a Hue hotel."},{"title":"Hue - Hamburger Hill (B/L/D)","description":"\nAfter breakfast at the hotel, you will drive into Ashau Valley via Highway No.14, stopping over at Camp Eagles, Firebase Birmingham and A Luoi. These military zones are infamous as U.S. posts during the Vietnamese-American War.\nAfter lunch in a local restaurant, you will uncover more of the area's military past with a trip to Hamburger Hill. You will also have the chance of an unofficial meeting with local veterans which will give you a deeper insight into the conflict. You will have dinner and spend the night in A Luoi."},{"title":"A Luoi - DMZ (B/L/D)","description":"A Luoi - DMZ (B/L/D)\nAfter breakfast, you will take Highway No.9 northwards, stopping en-route at Da Krong Bridge, Lang Vei Special Forces Camp, Khe Sanh Base, Cam Lo, Rockpile and Camp Carrol all known for their strategic importance in the Vietnamese-American War. As well as uncovering the fierce battles which took place here, you will also discover the wild, rugged beauty of the area. You will have lunch and dinner at local restaurant and stay overnight in Dong Ha."},{"title":"DMZ - Hue B/L/D)","description":"\nAfter breakfast at your hotel, you will visit the DMZ (Demilitarized Zone), with stops at the 17th parallel, Ben Hai River, Hien Luong Bridge, Vinh Moc Tunnel and Quang Tri Citadel, all influential outposts during the war which became part of the DMZ. Although these areas were part of the DMZ, they saw some of the most brutal battles of the war. Now what's left of the historical sites sits amongst lush green scenery. You will have lunch and dinner at local restaurant, and return to Hue via Highway No.1 where you will spend the night."},{"title":"Hue Sightseeing (B/L/D)","description":"\nFollowing breakfast at the hotel, you will take a boat trip on the romantically named Perfume River. During the trip, you will visit Hue’s best-known religious site, Thien Mu Pagoda and the elaborate royal tomb of Emperor Minh Mang. As well as the history which lines the banks of the river, this trip is a great chance for you to see the daily life of local people living here. You will go on to visit the tomb of Tu Duc, and you will have lunch and dinner at local restaurant and stay overnight in the Duy Tan Hotel in Hue."},{"title":"Hue - Da Nang - Hoi An (B/L/D)","description":"\nYou will have breakfast at the hotel, then drive over the stunning Hai Van Pass, stopping over at Lang Co Beach. You will travel to Da Nang where you will go on a city tour including the grounds of former US Consulate, Cham Museum, Marble Mountain and China Beach.\nAfter lunch in Hoi An, you will take a cycle tour of the ancient town centre to visit the Chinese Assembly Halls, the Japanese Covered Bridge, Phuc Kien Pagoda and Tan Ky House. You will have dinner and stay overnight in Hoi An."},{"title":"Hoi An (B/L)","description":"\nAfter breakfast at the hotel, you will embark on a half-day trip to visit the capital and religious centre of the former Champa Kingdom, My Son. My Son was an imperial city during the Cham dynasty, between the 4th and 12th centuries, and is a large complex of religious relics that comprises more than 70 architectural works. This includes temples and towers that connect to each other with complicated red brick designs. After the tour, we will transfer you to Da Nang Airport for onwards travel if required."}]},{"name":"The Charming Of Vietnam - 9 Days","duration":9,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":720,"summary":"Let's get lost in stunning panoramas of Vietnam discovery. The tour will start in colonial Hanoi - the elegant capital, graceful yet fast-paced city. Then cruising on emerald waters among the peaks of Vietnam most famous bay. And savoring the spectacular view of Hoalu -Tam Coc in Ninh Binh province which popular known as \"Halong Bay Inland\". Explore the Southern part of Vietnam with vibrant Ho Chi Minh City and riverside life of local people alongside the mighty Mekong River.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197656_5e8c4efa3c8e6.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197656_5e8c4efa3c8e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e8c4efa3c8ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e8c4efa3c8ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e88a34e71e42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e88a34e71e44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e88a34e71e46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e8c4efa3c8f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197656_5e88a34e71e48.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Ha Noi Arrival","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you on the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. Remaining part of the day is at leisure. So, enjoy as all of you want to.\nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area.\nAfter enjoying the first day by yourself and return to the hotel for a relaxing sleep.\nOvernight in Hanoi\n\n"},{"title":"Hoa Lu - Tam Coc - Ninh Binh (B/L)","description":"Hoalu - Tam Coc is perfect combination for a day trip to learn about a dark period when Vietnam was conquested by Northern Invader. Hoalu is a sacred land with two temple worshiping those kings in 10 century who gave great contribution for the nation. Next, let's take a boat trip along the Ngo Dong river to enjoy landscape in Tam Coc. You will know why it's named Halong Bay on Land\nHIGHLIGHT:\n•  Hoa Lu and Tam Coc Biking and Boat Day Trip from Hanoi\n•  Tour Hoa Lu and Tam Coc\n•  Biking trip to Bich Dong Pagoda\n•  Enjoy the epic landscapes of northern Vietnam with a professional guide\n•  Perfect for all fitness levels\n•  Round-trip hotel transportation is included (in the Old Quarter area only)\nITINERARY:\nAM : 8:00 - 8:30. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12:30PM.\nPM : After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). \nTonight you will have free of your own time to relax in Ninh Binh "},{"title":"Explore Bai Tu Long Bay – Thien Canh Sơn – Cap La (B/L/D)","description":"•  10h30: Pick up from your local homestay in Tam Coc . Drive to Ha Long City through the green fields in the Red River Delta.\n•  12h00: Embark at Ha Long wharf – Break and photography time\n•  12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n•  13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n•  15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n•  19h00: Vietnamese style set dinner is served on board.\n•  21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat."},{"title":"Vung Vieng floating village by Bamboo boat (B/L) – Flight to Da Nang","description":"•  07h30: Have breakfast and enjoy sunrise on the bay.\n•  09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n•  10h30: Have lunch while cruising back through Ha Long Bay to the pier\n•  11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n•  12h00: Return from Ha Long to Hanoi.\n•  14h00: Stopover on the way for a refreshment break.\n•  16h00: Arrive in Hanoi. End of the trip.\nAfter the trip, you will come back hotel in Hanoi, have short rest and preparing for picking up to airport.\nYou will be transferred to airport by our driver. After landed, our driver in Da Nang will take you to hotel in Hoi An. Overnight stay at hotel\n"},{"title":"Famers and Fishermen’s Tour (B/L)","description":"Introduction:\nJoin HOI AN ECO GREEN TOUR and you will experience an enjoyable trip with immense delight from rural areas to coastal fishing villages on HOI AN estuary.We will offer you a deep insight into the local people’s daily life activities. Don’t forget to take your cameras to capture memorable moments when you go on our tour.\nTour programmes:\n\n- Tourguide pick visitors up at their hotel (in HOI AN City only)\n- Taking visitors to the countryside by bicycle \n- Participating in riding water buffalo with farmers\n- Visiting local bamboo handicraft spot\n- Coming to Cam Thanh village and take a rest at local people's house\n- Getting on a boat to visit the coastal fishing village in CUA DAI\n- Taking part in traditional fishing activities of the local fishermen.\n- Learning to paddle VIET bamboo baskets boat\n- Catching crab with local people in the water coconut forest\n- Going back enjoy lunch ( dinner ) at the local people’s house\n- Tourguide take visitors back the hotel and finish tour\n"},{"title":"Ba Na Hill – Golden Bridge Tour (B/L) – Flight to HCM City","description":"07:30 am – 08:00 am: Our Minivan and a tour guide pick you up at hotel lobby. Reach Ba Na Hills via Cable Car \t\nSpend your time on the most modern Cable Car in Southeast Asia, then take The Climbing Train to visit the top of the mountain& further explore Le Jardin D’Amour (consists of 9 gardens), Debay Wine Cellar (old wineries) & Ling Ung Pagoda \nContinue  the 2nd Cable Car to visit  the French Village (enjoy Street Music, watch Art’s statue), Campanile, Nine Floor Goddess Shrine, Tombstone Temple, Linh Phong Monastery, Linh Chua LinhTu Temple & Tru Vu Tea Shop\nWatch Carnival Performance Show, Square Du Dome...\nChallenge the most popular adventure ride - Slide of Tube Car (free ride), \nLunch at Restaurant (Buffet) \nJoin in Fantasy Park with Walking in Fairy Forest, discover Dinosaur Park, play 5D wild west, enjoy 4D death race ride, watch 3D mega 360 degree, ride on Journey into the underground, enter Jurassic Park, challenge Freefall Tower and participate in adventure in Horror House and over 90 free games.\n15:00: return the Cable Car for leaving Ba Na Hills\nHighlight: Unique and unique design, unprecedented in Vietnam. The Golden bridge is built at a height of more than 1400 meters above sea level. With total length of about 150 meters, with 8 spans, the largest is 21.2 meters. The bridge is made of 3 meters wide, 5 cm thick wood, along the aisles are planted a lot of flowers Queen Green, above the railing is made of stainless steel gilt. \n16:45 – 18:00: Our Minivan brings you back to your hotel. Tour ends.\n\nAfter the trip, you will be back hotel in HoiAn for picking up. Transfer to airport for flight to Ho Chi Minh. After landed, transfer to hotel for overnight stay \n"},{"title":"Cu Chi Tunnels in afternoon (B)","description":"Located 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". \nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon.\n"},{"title":"Mekong Delta River (B/L)","description":" HCM – My Tho – Ben Tre – HCM ( start 8.00 – return 17.00 )\nEnjoy the scenic journey along the way bordered by green rice fields.  \nOn arrived at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoycruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals. \nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories. Overnight at hotel. \n"},{"title":"Departure (B)","description":"This day you are free until transfer to Tan Son Nhat airport for your flight back home"}]},{"name":"2 Nights on La Regina Legend Cruises and 3 Nights in Hanoi","duration":6,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":175,"summary":"Spend 02 Nights on La Regina Legend Cruises 5*\nSpend 03 Nights in Quoc Hoa Premier Hotel 4* in Hanoi\nFree round trip transfer Hanoi-Halong Bay and Airport\nFree Kayaking to explore tunnel caves\nSail on both Lan Ha Bay & Cat Ba Island\nExplore Trang An - Bai Dinh Pagoda full day Trip ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/161905_a21644dd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/161905_a21644dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_b4c4ff1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_a1cc824e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_dc222e24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_8722a99a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_f86ecba0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_08d2f209.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_5ab9aa62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_98daab15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_c224b364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_5d313f22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_46d08133.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_6494d31c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_448857a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_61936631.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_717c0382.jpg","https://cdn.tourradar.com/s3/tour/1500x800/161905_3f623c96.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Highlights:\nAirport transfer\nHotel Check in\nExplore Hanoi Old Town\nAfter being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the Quoc Hoa Premier Hotel 4* which is in the perfect location to explore Hanoi Old Town at your leisure"},{"title":"Day 2: Hanoi - La Regina Legend Cruises","description":"9:00-9:30 LA REGINA LEGEND CRUISE luxury limousine picks you up at your hotel at Hanoi Old Quarter to travel to La Regina Private Lounge – arrive at around 11h30. The 2-hour journey from Hanoi to Got Ferry via the new Hanoi – Hai Phong highway is seen as a much quicker and smoother than the classic 4-hour drive to other ferries in Halong City. It’s a huge advantage when cruising with La Regina Legend Cruise.\n12:30 Let your vacation start with a welcome drink and wet towel during the time that our Cruise Manager introduce the safety briefing. The boat start to cruise to Lan Ha bay.\n13:15 Delicious set menu lunch is served in La Corona restaurant.\n15:30 Feel free to discover Trung Trang cave, one iconic and historic cave in Cat Ba island\n17:30 - 19:00 Enjoy your time with the beautiful sunset on the bay and join “Happy Hour” - 30% Discount off all drinks onboard\n18:30 join our Cooking Class on sundeck with the Chef on boat and learn how to prepare one of the most iconic dish of Vietnamese cuisine.\n19:30 Dinner is served on sundeck if the weather permit\n21:00 Other option is to try yourself at Squid Fishing at the reception or watching movie in the La Magia Restaurant on the third floor"},{"title":"Day 3: Cruise on Lan Ha Bay - Cat Ba Island","description":"06:15 Start your day with a Taichi session on the sundeck\n06:45 - 8:00 Breakfast is served in La Corona on the second floor\n08:30 Move to Day Cruise. Free time to relaxing and enjoy beautiful view of Lan Ha Bay\n9:30 Visit Viet Hai village in the midst of jungles, covered by high mountains range of the Cat Ba National Park\n12:00 Back to the main boat for relaxing and enjoy the lunch\n14:00 Enjoy kayaking at Ao Ech area which is one of the most beautiful area on Lan Ha Bay\n16:30 Back to the La Regina Legend Cruise. Free time to enjoy beautiful sunset on the bay\n17:30 - 19:00 Enjoy your time with the beautiful sunset on the bay and join “Happy Hour” – 30% Discount off all drinks onboard\n18:30 join our Cooking & Fruit Carving Class on sundeck with the Chef on boat and learn how to make one of the most iconic dish of Vietnamese cuisine and make some fruit flowers\n19:30 Dinner is served on sundeck if the weather permit\n21:00 Other option is to try yourself at Squid Fishing at the reception or watching movie in the La Magia Restaurant on the third floor"},{"title":"Day 4: La Regina Legend Cruises - Hanoi","description":"06:15 Start your day with a Taichi session on the sundeck\n06:45 Light breakfast is served in La Corona on the second floor\n07:30 The boat anchor at Tra Bau area, it is time to discover the natural beauty of Lan Ha bay by kayaking or swimming.\n9:00 - 9:45 Back to the main boat for relaxing and check out at the reception, please put all your luggage at the outside of your cabin, crew member will help to bring luggage on land.\n09:45 Brunch is served in the restaurant while the boat heads back to the harbor.\n11:30 Disembark at the harbor. Get back to the Bus for Hanoi\n15:30 - 16:00: Arrive Hanoi Downtown. Check in hotel and stay overnight in Hanoi"},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today, you are free to discover Hanoi by yourself!\nOf you can join: Trang An - Bai Dinh Pagoda full day: 55 US$/ Per Person\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Km).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork\n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure","description":"You have the morning free to relax before being transferred to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]}]