[{"name":"Quick Look Vietnam from Hanoi to Ho Chi Minh City - 7 Days","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1032,"price":619,"summary":"Hanoi: Sightseeing activities: Water Puppets performance; visit Ho Chi Minh’s mausoleum, One Pillar Pagoda, Ho Chi Minh Museum, Presidential Palace, and Temple of Literature; take a “cyclo” ride through the Old Quarter. (optional, discover by yourself)\nHalong Bay: Overnight cruise in a traditional Junk boat, discover caves & fishing villages, explore the lagoon.\nMai Chau Valley: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nHo Chi Minh City: City tour including entry to the War Remnants Museum & Cu Chi Tunnels.\nMekong Delta: Take an excursion to Mekong Delta, with a boat trip on the Mekong River to visit Floating markets.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/188731_c159359c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/188731_c159359c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_afe5180c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_aefceb13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_135b0e41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_4af47ec0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_66a8ce15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_a4670179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_1741baf8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_05bfcf07.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_69428a02.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_7fcca233.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_22dcd7c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_2394fcfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_54809f67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_ba19d0ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_5f2fb622.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_02bdca29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_22d76a49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_cfbab422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_21e06586.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_16e489a0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_8e6b3a9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_12139075.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188731_7b0af8ba.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check in hotel. Stay overnight in Hanoi.\nAirport Pick up is Optional service. You`ll pay extra 20 US$/ Per Person (pay in location) if you need picking up at airport upon arrival or you can arrange your own transfer from airport to hotel. In case of arriving before departure date, you will check in the hotel by your own following the address below:\nPomihoa Hotel Hanoi\nAddress: 166 Đường Trần Quang Khải, Lý Thái Tổ, Hoàn Kiếm, Hà Nội, Vietnam\nPhone: +84 24 3354 4555"},{"title":"Day 2: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Boat.\nGarden Bay Cruises 3* or similar"},{"title":"Day 3: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back to Hanoi for overnight. Arrive Hanoi at 3:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. Overnight in Hanoi\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 5: Bakhan Village - Hanoi - Fly to Ho Chi Minh City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter. Transfer to airport for 90 minutes flight to Ho Chi Minh City. Pick up at Airport upon arrival by Car Driver. Transfer to hotel to check in. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 6: Ho Chi Minh City - Cu Chi Tunnels full day (B, L)","description":"Today you will visit the largest Vietnamese city. There are street markets, sidewalk cafes and sleek new bars. This teeming metropolis offers 300 years of timeless traditions and the beauty of an ancient culture. To the west of the city is the huge Chinese neighborhood called Cho lon, which means \"Big Market.\" Notre Dame Cathedral, in the heart of Saigon's government quarter, is of neo- Romanesque architecture with two high square tower and iron spires. The Central Post Office is French-style and City Hall, known as \"Hotel de Ville,\" is typical of the French architecture that would be seen in any village in France. Visit the War Remnants Museum, featuring collections of weapons and photographs from the two Indochina wars. Leave Saigon for Cu Chi Tunnels to learn about Vietnam history & Vietnam War.\nArrive hotel around 5:00pm. Check in hotel and stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon 3* or similar"},{"title":"Day 7: Full day to Mekong Delta/River Boat Trip/Conclude. (B, L)","description":"Today takes you to My Tho, the capital of Tien Giang Province. Situated on the Mekong River, 75 kilometers southeast of Ho Chi Minh City, the city is surrounded by orchards and rice fields, which produce grain for the entire country. Visit one or two of the islands that produce traditional handcrafts, coconut candy and bee farms. Visit the Vinh Trang Pagoda, the oldest one in the delta on your boat trip on the Mekong River. Return to Ho Chi Minh City around 3:00pm - 4:00pm. Trip ends at Liberty Parkview Hotel Saigon.\nNotes: Today before you leave Ho Chi Minh City for Mekong Delta Tour, you can leave your luggage at Liberty Parkview Hotel until you come back after the trip (ask Hotel Reception to store your luggage until you take it). You can extend your trip by staying the same hotel or plan your own arrangements. Good bye and see you again!"}]},{"name":"Legends Of Northern Vietnam - 9 Days","duration":9,"travelStyle":["Northern Lights","Group","Partially Guided","Holiday"],"oldPrice":0,"price":719,"summary":"Explore the most charming places in Northern Vietnam. Start with a visit to Hanoi which is a unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes, and oriental pagodas and temples. You also try Vietnamese food , drink with plenty of favor . After you will visit one of the most spectacular mountains and the valley of Vietnam as Sapa with its unique culture. Besides that, cruising to the UNESCO World Heritage Halong Bay which is known as the Jewel in the Crown of Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d447bbe961.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d447bbe961.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8c53486cb9c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d447bbe98e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d447bbe990.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d46c968a67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d46c968a6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197672_5e8d46c968a6b.jpg"],"destinations":["Hanoi","Ninh Binh","Lao Cai","Halong Bay"],"timeline":[{"title":"Ha Noi Arrival","description":"We'll pick you up from the airport and take you to the Hotel in Hanoi. You'll then have plenty of time to recover from your flight, chill out and free time for your own plan."},{"title":"Ha Noi Street Food (B/L) – Water puppet show","description":"In Hanoi the food is plentiful, it’s everywhere that you look and is an integral part of the livelihoods of many locals. More often than not, the street is the stage where much of what is food related in Hanoi takes place.\nHighlights:\nSample delicious Vietnamese cuisine just like the locals do - on the street Stroll through hidden alleyways and bustling markets of Hanoi’s charming old quarter Learn more about Hanoi’s unique food culture Try local specialties with influences from French and Chinese cuisine Take in a spectacular night view of Hoan Kiem lake from a secret cafe Fascinating cyclo tour to discover the 36 ancient Streets of Hanoi Old Quarter with its ancient buildings and temples, transparent lakes and old cultural features.\nInclusions: English speaking tour guide, all street food items as per itinerary ( 6 to 8 different street food vendors stops with 10 tastings ). Drink include : 01 bottle of water, a cup of local frest beer, rice wine, egg coffee and local dessert .\nExclusions: All other drinks, extra food portions, tips for local guide\nSchedule details:Duration: 03 hours by Walking ( 2,5 Km )\nAfter street food tour, you will have free time to see Hanoi old quarter then take the water puppet show. which is  a must see for anyone visiting Hanoi. It's a very old craft that is a unique part of Vietnamese culture"},{"title":"Hoa Lu - Tam Coc - Train to Sapa (B/L)","description":"Hoalu - Tam Coc is perfect combination for a day trip to learn about a dark period when Vietnam was conquested by Northern Invader. Hoalu is a sacred land with two temple worshiping those kings in 10 century who gave great contribution for the nation. Next, let's take a boat trip along the Ngo Dong river to enjoy landscape in Tam Coc. You will know why it's named Halong Bay on Land\nHIGHLIGHT:\n•  Hoa Lu and Tam Coc Biking and Boat Day Trip from Hanoi\n•  Tour Hoa Lu and Tam Coc\n•  Biking trip to Bich Dong Pagoda\n•  Enjoy the epic landscapes of northern Vietnam with a professional guide\n•  Perfect for all fitness levels\n•  Round-trip hotel transportation is included (in the Old Quarter area only)\nITINERARY:\nAM : 8:00 - 8:30. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12:30PM.\nPM : After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). Dive back to Hanoi and drop off at your hotel around at 18:30PM.\n\nYou will come back hotel about 7 pm, you should keep luggage and rest at lobby hotel till we take you to train station to Sapa. There are many differnt ways to reach in Sapa like bus, car, train... tonight you will have a night train experience in Vietnam which you have not in your country. \n\n"},{"title":"Sapa - Y Linh Ho - Lao Chai - Ta Van (B/L/D)","description":"Around 06:30am, be greeted by our tour guide and driver upon arrival at Lao Cai train station, before being transferred to Sapa village, by a shared tourist bus. The bus ride uphill to Sapa takes a little over an hour, and will give you a glimpse of the stunning vistas and impressive rice terraces as you make this short trip.\n\nOnce arriving in the hotel in Sapa, an early check in follows if room is available, otherwise in the interim, you will have access to a basic room for your refreshment, before enjoying breakfast prior to going on the morning tour.\n\n09.30 Start your tour with 6km of walking down to the South East of Sapa along the side of Muong Hoa valley to Y Linh Ho village, home of the Black H’mong people. Then continue with a 3km-trek down to Lao Chai village. Here we will stop for a simple lunch before exploring the village. After lunch, continue trekking through terraced rice fields to Ta Van, village of the Dzay minority people. This trek is relatively easy, though the trail\ncan be quite slippery if it rains, so good footwear is recommended.\n\n•\tTrekking level: 6/10\n\n•\tTrekking: 10Km trekking and 8Km driving from Tavan village back to Sapa.\n\n•\tAccommodation: Home-stay in Ta Van\n\n"},{"title":"Ta Van - Giang Ta Chai - Su Pan - Sapa (B/L/D)","description":"Around 09:30Am, after having had a restful night and enjoyable breakfast, it is time to take an 8 km walk to visit 2 villages of the red Dzao people, the H’mong who are located in Giang Ta Chai\n\nSu Pan villages. Situated at the edge of Muong Hoa Valley, Giang Ta Chai is gaining popularity as one of the most scenic and interesting locations for visitors who enjoy experiencing the colorful traditional customs and costumes that are always on show here. While Supan is considered as a less travelled and more withdrawn village because of its small population base.\n\nThere are breath taking and beautiful landscapes throughout this mountainous area, including a stunning waterfall, rattan bridges, and some exquisite ferns and orchids that drape from the overhanging branches of so much lush vegetation. After Giang Ta Chai and Su Pan visits, it is hard to have to leave this area, but we again have opportunity to do more exploration in Sapa town, so the bus ride allows some recovery time... and lots of photos and stories will no doubt be told on the brief ride back.\n\nTour ends at around 15:30 or 16:00. Overnight in Sapa.\n\n•\tTrekking level: 5/10\n\n•\tTrekking: 10Km\n\n•\tAccommodation: Hotel in Sapa\n\n"},{"title":"Cat Cat & Sin Chai (B/L/D)","description":"After breakfast around 9.00am, we start explore the village a little bit further to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. This trek offers some stunning views of the waterfall and the vestige of a hydro-electric power station which was built in the early 20th century. Also here you will have the opportunity to see the villagers working on the paddy rice fields, their children playing around, and the animal such as water-buffaloes, pot-bellied pigs and chickens. After crossing a village, you will arrive at the picturesque waterfall which is an ideal place for resting & taking pictures. Enjoy your lunch and the mountainous scenery.\n\nLater, continuing to hike to Sin Chai village (3km) that situated on the bottom of Fansipan Mountain, also well-known as ‘the roof of Vietnam and Indochina”. There you will enjoy huge stunning and sleeping landscape before heading off to Sapa town.\n\n•\tTrekking level: 4/10\n\n•\tTrekking: 7KM trekking, 3Km driving from Cat Cat back to Sapa.\n\n•\tYou will get overnight bus back to hotel in Ha Noi. \n\n"},{"title":"Bai Tu Long Bay – Thien Canh Sơn – Cap La (B/L/D)","description":"Coming to Bai Tu Long Bay, you will be charmed by its wild beauty with stone mountains, caves, long sandy beach and lovely fishing village. With our Cruise experience, an elegant designed and well-furnished cruise, we are provided you a unique and unforgettable trip.\n\n07h30: Pick up from your hotel in Hanoi. Drive to Ha Long City through the green fields in the Red River Delta.\n10h00: Stopover on the way for a refreshment break.\n12h00: Embark at Ha Long wharf – Break and photography time\n12h30: Boat Cruises on Halong, enjoy a welcoming drink and cruise briefing.\n13h30: Have lunch while cruising in Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n15h30: Transfer by tender to Thien Canh Son cave. Our tour guide will take you to a huge cave with many interesting stalactite and stalagmite in different amazing shapes …. After about half an hour visiting, you will go back to tender and return to the boat. Then return to cruise for your leisure or join sunbathing, enjoy swimming in the crystal clear water. Join with cooking class by our chef.\n19h00: Vietnamese style set dinner is served on board.\n21h00: Take some leisure time to enjoy chatting at the bar or enjoy some night fishing. Stay overnight on boat.\n"},{"title":"Explore Vung Vieng Floating Village by Bamboo Boat (B/L)","description":"07h30: Have breakfast and enjoy sunrise on the bay.\n09h00: Visit ancient Vung Vieng floating village you are not only be immersed in the quiet and peaceful atmosphere, but also be surrounded by the rocky mountains by small bamboo boat for an hour in to the ancient village then return to cruise for relaxing and check out the room.\n10h30: Have lunch while cruising back through Ha Long Bay to the pier\n11h30: Disembark at Ha long wharf, time to say goodbye to the crew.\n12h00: Return from Ha Long to Hanoi.\n14h00: Stopover on the way for a refreshment break.\n16h00: Arrive in Hanoi. End of the trip."},{"title":"Departure (B)","description":"Breakfast at hotel, there is no activities for today, till our driver take you to airport for flight to home. Trip ends"}]},{"name":"7 Days in Northern Vietnam","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":410,"summary":"Best of Northern Vietnam tour will provide you the value experience; you will have a chance to enjoy the natural world heritage Halong bay as well as the capital city of Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe4e3161.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe4e3161.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe4ef5ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe5003b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe50cff6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe511f5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe51be7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189100_5df30fe516dfc.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"HANOI ARRIVAL","description":"Welcome to Hanoi! You will be met at the airport for transfer to your hotel in Hanoi.\nFree at leisure. Dinner on your own.\nOvernight in Hanoi\n"},{"title":"HANOI – HAI PHONG - HALONG BAY - LAN HA BAY (B,L,D)","description":"09h10\tYou will be collected from Hanoi Old Quarter to take the new highway to Got Ferry Terminal – Cat Hai Town, Haiphong City where we arrive at around 11h30. The passengers have a chance to experience on longest and newest bridge in South East Asia area. You can take special tea at Cruise’s lounge by warm welcome.\n12h15 \tTransfer by tender to the CRUISE. \n12h30\tWe welcome our guests onboard the CRUISE and then check in, enjoy Welcome Drink, receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature.\n13h00\tCRUISE proceeds to Da Chong islet, where you can see a lighthouse built by the French over 100 years ago. Have International Buffet Lunch while passing via the islets of Con Vit area. These amazing limestone karst formations rise up out of the sea in an impressive manner. This area is untouched, as not many cruise ships use the route via the Cat Ba Island - Thoi Quyt area - Coc Ngoi islet - through Gia Luan area where is belong to Cat Ba National Park\n15h00\tWe progress to Trung Trang cave by our bus on Cat Ba island which is located in the middle of Cat Ba National Park with Kim Giao forest around the cave. \nTrung Trang Valley is the largest valley on Cat Ba Island. The valley covers an area of approximately 300 hectares, has a depth of 10m to 30m and is around 15km in the middle of Cat Ba National Park. Trung Trang Cave measures 300m lengthwise through the mountains. The cave was carved by nature for more than 2000 years. The cave has many stalactites that take on various shapes that will awe and inspire visitors to use their imagination.\n17h00\tCruise gets in the less populated area at Tra Bau where is located in Lan Ha Bay. You will enjoy the green emerald and cool water by swimming\n17h45\tReturning CRUISE, you can watch the magnificent sunset over the Gulf of Tonkin. Onboard you may join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. In the early evening the boat has its Happy Hour deal\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n19h30\tSumptuous Deluxe Dinner Set Menu is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting\n21h30\tEnjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n23h00\tEnd of Day One program\n"},{"title":"DAY 03: HANOI – LAN HA BAY (B,L,D)","description":"6h15\tThe day starts early onboard CRUISE with Tai Chi session on the sundeck. \nThe breakfast is served in the restaurant with morning view of bay’s landscape, then continue our journey. \n8h30\tTransfer to Peony Day Boat to visit Viet Hai village. You will take the bicycle trip along the village path and go through rain forests and dark tunnel.  Enjoy stunning scenery of rice fields on the way. Stop at the village to relax. Visit an ancient local house, made from straw, mud, bamboo…you will have chance to see the local life on a valley of local people. Optional electric car service is available (at an extra cost). \nBack to day boat for visiting Lan Ha Bay. Lunch served on day boat.\n13h30\tVisiting Lan Ha Bay, taking a free breeze at area with the path less visited. You will use your imagination to name any beautiful islands in Lan Ha Bay or get the interesting introduction of our professional tour guide on Peony Day Boat\n15h00\tReturn to CRUISE. Enjoying swimming at the untouched area.  Then, you will join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. Watch the magnificent sunset over the Gulf of Tonkin. In the early evening the boat has its Happy Hour deal\n19h30\tDeluxe Dinner is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting\n21h30\tEnjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n23h00\tEnd of Day Two program.\n"},{"title":"HALONG BAY – HANOI (B, brunch)","description":"06h15 \tWhy not rise early to witness the bay at its very best whilst enjoying an invigorating Tai Chi session on the sundeck; after which we serve the breakfast. Upon completing the breakfast continue our journey and head out to explore the bay in the area where Ao Ech is situated.\n7h45\tYou enjoy on your own to kayak at Ao Ech area to discover the hidden charm of Lan Ha Bay\n9h30\tCruise welcomes you back on board and it is time for checking out \n10h00\tWhilst cruising back you can enjoy a delightful brunch\n10h30\tTea Ceremony is served at the restaurant. You will learn how to enjoy Vietnamese tea and Vietnamese cultural at this ceremony. Joining Tea Ceremony with our crews team and have great fun with us!\n11h35\tWe return to the quay side in the south of the bay, where our visitors disembark.\nWe bid farewell at Got ferry, this is the end of the program. \n14h00\tBack to your drop-off point in Hanoi. Overnight in Hanoi\n"},{"title":"HANOI –CITY TOUR (B)","description":"After a truly scrumptious breakfast, you will get ready for a full day viewing Hanoi's attractions. Your first stop is the Ho Chi Minh Complex, which includes the Mausoleum, Uncle Ho's former stilt-house residence, the Presidential Palace, the Ho Chi Minh Museum, followed by the Literature Temple, Vietnam's first University constructed in 1070. In the afternoon, explore the Museum of Ethnology, which contains an extensive display of life-size structures dedicated to Vietnam’s 54 ethnic minorities. Next, enjoy an hour-long tricycle (cyclo) ride winding through the narrow, chaotic streets of the Old Quarter – a must for any visitor to Hanoi. Afterwards you will enjoy a Water puppet show- the unique Traditional Art in the North of Vietnam. \nOvernight in Hanoi\n"},{"title":"HANOI –CITY TOUR (B)","description":"After breakfast, free and explore Hanoi on your own way. Overnight in Hanoi"},{"title":"HANOI – DEPARTURE (B)","description":"After breakfast, free until transfer to the airport for flight back home."}]},{"name":"Golf Trails of Vietnam - 13 Days","duration":13,"travelStyle":["In-depth Cultural","Group","Partially Guided","Holiday"],"oldPrice":3518,"price":1935,"summary":"Experiencing different golf courses throughout Vietnam within 13 days. From the excitement of modern Saigon to the thousand-year-old streets of Hanoi, from the sea and sand in Mui Ne, Nha Trang, Danang and Hoi An , the choices are endless. Combine this with world-class Vietnam golf and accommodations to suit every golf traveler and you have the foundation of for the ultimate Vietnam golf destination.","highlights":["Take a swing and try your hand at world-class Vietnam golfing","Experience the excitement of modern Saigon to the 1000-year-old Hanoi","Fall in love with the sea and sand in Mui Ne, Nha Trang, Danang and Hoi An"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187471_4bc801f4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187471_4bc801f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_6d94a2ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_97f1b3ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_162d6db4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_19935858.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_f7260673.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_542b8241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_093b1628.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187471_fddc5d90.jpg"],"destinations":["Ho Chi Minh City","Mui Ne","Quy Nhon","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City – Arrival","description":"We will pick you up at the Ho Chi Minh Airport and take you to your hotel for check-in. Overnight in Ho Chi Minh City."},{"title":"Day 2: Ho Chi Minh City – Golf at Viet Nam Golf and Country Club (B/-/-)","description":"Enjoy an experience with golfing at one of the golf courses in Viet Nam. Viet Nam now boasts some of the finest golf courses, not only in Asia but also worldwide. Only 20 km away from the center of Ho Chi Minh City, the Viet Nam Golf and Country Club is a world class 36-hole golf course that consists of two 18-hole courses. The courses here are unique in that the West course favors the Asian tradition of narrow tree-lined fairways and fast smooth greens, while the East course offers long, wide fairways with well-placed bunkers and water hazards in addition to challenging and undulating greens. Overnight in Ho Chi Minh City."},{"title":"Day 3: Ho Chi Minh City - Mui Ne (B/L/-) by minivan","description":"Visit Ho Chi Minh City in the morning. Ho Chi Minh City is the largest, busiest and most exciting city in Viet Nam. It is also filled with intrigue and culture. On this tour we will visit some of the most interesting sights that Ho Chi Minh City has to offer, such as:\nThe War Remnants Museum: This is a lively display of the futility of the war. \nThe Reunification Palace: This beautifully preserved palace was the residence of the President of the Republic of Viet Nam. \nNotre Dame Cathedral was built in 1880 and the Old Post Office was built between 1886 – 1891. It is one of the best examples of classical French colonial architecture.\nThien Hau Pagoda in Cho Lon: This is a Chinese style temple located on Nguyen Trai Street in Cho Lon (China town) district. It is dedicated to Thien Hau, the Lady of the Sea, also known as “Mazu” (“Tian Hou” in Chinese). \nOur last stop would be at the Lacquer ware factory where you can observe the process of making these traditional Vietnamese products.\nLunch at local restaurant. Depart for Mui Ne, check in resort. Overnight in Mui Ne.\n"},{"title":"Day 4: Mui Ne – Golf at The Golf Sea Links (B/-/-)","description":"In the morning, it is time for golf at The Golf Sea Links Mui Ne Phan Thiet - Vietnam golf course is located in Phan Thiet City, about 200km from Ho Chi Minh City. Sea Links lies in the heart of a simply breathtaking area of the countryside. Nearby attractions include Lau Ong Hoang, Poshanu Tower, Ong Dia Stone, Ham Tien and Hon Rom. Sea Links is the second course in Phan Thiet, joining Ocean Dunes Golf Club as two jewels in this Vietnamese coastal town. Sea Links Golf Club is built on an area of 160 hectares on a cliff with wild and beautiful sand dunes. The golf course is practically at the sea level, just a few minutes from Full Moon Beach and with amazing views of the ocean below. The courses designers, Ronald Fream and Golfplan Company, highlight that the course retains much of the original terrain of white sand dunes. Sea Links looks over the ocean, with panoramic views of Mui Ne Bay, thus creating a particular appeal for golfers. The golfers at Sea Links can experience for themselves a modern but traditional links style golf course that exists nowhere else in Vietnam and or even in Asia. Overnight in Mui Ne."},{"title":"Day 5: Mui Ne – Nha Trang (B/-/-) by minivan","description":"Have breakfast. Check out. Drive to Nha Trang by car. Upon arrival in Nha Trang, check in. Pick up from your hotel and visit the Long Son Pagoda, which was founded in the late 19th century then renovated in 1940. Located on Trai Thuy Hill it is the largest pagoda in Nha Trang. Every year, around tens of thousands of pilgrimage tourists visit this pagoda and pray at the 79 foot tall White Buddha Statue and the many other architectural features that the pagoda has to offer. After that we go to Ponagar Cham Tower, these towers were built by the Cham civilization between the 7th and 12th century to honor Yang Ino Po Nagar. The local Buddhists of Nha Trang use this place for prayers and worshipping and there are many incense sticks lit, giving the place an interesting architecture filled with stunning colours. The last point of the tour is the photogenic stone grotoes of Hon Chong. Overnight in Nha Trang. "},{"title":"Day 6: Nha Trang – Golf at Diamond Bay Golf (B/-/-)","description":"Play at Diamond Bay Resort & Golf. With its unique scenery, Diamond Bay Resort & Golf is one of the truly fascinating golf courses in Asia. Golfers can experience the combination of the sweet fragrance of Platinum TE Paspalum grass combined with the clean fresh air off the tropical sea and of course, the Sea driving range. This great golf course is nestled naturally between the mountains and sea creating one of the great golf experiences in the world. Back to your hotel and relax. Overnight in Nha Trang."},{"title":"Day 7: Nha Trang - Quy Nhon (B/-/-) by minivan","description":"Have breakfast at the hotel. Depart for Quy Nhon, check in hotel. Overnight in Quy Nhon."},{"title":"Day 8: Quy Nhon - Golf at FLC Quy Nhon Golf Links (B/-/-)","description":"Spend your day playing golf at FLC Quy Nhon Golf Links. The 36-hole golf course is a harmonious combination of unique design and picturesque scenery of Nhon Ly Beach with the highlight of Eo Gio - the most spectacular place to watch the sunrise in Vietnam. Building on large sand dunes beside an evergreen pine hill, you are challenged to conquer golf holes. Back to your hotel and relax. Overnight in Quy Nhon."},{"title":"Day 9: Quy Nhon - Hoi An (B/-/-) by minivan","description":"Have breakfast at the hotel. Depart for Hoi An, check in hotel. Overnight in Hoi An."},{"title":"Day 10: Hoi An - Marble Mountain (B/-/-)","description":"08:00 The Marble Mountain (Vietnamese: Ngu Hanh Son; literally \"five elements mountains\") is a popular sightseeing location in Da Nang because of its alluring beauty. Stone steps carved into the mountain lead to a Buddhist Pagoda. There are plenty of exercises as there's lots of steps, you can also discover stunning caves and enjoy the beautiful view from the top of the mountain. Upon arrival to the mountain, we will climb up the stone stairs and visit the caves and pagodas as well as admire the beautiful panoramic view. We will then head down the mountain and visit the stone village where the skilled local sculptors create many marble products. Then, you will go to Am Phu Cave where there's a replica of heaven and hell, eerie underground tunnels while listening to the clapping of bats' wings in the cave. Before getting back to the hotel, we head to Linh Ung Pagoda. Built under the reign of King Minh Mang in the Nguyen Dynasty (the 19th century), legend has it a Buddhist statue drifted downstream to the area and got anchored at a sandy embankment. The local villagers thought it was a good sign, so they built up a small pagoda to worship the statue. From that day on, they said, the whole coastal region enjoyed good weather, with no big storms and rough sea waves, while local fishermen harvested good fishing. Overnight in Hoi An."},{"title":"Day 11: Hoi An – Golf at Montgomerie Link Viet Nam – Ha Noi (B/-/-) by flight","description":"In the morning, we will enjoy golfing at the Link Viet Nam Golf Course with one round of 18 holes. Montgomerie Link Viet Nam has the good fortune of having truly outstanding natural features. The sandy soil, wind-blown dunes and indigenous vegetation combine to create the framework for a very strong golf course. The course is an exciting mixture of styles and caters to all types of golfers. Transfer to Da Nang airport for flight to Ha Noi. Overnight in Ha Noi."},{"title":"Day 12: Ha Noi – Golf at Chi Linh Star Golf Club (B/-/-)","description":"After breakfast, transfer to Hai Duong for 18 holes of golf at Chi Linh Star Golf Club. The rest of the day you are free to relax at the hotel. Overnight in Ha Noi."},{"title":"Day 13: Ha Noi City Tour – Departure (B)","description":"Pick up at the hotel in the morning and drive to the historic complex of Ba Dinh. Visit Ba Dinh Square, where the late President Ho Chi Minh read Viet Nam’s Proclamation of Independence on 2 September 1945. Visit Ho Chi Minh’s Mausoleum and continue to One-Pillar Pagoda, a must-see monument in Ha Noi. One-Pillar Pagoda is an ancient Buddhist pagoda supported by only one pillar. Built in the early 11th century during the reign of King Ly Thai Tong, the pagoda resembles a lotus blossom. We will also visit Van Mieu - Quoc Tu Giam (temple of literature), the first Imperial school in Viet Nam built in 1070 during the dynasty of King Ly. (if you have time)\nTransfer to the airport for departure flight.\n"}]},{"name":"Cycling along Vietnam's Red river Delta","duration":10,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Discovery"],"oldPrice":0,"price":1966,"summary":"CYCLING ALONG VIETNAM’S RED RIVER DELTA \nHANOI - MAI CHAU - PU LUONG - NINH BINH - HALONG BAY\n\nHighlights\n\n  Explore Hanoi’s bustling Old Quarter and discover the city’s rich culture and history. \n  Cycle through Vietnam’s lush green valleys and spectacular karst mountains. \n  Visit the serene Pu Luong Nature Reserve and Vietnam’s first and largest national park, Cuc Phuong National Park. \n  A truly immersive experience offering travelers an insight into the authentic way of life in northern Vietnam. \n  Venture into the tranquil Van Long Nature Reserve - the ‘Halong Bay on Land’ - and glide along its lake in a traditional sampan raft. \n  Relish an overnight cruise on the world renowned Halong Bay, enjoying delectable seafood dishes and spectacular sunset views.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d18e22d71.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d18e22d71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d1740f346.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d1743c573.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d17441e1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d17447a9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d1ba7acc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/188798_5df1d1ba8e2bc.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh","Halong Bay"],"timeline":[{"title":"Arrival in Hanoi","description":"The guide will meet your group at the hotel in the late afternoon. You will spend the evening exploring Vietnam‘s capital, enjoying the colonial era charm of the city. You will spend most of the evening discovering the surroundings of Hoan Kiem Lake, the heart of the capital where all sorts of exciting activities and sights can be experienced. The lake is associated with a fascinating legend. Once upon a time, the heavens entrusted the Vietnamese Emperor, Le Thai To, with a magical sword to chase the invading Chinese out of Vietnam. Once the task was accomplished, he walked around the lake, and a giant turtle arose from the waters, taking the sword and returning it to its divine owners - and hence its name, \"Lake of the Returned Sword\".\n\nMeals included: Dinner\nAccommodation: Overnight at hotel\nNotes: Rooms will be at guests’ disposal from 14:00\nNote: Airport pick up can be provided as a supplement for travelers arriving on a different flight.\n"},{"title":"Hanoi","description":"The guide will meet your group at the hotel in the late afternoon. You will spend the evening exploring Vietnam‘s capital, enjoying the colonial era charm of the city. You will spend most of the evening discovering the surroundings of Hoan Kiem Lake, the heart of the capital where all sorts of exciting activities and sights can be experienced. The lake is associated with a fascinating legend. Once upon a time, the heavens entrusted the Vietnamese Emperor, Le Thai To, with a magical sword to chase the invading Chinese out of Vietnam. Once the task was accomplished, he walked around the lake, and a giant turtle arose from the waters, taking the sword and returning it to its divine owners - and hence its name, \"Lake of the Returned Sword\".\n\nMeals included: Dinner\nAccommodation: Overnight at hotel\nNotes: Rooms will be at guests’ disposal from 14:00\nNote: Airport pick up can be provided as a supplement for travelers arriving on a different flight.\n"},{"title":"Hanoi - Hoa Binh - Thung Khe - Mai Chau","description":"In order to avoid the highway, you will head by car to the Ho Chi Minh Trail in Hoa Binh, your cycling starting point. You will cycle through villages and get a glimpse of the local life of people in Northern Vietnam. \n\nAfter lunch, you will travel to Thung Khe, the afternoon's starting point. Beginning from Thung Khe, the wonderful pass will dazzle you with incredible views as you continue pedaling through sharp, karst mountains. En route, be sure to gaze at the spectacular views over Hoa Binh Lake until you reach a stunning waterfall, situated 15 kilometers below the main road (access to which might be more challenging on rainy days). A refreshing swim is a great idea before heading to the pick-up point, where you will be taken to the lush, green valley of Mai Chau, located in traditionally Thai minority territory. The Vietnamese Thai minority people are originally related to the Thai people of Thailand, and their community now consists of over a million people in Vietnam. A local family will warmly welcome you into their traditional stilt house. You can explore the village, meet its inhabitants, and discover their lifestyle - still authentic, with traditions having been passed down from generation to generation.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel\nEasia Level: 2-3\nDistance and duration of cycling: 40 to 70 kilometers – 4 to 6 hours\nDifference in elevation: +320 meters / -560 meters\nTerrain: Paved roads and village roads\nTransportation: 125 kilometers – 2hr 45min – full-day vehicle support\n"},{"title":"Mai Chau","description":"An entire day devoted to cycling and the discovery of Mai Chau Valley is the only way to do this area justice. Along the way, the ethnic minorities who populate the peaceful villages, their stilt houses, local schools, and rice fields will paint a distinct and beautiful picture of authentic life in Northern Vietnam. Passing the villages of Chieng Sai, Ban Nhot, Ban Ha, Na Loc, and Mai Hich, you will catch glimpses of the customs, people, and traditions that showcase the intrinsic beauty of this region - aside from its obvious natural splendor. Finally, you will reach the village of Buoc and enjoy a break.\nAfter lunch in the village, hop on your bike and cycle to explore other villages in Mai Chau, before arriving at the hotel where you will spend the night. \n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel\nEasia Level: 3\nDistance and duration of cycling: 50 kilometers – 5 hours\nDifference in elevation: More than 550 meters\nTerrain: Easy to cycle, mainly paved roads\nTransportation: Full-day vehicle support\n"},{"title":"Mai Chau - Pu Luong","description":"Day 5’s cycling journey has you diving deeper into the Mai Chau Valley to experience more of the local, rural life. Your day consists of 40, easy-going kilometers, that will have you crossing rice fields and passing wooden stilt houses, before hitting the road again in the direction to another one of Northern Vietnam's highlights: the enchanting Pu Luong National Park. Here, the incredible limestone landscapes – quintessential Vietnamese views - and peaceful rural life are your reward for the physical work you put in! Riding around the park is also a great opportunity to spot birds hidden among the diverse flora (almost 1000 listed plant species in total). The route takes you through beautiful villages, rice fields framed by karstic mountains, as well as the primeval jungle, a region and part of Northern Vietnam untouched by most travelers.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at Pu Luong Retreat (non-private traditional house on stilts)\nEasia Level: 2\nDistance and duration of cycling: 50 kilometers – 5 to 6 hours\nDifference in elevation: +170 meters / -750 meters\nTerrain: Paved roads and dirt roads\nTransportation: Full-day vehicle support \n"},{"title":"Pu Luong - Ninh Binh","description":"During the morning, you will travel from Pu Luong to Cau Tram, your starting point of the day. From here, you will cycle along back roads through pineapple and tea plantations. At lunchtime, you will enjoy a break and enjoy a meal in a local house. \n\nIn the afternoon, cycle along the country dike to Van Long Nature Reserve, another tranquil and visually stunning nature reserve in Ninh Binh Province, also nicknamed the \"Halong Bay on Land\". Upon arriving at the shallow lake waters, wild grass and water lilies gently caress the traditional wooden sampan you will embark on. Your craft will glide effortlessly over the waters of the lake. While you take a well-deserved break and soak in the scenery, the boat will take you around to enjoy this almost otherworldly environment. After the pleasantly relaxing sampan tour, you will finally make the trip to the hotel in Ninh Binh. \n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel\nEasia Level: 2\nDistance and duration of cycling: 50 kilometers – 5 hours\nDifference in elevation: None \nTerrain: Mainly paved road\nTransportation: Full-day vehicle support \n"},{"title":"Ninh Binh - Cuc Phuong National Park - Ninh Binh","description":"Start your day with a short transfer from the hotel to the starting point and cycle to visit Dinh Le Temple. From here, continue to cycle through the beautiful landscapes of Trang An and to Tam Coc. \nAfter lunch in Tam Coc, travel to and cycle through Cuc Phuong National Park. It is a peaceful place, 100 kilometers south of Hanoi, and is an ideal destination for people looking to immerse themselves in nature. The park is located between two limestone mountain ranges, and is home to the Muong minority people who still live in the few villages scattered around the park’s periphery, working to preserve their traditions and culture.\nEnd the day with a transfer back to the hotel. \n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 3\nDistance and duration of cycling: 60 kilometers – 6 hours\nDifference in elevation: +218 meters / -225 meters\nTerrain: Mainly flat roads, easy to ride\nTransportation: Full-day vehicle support \n"},{"title":"Ninh Binh - Halong","description":"In the morning, you will head towards the famous Halong Bay. On the way, you will pass through the Thai Binh province and the large port city of Haiphong. You will arrive at Halong at around noon and embark on a cruise around the bay. This world-famous bay is one of the most beautiful landscapes in Vietnam, with giant rock islets covered in lush vegetation overlooking the waters. Halong Bay includes some 1,900 islands and islets of rocky peaks, often uninhabited and untouched by humans. These scenes create a spectacular marine landscape, which earned it UNESCO World Heritage status in 1994. You will be served lunch and dinner aboard the cruise, which consists of excellent, freshly caught seafood from the bay. Don’t miss the sunset on the top deck for some beautiful photo opportunities. At the end of the day, you will also have the chance to enjoy an evening fishing session on the boat.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight on the boat\nDistance: 180 kilometers – 3 hours\n"},{"title":"Halong - Hanoi","description":"Early in the morning (the time depending on the season), wake up to enjoy the stunning sunrise over the aquamarine waters of the bay. Enjoy a morning cruise around the bay until you disembark and return to Hanoi on a road lined with rice fields typical of the Red River Delta. \n\nArrive in Hanoi at about mid-afternoon, and enjoy some leisure time before a fare-well dinner. \n\nMeals included: Breakfast, dinner\nAccommodation: Overnight at hotel\n"},{"title":"Departure Hanoi","description":"Enjoy your final breakfast at the hotel, and then make your way to the airport for your onward flight.\n\nMeals: Breakfast\nHotel standard check-out: 12:00\n"}]},{"name":"Hanoi Stopver Tour with 1 Night on Paradise Elegance Cruises 5*","duration":6,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":189,"summary":"Free round trip transfer pick up from airport\n04 nights at 4* Quoc Hoa Premier Hotel in Hanoi\n1 night on brand new luxury Paradise Elegance\nSpend one day to Trang An and Bai Dinh Pagoda\nDiscover Hanoi City Tour full day\nDiscover Caves & Beaches in Halong Bay\nUnique Water Puppet Show & rickshaw ride","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100262_7726ef75.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100262_7726ef75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_0c727eef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_eba7d7d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_1ad49679.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_de2a8cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_13ff33b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_7b62938a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_58323410.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_03641794.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_9e9c9aa1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_3da7d28b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_6f4aa81d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_2fe2914f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_5af51b35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_e604b5ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_aa9fa2d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_5d0f33f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_4d2432aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_6326cbf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100262_a41b1288.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. "},{"title":"Day 2: Hanoi - Paradise Elegance (B, L, D)","description":"7:30 am to 8:30 am: Pick up at Hotel Hanoi. \nAlong the way to Halong Bay we will stop for a short break in an arts and crafts centre. Here you are able to watch the produce being made and grab a snack to eat\n12:00 pm reach Tuan Chau International Port and prepare for boarding\n12:15: Transfer to Paradise Elegance\n12:30: Welcome drink, cruise information and check-in\nSpa samplers\n13:00 - 14:30: Lunch at Le Marin Restaurant\n14:30 - 16:00: Cruise and sightseeing along Halong Bay\nEnjoy an afternoon spa treatment at Paradise Spa*\n16:00: select from\n- Visit Sung Sot Cave (1 hour) or kayak near Luon Cave area (1 hour)\n- Afternoon Tea at Le Piano Bar and spa treatment at Paradise Spa*\n17:00 - 18:30: Happy Hour at Le Piano Bar with music\n17:30 - 19:00: Anchor at Coconut Tree Island for overnight stay\nCooking demonstration at L’Odyssée Sundeck\n19:00 - 22:00: Dinner at Le Marin Restaurant\n21:00: Mixology at L’Odyssée Sundeck*\nLive music at Le Piano Bar"},{"title":"Day 3: Paradise Elegance - Hanoi (B, L)","description":"07:00: Tai Chi at L’Odyssée Sundeck\n07:00 - 08:00: Light breakfast, coffee & pastries at Le Piano Bar\n08:00: Visit Ti Top Island (1 hour)\nStay on board to relax or enjoy a spa treatment at Paradise Spa\n09:00: Breakfast Buffet at Le Marin Restaurant\nPassing by Thien Cung and Dau Go Cave and the Fighting Cock Islet\nBill settlement and check out\n10:30: Return to Tuan Chau Marina\n10:45 - 12:00: Light snacks at Paradise Suites Hotel\n12:00 pm: Depart Halong Bay for Hanoi\n4:30 pm: Arrive Hanoi. Check in  Hotel. Stay overnight in Hanoi\n*payable"},{"title":"Day 4: Hanoi City Tour full day (Optional)","description":"Today you are free to discover Hanoi by yourself!\nOr spend full day with: Hanoi City Tour full Day. Lunch is included:\n8:00 am. We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). "},{"title":"Day 5: Trang An - Bai Dinh Pagoda full day (Optional)","description":"Today you are free to discover Hanoi by yourself!\nOr spend full day with: Trang An - Bai Dinh Pagoda Tour full Day. Lunch is included:\n8:00 - 8:30: Tour guide and car pick you up at your address to depart for Ninh Binh province (98 Kms).Start tour Trang An - Bai Dinh Pagoda.\n10:30 - 12:00: Arrive in Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters in height, 100 tons in weight.\n12:30: Have lunch in local restaurant with some local special dishes such as Goat meat with elderberry, pork \n14:30: Depart to visit Trang An tourist attraction, take boat trip to visit cave complex: Sang Cave, Toi Cave, Ba Giot Cave, Nau Ruou in mystery and wildness, see scenery of mountain and rivers. Trang An is considered as Ha Long on the land.\n16:00: Getting on the car for returning to Hanoi.\n16:30: Back to Hanoi at your address, Trang An - Bai Dinh Pagoda Tour ends."},{"title":"Day 6: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi & Halong Bay Trip. Good bye & see you again!"}]},{"name":"Northern Mountains of Vietnam 7 days 7 nights","duration":7,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":940,"summary":"Explore the spectacular landscapes of the northern mountainous region Sapa, Bac Ha, Ha Giang and Ba Be with the limestone formations and the Chay River Massif.  Observe the fascinating culture, customs and way of life of different ethnic minority groups living in Vietnam's far north.\n ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/180479_5e43c0517d227.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/180479_5e43c0517d227.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_0c1fb087.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_3bfc0cf7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_5e43c0517d230.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_890dd877.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_720a2dfd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_89fabaff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_12098fb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_8950afff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_5e43c0517d23d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_632aa3fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_5e43c0517d241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_0d933f19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_0e454367.jpg","https://cdn.tourradar.com/s3/tour/1500x800/180479_54d78353.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Nigh 1 Hanoi - Night Train To Lao Cai","description":"\nYou will be collected from your hotel in Hanoi at around 20:00 and taken to Hanoi Train Station where you will board the 21:15 overnight train to Lao Cai. You will be in a shared sleeping compartment (sharing with other passengers in 2 lower & 2 upper berths per compartment).\nNotes: The train schedule is subject to change. Private compartments are available on request and are subject to a surcharge. Cabins are shared with other local passengers (unless private cabin is requested and all berths paid for - with supplement). There are restrooms at either end of the carriages.\n\n"},{"title":"day 1: Sa Pa Trekking (B, L, D)","description":"You will arrive in Lao Cai at around 06:30, the border town to Yunnan, China. The journey starts with a 38 km drive on winding roads up the mountains to Sapa. After breakfast, you will drive from Sapa town down to Lao Chai Village. Soon after turning off the main road and taking a local path, we will arrive in the Black H’mong village of Lao Chai, where you will experience the daily life of the villagers. From here you will continue on foot Ta Van Village, where the Zay hill tribes live. Here you can take a rest and enjoy a delicious lunch prepared by your guide in a local house. After lunch, you will continue your trek through a bamboo forest and then relax at a waterfall. You will have time to explore the Red Dzao village of Giang Ta Chai and meet the local people before returning to Sapa for dinner and an overnight stay in a hotel.\n\nHighlights and activities: Sapa a 10 -12 km trek\nAccommodation: Sapa Horizon Hotel ***\nMeals: Breakfast, lunch, dinner\n"},{"title":"day 2: Sa Pa - Bac Ha (B, L, D)","description":"Starting from Sapa, you will first visit Bac Ha Town and Vua Meo' Palace “Cat King’ House”, the outlandish palace, built in 1921 by the French.\nNext, you can visit Can Cau Market on Saturday or Bac Ha Market on Sunday morning, both located in the mountains near the Chinese border. You will then proceed to Bac Ha for lunch. In the afternoon, you can enjoy an easy trek to Ban Pho Village and visit the old castle of the former H’mong King. Tonight you will have dinner and stay overnight in a homestay.\n\nHighlights and activities: Bac Ha a 5 -7 km trek\nAccommodation: Lap Xuan's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"day 3: Bac Ha - Hoang Su Phi - Ha Giang (B, L, D)","description":"\nYou will set off on a full-day journey through Sin Man and Hoang Su Phi. The cascading paddies of this remote land are some of the most dramatic in the whole of Vietnam. Then you will take the rough but scenic route through a dense jungle before crossing over a pass and descending to Sin Man. Along the way, we may encounter the Nung Ing, Tay, Red Dao, Dao Ao Dai, La Chi and Co Lao, just some of the many hill tribe groups who have settled in the area. You will continue the journey arriving in Ha Giang at 18:00. On arrival, you will visit a nearby Tay village, where you will have dinner and spend the night in a family owned stilt house.\n\nHighlights and activities: Hagiang, Hoang Su Phi a 5 -7 km trek\nAccommodation: Mr Doan's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"day 4: Ha Giang - Sa Phin - Dong Van (B, L, D)","description":"\nThe remote region of Dong Van Plateau Karst Geopark rock and Meo Vac is a land of rugged mountains and beautiful hill tribe villages which have remained unchanged for centuries. Today you will head north-west out of Ha Giang towards this northernmost tip of Vietnam. The first stop is a twin mountain range of Quan Ba and Heaven's Gate, then walking on until you reach the Green H’mong villages of Pho Cao and Pho Bang. The former H’mong royal house at Sa Phin is a primary attraction of the region, but the blend of the hill tribe people's colourful costumes and the majestic mountainous scenery make this long and sometimes bumpy trip an unforgettable experience.\n\nHighlights and activities: Hagiang, Dong Van, Lung Cu a 5 -7 km trek\nAccommodation: Hoa Cuong's Hotel.\nMeals: Breakfast, lunch, dinner"},{"title":"day 5: Dong Van - Meo Vac - Ba Be Lake (B, L, D)","description":"\nToday, the journey takes you through the rolling hills and the picturesque scenery to Ba Be National Park. We will visit Dong Van town before crossing a stunning mountain pass Ma Pi Leng to Meo Vac which is inhabited mostly by the Lo Lo and Pu Peo ethnic minority communities. They still retain their centuries old cultural traditions and are recognisably distinct from each other by their dress and traditions. Living conditions are very basic here. Roads are bumpy and zigzagging through the mountains, but the journey is more than rewarding. Meet the locals and learn more about the life and culture of the Hmong, Dao, Tay and Nung ethnic minorities who make for the main population in this region. Surely, your presence will attract the locals’ attention as this part of the country that still receives very few visitors. Depending on road and traffic conditions, you will arrive in Ba Be lake by late afternoon. You will have dinner and stay overnight in a Tay house.\n\nHighlights and activities: Hagiang, Ma Pi Leng pass. Ba Be National Park a 5 -7 km trek\nAccommodation: Mr Linh's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"day 6: Ba Be Lake (B, L, D)","description":"After breakfast with a local family, you will board our boat for a trip on Ba Be Lake. Cruising on Ba Be lake's green waters, you will visit the fishermen who work from their dug-out canoes. Passing Peleng corner, you will cruise further to Puong Cave, home to thousands of bats. We will continue to Cam Ha Village where you can observe the peaceful life of the Tay people amongst the green rice fields. You will have a lunch at a local restaurant near the Dau Dang Waterfall. Coming back to Ba Be lake you will visit An Ma Temple where Mac, commander in chief, is commemorated. You can trek through Ba Be rain forests and climb a tower to get the best photos of the Ba Be area. You will return to Coc Toc Village by for dinner and an overnight stay.\n\nHighlights and activities: Ba Be Lake, boat tour, a 3-5 km trek\nAccommodation: Mr Linh's Homestay\nMeals: Breakfast, lunch, dinner"},{"title":"day 7: Ba Be - Hanoi (B, L)","description":"\nAfter breakfast, you will take a stroll along the riverfront, visit Pac Ngoi Village where most Tay people still live in traditional houses. You will then hike to the upper reaches of the lake in an area marked by massive limestone cliffs and mountains. Later, you will visit Hua Ma Cave, this is a dry cave system which stretches 2000 meters underground. You will stop for lunch before you continue your journey back to Hanoi, arriving there at around 17:00.\n\nHighlights and activities: Ba Be National Park, Hua Ma cave, a 3-5 km trek\nAccommodation: No"}]},{"name":"Best Treasures of Hanoi - Halong Orchid Cruises - Bakhan Village Resort 7 Days","duration":7,"travelStyle":["Sailing","Family","Motor boat","Group","Partially Guided","Discovery","In-depth Cultural","Holiday"],"oldPrice":0,"price":787,"summary":"The best quality and unbeaten price for 7 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Orchid Cruises 5* Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort 4* - the best brand new Mountain resort in the Northwest of Vietnam\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/100257_aa00901b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/100257_aa00901b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_c5609e09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_e65ccf46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_44d25fa5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_d36a7ccc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_69d15698.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_57ef3a78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_3f629fe9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_7770ce62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_9bfb94a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_7685a755.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_ff6a20cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_0ad53145.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_1af23f0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_ddb82f85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_175e88b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_ab3dd155.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_763892f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_fdea2f03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_99f0e308.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_64d2362f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_17903c85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_20d2898b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/100257_6f321df7.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau"],"timeline":[{"title":"Day 1: Welcome to Hanoi, Vietnam","description":"After being greeted at the airport by our friendly representative our car will be waiting to whisk you directly to the hotel which is in the perfect location to explore Hanoi Old Town at your leisure. Check in and stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Orchid Cruises (B, L, D)","description":"\n10:00 am: You will be collected from Hanoi Old Quarter to take the highway to Dinh Vu Port, Hai Phong City where we arrive at around 11h30. A special tea and warm welcome awaits you at Orchid Cruise’s.\n12:00 pm: Transfer by tender to the Orchid Cruise. On the way to the main boat, you will have a chance to see Cai Trap canal.\n12: 15 pm: We welcome our guests onboard the Orchid Cruise and then take time to enjoy your welcome drink, receive cruise briefing, safety instructions and check in. Start cruising and explore Halong Bay - one of the New Seven Wonders of Nature.\n12: 40 pm: Orchid Cruise boat proceeds to Da Chong islet, where you can see a lighthouse built by the French over 100 years ago. We have lunch before continuing our journey via the islets of Con Vit and Gia Luan. These amazing limestone formations rise up out of the sea in an impressive manner. This area is untouched, as not many cruise ships use this route.\n3:00 pm: We progress to Ba Trai Dao beach area of Lan Ha Bay- a separate part of Halong Bay. This is a quiet paradise in Vietnam. The region is known for its pristine beaches and spectacular beauty, having about 400 fascinating islands. Unlike the main, Ha Long Bay, the islands of Lan Ha Bay are forested, and most are small in stature.\nYou may prefer to try your hand at kayaking or simply just enjoy a swim. \nReturning to Orchid Cruise you can watch the magnificent sunset over the Gulf of Tonkin. Onboard you may join a traditional cooking class. Our chef will instruct you in the making of some Vietnam dishes. In the early evening the boat has its Happy Hour deal.\n5:30 pm: Option: Massage service available. Please book with Cruise Manager directly (please see massage menu)\n7:30 pm: Deluxe dinner is served. Enjoy delicious local food prepared and served for you by our wonderful onboard catering staff. This is a delightful meal in an intimate romantic setting\n9:30 pm: Enjoy the landscape of the bay at night up on the top deck. Relax whilst enjoying drinks from the bar. Try your hand at night squid fishing, watching a movie in the restaurant. Overnight on board.\nOption: Massage service available. Please book with Cruise Manager directly (please see massage menu)"},{"title":"Day 3: Orchid Cruises - Hanoi (B, L)","description":"6:00 am: Why not rise early to witness the bay at its very best whilst enjoying a Tai Chi session on the sundeck; after which we serve light breakfast. After breakfast we shall continue our journey and head out in canoes to explore the bay in the area where the Sang Toi cave is situated.\n9:30 am: Return to Orchid Cruise for check-out \n10:00 am: Whilst cruising back you can enjoy a delightful brunch\n11:35 am: We return to the quay side in the south of the bay, where our visitors disembark\n12:10 pm: We bid farewell at Dinh Vu port, this is the end of the program.\n4:00 pm: Arrive Hanoi. Check in Hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi City Tour full day (B, L)","description":"We shall meet you at your hotel after breakfast for a full day exploring the depths of what Hanoi has to offer. In the morning you will be shown the mausoleum of the nation’s founder Ho Chi Minh (close on Monday & Friday), the Presidential Palace, the Ho Chi Minh’s house on stilts, the One Pillar Pagoda & the Temple of Literature.\nAfter lunch at local restaurant, visit the impressive Museum of Ethnology which focuses on the 54 officially recognized ethnic groups in Vietnam, the beautiful West Lake, the Tran Vu Pagoda, the peaceful lake of the Restored Sword (Hoan Kiem Lake) and the Ngoc Son temple. Take one hour rickshaw ride through the bustling old quarter streets of Hanoi & Enjoy a fantastic traditional water puppet show (unique to Vietnam). Stay overnight at the hotel.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 7: Hanoi Departure. (Breakfast included)","description":"You have the morning free to relax before transferring to the Airport by Private Car for your home flight. Finish your unforgettable Hanoi - Halong Bay & Bakhan Village Resort Trip. Good bye & see you again!"}]}]