[{"name":"Wandering Northern Vietnam Motorbike Tour to Ta Xua , Mu Cang Chai, Y Ty, Sapa","duration":7,"travelStyle":["Motorcycle Ride","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1010,"summary":"This 7-day Northern Vietnam Motorbike Tour to Ta Xua, Mu Cang Chai, Y Ty, Sapa, Bat Xat, Mai Chau, Bac Yen in Son La takes you to explore the best authentic northwest of Vietnam with rice terraces, dirt rides through jungles, high mountains & remote villages cum waterfalls and rivers … to meet the friendly locals and taste their great local foods …","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675a6549.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675a6549.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675bd5e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675c46c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675cad7f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675d15f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675d8e68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675df08c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675e7a51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017675f0233.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176760ee43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017676147e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176761b696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176762375b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176762af59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e01767630d95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017676375ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e0176763ee10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955b8a77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955c7d6e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955d0eab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189760_5e017955d7c21.jpg"],"destinations":["Hanoi","Mai Chau","Sapa"],"timeline":[{"title":"HANOI MOTORBIKE TOUR TO MAI CHAU VALLEY (HOA BINH)","description":"Start our motorbike tour by leaving Hanoi on dyke roads to avoid the heavy traffic around 9.am, we ride our motorcycles west to Mai Chau, an area of beautiful landscape and home to the Thai ethnic minority. We will motorcycle on Highway 6 passing extensive farming lands comprising a sea of paddy fields split by tree-lined roads punctuated by limestone karst scenery.\n\nAfter a light lunch in Hoa Binh Province, we cross Thung Khe, one of the most beautiful mountain passes in North Vietnam then descent to the mountain valley settlement of Mai Chau. After dinner we join performance, where you can dance and share a range of special liquors (rice wine) with the locals. Overnight in a house-on-stilts of the Thai people.\nSummary :"},{"title":"MAI CHAU MOTORCYCLE TOUR TO BAC YEN (SON LA)","description":"In the morning, we take a short walk around village to discover local life. Life in the countryside starts early so by sunrise there is a wealth of activity. The Thai women are masterful weavers who ensure that there is plenty of traditional-style clothing to buy in the village centre.\n\nYou will see women weaving on looms under or inside their houses in the village We can buy some handmade traditional-style clothing, knife or cross-bow. After breakfast in home-stay, we say goodbye to villagers and leave Mai Chau around 10 am. We ride from Mai Chau to the direction of Moc Chau, where we have lunch. This highland town produces some of Vietnam’s best tea and is a good place to stock up.\n\nThe surrounding area is also home to several ethnic minorities, including Green H’mong, Dzao, Thai and Muong. Moc Chau boasts a pioneering dairy industry that started in the late 1970s with Australian (and, later, UN) assistance. The dairy provides Hanoi with such delectable iuxur us as fresh milk, sweetened condensed milk and little tooth-rotting bars called “Banh sua”.\n\nAfter lunch, we turn to the less travelled Road 43 leading to the Da River, crossing the reservoir of Da river at Van Yen ferry, then ride on a beautiful winding secondary road until Bac Yen where we stay in a basic guest-house.\n\nSummary:"},{"title":"BAC YEN MOTORCYCLE TOUR UPTO TA XUA PEAK – MU CANG CHAI (YEN BAI)","description":"In this morning, after having breakfast you’ll be jumping up the iron horse again to get over zigzag & curving spiral roads with wild beautiful flowers such as Do Queen & Tao Men to reach Ta Xua peak which is located at the height of 2.600m above the sea level. We then will ride on the narrow backbone of dinosaur to view cloud flying beneath our feet.\n\nIn the morning, we keep motorbiking across Lung Lo pass before head up on Road 32 . During the First Indochina War, the 15km-long Lung Lo Pass, used by the Vietnamese resistance force to transport weapons, goods and food during the Dien Bien Phu campaign of 1954, was heavily bombed by the French in order to sever the front lines from the rear.\nLung Lo Pass, situated in the northern province of Yen Bai, was also recognized as a national heritage by the ministry. After lunch, we ride through the Mu Cang Chai massif, almost as high as the Fansipan. From the top, it offers one of the most beautiful views of North Vietnam. The ride is challenging but very rewarding.\nOvernight in a hotel.\n\nSummary:"},{"title":"MU CANG CHAI MOTORBIKE TOUR VIA THAN UYEN TO Y TY","description":"In this morning, We’ll keep motorbiking straight toward the main Fansipan Mountain range via Than Uyen town of Lai Chau. There is also the option for a very challenging back route which takes us through several river crossings. The massive mountain range dominates the road until finally we must make a splendid climb up from Binh Lu and up to the top of the highest road pass in Vietnam (Tram Ton Pass).\n\nY Ty, one of the poorest communes in Lao Cai Province’s Bat Xat District, has become an attractive tourism destination in recent years due to its natural beauty. Y Ty is still a strange name to many Vietnamese people. Nestled against 2,700m Nhi Cu San mountain, the commune rarely sees the sun and is often covered by dense white clouds. This lovely land is a must-see destination for photographers and nature lovers who dont want to be in the crowd of Sapa.\nTerraced fields beautifully make up the place in which tourists themselves can witness the transplanting of seedlings called “pouring water season” every May and seeing the whole area turn to green after. The sight is so astonishing that it has become a favorite shooting destination for both amateur and professional photographers.\n\nY Ty has become famous for its unique terraced fields made by the ethnic minority group Ha Nhi. The fields have varying terrain, but the Ha Nhi people manage to make wide and beautiful fields that amazingly fit the valley curves and high mountain slopes.\n\nAnother special feature of Y Ty is its earthen houses whose architectural design is simple yet one-of-a-kind. It is mushroom-shaped especially when viewed from atop. There is only one door and a small arched window but enough to keep warm in the winter and cool in the summer. Though the design is basic, it takes one month to build an earthen house.\n\nOvernight at Y Ty homestay"},{"title":"Y TY MOTORBIKE TOUR TO SAPA (LAO CAI)","description":"WE keep riding from Y Ty to Sapa via Lung Po and Muong Hum Crossing into Lao Cai Province at over 2,000m the views looks out over the main range for miles and miles, before we descend to the mountainous Sa Pa valley. Sa Pa is located in Lao Cai Province, north-west Vietnam, and 350 km north-west of Hanoi, close to the border with China. Sapa is famous both for its fine, rugged scenery and for its rich cultural diversity.\nFrench used to consider Sapa as Summer Capital of Northern Vietnam in the early decades of the 20th century. Its naturally gifted beauty keeps attracting more and more people to spend their vacation there since then. Particularly, the place is the foremost choice for honeymoon couples!\nOvernight in Hotel.\nSummary:"},{"title":"SAPA MOTORCYCLE TOUR TO THAC BA RESERVOIR – VU LINH VILLAGE (YEN BAI)","description":"Take our motorbikes down from Sapa to Lao Cai City and then have a coffee-stop on the bank of Nam Thi river, which is Vietnam – China border. Enjoy your coffee while taking the view to China.\n\nHead to Road 70 before turning via Luc Yen on Road 152 with palm forests and lots of high mountains, deep valleys to Vu Linh village of Dzao ethnic minority located on the side of Thac Ba reservoir which is the biggest man-made lake in Vietnam. This artificial lake has an area of 23,400 ha and 1,331 islands and hills with diverse ecological environments.\n\nThe water in the lake is blue and clear, and imprinted with the reflections of the surrounding ancient forest. The thousands of hills and islands feature caves such as the Hum, Cau Cuoi and Bach Xa. After lunch, we take the boat ride, stop by an island for swimming and discover the particularities of this area: the way villagers paddle their boats, the exotic and odd animals living around, the quiet and peaceful beauty of this huge lake, the lifestyle of the Dao among the thousands of islets.\n\nWe will have an unforgettable dinner with the hosts, whose are really big drinkers and they party every day. The welcome is exceptional and we hope you will survive.\nSummary:"},{"title":"VU LINH VILLAGE (THAC BA LAKE) MOTORCYCLE TOUR TO HANOI","description":"After breakfast we ride southeast on Highway 2 and then branch off to the sleepy town of Phu Tho. We follow the edge of the Red River along the dyke, almost to the point where it merges with the Black River after which they flow together to Hanoi.\n\nBy now we are very much in the lowlands of the delta plains and the north’s main agricultural areas. Harvest time here is a sea of activity. Crossing the Black River by bridge, we pass through Son Tay and then return to Hanoi on the highway. We should be back to Hanoi before rush-hour (4 pm) because traffic’s getting busier and busier.\nSummary:"}]},{"name":"North to South Vietnam - 10 Days","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Discovery","Holiday"],"oldPrice":799,"price":607,"summary":"\n\tGo Asia Travel is proud to offer you the best of the best deal to discover my beautiful country. Vietnam tour 10 days 9 nights from North to South (with 3 Star, 4 Star, 5 Star option) included flight and train tickets. Destination covers Hanoi, Halong bay, Da Nang, Hoi An, Ho Chi Minh city, Mekong delta, Cu Chi Tunnel. All of hotel we select is top ranking on Tripadvisor and guarantee satisfaction ! Let’s book and enjoy your holiday !\n\n\tPick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\n","highlights":["Discover hidden treasures at the Cai Be Floating Market","Learn of Vietnam's dramatic history in Cu Chi Tunnels","Weave between limestone formations on Ha Long Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/80344_334bd603.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/80344_334bd603.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_a6f44b47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_f6c44257.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_9f56883a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_330908b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_c5269842.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_6cfd5eb3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_a35c09e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_05a795bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_46dfc666.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_a2fa7c66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_6fc3a36b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_33859050.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_1ed14def.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_febcaed7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_c0116143.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_8d7dce75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_27e78eaa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_d3f7f213.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_ffce8ea4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_34475bbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_8b668763.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80344_072273fc.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Vinh Long","Ho Chi Minh City"],"timeline":[{"title":"Day 1 Hanoi - airport pick up - Check in hotel in Hanoi (Meals: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nNote: Check in time is 13:00 P.M"},{"title":"Day 2 Hanoi - Halong Bay - Overnight on Cruises (Meals: B, L, D )","description":"08.00 – 08.30: Pick-up at hotel and start 3 and ½ hour drive to Halong Bay. \n12.30 – 13.00: Embark on cruise and followed by a short cruise briefing.\n13.30 – 14.30: Savor a delectable lunch as V’Spirit Classic cruises among the limestone islands.\n15.00 – 16.00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16.00 – 17.00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17.00 – 17.30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17.30 – 19.00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19.00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board."},{"title":"Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meals: B, L )","description":"06.30 – 07.15: Start your day with Tai Chi exercises or a photo hunt.\n07.30 – 08.30: Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n09.00 – 10.00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10.15: Return to the boat. Freshen up and check out of your cabin.\n10.15 – 11.00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11.00 – 12.15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12.15 – 12.30: Disembark \n12.30 – 13.00: Transfer back to Hanoi.\n16.30 - 17.00: Arrive Hanoi City\nNote: Itinerary can be changed upon the weather condition\nAbove is itinerary of 3 star cruise, itineraries of 4 or 5 star cruises will be different"},{"title":"Day 4 Hanoi Free day – Train station transfer- Night train to Da Nang (Meals: B )","description":"Today, you are free to visit Hanoi Old Quarter, see the water puppet show until transfer to Hanoi Train Station for solf sleeper train to Da nang. Time you need to spend on the train is around 14 hours. On the train you can view our beautiful country along the coastal line. You also stay overnight on the train and reach Danang train station the next day."},{"title":"Day 5 Da Nang pick up - Check in hotel in Hoi An town (Meals: No)","description":"Train arrive on the next day. We will pick up and transfer to Hoi An Ancient town. Check in hotel and you are free on your own."},{"title":"Day 6 Hoi An - My Son day tour (Meal: B,L)","description":"7:30 – 8:00 AM: The bus and tour guide pick you up at your hotel \n8:30 : Leaving Hoi An for My Son HolyLand.\n9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide.\n12.00: Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!.\n "},{"title":"Day 7 Hoi An - Airport transfer - Flight to HCMC- Pick up- check in Hotel (Meals: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City."},{"title":"Day 8 HCMC - Mekong delta - Cai Be Floating Market - Vinh Long tour (Meals: B, L )","description":"7.30 - 08:00 AM Picking up from hotel/stay.\n08:15 Starting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30 Start the motorized boat to visit the Cai Be Floating market, experience how people exchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn.\nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature.\nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30 Arrive in your hotel."},{"title":"Day 9 HCMC - Cu Chi tunnel tour (Meals: B, L )","description":"08:30 -9.00 AM: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffaloes swimming in the rivers alongside the road. Visitors will find it hard to imagine the destruction, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\n12:00 Have lunch in a local restaurant\n13:00 Back to Ho Chi Minh City\n14:00 Arrive in your hotel in Ho Chi Minh City."},{"title":"Day 10 HCMC - Airport transfer - end the trip (Meals: B )","description":"This day you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends.\nNote: Tour starts everyday, that means \"always available\". you only need to ask for availability if your travel date is 1 month before your booking date."}]},{"name":"Explore Vietnam National Geographic Journeys","duration":13,"travelStyle":["In-depth Cultural","Group","Fully Guided"],"oldPrice":0,"price":2049,"summary":"Immerse yourself in Vietnam’s mesmerizing culture and momentous history on a journey from the emerald mountains of the north to the sun-drenched beaches of the south. Discover a plethora of UNESCO World Heritage sites, including the imperial city of Hue and mystical Ha Long Bay. Glimpse rural life on a hike through idyllic Mai Chau Valley; enjoy a cyclo ride through the heart of bustling Hanoi; and descend into the famed Cu Chi tunnels, where Viet Cong guerillas lived during the Vietnam War.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/85751_b24b44f4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/85751_b24b44f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_5edcd3ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_04ab3a5c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_28fdbc1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_a2473579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_71ca98cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_4d32a21b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_72366049.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_2cb490e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/85751_9a611952.jpg"],"destinations":["Hanoi","Mai Chau","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrive at any time. Arrival transfer is included.\n\nAccommodation:\n- Golden Silk Boutique Hotel (or similar).\n\nTransport:\n- Arrival Airport Transfer\n\nIncluded Activities:\n- Arrival Day and Welcome Meeting\n\n\n"},{"title":"Day 2: HANOI/MAI CHAU VALLEY (1B)","description":"Travel to the verdant Mai Chau Valley, a patchwork of rice paddies, emerald hills, and charming traditional villages. Opt to take a kayak out on the scenic Hoa Binh reservoir, the largest reservoir in Vietnam, or pedal through the countryside on a bike, enjoying the lush scenery and getting a glimpse of local life.\n\nAccommodation:\n- Mai Chau Hideaway Lake Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle: Hanoi to Mai Châu 03:00 - 04:00 Hr(s)\n\n\n"},{"title":"Day 3: MAI CHAU VALLEY (1B)","description":"Spend the day exploring the picturesque valley. Set out on a walk through the peaceful countryside, learning about the local tribes and customs, and visit a rural market for a fruit tasting. Choose to enjoy an authentic country lunch at a village home.\n\nAccommodation:\n- Mai Chau Hideaway Lake Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Village Walking Tour\n\n\n"},{"title":"Day 4: MAI CHAU VALLEY/HANOI (1B)","description":"Return to Hanoi and discover the bustling Vietnamese capital on a guided tour. Visit the mausoleum of Ho Chi Minh, one of Vietnam’s most influential political leaders, and learn more about his life at the Presidential Palace, a French colonial-style building that was designed to be his official residence. Gain insights into the Vietnam War at the Hoa Lo Prison, known by American POWs as the Hanoi Hilton; then jump on a cyclo, a three-wheel bicycle taxi, for a fun-filled ride through Hanoi’s colourful Old Quarter.\n\nAccommodation:\n- Golden Silk Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle: Mai Châu to Hanoi 03:00 - 04:00 Hr(s)\n\nIncluded Activities:\n- Ho Chi Minh Mausoleum and Museum Visit\n- Hoa Lo Prison (Hanoi Hilton) Guided Tour\n- Hanoi Cyclo Tour\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\nAdditional Notes: Ho Chi Minh Mausoleum is open until 11:00am and closed on Monday and Friday. Entry is dependent on what time the group arrives in Hanoi.\n\n"},{"title":"Day 5: HANOI/HA LONG BAY (1B, 1L, 1D)","description":"This traditional wooden sailing boat offers a unique way of navigating the lime karsts of Ha Long Bay with all the comforts of a motorized, floating hotel. The boat crew will prepare an included seafood lunch and dinner. All cabins are twin share and have an en-suite bathroom. The boat features an enclosed dining and sitting area and of course plenty of outside deck space to enjoy your beautiful surroundings.\n\nAccommodation:\n- Halong Boat (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Private Vehicle: Hanoi to Ha Long 04:00 Hr(s)\n\nIncluded Activities:\n- Breakfast at Hoa Sua\n- Ha Long Bay Overnight Junk boat Cruise\n\nAdditional Notes: On rare occasion Halong Bay is closed to tourist vessels by the government authorities due to extreme weather conditions. Should this occur, an alternate activity will be provided.\n\n"},{"title":"Day 6: HA LONG BAY/HUE (1B, 1L)","description":"Enjoy an early lunch on board before returning to land and heading back to Hanoi to catch a short flight to Hue. A former imperial capital of Vietnam, this World Heritage-listed city boasts many architectural treasures; it was also the site of one of the Vietnam War’s most dramatic battles.\n\nAccommodation:\n- Moonlight Hotel Hue (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Shared Van 04:00 Hr(s)\n- Plane 01:00 Hr(s)\n\n\n"},{"title":"Day 7: HUE (1B, 1L)","description":"Hue is the gateway to the treasures of Vietnam's royal past and remains one of Vietnam's major tourist attractions. This quiet city is widely known for the magnificent architecture of its citadel, royal tombs, pagodas, and temples built under the Nguyen dynasty on the lush banks of the Perfume River.\n\nOpt to explore Hue like the locals on a motorbike taxi, visiting local shops and a convent for lunch. Pre-book the \"Hue Motorbike Tour\" on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- Moonlight Hotel Hue (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Private Vehicle: Huế\n\nIncluded Activities:\n- Imperial Citadel Tour\n- Emperor's Tomb Guided Tour\n- Lunch at a Buddhist Nunnery\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 8: HUE/HOI AN (1B)","description":"The journey to Hoi An, via the Hai Van Pass, is an incredibly scenic and mountainous stretch of highway with spectacular views of Lang Co Beach.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\nIncluded Activities:\n- Hoi An Walking Tour\n- Traditional Lantern Making Experience\n\n\n"},{"title":"Day 9: Hoi An (1B, 1L)","description":"Delve into a local market this morning with guides from Oodles of Noodles, a G Adventures–supported program that trains local youth in the culinary arts. Taste dozens of varieties of noodles and pick out fresh ingredients at the market; then take your groceries to the Oodles of Noodles training kitchen, where you’ll learn to prepare mouthwatering noodle dishes and enjoy your creations for lunch.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Local Market Excursion\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 10: Hoi An (1B)","description":"The day is yours to explore enchanting Hoi An and its environs. Choose to take a day trip to World Heritage-listed My Son, a cluster of moss-covered Hindu temples dating between the 4th and 13th centuries. Alternatively, head to the nearby Cua Dai beach, or relax at your hotel by the pool.\n\nAccommodation:\n- Thanh Binh Riverside Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\n\n"},{"title":"Day 11: Hoi An/Ho Chi Minh City (1B)","description":"Fly to Ho Chi Minh City, formerly known as Saigon. Immerse yourself in this vibrant metropolis—Vietnam’s economic hub—on a variety of optional activities. Discover the city on a cyclo tour, taking in iconic sites like the Notre Dame Cathedral and the ornate Central Post Office and City Hall. Visit the War Remnants Museum, a powerful reminder of the atrocities committed during the Vietnam War; or take a tour of the Reunification Palace, the site which marked the end of the war.\n\nAccommodation:\n- Hotel Continental Saigon (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Plane 00:45 Hr(s)\n\n\n"},{"title":"Day 12: Ho Chi Minh City (1B, 1D)","description":"Venture to the legendary Cu Chi tunnels, a network of underground passageways that provided a base for Viet Cong soldiers during the Vietnam War. Visit subterranean hospitals and ammunition stores, and learn about the vital role that the tunnels played in the eventual victory of the North.\n\nAccommodation:\n- Hotel Continental Saigon (or similar).\n\nMeals Included:\n- Breakfast\n- Dinner\n\nTransport:\n- Private Vehicle: Ho Chi Minh City to Củ Chi 01:00 - 01:30 Hr(s)\n\nIncluded Activities:\n- Cu Chi Tunnels Guided Tour\n\n\n"},{"title":"Day 13: Ho Chi Minh City (1B)","description":"Depart at any time.\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Departure Day\n\n\n"}]},{"name":"Essence 10 Days in Vietnam from North, Central down South","duration":10,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":658,"summary":"From North down to Central and South, you'll get several lovely memories. Not only easy exploring Vietnam through stunning and famous destination, but also you can see how the local people, culture, architecture and costume are in North, Central and South. Plenty delicious local foods each city you are travelling in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/115917_ff90330a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/115917_ff90330a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_e6eac14d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_75b38c8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_30606058.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_500e5a28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_5ee940b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_e488f99c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_248aae80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_84038b04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_d6fdaf5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_7ecc235d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_1fa646b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_459dd4bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_aad7c730.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_580d7d32.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_6540cfdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_9cc6108e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_d1ae9a7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_8b63beba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_534c59cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_79918a00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_e477344a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_eabd4ae5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/115917_e6a1fb44.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Welcome to Hanoi – Airport pick-up - Hotel check-in (Meal:No)","description":"You will be welcomed at Noi Bai airport by our driver and transfer you to the hotel in Hanoi city.\nEnjoy Welcome Drink at hotel and check in the hotel. \nFree time to visit the most interesting place in Hanoi city – Hanoi old quarter. With the ancient architecture, house and local lives, you can see and find out much strange things while slowly walking around. Tasting the local delicious street foods, traditional Vietnamese rice noodle, old house and ancient temples, friendly people…all will bring you the best.\nOvernight at hotel in Hanoi.\nNote: Hotel check-in time: 13:00"},{"title":"Day 2: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n08:00-08:30: After Breakfast at hotel, tour guide meets you and depart for Halong Bay trip. Arrive Halong harbor and get on the cruise. Check in the cabin before enjoy the delicious Vietnamese Lunch on cruise while cruising among the mountains in Halong Bay with stunning landscape. Visiting Sung Sot cave or Surprising cave-the biggest and most beautiful cave in Halong Bay. Stop at Titop island to hiking up to the top for awesome Halong Bay view point. Swimming on pure water on Titop beach. Feeling the peaceful Sunset in the by with fruit and local wine before Dinner be served. \nOvernight on cruise."},{"title":"Day 3: Halong Bay – Kayaking – Hanoi (Meal:B,L)","description":"You should wake up early to enjoy the Sunrise and pure air in the morning. Exploring how beautiful Halong Bay is by Kayaking time by your own. Learning how to make Vietnamese spring roll with Chef on cruise in Cooking Demonstration. Lunch will be served while cruising back to the harbor.\n12:30: Get on the bus to come back Hanoi city.\n17:00: Get off the bus at the hotel in Hanoi. \nOvernight at hotel in Hanoi."},{"title":"Day 4: Hanoi Free Day – Overnight train to Da Nang (Meal:B,L)","description":"Exploring Hanoi old quarter - the most intersting place for tourist. Walking in the old quarter to see Hanoian daily life. You also find out the norrow houses where there are some families sharing the same house. Small and narrow entrance on street what is the entrance of some houses inside. \nTasting several street food, viewign the old houses, and a lot of thing what will make you interesting.\nLate afternoon, driver will pick you up at your hotel and transfer you to Hanoi Trin station for Night train to Da Nang.\nOvernight on the train."},{"title":"Day 5: Da Nang arrival – Transfer to Hoi An (Meal:No)","description":"Welcome to Da Nang city! On the way to Da Nang city, you will see and take photo of giant Hai Van pass from the train. All the stunning and breathtaking landscape will appear. The beautiful sea view on one side and gorgeous hill on the other side. This sightseeing might not come to you second time in the life.\nDriver is waiting for and transfer your from Da Nang train station to Hoi An. Check in the hotel in Hoi An and spend each nice minute to explore the beauty of Hoi An old town where was a famous and rich town in the pass. Walking around the town and tailor a costume at any shop in the town. \nOvernight at hotel in Hoi An."},{"title":"Day 6: Hoi An – My Son Sanctuary Full Day (Meal:B,L)","description":"7:30 – 8:0: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide. \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon river. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip! \n\nOvernight at hotel in Hoi An\n"},{"title":"Day 7: Hoi An Free & Easy (Meal: B)","description":"Hoi An old town is a peaceful atmosphere appearing while walking on the small and old street in the town. The ancient Japanese, Chinese and Vietnamese architecture impressive you. Loca and simple people, daily life will offer you an unforgettable memory.\nYou can make the costum made-tailor where is most famous to make the clothes in Vietnam. Tasting the local foods on river side and viewing the local daily life.\nOvernight at hotel in Hoi An."},{"title":"Day 8: Hoi An free – Da Nang airport – Flight to Ho Chi Minh city (Meal:B)","description":"Today, you can spend the leisurely walking time in the old town to take photo, buying some good clothes before goinf to Da Nang airport. Driver will transfer you to the airport for the flight to Ho Chi Minh city.\nWelcome to Ho Chi Minh city. Our driver will pick you up at Tan Son Nhat airport and transfer you to the hotel in Ho Chi Minh city. \n\nOvernight at hotel in Ho Chi Minh city\n"},{"title":"Day 9: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in Ho Chi Minh city"},{"title":"Day 10: Ho Chi Minh Departure (Meal:B)","description":"To day you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. \nHo Chi Minh city is the biggest city in Vietnam where you can see the mixed culture, taste and life style among the people in North, Central and South. Several local tasty food from Hanoi, Da Nang, Hue, Hoi An and from local Ho Chi Minh, you’ll feeling the different food’s taste from Three Lands in Vietnam.\nDriver transfers you to the airport and end the trip.\nNote: \n- If you are Solo traveller, you will stay at the Share Dorm Room at the hostel during your vacation.\n- This is group joining, there is a different group each trip during your vacation.\nWho should participate? - This tour is suited for all, including children as well. \nPrice structure: - Price quoted is based on per person basis.  \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! "}]}]