[{"name":"Viet Nam 5 Days Super Save Package","duration":5,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":290,"price":261,"summary":"Start in Ha Noi and end in Ho Chi Minh city! With 5 days tour package taking you from Ha Noi to Ho Chi Minh City and through Ho Chi Minh City, Vietnam and 3 other destinations in Vietnam. Vietnam 5 days package tour is a small group tour that includes accommodation in a hotel as well as meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/135230_fac7b2f1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/135230_fac7b2f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_74e73472.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_e6885b0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_61a6460a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_0be34c03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_ea060661.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_b1f9054b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_67a4e37d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_ddef3f2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135230_e530af42.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Mekong Delta","Ben Tre"],"timeline":[{"title":"Day 1: Ha Noi arrive (No meal)","description":"Hanoi welcome: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited. You will be warmly welcomed by our tour guide at the airport and transferred to your hotel in the city center of Hanoi. \nFree time and easy.\nOvernight in Ha Noi"},{"title":"Day 2: Ha Noi- Ha Long Bay, overnight on cruise (meals incl: B/ L/ D)","description":"08:00 08:30 Pick up at your hotel. Enjoy the interesting scenery on the 3.5 hours-way drive to Halong Bay. 12:30 pm: Embark the cruise for check-in and have lunch. Enjoy the buffet lunch onboard while the cruise sails passing by magnificent sceneries of the World Heritage Site. Explore Sung Sot Cave Hiking up and down 600 steps to the magnificent limestone formations of the biggest and most marvelous cave in Halong Bay.Then, back to the vessel and continue sailing. Enjoy your relaxing time aboard, among the magnificence of the UNESCO World Heritage Site. A wide range of fine wines or spirits are served in the open-air bar on the sundeck. Participate in cooking class under the attentive instruction of our top chef, to discover the Vietnamese cuisine of traditional spring rolls. Time for dinner and evening entertainments: bar, spa, squid fishing and overnight on the cruise. \nStay overnight on Halong Bay Cruise"},{"title":"Day 3: Ha Long Bay- Ha Noi- Ho Chi Minh (meals incl: B/ L)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi\n17:00 Arrive Ha Noi, the driver takes you to the airport for your flight to Ho Chi Minh\nArrive Ho Chi Minh, check in hotel and free time.\nOvernight in Ho Chi Minh\n"},{"title":"Day 4: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"Ben Tre is the best option for a day trip to the Mekong Delta from Saigon, since it is only around 2 hours away, and 15 minutes from My Tho. However, this wonderful destination retains an authenticity which has been somewhat lessened in nearby My Tho.\n\nThis picturesque and friendly Mekong Delta town has historically seen very few travelers, but the recent opening of a bridge connecting Ben Tre and My Tho has made it far easier for day trippers to visit from Saigon.\n\nOur one day cruise excursion starts at 8:00 am from the lobby of your hotel in Saigon with a drive to Ben Tre. While there, you can take a walk along the waterfront, lined with French era shops and houses, and you'll see plenty of coconuts being unloaded from boats for dispatch around the country. Then, jump on a boat for a couple of hours of cruising on the Mekong River. You will enjoy your delicious lunch at a local restaurant or on board. The excursion will end at around 4:00pm where the vehicle will await you for your transfer back to Saigon.\nOvernight in Ho Chi Minh\n"},{"title":"Day 5: Ho Chi Minh city a half of day- departure (meals incl: B)","description":"For those you dot not have a lot of time in Ho chi minh city, This trip give you a quick look on the major sites of tourists spots in the city including the Reunification Palace, the Notre Dame Cathedral, the Old Central Post Office and the War Remnants Museum.\n\nFinish tour, come back hotel and the driver take you to the airport for your flight.\n\nEnd of services!"}]},{"name":"Sapa Bac Ha Sunday Market 2Days/3Nights","duration":3,"travelStyle":["Adventure","Private","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":285,"summary":"Discover the nicest highland place in the North of VietnamVisit ethnic minorities group in Sapa such as Dzay People, H`mong Peple, Red Dao People…….Take part in the most typical Sunday Market of ethnic minorities group in Bac Ha Town.Private Cabin on the night trainStay at the best 4* Chau Long Hotel in Sapa Town.All taxes and services chareNo hidden cost.Best services guaranteed","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95521_4a97a273.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95521_4a97a273.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_21cd0a8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_df452425.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_63e45c09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_e3ba3f64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_89a99fe6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_cd31155c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_1e50d6b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_7b6b084b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95521_7971d72f.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Friday: Hanoi – Overnight on the train.","description":"7:30pm. Leave Hanoi for Sapa by night train. Tour Guide & Car pick you up from hotel in Hanoi then transfer to Hanoi Railway Station. Take night train to Lao Cai. Overnight on the train. Livitrans Train or similar. Private Deluxe Cabin 4 Berth sharing!\nLivitrans Express Train or similar"},{"title":"Day 2: Saturday: Ta Van- Giang Ta Chai- Sapa hotel (Breakfast, Lunch included)","description":"Arrive Lao Cai Railway Station. Pick up to Sapa town for check in. Having breakfast and start trekking down to Lao Chai village to visit the Black H’mong. Have a picnic lunch on the way then keep going along the valley to get to Ta Van village to visit the Dzay people live, which supposed to be the most friendly one in mountainous area. The next is Giang Ta Chai village of Red Dzao tribe where you will see the amazing scenery and beautiful waterfall. In the afternoon, you get back Sapa Town for free to discover Sapa Market & stay overnight in Hotel or you can keep staying Giang Ta Chai Village. Overnight in Sapa Town.\nBamboo Sapa Hotel 3* or similar"},{"title":"Day 3: Sunday: Sapa - Bac Ha Sunday Market - Night train to Hanoi (Breakfast, Lunch included)","description":"After breakfast in Sapa, you leave Sapa Town for Bac Ha Town to join Sunday Market with local people. Bac Ha is considered one of the most wonderful and colourful markets in extreme north Vietnam where thousands of local people in their traditional attire buy and sell the local products. Dogs, cats, pigs, horses… are all on sales. This is a golden opportunity to take your best photos! In the afternoon, we will take a pleasant walk to Ban Pho village, home to the flower H’mong people. This is a great opportunity to interact with the friendly locals and have pleasant walk amongst tribal villages. Leave Bac Ha Town at 3:00pm for Lao Cai Railway Station. Take night train, which departs about 7.30pm. Overnight on the train. Livitrans Train or similar. Private Deluxe Cabin for 4 Persons only!\nArrive Hanoi at 5:00am of Monday. Finish the unforgettable trip at Hanoi Railway station or extend the trip to Halong Bay Cruise or other places!"}]},{"name":"Seven Days Discover Real Charm North Vietnam","duration":7,"travelStyle":["Discovery","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":399,"summary":" Seven Days Discover Real Charm North Vietnam package bring you the best experience to explore North Vietnam. Accommodation of hotel in Hanoi Old Quarter – most interesting conner in Hanoi city, Bamboo rrowing boat in “ Halong Bay on Land”, Cycling to local village to see the local daily lives in the countryside; discovering the beauty of Halong Bay with one night on cruise; trekking through the terrace rice fields in Sapa to find out the real minority people. No better way to understand about Vietnam by this. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/113965_06eb5a00.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/113965_06eb5a00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_b88033e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_f243ed1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_5e51d67f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_bf67e955.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_5b12de9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_f07c178d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_b281fc74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_3badcfa9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_56df4013.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_205d7cdc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_3dfa617d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_e6ddad42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_6f0c936e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_7a01ab64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_ba73f5cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_2fb9ef4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_a0f22818.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_3b8b4ea0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_fde975c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_feeccad7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_c4b68ae4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_a941d0de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113965_35659d9f.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Hanoi arrival – Airport pick up – Check in hotel ( Meals: No )","description":" \nFollowing your flight’s information, our driver would like to pick you up at Noi Bai airport and transfer you to the hotel in Hanoi Old Quarter – the most interesting place in the capital of Vietnam.\nWelcome drink at hotel and check in the room.\nYou have free time to visit Hanoi city by your own.\nCheck-in time at hotel: 14:00\nOvernight at hotel in Hanoi"},{"title":"Day 2: Hanoi - Ninh Binh – Hoa Lu ancient capital – Tam Coc – “ Halong bay on land “ – Cycling time 1 Day ( Meals: B, Buffet Lunch )","description":" \n8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2  Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful  and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi"},{"title":"Day 3: Hanoi – Halong Bay – Overnight on Cruise ( Meals: B, L, D )","description":"08:00 – 08:30: Tour guide and driver will pick you up at your hotel/stay in Hanoi Old Quarter and heading to Halong bay.\nShort breaktime on the half way to relax, stretch your legs.\n12:30: Arrive Halong tourist harbour. Boarding the cruise and check in the cabin.\nWhile cruising to the centre of Halong bay, the Lunch will be served.\nAlong the route through stunning seascape, you can see the most beautiful sighseeing of the bay with thousand of limstone islands.\n15:00: Visiting Surprising cave – the biggest and most beautiful cave in Halong bay. Take the time to leisurely walikng through the grotte and you have the chance to take a lot of nice photo in the cave.\nAfter the time to explore the beauty of Surprising cave, small tender will take you to Titop island – where you can fall down in love with natural beach, hiking up to the top with over 400 steps. From the top, you can view the whole bay and hunt so many nice views.\n17:00: Get back to the cruise. Enjoy the Sunset Party with fresh fruit and Vietnamese red wine. This time is a lovely chance to cheer with each other and enjoy the Sunset in the bay.\n19:00: Dinner will be served.\nEnjoy the quite and fresh evening on the cruise with Squid fishing game, or play the card, Karaoke among the mountains.\nOvernight on cruise"},{"title":"Day 4: Halong bay – Kayaking - Hanoi","description":"You can wake up ealry to enjoy the pure air in the bay and start a new day.\n7:00: Breakfast will be served with Tea & Coffee.\n8:00: Discovering the small corner of the bay by Kayaking time. You kayak by your own to see the other view of Halong bay from your Kayak.\n9:00: Get back to the cruise to relax and check out the cabin. Start cruising back to Halong harbour with diferent route from first day. You will see more and more stunning seascape.\n10:00: Chef on cruise would like to share with you how to make one of most delicious traditional food of Vietnam with Cooking Demonstration. You have the chance to make the Spring Roll by yourself.\n10:30: Enjoy the Brunch while crusing through the bay\n12:00: Saying goodbye with crews on boat and get back to the harbour\n12:30: Driver will pick you up and transfer you back to your hotel/stay in Hanoi city.\nShort breaktime on the half way before reach Hanoi city\n17:00: Arrive your hotel in Hanoi.\nOvernight at hotel in Hanoi"},{"title":"Day 5: Hanoi – Sapa – Ylinh Ho – Lao Chai – Ta Van village ( Meals: B, L, D )","description":" \n12km trekking through the terrace fields to homestay.\n06:30 – 07:00: Shuttle bus and tour guide will pick you up at your hotel and transfer you to sleeper bus.\nOur our guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance  trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepaire the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house."},{"title":"Day 6: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":"6km trekking through the local village and terrace fields.\nYou can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tel your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields.\nGet back to Sapa town by shuttle bus.\nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:30: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi. Shuttle bus will transfer you back to your hotel/stay in Hanoi Old Quarter.\nOvernight at hotel in Hanoi"},{"title":"Day 7: Hanoi free time – Airport transfer – Flight out ( Meals: B )","description":"Today, you have free day to explore Hanoi city by your own. Slowly to see the corner by corner, all are strange of you from the house, street, local life to traditional foods; where you can go shopping souvenir… Until the transfer time, driver will pick you up and transfer you to the Noi Bai airport for your flight out. Trip ends.\nNote: \n- If you are Solo traveller booking for Share Room, you will stay at Share Dorm Room at hostel during your vacation.\n- This is group joining, there is a different group each trip during your vacation.\nWho should participate? - This tour is suited for all, including children as well. \nPrice structure: - Price quoted is based on per person basis.  \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!"}]},{"name":"Highlights of Vietnam - 8 Days","duration":8,"travelStyle":["Discovery","Family","Custom","Group","Fully Guided","Holiday"],"oldPrice":0,"price":989,"summary":"The best quality and unbeaten price for 8 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optional\nStart in Hanoi and finish in Ho Chi Minh City\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nTaste wonderful Vietnamese local cuisines along the trip\nChillout and shopping in Ho Chi Minh City - the biggest City in Vietnam\nAnd more...\n","highlights":["Visit the unique Cat Be floating market at the Mekong Delta","Spend the night on Halong Bay in a traditional junk boat","Be entertained by a water puppet performance in Hanoi"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02dfc92ac43.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02dfc92ac43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_6a61684e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_6c517fa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_2abdf07d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_eab98024.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_9106d70a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_883ca8c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_c409bb41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_78ab99e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_32e6df52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_8bf76856.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_144072e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df667f504.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df668c4b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66918c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df6696bcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df669e069.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66a428d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66aa721.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66b0824.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66b62a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02df66bcb22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02dfc925c88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/76132_5e02dfc92f5bf.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi. Warmly welcome by Tour Guide & Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi to Halong Bay Cruise. (B, L, D)","description":"Early this morning, we’ll drive from Hanoi to one of the most magnificent scenic environments in the world, Ha Long Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see. We’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on Board.\nGarden Bay Cruises or similar"},{"title":"Day 3: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay. After breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served while you are cruising through the bay, along the way seeing more of the fascinating formations. Cruise check-out. Rejoin car drive back Hanoi. Water Puppet Show & Cyclo Tour in Hanoi Old Quarter (optional).\nPomihoa Hotel Hanoi or similar"},{"title":"Day 4: Depart Hanoi - Danang - Hoi An. (B)","description":"This morning a flight brings you to the coastal city of Danang in Vietnam’s Central Region. You visit Cham Museum, an open air collection of some of the finest sandstone carvings in the world, Cua Dai Beach, and the Marble Mountain, before you continue on to picturesque Hoi An Vietnam’s largest port. Known as Faifo to early western traders, it was one of Southeast Asia’s major international ports during the 17th, 18th and 19th centuries. Hoi An was inhabited by Japanese, Indian, Chinese and Portuguese traders; the city is remarkable for its collection of original Chinese temples and glorious homes built by wealthy merchants of earlier times. Stay overnight in Hoi An.\nPhu Thinh Resorts Hoi An or similar"},{"title":"Day 5: Explore Hoi An full day. (B, L)","description":"A full-day tour here includes the Japanese Covered Bridge, the beautiful Chinese Assembly Halls, the Phuok Kien Pagoda, and the local market. You’ll also take a boat trip on the Thu Bon River to a village of woodworkers and boat building families on Cam Kim Island. The evening is free. Overnight in Hoi An.\nPhu Thinh Resorts Hoi An or similar"},{"title":"Day 6: Depart Hoi An - Danang - Ho Chi Minh City. (B)","description":"The day is free, Hoi An is a beach resort that’s easy to explore on your own, especially by bicycle. In the late afternoon, we drive to Danang and fly on to Ho Chi Minh City (Saigon). Here you’ll see the hustle and bustle of Vietnamese life everywhere – in the street markets, sidewalk cafes and sleek new restaurants and pubs. Yet within this teeming metropolis are 300 years of timeless traditions and the beauty of an ancient culture. Arrive Ho Chi Minh City in the noon time. Pick up from airport then transfer to hotel & check in. Overnight in Ho Chi Minh City.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 7: Ho Chi Minh City - Cu Chi tour. (B, L)","description":"In the morning visit the  Notre Dame Cathedral, the historic Central Post Office,  Reunification Palace. Followed by the remarkable site of the War Remnants Museum.\nBreak time for lunch at a local restaurant. \nAfternoon trip to Cu Chi tunnels - a popular spot for both Vietnamese & foreign tourists. The network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities included  innumerable trap doors, specially constructed living areas, storage facilities, weapon factories, field hospitals, command centers & kitchen. Plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Today, start our trip, visitor can have chance to know how the tunnel was constructed, spend the next hours exploring the tunnels and war remnants, where you'll learn more about the conditions the people lived in, the hardships they faced, and the amazing ingenuity employed to maintain life in the tunnels, sample some of the simple cuisine that local fighters would have survived on, and have an opportunity to venture into the tunnels and explore the complex.\nBack to Saigon.\nLiberty Parkview Saigon Hotel or similar"},{"title":"Day 8: Ho Chi Minh City Departure. (B)","description":"Today you are free for leisure & shopping until transfer to Airport for departure. Finish unforgettable Vietnam trip arranged by Legend Travel. Good bye & see you in the next time!"}]},{"name":"Surprising Vietnam in 10 days - HCM/ Hoi An/ Halong Bay","duration":10,"travelStyle":["Sightseeing","Group","Fully Guided","Holiday"],"oldPrice":1420,"price":767,"summary":"Vietnam has become one of the leading travel destinations in Asia with many beautiful beaches and breathtaking natural scenery that attracts millions of visitors each year. This tour is a perfect snapshot of captivating country, you will travel overland through the verdant south of Vietnam – from the riverside life of the Mekong  then up the beautiful coastline to bleached sand and azure - blue waters in Nha Trang.  Head to the star of central Vietnam - Hoi an and visit the a unique beautiful sanctuary world of the ancient Chăm religion. Finish off by exploring colonial Hanoi and cruising on tranquil Halong Bay.  The charming Vietnam packages includes a lot of interesting things to see, do and experience and will create memories that will last a lifetime.\n\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137651_453ca2d0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137651_453ca2d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_5f8c631b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_5ffd84a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_09ac27bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_bea4b2e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_db624691.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_b4ac1bed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_2418c2bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_7ef96e1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_30cde1e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_734e6d25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_4590074f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_51951eae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_ee6a3d31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_d2e92df3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_950d9e3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_d32bd787.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_c43885e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_f00c20cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_baa7ca67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_810beb8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_9fae9603.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137651_83370764.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hoi An","Hue","Halong Bay","Hanoi"],"timeline":[{"title":"WELCOME TO VIETNAM - HO CHI MINH CITY ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"EXPLORE THE MIGHTY MEKONG RIVER (B/L)","description":"(start 7:20 am  – return around 17:30 )\n7:20 am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Board the sampan and cruise down the river around four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise Islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Then visit the fruit plantation. \nRide a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family workshop and honey-bee farm, enjoy honey tea and coconut candies. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. \n"},{"title":"HO CHI MINH CITY FLY TO DA NANG (B)","description":"Have breakfast at the hotel and then transfer to the airport for flight to Hoi An via Da Nang International Airport. \nOvernight in Hoi An "},{"title":"RIDING BASKET BOAT IN HOI AN (B/L)","description":"Today your English-speaking guide will meet you at the hotel and take you to a tour of the countryside and rivers around Hoi An. As you meander through the countryside you will experience the friendliness of the local people greeting you along the way. After that, you will board the Hoi An Eco-tour boat for a river cruise to meet and engage with local fishermen. Enjoy a hands-on experience of traditional net fishing. You will also take a paddleboat trip in a unique Vietnamese bamboo basket boat down the waterways of a coconut palm paradise. In the afternoon, leisure time on your own exploring the ancient town or relaxing at the hotel."},{"title":"HOI AN LEISURE DAY (B)","description":"Today you will have free time explore Hoi An at your own pace, seeing what interests you. This ancient town is full of Japanese merchant houses and pagodas, temples and antique warehouses. Or just lounge about in a laid-back riverside café on the bank of the Thu Bon River."},{"title":"HOI AN TO HUE BY PRIVATE CAR (B)","description":"Morning: Have breakfast and get ready for your next trip to Hue. Our bus will pick you\nup at lobby in your hotel . Take a bus to Hue \nAfternoon: After arriving in Hue, checks in hotel. Next, you are free to visit around the city. For example, you can go sightseeing Thuan An Beach, Lang Co Beach, Garden\nHouse….or take some photos. Spend overnight in Hue. (Meals: breakfast)"},{"title":"FLY FROM ANCIENT CAPITAL TO THE BEATING HEART OF VIETNAM (B)","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport for the next flight to Hanoi.\n(Meals: breakfast)"},{"title":"CRUISING TO THE NEW 7 WONDERS OF THE WORLD","description":"In the morning, check-out from hotel and get pick-up by the Cruise around 7:30. Take the most scenic route to Halong Bay across the Red River Delta with emerald green rice paddies. On arrival to Halong, you will take a cruise on the bay to explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can also attend the activities taking part on the boat.\nOvernight on cruise\n(Meals: breakfast, luch, dinner)"},{"title":"MORNING IN VIETNAM'S MOST SPECTACULAR BAY","description":"Rise early for a Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, you would sailing back to the main harbor and the return Hanoi around 17:00. Free at your leisure time. Overnight in Hanoi.\n(Meals: breakfast, lunch)"},{"title":"TIME TO SAY GOODBYE - HA NOI DEPARTURE","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"Hanoi & Halong Bay plus Mountain Resort - 6 Days","duration":6,"travelStyle":["Discovery","Family","Custom","Group","Partially Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":399,"summary":"The best quality and unbeaten price for 6 Days Trip in the North of Vietnam\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n","highlights":["Spend the night cruising on a traditional junk boat on Halong Bay","Discover enchanting lagoons and coves amongst limestone karsts","Fall in love with the vibrant hustle and bustle of Hanoi"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95674_2674385f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95674_2674385f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_cdd8fe3c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_fc2ecd6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_3ff197e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_8aef5056.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_e241e136.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_7406abb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_6cd2829f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_97cb6cce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_70adcda7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_b2ddf919.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_46226594.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_df51e61e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_187183b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_028af826.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_bb0fc5d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_99df5636.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_42193001.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_de43f7eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_a01d28cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_2b35be76.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_1922d7c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_e22c11c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95674_83d2b81c.jpg"],"destinations":["Hanoi","Mai Chau","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi Vietnam","description":"Today you’ll land in Hanoi and this is where your adventure begins. Be warmly welcomed by our representative at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi.\nOptional tour for morning flight arrival: (45 US$ per Person)\nTake a short tour to visit Hanoi city landmarks including: Ho Chi Minh Mausoleum, One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong; stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. Also take the outside visit to the Opera House, St. Joseph Cathedral and make sure your camera is handy.\nOvernight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Excursion to Halong Bay and Stay overnight on Board. (B, L, D)","description":"After breakfast at your hotel, you will be picked up for Halong Bay, one of the most magnificent scenic environments in the world, Halong Bay. Covering 577 square miles, this vast bay is filled with more than 3,000 limestone “peaks” or karsts that jut from the deep blue water as far as the eye can see.\nWe’ll spend a day and a half, including an overnight with dinner and breakfast onboard, exploring this overwhelming seascape from the decks of a traditional Vietnamese boat. Comfortable and intimate, your boat features hand-crafted wooden interiors including a dining room and pleasant air-conditioned cabins with private baths. Since we’re overnight on the water, we’ll be able to explore Ha Long Bay’s most beautiful spots with time to swim and even visit some of the largest rock formations and caves. This promises to be one of your most memorable travel experiences in Asia. Stay overnight on cabin on boat.\nGarden Bay Cruises 3* or similar"},{"title":"Day 5: Halong Bay Cruise - Hanoi. (B, L)","description":"Rising to the sound of lapping bay waters, we have time for an early morning dip followed by breakfast. Sitting on the upper deck, you can relax while taking in the breath-taking beauty of the rocky islands rising from the emerald water of the bay.\nAfter breakfast, explore Sung Sot cave, swim and relax. Cruises back to the jetty while brunch is served. Cruise check-out time is around 10:30am. Disembark and rejoin our bus for driving back to Hanoi city. There will be one rest stop on the way for restroom and short shopping for handicraft souvenirs and local handmade products. Arrive Hanoi about 4:00pm. Check in hotel & free time to go sightseeing in the Old Quarter. The Pub Street is opened until 12:00pm along Ta Hien, Dao Duy Tu, Hang Buom, Ma May ets streets. You will be filled of fun with local beers and street foods. Enjoy your last night in Hanoi before leaving home tomorrow.\nStay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 6: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip arranged by Legend Travel Group! Have a safe journey home or to next destination. Goodbye and see you again in Vietnam and Southeast Asia."}]},{"name":"VIETNAM COLLECTION 3 - Romancing Vietnam","duration":14,"travelStyle":["Discovery","Group","Partially Guided","Moderate","Holiday"],"oldPrice":0,"price":1970,"summary":"Vietnam is a country of natural beauty, delicate and flavorful cuisine, compelling history, cultural diversity, incredible heritages. The vibrant people make Vietnam a one-of-a-kind Asian destination. With an intriguing history spanning back over 4,000 years, including occupations from both the Chinese and French, the country’s architecture and cuisine is a fascinating testament to cultural diversity. ","highlights":["2 Domestic Flights","Overnight on cruise in Halong Bay","Cruising along Mekong Delta by Luxury Cruise","Bike tour in Hoi An Ancient Town","Cai Rang Floating Market - the biggest one in Mekong Delta","Speedboat from Vietnam to Cambodia","Discover Chau Doc City - located in the border Vietnam & Cambodia","Angkor Temple - Siem Reap ancient city"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/127018_d4df1001.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/127018_d4df1001.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_6ea82e0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_9e91b8cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_42def51c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_6063e2e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_3eed9f72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_e05d8699.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_348dec85.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_9f748057.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_5cc43036.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_d0551761.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_bd9eb475.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_42c6e626.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_4377db2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_ecd4c495.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_c2b8c335.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_4422bafa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_f08f8bc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_d2de530b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_343d1ccc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_1b0011e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_1ee9dc64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_d0df008f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/127018_65360fd8.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HANOI ARRIVAL - VIETNAM XIN CHAO!","description":"Welcome to Vietnam! Upon arrival, meet our team at the airport and drive to city center, all domcument will be sent to you in this day (tour program, domestic flight tickets, all contacts in details). Free time for relax after a long flight. Overnight in Hanoi.\nHotel check-in time is 14:00"},{"title":"HANOI CITY TOUR - A DAY IN HANOI - CYCLO EXPERIENCE (B,L)","description":"Breakfast at hotel. Considered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. Meet your tour guide. Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. Visit Ho Chi Minh’s complex (outside), the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam. Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. After lunch, process to visit Temples of Literature - constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university. Leave for a legendary Hoan Kiem lake and Ngoc Son Temple. Drive back to hotel and drop off. Free time for relaxing in the evening. Overnight in Hanoi."},{"title":"HANOI - HALONG LEGENDARY BAY (B,L,D)","description":"After breakfast at hotel, check-out hotel. From Hanoi, head East for more than 3 hours to Halong Bay, the pride of the Gulf of Tonkin, a Natural World Heritage as designated by UNESCO in 1994 and 2006. The road will pass by the Red River delta with green paddy fields and rural villages, where hard-work farmers are busy with their farming jobs, ploughing buffaloes or planting seedling. Upon arrival in Halong, we’ll take a big boat to cruise the Bay to discover the magnificent beauty of this “Descending- dragon” bay, created by thousands odd-shaped limestone rocks and karst grottoes. After a lunch of fresh seafood on board, we can visit the Surprising Grotto, stop for swimming, passing floating villages and approach islets to enjoy their beauty in close distance. Evening attend activities on the boat or relax at your own leisure. Overnight on the boat.\nSIC Tour - Itinerary is subject to change without prior notice"},{"title":"HALONG BAY - HANOI - BACK TO CAPITAL (B,BR)","description":"In the morning, doing exercise morning on Sundeck, enjoy light breakfast with coffee, tea, seasonal fresh fruit and bread before keep going to visit Halong Bay, passing by many other rocks, Islets as well as fishing villages. Brunch will be served on board before disembarking time. Return to Hanoi, arrive at your hotel in Hanoi in the late afternoon. Check-in hotel. Free time in the evening. Overnight in Hanoi.\n"},{"title":"HANOI - FLY TO DANANG - HOI AN ANCIENT TOWN - ROMANCE DINNER (B,L,D)","description":"Breakfast at hotel. Check-out and transfer to airport for fly to Danang (Central of Vietnam). Upon arrival, meet and great service at the airport with our team. Take a short drive to the riverside town of Hoi An (30-miuntes). Upon arrival, enjoy lunch at local restaurant then you will set off on a walking tour to explore this World Heritage Site. Highlights include an ancient merchant house, the Phuc Kien Assembly Hall, the 400-year-old Japanese Covered Bridge, and the vibrant riverside market. Check-in hotel and relax. A private romance dinner will be served at Glory Morning Hoi An Restaurant, a cozy restaurant inside ancient town. Overnight in Hoi An."},{"title":"HOI AN EXCLUSIVE TOUR - LANTERN MAKING - FOOD TESTING - SUNSET KAYAKING (B,L)","description":"Breakfast at hotel. Depart to the home of lantern craftsman by bike. Here you will have a brief introduction into the history, shape and color of the lanterns, as well as the many stages of making them. Then you will learn how to practice hands-on through each stage of lantern making under the guidance of the enthusiastic craftsmen: from bending it into frame, cutting cloth, sticking and completing lanterns. You can make your own lantern and keep it as a souvenir. Enjoy lunch with Cao Lau, Banh Mi which are traditional cuisine in Hoi An. Relaxing at your hotel.\nSunset Kayak Tour will begin at 14:00. The tour starts up with pick up from your hotel to our kayak station in Cam Thanh. After a briefing on paddle safety and the area you will be kayaking, we’ll set off to paddle along the cocopalm forest and local villages and up to the Lantern Town. Connect with nature, immerse ourselves in life on the river and enjoy amazing landscapes as we paddle into the sunset. Trip ends after 3-hours. You’ll have time for refreshment at a local cafe near the town center before getting a transfer back to your hotel. Free time for relaxing. Overnight in Hoi An."},{"title":"FLY TO SAI GON - SUNSET COCKTAIL - SAIGON BY NIGHT (B,D)","description":"Breakfast at hotel. Free time for relaxing until transfer to airport for fly to Saigon (Ho Chi Minh City - South of Vietnam). Upon arrival, meet and great services at the airport with Footsteps' team. Drive to city center, check-in hotel and relax.\n16:30 - 18:30 - sightseeing Saigon via motorbike. Then stop at The deck restaurant, enjoy a glass of cocktail and relaxing in few minutes. Saigon Food Tour - Saigon by night will begin at 18:30. We designed this 2,5 hours tour for you to enjoy a wonderful evening in Saigon. You will travel to non- tourist destinations and see the real life of local people. This four hours on the back of our own scooters will take you through districts 1, 2, 3, 4, and 10 where you will see the local’s activities in the night time. And guess what, we're gonna sample 10 different dishes during this food challenge. Overnight in Saigon."},{"title":"SAIGON CITY TOUR - CU CHI TUNNELS (B,L)","description":"Breakfast at hotel. We start this day tour by a visit to The Reunification Palace. This is one of the most important buildings in the city. Continue to Notre Dame Cathedral and The Post Office Center for the best examples of classical French colonial architecture in Saigon. War Remnants Museum, which formerly known as the Museum of American War Crimes.\nEnjoy lunch at local restaurant. Head to the Cu Chi tunnels - an underground tunnels network constructed by Vietnamese fighters during their struggle for independence. Arriving tunnels, a short introductory video showing how the tunnels were constructed will be given. We then spend time exploring the maze of tunnels including innumerable trap doors, storage facilities, weapons factories, field hospitals, command centers and kitchens. These tunnels consisted of many ‘moving parts’ making them a livable structure for long periods of time. We then drive back to Saigon and end the Cu Chi Tunnels tour at late afternoon. Free time in the evening for relaxing. Overnight in Saigon."},{"title":"MEKONG DELTA - COCONUT VILLAGE (B,L)","description":"Breakfast at hotel. A trip to Mekong Delta offers a glimpse into the unique and distinct agrarian life of the vibrant southern Delta region. We will enjoy a cruise along Mekong River to one of the Islands (located in the town of My Tho) where we will be entertained with traditional music while enjoying some tea sweetened with bee's honey and seasonal fresh fruites. We will then take a paddle-boat to cruise through the narrow canals of the Mekong. The paddle-boat ride provides an interesting look into local cottage industry of making coconut candies. Go around the island by rickshaw to see the life of local people before returning to Saigon. Overnight in Saigon."},{"title":"SAIGON - FLY TO CON DAO ISLAND – ROMANCE ISLAND (B)","description":"Breakfast at hotel. Airport transfer to Tan Son Nhat Airport, take a flight to Con Dao Island. You will have relaxing time in the wonderful island."},{"title":"CON DAO ISLAND (B)","description":"Breakfast at hotel. Free day for relaxing. Overnight in Con Dao."},{"title":"CON DAO ISLAND (B)","description":"Breakfast at hotel. Free day for relaxing. Overnight in Con Dao."},{"title":"CON DAO - FLY TO SAIGON (B)","description":"Breakfast at hotel. Free time for relaxing until transfer to airport for a flight to Saigon. Overnight in Saigon."},{"title":"SAIGON DEPARTURE (B)","description":"Breakfast at hotel. Free time until check-out hotel. Private airport transfer before 3-hours for your departure flight."}]},{"name":"Discover Vietnam","duration":13,"travelStyle":["Adventure","Group","Partially Guided"],"oldPrice":0,"price":1997,"summary":"Vietnam effortlessly blends a modern bustling Asia with the exotic vibe of the old and traditional. Embrace the enchanting Vietnamese culture through adventure, exploration and volunteering whilst having a damn good time on this two week experience!Starting in Hanoi, Vietnam's bustling capital, you'll cruise the waves amongst the awe-inspiring limestone cliffs of Ha Long Bay before continuing onto one of South East Asia's most majestic and impressive natural landscapes: Ninh Binh. You will then volunteer with the local community in the imperial city of Hue, drift along the scenic coast of the Hai Van Pass, before finishing the experience of a lifetime roaming through the picturesque streets of Hoi An.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/92080_72cb6992.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/92080_72cb6992.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_adddd6ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_5bd53163.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_3c89bcbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_c845dcee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_70dab32f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_faedfe3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_85e5171d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/92080_c7e01be1.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An"],"timeline":[{"title":"DAY 1 (FRI) WELCOME","description":" This is it then, the starting point! We know that you'll be excited, nervous, apprehensive or all three, so to help ease you into life here in Vietnam, our team will collect you from the airport and transfer you to our first base and set you up ready to begin this epic adventure. As we'll have traveller's arriving throughout the day you can choose to either rest up or explore locally as we collect all the new arrivals and have a huge group hug! In the evening, for those who are lucky enough to have already arrived, there'll be an informal get-together, a great way to get to know your fellow give-back-packers! "},{"title":"DAY 2 (SAT) LET'S EXPLORE","description":" We’ll kick today off with breakfast and an informative orientation so you can get your bearings and find out about all the activities, rules of the road and what we have planned for you during your trip. Once you’ve got your head around the info, we'll head into town for a walking tour and visit the scenic Hoan Kiem Lake, the Temple of Literature, and the old French quarter. In the evening you’ll have the opportunity to watch a traditional water puppet show before enjoying a delicious meal in the city’s old quarter. If you’re still thirsty for more, it’s off to Beer Street for a few drinks! Meals Included: Breakfast & Dinner "},{"title":"DAY 3 (SUN) HA LONG BAY","description":" Hopefully, you’re not feeling too fragile this morning as it’s an early start. We will be making our way to Vietnam’s extraordinary Ha Long Bay. The journey takes around 3-4 hours, so there’s plenty of time to catch up on your beauty sleep. Once we’re at the dock, we’ll set off on a cruise through the iconic emerald waters dotted with thousands of imposing limestone cliffs. You’ll even get the chance to kayak if you don’t mind getting wet! Lunch will be provided to keep you going through the day, and in the evening we’ll sit down for a group meal while watching the sunset - how nice does that sound?! Expect the drinks to be flowing in the evening along with a few questionable song choices (and that’s just from your guides!) Meals Included: Breakfast, Lunch & Dinner "},{"title":"DAY 4 (MON) NINH BINH","description":" You’ll have a final opportunity to kayak and swim in the beautiful bay after breakfast and before we head back to the mainland. In the afternoon we’ll be making our way to Ninh Binh to check into our accommodation and explore the town's surroundings. Later on that evening we’ll meet up with the gang and see what everyone wants to do. Meals Included: Breakfast "},{"title":"DAY 5 (TUE) NINH BINH","description":" You’ll be able to get out and really explore Ninh Binh today. Did you know that in 2016 the Hollywood blockbuster King Kong was filmed here? Well, you do now! So let’s grab the opportunity and hop on a bike for a closer look at the town and the surrounding countryside. We will also make time for a cruise along the Tam Coc River which is, without a doubt, one of the most picturesque places in northern Vietnam. In the evening we’ll board the night bus and move to our next location, Hue. Meals Included: Breakfast "},{"title":"DAY 6 (WED) HEY HUE","description":" Arriving in Hue this morning, we'll get you checked in, give you a chance freshen up and have some breakfast. After lunch we'll walk down to the Perfume River through the park and board our private boat for a relaxing ride down stream. Kick back and relax before we arrive at Thien Mu Pagoda, Vietnam's tallest religious building at seven tiers high. In the evening, you will receive a pre volunteering orientation, so you're ready for some hard work for next three days! Meals Included: Breakfast "},{"title":"DAY 7-9 (THUR-SAT) VOLUNTEERING","description":" It’s that time, so let's give something back because that’s what we do best! Working alongside one of the top NGOs in Vietnam, your three days on the project will have you rolling up your sleeves and getting your hands dirty. Community development is something Bamboo loves to support and such projects include: building toilets for families, building sustainable chicken farms and pens and educating the community on how to provide food and a steady income for the future. Projects can change depending on a number of factors and we work on whatever is most needed at the time. Whichever project you’re involved in, rest assured your hard work will make a difference to the people who really need it. That’s just how we roll. On your last evening, and after you’ve had a massive pat on the back, let the games begin as we spend the night enjoying Hue’s vibrant nightlife one last time. Meals Included: Breakfast, Lunch. "},{"title":"DAY 10 (SUN) HOI AN","description":" Making our way to the historic town of Hoi An today, we’ll travel down the famous Hai Van Pass – a scenic, winding road with panoramic views. If the weather’s kind to us, we’ll stop at a secluded waterfall known as the Elephant Springs, or we will stop along the road at Da Nang and walk amongst the Marble Mountains - the perfect photo op. Meals Included: Breakfast "},{"title":"DAY 11 (MON) BICYCLE CLUB","description":" Today we’ll head out on an epic bicycle ride through the beautiful streets of Hoi An. We will venture out into the countryside, riding through the stunning rice paddocks and run into a buffalo or two. The bike tour ends at the water's edge where your basket boat awaits. This is a unique experience that not many visitors know about, and we’re sure you’ll love it! After lunch by the river you'll be treated to a round of traditional Vietnamese games (prizes are involved!) before heading back into town for a night out. Meals Included: Breakfast "},{"title":"DAY 12 (TUE) FREE TIME","description":" Time for some relaxation, so make the most of being in a great location to explore! The Old Quarter is packed full of pretty yellow buildings, boutiques, tailor shops, and quaint coffee shops. Book yourself into a cooking class at the famous Green Mango Restaurant with a world-famous chef; or if the sun’s out, take a trip down to An Bang Beach for ultimate relaxation on the sand. This evening we can all get together for a final group meal - no need to worry, this one’s on us. Meals Included: Breakfast, Dinner "},{"title":"DAY 13 (WED) GOODBYE'S","description":" That’s it! It’s time to say bye-bye. Our team will be there to help you to arrange any transport you might need, be it back to the airport or wherever you're heading. One final group photo? Oh, go on then! Meals Included: Breakfast "}]}]