[{"name":"Vietnam World Heritages - 10 Days","duration":10,"travelStyle":["Custom","Private","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":670,"summary":"\n\tFrom charming Hanoi with its fading colonial architecture and national monuments, to the amazing scenery of Halong Bay on traditional junk, Hue imperial city then Hoi An ancient town plus My Son Holyland and the steamy city of Saigon on the edge of the Mekong Delta, Vietnam is as colorful as it is diverse. See almost of UNESCO World Heritage sites of Vietnam in 10 interesting days!\n\n\tNote: Tour starts everydays, that means \"always available\". you only need to ask for availability if your travel date is 1 month before your booking date.\n\n\tPick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\n","highlights":["Be amazed by the most beautiful cave on Ha Long Bay","Gaze at the architecturally beautiful My Son Holy Land","Learn the life of the locals at the Cai Be Floating Market"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/80347_68793b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/80347_68793b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_73345a26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_f03d5e67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_99dcf3c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_eda6ae0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_7f922858.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_0983d403.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_621f512a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_698aa618.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_4aeb12b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_138cc8ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_ffd34024.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_3f77a494.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_3682002b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_8a4f38a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_5646ebc3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_e0f7c003.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_99d607f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/80347_e0e5d6ca.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1 Hanoi - airport pick up - Check in hotel in Hanoi (Meals: No)","description":"Pick up the airport and then transfer you to the hotel in Hanoi Old Quarter – the most exciting place for tourist. After that you are free to visit Hanoi City by yourself.\nNote: Check in time is 13:00 P.M."},{"title":"Day 2 Hanoi - Halong Bay - Overnight on Cruises (Meals: B, L, D )","description":"\n08h00 – 08h30: Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12h30 – 13h00: Embark on cruise and followed by a short cruise briefing.\n13h30 – 14h30: Savor a delectable lunch on cruises among the limestone islands.\n15h00 – 16h00: Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay.\n16h00 – 17h00: Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17h00 – 17h30: Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way.\n17h30 – 19h00: Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19h00: Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on board."},{"title":"Day 3 Halong Bay - Hanoi - Check in hotel in Hanoi (Meals: B, L )","description":"06h30 – 07h15: Start your day with Tai Chi exercises or a photo hunt.\n07h30 – 08h30: Have breakfast on board and enjoy the peaceful morning of Halong Bay.\n09h00 – 10h00: Kayak among the hidden areas of the bay, around the Man’s Head Islet area.\n10h15: Return to the boat. Freshen up and check out of your cabin.\n10h15 – 11h00: Continue your cruise exploring the Bay, passing Ba Hang fishing village, Dog Islet, and more.\n11h00 – 12h15: While heading back to the harbor, watch the fruit carving demonstration and participate in the Cooking Class before enjoying a traditional Vietnamese lunch.\n12h15 – 12h30: Disembark \n12h30 – 13h00: Transfer back to Hanoi.\n16.30 - 17.00: Arrive Hanoi City\nNote: Itinerary can be changed upon the weather condition\nAbove is itinerary of 3 star cruise, itineraries of 4 or 5 star cruises will be different"},{"title":"Day 4 Hanoi Airport transfer - Flight to Hue (Meals: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Hue city and stay overnight at the most touristic area of Hue."},{"title":"Day 5 Discover Hue by boat and Car (Measl: B,L )","description":"07.45 Am, We will pick up you at your hotel & transfer to Visit 04 famous sites:\n- Minh Mang Tomb\n- Khai Dinh Tomb\n- Tu Duc Tomb\nConical Hat Making Incense Making Village.\nAfter having lunch, visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank\nAfter you visit Thien Mu Pagoda, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\nHere, you walk to your hotel.\nThe tour ends at 16.30"},{"title":"Day 6 Hue - Bus to Hoi An town (Meals: B)","description":"08.00 – 08.30 Bus pick up from your hotel and start journey to Hoi An City. On the way, bus will stop at Hai Van Pass for taking photos, Linh Ung Pagoda, Marble Mountain in Da Nang City for the short visit. You will have lunch by yourself in stop over place.\n14.00 Arrive in your hotel in Hoi An City\n"},{"title":"Day 7 Hoi An - My Son day tour (Meals: B,L)","description":"7:30 – 8:00: The bus and tour guide pick you up at your hotel 8:30 : Leaving Hoi An for My Son HolyLand.\n9:30: Arriving in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham.\nSpend 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide.\n12.00: Leaving My Son for boat station and taking a boat trip on Thu Bon river. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river\n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip!."},{"title":"Day 8 Hoi An - Airport transfer - Flight to HCMC- Pick up- check in Hotel (Meals: B )","description":"After breakfast at your hotel and you are free till airport transfer. Today, you will have a flight to Ho Chi Minh city and stay overnight at the most touristic area of Ho Chi Minh City."},{"title":"Day 9 HCMC - Mekong delta - Cai Be Floating Market - Vinh Long tour (Meal: B, L )","description":"08:00 Picking up from hotel/stay.\n08:15 Starting drive to Cai Be. Short time to take photos at Tan An town over the flat rice fields.\n10:30 Start the motorized boat to visit the Cai Be Floating market, experience how people exchanging goods, fruit and many other commodities on their vessels. Visitors then roam into the small villages to visit the orchard, fruit plantation. Keep cruising to Vinh Long through small canals to enjoy the charm of the Upper Mekong Delta. Visit some handmade family business products such as the coconut candy mill, the crispy rice popcorn.\nArrive in Binh Hoa Phuoc village the green pearl of Vinh Long town where you can indulge yourself into the nature.\nHave lunch with fresh river food served in the heart of the garden. Enjoy the southern Vietnamese traditional folk music. Take a nice walk through the bonsai garden, in Vinh Long. Head home to Ho Chi Minh City.\n18:30 Arrive in your hotel."},{"title":"Day 10 HCMC - Airport transfer - end the trip (Meal: B )","description":"This day you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends."}]},{"name":"Vietnam Adventure","duration":14,"travelStyle":["Discovery","Group","Fully Guided"],"oldPrice":0,"price":1879,"summary":"This trip encapsulates the magic of Vietnam: the conservative north, the rich \nheritage of the imperial cities, coastal scenery and the vibrant life of \nSaigon and the Mekong Delta. We come face to face with an outgoing culture, \nwhere so much goes on in the streets: eating, washing, socialising, buying \nand selling or impromptu games. This intoxicating parade of Vietnamese daily \nlife may leave us with our strongest memories, as much as the superb \nlandscapes and amazing cuisine.","highlights":["Watch the Hanoi's water puppets performance","Enjoy overnight cruise along Halong Bay","Take a walking tour of Hoi An","Explore the Cham civilisation's spiritual home"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33213_c9fc17.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33213_c9fc17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_16503e24.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_18cce643.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_7eef145f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_453dff90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_c0e82e7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_c26f7656.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_6047dd39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_689c1e3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_9c3f8345.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_18209cbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_f0cf2ee9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_c06da113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_809f7563.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_095e0619.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_888cf49a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_7dabcdd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_34798e77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_beb95086.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_760584e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_8f5a50b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33213_6953ca95.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Vinh Long"],"timeline":[{"title":"Day 1: Start Hanoi","description":"The day is free to recover from the flight or stroll amongst broad tree-lined \navenues dating from the French period. There is a faded colonial charm where \nbaguettes and good coffee are sold from doorways of grand buildings of a past \nera. \n\nThis evening there will be a welcome briefing followed by an optional group \ndinner at a local restaurant.\n\n*May de Ville City Centre Hotel or similar*"},{"title":"Day 2: City tour","description":"In Hanoi we take a sightseeing tour of the city that includes a visit to the \nTemple of Literature; the site of the oldest university in Vietnam with over \n2000 graduates, Hoa Lo Prison & the Old Quarter of the city with its '36 \nStreets' where each street is home to shops selling particular products - \ne.g. 'silk street', 'gold street', 'paper street' and 'tourist souvenir \nstreet'. Another stop is the grounds of the Presidential Palace where Ho Chi \nMinh refused to live in the grand structure for symbolic reasons. We visit \nhis traditional Vietnamese stilt house here. In the evening there is the \noption to enjoy a performance of Hanoi's famous water puppets.\n\n*May de Ville City Centre Hotel or similar*"},{"title":"Day 3: To Halong Bay; cruise; overnight on boat","description":"We make an early start for the approximately 4-hour journey to Halong Bay. \nThis is one of the most stunningly beautiful sights in South East Asia with \nroughly 3,000 limestone peaks rising directly from the clear emerald sea. We \ncruise amongst this amazing karst scenery and enjoy a seafood lunch on board. \nWe overnight on board in twin share cabins with en suite facilities.\n\n*Overnight Boat*"},{"title":"Day 4: Cruise; return to Hanoi; overnight train to Hue","description":"We continue to cruise around Halong Bay this morning before returning to \nport. We then drive back to Hanoi, and transfer to the train station and \nboard the Reunification Express for the overnight train ride to Hue, 688km to \nthe south.\n\n*Overnight Train*"},{"title":"Day 5: Arrive Hue; sightseeing","description":"Arriving mid-morning in Hue we transfer to our hotel. Hue claims to be the \ncultural and historical centre of Vietnam, and there is plenty to see. The \nmost outstanding sight is the Imperial Citadel with walls six miles in \nlength. Inside are the palaces and halls of the Mandarins, and the remains of \nthe Forbidden Purple City, where only the emperor, his eunuchs and concubines \nwere allowed. The Forbidden Purple City was almost totally destroyed during \nthe Vietnam War's Tet Offensive, but the foliage-covered ruins are still \natmospheric and the gaping holes left by bombs give an idea of the \ndestruction wreaked upon the country during the war.\n\nThis afternoon we visit the Imperial Citadel and the famous Thien Mu Pagoda. \nThe pagoda was a centre for anti-government protest in the early 1960's and \nit houses the Austin car that transported a monk, Thich Quang Duc, to Saigon \nin 1963 where he burned himself in protest against the president. The \nphotograph of his self-immolation was printed in newspapers all around the \nworld. \n\n*Park View Hotel or similar*"},{"title":"Day 6: Visit historic Tu Duc Mausoleum; free afternoon","description":"This morning after breakfast we visit the mausoleum of Tu Duc, one of the \nmost extravagant mausoleums of the great Nguyen emperors who ruled Vietnam \nfrom Hue between 1802 and 1945.\n\nHeading back to Hue, the afternoon is then free to further explore and get to \nknow this historical centre or to simply relax by the riverside and absorb \nthe local sights. \n\n*Park View Hotel or similar*"},{"title":"Day 7: Journey to Hoi An via Da Nang","description":"Leaving Hue, our 130km journey drives through the beautiful peninsula of Lang \nCo between the crystal waters of a lagoon and the Eastern Sea, and then \npasses over the spectacular Hai Van pass ('Pass of the Ocean Clouds') where \nthe views are stunning. In Da Nang we first stop at the Cham museum where \nthere are altars, statues and decorative works collected from Hindu and \nBuddhist temples and towers from the Kingdom of Champa that flourished \nbetween the 7th to 17th centuries in Central Vietnam. We then climb Marble \nMountain where we explore the large caves which were used by the Viet Cong as \na hospital base during the war. From the mountain peak, there are fantastic \nviews over My Khe beach and the surrounding countryside leading on to Hoi An \nwhere we spend the next three nights.\n\n*Le Pavillon Hoi An Boutique or similar*"},{"title":"Day 8: Walking tour of Hoi An; free afternoon","description":"This morning will include a walking tour of Hoi An, the original European \ntrading port in Vietnam dating back to the mid-16th century. It is now a \nliving museum, with attractive wooden merchant's houses and pagoda-style \ntemples with Chinese, Japanese, Vietnamese and European architectural \ninfluences. It is also a marvellous place to wander around and enjoy the \nthriving riverside market and great silk clothes shopping.\n\nThis afternoon is free, one popular option is to jump on a bike for a ride \nthrough the countryside past local markets, schools and villages before \ncontinuing on to Cua Dai beach (5 km).\n\n*Le Pavillon Hoi An Boutique or similar*"},{"title":"Day 9: Visit My Son; free afternoon in Hoi An","description":"This morning we will visit My Son, the Cham civilisation's spiritual home, \nwhere Cham kings were buried as early as the 4th century. Although wartime \nbombing has destroyed much of the site, there are a number of interesting \nstone towers and sanctuaries. Upon returning to Hoi An the rest of the \nafternoon is free to carry on enjoying this historic town.\n\n*Le Pavillon Hoi An Boutique or similar*"},{"title":"Day 10: Fly to Saigon; walking city tour","description":"We drive to Da Nang and then fly to Ho Chi Minh City (Saigon), an exciting \nand absorbing city where scooters pack the streets and temples stand \ndefiantly alongside modern developments. Devastated by the Vietnam War, it is \nnow a bustling free market city where anything goes. This afternoon's walking \ncity tour includes a visit to the Ben Thanh Market, Reunification Palace, \nNotre Dame Cathedral and War Remnants Museum. The Museum has an interesting \nphotographic record of the Vietnam/American War. Please be aware that some \nimages at the museum are very graphic.\n\n*Huong Sen Hotel or similar*"},{"title":"Day 11: Visit Cu Chi Tunnels; free afternoon","description":"Today we leave the city behind us and head north to visit the infamous Cu Chi \ntunnels. Used by the Viet Cong during the war, the network covers 3 levels \nand approximately 240km of tunnels. Traditionally these were very narrow but \nsome areas have been widened to allow tourists to explore the system. \nClaustrophobes may prefer to stay outside in the sunshine! In the afternoon \nwe return to Saigon and the rest of the day is free for individual \nexploration.\n\n*Huong Sen Hotel or similar*"},{"title":"Day 12: Mekong Delta boat ride; overnight in homestay guesthouse","description":"In the morning we drive to Vinh Long (approx. 2.5-3 hrs) in the Mekong Delta, \nknown as the 'rice bowl' of Vietnam. This region produces most of Vietnam's \nfruit, sugar cane and coconuts. We take a boat trip on the mighty Mekong \nRiver to Cai Be. Recently, Cai Be floating market is becoming less crowded \nand smaller as fruit trading is mostly now done by trucks due to the bridge \nbeing built. However, this is still a great opportunity to see a local market \nand the trade being conducted traditionally on a smaller scale.\n\nEn route we pass many orchards and friendly locals also travelling by boat. \nWe stop to see some small cottage industries such as rice paper and coconut \ncandy, getting a chance to sample the local produce along the way. The \nevening is tranquil as we have dinner on an Island and enjoy some 'Delta' \nhospitality. We spend the night sleeping at a simple homestay guesthouse \nbuilt in the style of a local house. Bedding, a mosquito net and a small \ntowel are provided.\n\n*Mekong Homestay Guesthouse*"},{"title":"Day 13: Walk through fruit orchards; return to Saigon","description":"This morning we take a walk through the fruit orchards and navigate our way \nthrough the small canals in a traditional wooden sampan. Later we rejoin our \nboat to rendezvous with our vehicle for the journey back to Saigon via a \nlittle visited Cao Dai temple used by devotees of this strange indigenous \nreligion, which fuses all the great religions of east and west.\n\n*Huong Sen Hotel or similar*"},{"title":"Day 14: End Saigon","description":"For land only clients, the tour ends this morning in Saigon after breakfast."}]},{"name":"Sapa Biking from Hanoi - 3 Days","duration":3,"travelStyle":["Bicycle","Group","Partially Guided","Discovery","Sightseeing","Holiday"],"oldPrice":0,"price":312,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\nThe Sapa area is perfect for exploring some of the best natural scenery and cultural highlights in Vietnam. Make the most of the fresh mountain air by coming with us on a bicycle tour that takes in terraced fields, farmers working the land and several colorful ethnic minorities.","highlights":["Fall in love with the cultures and traditions of the local people","Make the most of the fresh mountain air on a bicycle tour","Ride through succulent terraced fields and meet local farmers"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33662_9974ed.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33662_9974ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_70106ab1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_5f5ff7aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_83c9b6fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_e7a5f3ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_07b0db17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_7c6beaef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_57717468.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_b4eb68fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_2e7ac6d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_aa695e3b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_7fac2a77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_897839ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_02274602.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_e2b13bf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_6bd471c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_26002b0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33662_4459fe69.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"Day 1: Biking trip to Muong Hoa Valley - Hill Tribes (-/L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide to have lunch. After lunch, we will take a day trip to visit Muong Hoa Valley by bike. Along the way, we will stop to relax and take photos. This is a stunning place to view the largest terraced rice fields in Sapa. If travelling between May and October, local harvest period, you will see the local farmers in action-a great photo opportunity. After that, we will take a walk from Lao Chai Village of the Black H'mong Minority to Ta Van Village of the Giay Minority with a stop at the local Catholic Church, taking in the different traditions, cultures and costumes of the two minority groups. Return to Sapa by car. Overnight in Sapa. \n"},{"title":"Day 2: Biking trip to Binh Lu - spectacular charm (B/L/D)","description":"Have breakfast. Take a 45 km bike ride to Binh Lu. Along the way, we will stop to take a short walk to Silver Waterfall and Heaven’s Gate, where you will be amazed by breathtaking view of the surrounding mountains and you can see Fansipan Mountain-the highest peak in Indochina. A 1.5-hour downhill ride to Binh Lu includes a stop at Chu Va Village of the Flower H'mong. Enjoy a packed lunch on the way before cycling to Pa Pen Village of the Lu Minority where you can talk with the local people and visit the local school (closed on weekends). Then, we will return to the hotel by car. Overnight in Sapa. "},{"title":"Day 3: End of the trip, full of experiences (B/-/-)","description":"Free day for shopping and discovering Sapa town. \nAs a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. It is interesting \nto buy some presents for your relatives and friends .\nCheck out, transferring to Sapa bus station back to Ha Noi.\n"}]},{"name":"Sapa Tour by train from Hanoi 2 days 3 nights - Overnight in homestay","duration":3,"travelStyle":["Hiking & Trekking","Adventure","Mountain Hikes","Attraction-Based Hikes","Group","Partially Guided","Train & Rail","In-depth Cultural","Holiday"],"oldPrice":0,"price":122,"summary":"\n  Experience sleeping train from Hanoi \n  Trekking in Sapa with local ethnic guide \n  Stay & eat with local people \n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b998016f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b998016f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b9980175.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b9980177.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b9980178.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b998017a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119434_5e449b998017c.jpg"],"destinations":["Hanoi","Lao Cai","Sapa"],"timeline":[{"title":"NIGHT 1: Hanoi - Sapa by train or overnight bus","description":"We will take the overnight train from Hanoi to Lao Cai (4-berth sharing cabin)"},{"title":"DAY 01:Sapa - Y Linh Ho - Lao Chai - Ta Van (B/L/D)","description":"Around 06:30am, be greeted by our tour guide and driver upon arrival at Lao Cai train station, before being transferred to Sapa village, by a shared tourist bus. The bus ride uphill to Sapa takes a little over an hour, and will give you a glimpse of the stunning vistas and impressive rice terraces as you make this short trip.\n\nOnce arriving in the hotel in Sapa, an early check in follows if room is available, otherwise in the interim, you will have access to a basic room for your refreshment, before enjoying breakfast prior to going on the morning tour.\n\n09.30 Start your tour with 6km of walking down to the South East of Sapa along the side of Muong Hoa valley to Y Linh Ho village, home of the Black H’mong people. Then continue with a 3km-trek down to Lao Chai village. Here we will stop for a simple lunch before exploring the village. After lunch, continue trekking through terraced rice fields to Ta Van, village of the Dzay minority people. This trek is relatively easy, though the trail can be quite slippery if it rains, so good footwear is recommended.\n\nTrekking level: 6/10\nTrekking: 10Km trekking and 8Km driving from Tavan village back to Sapa.\nAccommodation: Home-stay in Ta Van\nMeals: Breakfast, Lunch and Dinner"},{"title":"DAY 02: Ta Van - Giang Ta Chai - Su Pan - Sapa - Lao Cai (B/L)","description":"Around 09:30Am, after having had a restful night and enjoyable breakfast, it is time to take an 8 km walk to visit 2 villages of the red Dzao people, the H’mong who are located in Giang Ta Chai\nSu Pan villages. Situated at the edge of Muong Hoa Valley, Giang Ta Chai is gaining popularity as one of the most scenic and interesting locations for visitors who enjoy experiencing the colorful traditional customs and costumes that are always on show here. While Supan is considered as a less travelled and more withdrawn village because of its small population base.\nThere are breath taking and beautiful landscapes throughout this mountainous area, including a stunning waterfall, rattan bridges, and some exquisite ferns and orchids that drape from the overhanging branches of so much lush vegetation. After Giang Ta Chai and Su Pan visits, it is hard to have to leave this area, but we again have opportunity to do more exploration in Sapa town, so the bus ride allows some recovery time... and lots of photos and stories will no doubt be told on the brief ride back. Tour ends at around 15:30 or 16:00\nTrekking level: 5/10\nTrekking: 8Km of trekking, 10Km of driving back to Sapa.\nActivities: Start the journey with a trek to Giang Ta Chai Village and Supan Village of the Red Dao and the H’mong people, which are located far from the center of Sapa but very attractive with coloful traditional costumes.\nMeals: Breakfast, Lunch\nShuttle bus to Lao Cai train station\nNIGHT 3: Sapa - Hanoi by train or overnight bus"}]},{"name":"Top Gear Vietnam Motorbike Tour from Hanoi to Saigon on Chi Minh Trail","duration":12,"travelStyle":["Motorcycle Ride","Local Guide","Trail/Dirt bikes","Group","Fully Guided","Sightseeing","Holiday"],"oldPrice":0,"price":1870,"summary":"This 12-day Hanoi Motorbike Tour to Saigon takes you special rides on Ho CHi Minh trail and the stunning Coast to explore beauties of Phong Nha, Hue, Hoi An, Nha Trang, Mui Ne. You will learn about the Vietnamese history when you are in Khe Sanh and DMZ area of Vinh Moc","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/129802_966fa726.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/129802_966fa726.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_e0253103.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_b7557fa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_150e9f7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_86e8863e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_c8595b06.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_d640d34e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_5ce7f82c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_74e6ed97.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_539627d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_d1485a4c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_36589998.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_1763681d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/129802_654e0bb7.jpg"],"destinations":["Hanoi","Mai Chau","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An","Quy Nhon","Mui Ne","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi motorcycle tour to Mai Chau (Hoa Binh)","description":"Our motorbike tour will be started by leaving Hanoi on dyke roads to avoid the heavy traffic around 9.am , we ride our motorcycles west to Mai Chau, an area of beautiful landscape and home to the Thai ethnic minority. We will motorcycle on Highway 6 passing extensive farming lands comprising a sea of paddy fields split by tree-lined roads punctuated by limestone karst scenery.\nAfter a light lunch in Hoa Binh Province, we cross Thung Khe, one of the most beautiful mountain passes in North Vietnam then descent to the mountain valley settlement of Mai Chau. After dinner we join performance, where you can dance and share a range of special liquors (rice wine) with the locals. Overnight in a house-on-stilts of the Thai people.\n\nSummary:"},{"title":"Day 2: Mai Chau motorbike tour to Tan Ky (Nghe An)","description":"Ride on a small, spectacular and paved trail along the Ma river until Cam Thuy town where we stop for lunch. Hit the Ho Chi Minh trail (now a newly built highway) all the way to Tan Ky town where we spend the night in a hotel.\nSummary"},{"title":"Day 3: Tan Ky motorbike tour to Phong Nha (Quang Binh)","description":"Ride on Ho Chi Minh Highway until Pho Chau where we stop to visit the HCM Trail victory monument which is in fact the real starting point of our HCM Trail ride. Motorcycle all the way to Phong Nha – Ke Bang, the biggest and also the most beautiful cave in Vietnam and Indochina and is now a UNESCO World Natural Heritage site. The karst formation of Phong Nha-Ke Bang National Park has evolved since the Paleozoic (some 400 million years ago) and so is the oldest major karst area in Asia.\nSubject to massive tectonic changes, the park’s karst landscape is extremely complex with many geographic features of considerable significance. The vast area, extending to the border of the Lao People’s Democratic Republic, contains spectacular formations including 65 km of caves and underground rivers.\n\nSummary"},{"title":"Day 4: Phong Nha motorbike tour to Khe Sanh in Quang Tri (Roughly 250 Km – 7 hours of riding)","description":"Continuing west on highway 9, we will climb into the Truong Son foothills, pass the Rock Pile and stop at some villages and beautiful natural springs and waterfalls near the highway.Boating and exploring World Heritage site of Phong Nha where local civilians and military sheltered from incessant bombing during wartime. Then after having lunch, we will keep riding on Ho Chi Minh Trail and have short stop at Truong Son cemetary to pay respects to the soldiers who fought and died on the trail during the American War.\n\nApprox 5pm we arrive in Khe Sanh which was established as a forward base by General Westmoreland near Laos to secure highway 9.\nCheck in to hotel, free time at night\n\nSummary"},{"title":"Day 5: Quang Tri Motorcycle Tours to DMZ & Vinh Moc Tunnels – Motorbike Tours to Hue (200 Km – 6 hours of riding)","description":"In this morning, we ride along highway 1 to Quang Tri town, visiting Long Hung Church and Quang Tri Old Citadel which was a battlefield in 1972 between North and South Vietnam for 81 days and nights. We ride along the coast from Cua Viet Beach to Cua Tung Beach a long stretch of beautiful and peaceful coastline.\n\nNext we visit the Vinh Moc tunnels and explore the Demilitarised Zone, stopping for lunch at the Doc Mieu Firebase. And then wee will keep on riding on Ho Chi Minh Trail via Dong Ha town, where we will stop by to take a look at Dong Ha market known as one of the most hassle and bustle markets in Central. Later on, we will ride directly to Hue and en route, our guide will stop by to show you more war relics before reaching Hue\nUpon arrival in Hue, if time permits, we will take a ride to visit Imperial Citadel and one of Royal Tombs then enjoy sunset on the bank of Perfume River. Check in to hotel, free time at night\n\nSummary"},{"title":"Day 6: Hue Motorcycle Tour to Hoi An","description":"Today, we’ll have an easy motorbike trip to weave around the city to visit some more royal tombs as well as other important travel sites & relics in Hue.\nIn this afternoon, we will keep on riding along the coastal line via Hai Van Pass, where we could look down from the top to view the splendid beauties of Lang Co beach and ocean then time to refresh yourself by a cup of coffee. You will take time to visit Marble Mountains before heading straight to Hoi An via Da Nang coastline for a check-in. Free time on your own. Overnight at hotel in Hoi An\nSummary\n\n"},{"title":"Day 7: Hoi An city tour & My Son tour by motorbike","description":"Today, after having breakfast at hotel you’ll keep jumping on your bikes to ride to explore Vietnam’s most evocative Cham site, My Son, lies 40km southwest of Hoi An, in a bowl of lush wooden hills towered over by the aptly named “Cat’s Tooth Mountain”. It has been recently added to UNESCO’s World Heritage List and richly deserves its place on the tourist map. It is the former capital of the ancient Cham civilization that ruled Central Vietnam from the second to the thirteenth century.\n\nTheir religion was primarily derived from Indian Hinduism. My Son is considered to be one of the best-preserved Cham structures in Vietnam.  It is comprised of seventy Hindu-like towers and temples dating from the second century. This site is  a Must-See for those people who are interested in architecture and ancient civilizations. We return to the hotel around noon.\n\nToday, after having lunch  you’ll be taken to walk inside the old quarters of Hoi An to explore timeless beauties of monuments, relics like the ancient houses, pagodas, temples, markets…to understand more about the history of this fascinating ancient town as well as the lifestyle of the locals.\nIn the afternoon, you’ll be free on your own to laze on the beach. Overnight at hotel in Hoi An\n\nSummary"},{"title":"Day 8: Hoi An Motorbike Tour to Quy Nhon","description":"Later on, we’ll keep riding along the coastline through coconuts homeland of central Vietnam & through rice fields and rural villages and mountainous area to get to city of Qui Nhon. Continue cycling to the hotel in the town of Quang Ngai. Have breakfast at the hotel and check out. We then will ride our bikes south of Hoi An to Cua Dai beach and cross Thu Bon river. Ride on back roads through yellow sand dunes to Tam Ky. Have lunch before we keep riding on country roads to My Lai village to visit the memorial of the massacre to remember 504 locals who died.\nSummary"},{"title":"Day 9: Quy Nhon Motorbike Tour to Nha Trang","description":"Transfer 30 minutes to the suburb of Qui Nhon city then we’ll start riding along the coast and you could also race along a railway through hills to La Hai, have lunch on the way.\nAfter having lunch, we’ll take a rest a bit before riding straight to Nha Trang. Upon getting to Nha Trang, you’ll be helped to get checked in\n\nSummary"},{"title":"Day 10: Nha Trang Motorbike Tour for Sightseeing","description":"08h30: Pick up at hotel & ride to the Institute of Oceanography built at the beginning of 20th Century by French, where is exhibiting many oceanic creatures considered to be the most diversified & sufficient in Vietnam.\n\n10h00: Visit Bao Dai King’s Villa – the place for rest & recreation for Bao Dai King when he was alive. That villa was built on a top of hill surrounded by beautiful sceneries.\n\n11h00: Visit Yersin museum, where you will understand more about the life & career & researches of Doctor Yersin. He is the most well-known doctor in the world, who ever lived & died in Nha Trang.\n\n12h00: Have lunch & short break.\n\n14h30: Keep on visiting Long Son Pagoda, Ponagar Towers & shopping at Dam market.\n\n17h00: back to hotel.\nRest of time, you’ll be free on your own.\n\nSummary\n\n"},{"title":"Day 11: Nha Trang Motorbike Tour to Mui Ne","description":"After swim in the morning sunlight on the beach, we’ll say goodbye to Nha Trang to depart for Mui Ne on the amazing coastal road, passing over Ca Na Beach (One of the famous beaches in Vietnam). Right here, we’ll stop for a while to take a bath & photos before riding straight to Mui Ne.\nUpon reaching to Mui Ne, you’ll get rooms for a check-in.\nThe rest of time, you’ll be free by yourself to relax at hotel or on the beach.\nSummary:"},{"title":"Day 12: Mui Ne Motorbike Tour to Saigon","description":"Morning, after breakfast & check out, we will leave beautiful Mui Ne Cape to ride straight to Saigon.\nUpon getting to your hotel in Saigon, we’ll help you check in then say goodbye to all of you.\nSummary:"}]},{"name":"Vietnam Northwest Adventure Tour to Mai Chau, Sapa, Dien Bien Phu, Halong Bay","duration":12,"travelStyle":["Adventure","Private","Partially Guided","Holiday"],"oldPrice":0,"price":2118,"summary":"The interesting culture of many hill tribe groups and the breathtaking mountain scenery of the north are all presented on this adventure. The journey from Dien Bien to Sapa is quite hard, especially in the wet season. But it is a great chance to explore the remote area and many colorful markets…","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130197_7b3797e0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130197_7b3797e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_6af88eb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_21ac3ce0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_2a1f1b90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_703b58d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_9faefb74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_ddd34867.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_25ea1fc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_5995e6ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_75b5a2ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_ffb11752.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_40983cfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_621bf041.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_71936387.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_24cf2baf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_1779bf13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130197_3abe2a72.jpg"],"destinations":["Hanoi","Mai Chau","Sapa","Halong Bay"],"timeline":[{"title":"Day 1: Arrival – Hanoi","description":"On arrival at Noi Bai International Airport, you will be welcomed by your guide and driver who will bring you to your hotel in Hanoi City to rest up for the tour ahead. Hanoi is over 1000 years old and is currently the capital of Vietnam, as well the commercial, political, and cultural heart of the country.\n\nO/N in Ha Noi. "},{"title":"Day 2: Hanoi Full-Day City GROUP Tour (Seat-in-Coach)","description":"7:45 – 8:15 The tour guide will come and pick you in the hotel lobby, then transferred you to Ho Chi Minh Mausoleum to explore the architectural and historical aspects of Uncle Ho’s final resting-place. Keep moving to Ho Chi Minh’s stilt house which is located to one side of the Mausoleum, and having a look at the One Pillar Pagoda, which was founded by King Ly Thai To in 1049 – the structure has become an important symbol for the people of Hanoi.\n\nSay goodbye to Ho Chi Minh complex, the tour guide will lead you to visit the Buddhist Tran Quoc Pagoda at West Lake (One of the oldest pagodas in Vietnam). Then visit Bat Trang ceramic village (applied on Mon, Wed & Fri).\n\n12:00 Lunch at local restaurant (Vegetarians can be catered for if a prior notice is given at booking time).\n13:30 After lunch, you will keep continuing the tour with visiting the Ethnology Museum (apply on Sun, Tue, Thu & Sat) or the Literature Temple and Quoc Tu Giam – as known as the Vietnam’s first university. The tour will be enclosed by visiting the beauty of Hoan Kiem Lake with Ngoc Son temple and strolling in the small alley streets of the Old Quarter where you can have a chance for shopping and for being a traffic challenge when you cross the road.\n15h30 – 16h00 Ends one day Hanoi city tour."},{"title":"Day 3: Hanoi Tour to Duong Lam Ancient Village – Mai Chau Valley","description":"In the morning, we travel overland from Hanoi to Duong Lam village, a purely agricultural village of the Northern Red River Delta where many hundred-year-old houses are still well preserved. It will be your unique experience as you walk along tiny ancient alleys; visit a Communal House in Mong Phu hamlet – the only hamlet whose original village entrance gate remains intact.\n\nYou’ll also leisurely bike around the village while interacting with the locals in their ancient houses. After that, we continue to visit Mia Pagoda, which was built in the 15th century where you’ll admire 287 statues of all sizes. Then visit Ngo Quyen temple and Phung Hung temple, places dedicated to two national heroes Ngo Quyen and Phung Hung. Lastly, we will go back a local family to enjoy your special lunch with Vietnamese foods in an ancient house.\nAt around 14:00, we will keep heading to Mai Chau, the beautiful gateway to the mountainous area of northern Vietnam. The scenic drive offers an excellent opportunity to observe rural Vietnam up-close. The valley of Mai Chau is inhabited by a community of the Thai minority group while the upper lands of Mai Chau are inhabited by the H’mong minority group.\n\nOn arrival at Mai Hich village, take a short break. Unlike the other well-known tourist destinations, Mai Hich is the newly discovered village, a harmonial combination between human being and the nature. Dinner tonight will be hosted by a family followed by a local traditional dance show.\n\nO/N at house on stilts in Mai Hich remote village.  "},{"title":"Day 4: Mai Chau Trekking Tour to Son La","description":"This morning we are going to have a short trekking journey (or bike tour) to some of remote villages of Thai People inhabiting in Mai Chau valley to have your deep insight into the way the locals live. The journey northwest begins as we depart from Mai Chau and pass through the undulating terrains of tea plantations, terraced rice fields and sleepy villages linked to the road which is the main artery of trade between the northwestern region and the capital city.\nThis is our first glimpse of rural Vietnam and sets the tone for the days ahead. En route we have several stops to stretch our legs and visit some roadside villages. The thrilling drive will deliver us in Son La by mid or late afternoon depending on road and traffic conditions. We check in hotel and enjoy a short walk around this mountain town. There is a little traffic on roads and many Black Thai in traditional costume scurry in all directions.  O/N in Son La. "},{"title":"Day 5: Son La Tour to Dien Bien Phu","description":"The provincial museum and the top hill old prison are some of major sights in Son La Town. We include these in a short morning tour before we wind our way past the stunning mountain scenery. The road conditions are very poor therefore we need to bring along our spirit of adventure until Dien Bien Phu, the site of the decisive battle in Vietnam’s struggle for independence in 1954.\nOnce reaching Dien Dien Phu we drive around to see this fast growing town and make stop at Dien Bien Phu museum which details the event in place. We follow it with a visit to the strategic hill A1 and the old battle field where the lush vegetation grows behind many war relics including old French tanks and artillery pieces. \n\nO/N in Dien Bien Phu  "},{"title":"Day 6: Dien Bien Phu Tour to Tam Duong","description":"Heading out of Dien Phu Phu Town, we spend a full day travelling into Vietnam’s most mountainous region. The roads are difficult at times, but the spectacular landscape with a mixture of terraced fields and colorful local population makes the hardship all worthwhile. Along the way we encounter the mountaineers going about their daily business.\n\nThese local villagers are almost the Red Hmong, Kho Mu, Mang, Dao people who still retain their age old cultural traditions and wear distinctive costumes. We arrive in Tam Duong by late afternoon and may have time strolling around. This small hill town is surrounded by the breathtaking mountain backdrop and frequently visited by the ethnic minority people.\n\nO/N in Tam Duong."},{"title":"Day 7: Tam Duong Adventure Tour to Sapa","description":"The breathtaking north scenery is unequalled although the conditions are very basic. Today we continue driving along a zigzag route to Sapa. The road conditions is very poor in some places but it is still a wonderful trip for photograph hunters as we pass though the various scenic water falls, charming villages and rolling mountains.\nThe hill station of Sa Pa was founded in early last century and rapidly became an ideal place for anyone seeking an enjoyable escape from the unbearable heat in plains. At an elevation of 1,500 meters, it has some warm days and cool evenings. Today we can soak up the fresh climate as much as you want by spending the time to wander around and catch the first look of Sa Pa. The ethnic minority people are frequently seen in this hill town by their distinctive dress and they purchase their own textiles, handicraft as small vendors along the streets.  \n\nO/N in Sa Pa. "},{"title":"Day 8: Sapa Adventure & Trekking Tour to villages","description":"Today, we’ll start a bit later to pick up the best time when the sun arise for the clear vision & best photos.  Different from the other tour operators, DNG leads your trip out of crowd to the less visited places.\n\nAt around 09:00 am, DNQ local guide and driver will pick you up for a short road transfer heading northwards of Sapa along national road 4C to O Quy Ho with several stops for magnificent landscapes of Fansipan, Sin Chai valley and especially amazing flower and vegetable farms.\n\nThen turn right to follow a narrow road for half an hour getting through the wild region with thick rain forest covering walled-up mountains, passing several waterfalls before arriving to Ban Khoang, a village of the Red Zao ethnic peoples who live their unique way of life and well maintain their traditional values. The village looks prosperous thanks to the combination of wet rice cultivation on the terraced fields with cardamom farming under the shade of trees in thick forest. Spend over an hour walking to explore this remote village for a brief understanding of local life\nLeaving Ban Khoang and process along the road for about 10km to Ta Giang Phin valley inhabited by the Black Hmong who live in some small villages scattering along a peaceful stream. This valley is quiet and non- touristic. It’s totally different from Ta Phin or Muong Hoa valleys where the local peoples have changed much due to the strong influence of tourism.\n\nEnjoy your lunch break on the bank of a stream. As we walk through these villages nestled in the valleys below, we’ll witness daily activities of local life such as plough and harrow the fields, growing, harvesting or doing some house work. In the leisure months, men often gather to build new houses or repair parts of old ones while women stay at home making their traditional costumes. Interaction with them is very much encouraged.\n\nBack to Sapa later and the rest of the day is at your leisure. O/N in Sapa."},{"title":"Day 9: Sapa Tour to Bac Ha – Night Train to Hanoi","description":"This morning we journey through the beautiful mountainous road to one of the many hill tribe markets in the neighborhoods of Sapa. At the market we’ll see a number of ethnic minority people. They come to the market for not only trading but also a drink of local wines, socialization, making friends… \n\nIn the afternoon, continue to trek through some villages of hill tribe people that you met on the market. We will learn about their daily life, say hello to local children and enjoy the nice view along the trail  Then, board a boat downstream Chay River and visit other villages along the way, discover the local people life.\n\nTransfer to Lao Cai Railways Station for overnight train back to Hanoi. O/N on board.\n\nNOTE: There’re hill tribe markets on Sunday, Tuesday, Thursday, and Saturday\n\nOption 1: Bac Ha & Muong Khuong Market on Sunday\n\nOption 2: Coc Ly Market on Tuesday\n\nOption 3: Lung Khau Nhin Market on Friday\n\nOption 4: Can Cau Market on Saturday\n\nOption 5: Cao Son market on Thursday "},{"title":"Day 10: Hanoi – GROUP TOUR to Halong Bay – Overnight on cruise","description":"We’re back in Hanoi early this morning, met and transferred to a three-star hotel for shower and breakfast. Afterwards, we journey east to Vietnam’s greatest natural wonder, Halong Bay. We’ll board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Kayaks are also available if specified at time of booking. Spend the night on our luxurious boat.\n"},{"title":"Day 11: Halong Bay – Hanoi","description":"Enjoy the aquamarine waters of the Ha Long Bay at its best, as the boat continues to cruise quietly through spectacular limestone formations. Disembark from the junk at noon and return to Hanoi. Check in and enjoy the rest of the day free at leisure.\n\nO/N in Ha Noi."},{"title":"Day 12: Hanoi – Departure","description":"At leisure until transfer to Noi Bai Airport for departure flight (check out hotel before 12h00)"}]},{"name":"3-Day Overnight Cruise in Ha Long Bay and Hotel in Cat Ba Island","duration":3,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":248,"summary":"Explore Halong Bay and Cat Ba Island on this 3-day tour from Hanoi. Enjoy 1-night overnight accommodation on a deluxe boat and 1-night in a hotel in Cat Ba Island. Relax as you cruise along the beautiful Ha Long Bay and enjoy a range of activities enjoy campfires and see the monkeys on Cat Ba Island.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/157967_27a81be9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/157967_27a81be9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_8622e261.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_37b5d43a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_2f021bce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_4389e54d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_6ea428b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_0294b38e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_ee296431.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_04f65521.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_613dc767.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_d035a7fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/157967_21cc05fa.jpg"],"destinations":["Hanoi","Halong Bay","Cat Ba Island"],"timeline":[{"title":"DAY 1: HANOI – HA LONG BAY – LAN HA BAY (L/D)","description":"08:30am: Hotel or private address pick up with our shuttle bus. Short break half\nway.\n12:00pm: Arrive Got Ferry Terminal, transfer by tender to Cruise, and\nenjoy welcome drinks, receive cruise briefing, safety instructions then check in\nyour cabin and set sail throung Ha Long Bay while having time to admire the\nmagical landscape go by. The Cruise Pass Da Chong Islet, where you can see a\nlighthouse build by the French over 100 years ago.\n13:00pm: A special lunch in Vietnamese cuisine of fresh seafood and an\nassortment of appetizing favorites are served while sailing through Islets of Con\nVit and Gia Luan.\n16:00pm: The Cruise sails through Lan Ha Bay and completes its entry through\nCua Van Are. The area is surrounding of extraordinary limestore karsts\nlandscapes.\n- From October to May: You can start your journey to explore Ba Trai Dao\nBeach, enjoy kayaking and/or enjoy swimming in the crystal clear waters of\nthe Bay.\n- From June to September: We progress to Ong Cam area of Lan Ha Bay – a\nseparate part of Ha Long Bay. This is a quiet tourist paradise in Vietnam,\nenjoy kayaking and/or enjoy swimming in the crystal clear waters of the Bay.\n17:30pm: Back to Cruise, drop anchor for staying overnight. Enjoy the\ncomplimentary sunset party on the sundeck with local wine and fresh fruits.\n19:00pm: Dinner is served in the restaurant. Enjoy delicious local food\nprepared and served for you by our wonderful onboard catering staff.\n21:30pm: Retire to your cabin or join the fishing excursion, watch a movie, have\na drink at the bar, internet accsess or play exciting games."},{"title":"DAY 02: HA LONG BAY – DARK AND BRIGHT CAVE – CAT BA ISLAND (B,L,D)","description":"06:00am: Enjoy sunrise and admire the never ending miraculous cenery of the\nBay. Practice an invigorating Tai Chi session on the sundeck.\n07:00am: Light breakfast, coffee and tea.\n08:00am: Visit Dark & Bright Cave and islets by kayaking which is a wild and\nmysterious beauty in the middle of the World Heritage.\n09:00am: Back to our boat, relax before checking out your cabin.\n09:30am: Our daily boat pick you up at Cruise sailing Lan Ha Bay to\nViet HaI Wharf. From Viet Hai Wharf we will hop on bicycles for a 1,5 hour ride\nthrough pictureque trails straight to Viet Hai Village.\n12:00pm: Lunch will be served on daily boat in Lan Ha Bay.\n12:45pm: Visit the Vai Boi area, which is the heart of Lan Ha Bay, there are a\nlot of white sandy and coral beach for swimming, kayaking or rest and relax on\nthe beach.\n14:00pm: Daily boat will be drop off guest to Cat Ba Island Wharf (Beo\nHarbor) and proceed to Cat Ba Hotel via local transportation.\nCheck in Cat Ba Hotel upon arrival in Cat Ba town.\nFree time after checking in to explore Cat Ba town."},{"title":"DAY 3: CAT BA ISLAND – LAN HA BAY – HA LONG BAY – HA NOI (B/L)","description":"07:00am: Have breakfast and check out of the Cat Ba hotel. The bus will take\nyou to Beo Harbor.\n07:45am: Get on a daily trip boat and cruise back to Cruise. On the way\nback you will see a fishing village filled with fishermen in Lan Ha Bay.\n10:00am: Join cooking class demonstration (teaching you how to make our\nspecia;ity, Spring rolls) on the cruise.\n10:45am: Lunch is served on board\n12:00pm: Disembark at the Got Ferry Terminal by tender. Take our shuttle bus\nto return to Hanoi.\n16:00pm: Arrival back at your hotel or home."}]},{"name":"Excellent Hoa Lu - Tam Coc 1 Day plus Mai Chau Valley 1 Night","duration":3,"travelStyle":["Sightseeing","Custom","Group","Partially Guided","Holiday"],"oldPrice":0,"price":155,"summary":"Hoa Lu: the remains are the temples dedicated to King Dinh and King Le, the two heroes who lived in 10th century and chose Hoa Lu to build the citadel of the capital city ( from 968 to 1009)\nTam Coc: means three caves – considered as Halong Bay on land, sitting on a boat rowed by local lady in Hoang Long river and see the first limestone mountains, which will run along their river way for several kilometers.\nMai Chau: Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95680_af5adddd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95680_af5adddd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_5763a62c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_0650a91c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_73e26c04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_3c14b7ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_feeb9499.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_876911eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_90bbb2ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_1ebb9b8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_85f64115.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_71cf04cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_5d117ad9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_27704f2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_05535fb0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_c3d64871.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_46c11fdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_cf4892d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_23d5305e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_be97e445.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95680_88058c32.jpg"],"destinations":["Hanoi","Ninh Binh","Mai Chau"],"timeline":[{"title":"Day 1: Hoa Lu - Tam Coc full day tour (L)","description":"Trip starts at 8:00 am from your hotel lobby for Ninh Binh province, which owns Hoa Lu and Tam Coc as the most favorite sightseeing of tourists from all over the world.</p><p>About 10:30 am, you will arrive at Hoa Lu Ancient Capital. In 968, Dinh Bo Linh declared himself as the King. Since then Hoa Lu existed as the capital for the next 41 years (968 – 1009), of which 12 years was under the Dinh dynasty – King Dinh Tien Hoang, the country named Dai Co Viet, and 29 years later was under the Le dynasty – King Le Dai Hanh. In 1010, King Ly Thai To moved the capital from Hoa Lu to Thang Long – present day Hanoi. Hoa Lu became the old citadel. In Hoa Lu there are now 2 temples have been built on the ground of the old royal palace, one is dedicated to King Dinh Tien Hoang, the other is to King Le Dai Hanh. The visit offers a chance to know more about part of feudal dynasties and historical periods in Vietnamese history.</p><p>11:30 am leave Hoa Lu to Tam Coc at around 12:00pm. Having lunch in Tam Coc in a local restaurant and enjoy lunch served with goat meat which is famous as the local specialty.</p><p>1:30 pm, 5 minute-walk to the boat station and start the 2hour-boat trip to visit Tam Coc. Known as “Halong Bay on land”, Tam Coc are three limestone caves stretching along Ngo Dong river. The boat trip is a nice journey along the river with peaceful scenery of Limestone Mountains, rice paddy and the site of some temples along the way from Hang Ca (first cave) to Hang Hai (second cave) and Hang Ba (third cave).\n4:00pm: Leave Tam Coc and drive back to Hanoi. Arrive your hotel in Hanoi at 6:00pm.\nHotel accommodation in Hanoi arranged by your own."},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTrip ends at your hotel in Hanoi. Good bye and see you again!"}]}]