[{"name":"Mekong Delta explorer on bike","duration":3,"travelStyle":["Bicycle","Group","Partially Guided","Holiday"],"oldPrice":0,"price":359,"summary":"Cycle through the real village paths in the Mekong delta, Enjoy your conversations with the local framers, Experience a night home stay on the Binh Hoa Phuoc island, See the lively floating markets, Maximize your flexibility on this biking trip, Admire the mighty Mekong Delta scenery.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146976_54799dfa.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146976_54799dfa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146976_2ba88b27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146976_f8115c84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146976_6f60bd98.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146976_3954cd45.jpg"],"destinations":["Ho Chi Minh City","Can Tho"],"timeline":[{"title":"Ho Chi Minh - Mekong Delta (Lunch)","description":"At 8.00am, Pick up at your hotel in Ho Chi Minh (to be advised). Transfer to Tan An by support van with your cycling tour guide. Start your day by cycling through the peaceful villages, rice fields and orchards. See how the water buffalos and ducks live harmoniously together,in the same rivers. Lunch en route. Keep cycling to Cai Be and take a boat ride across the Mekong River to experience the charms of Binh Hoa Phuoc village. Restore your energy levels with a splendid dinner full of delectable local dishes. Overnight in Cai Be Mekong Lodge"},{"title":"Mekong on Bike (Lunch)","description":"After breakfast, start your day with an early morning bike ride on the island, giving you a great opportunity to meet the local villagers and farmers. Then head for Cantho, stopping on the way to experience the daily life of the Mekong Delta inhabitants. Overnight at your chosen hotel in Cantho at Ninh Kieu 2 or similar"},{"title":"Mekong Delta and Departure (Lunch)","description":"Breakfast at the hotel. Take a two-hour boat trip to visit the Cai Rang and Phong Dien floating markets. Wander into the villages to visit the rice paper mill and the rice noodle making factory. Learn how to cross the “Monkey Bridge” which is made from a single bamboo. Continue cycling through the villages to enjoy the beautiful rural scenery. After lunch, take the support van back to Ho Chi Minh City. End of services.Finish your services"}]},{"name":"Inside Vietnam","duration":14,"travelStyle":["Discovery","Group","Fully Guided"],"oldPrice":0,"price":1720,"summary":"Traveling along 2,000 miles of coastline we experience spectacular landscapes, try fresh and tasty local food, explore UNESCO-listed towns and learn about the ancient and modern history on this epic journey across Vietnam.   Hanoi - Wander through the bustling narrow streets of the Old Quarter   Hue - Explore the magnificent Imperial Citadel and cruise along the Perfume River   Mekong Delta - Take a sampan along palm-lined canals and barter for exotic fruit.","highlights":["Experience spectacular coastal scenery","Visit historic towns and war memorials","Enjoy a cruise in Halong Bay","Explore the ancient sea port of Hoi An"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124945_eb7aa73a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124945_eb7aa73a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_433851ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_c4cae810.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_c3a1242d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_a4467217.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_1ae43cbb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_4f3028cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_b6431c28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_58e6adc6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_c08cb079.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_c0a35384.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_72f9bb0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_fcfbcb1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_9e922393.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_936fd76f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_7ce079ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_68178603.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_aa3672fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_31bbd795.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_b8860c5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_2ee72c3f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_47077d8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_5ec61914.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124945_c9b37e13.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Join tour in Hanoi","description":"Arrive in Vietnam's capital which is famous for its rich culture, bustling life and colonial influences on their centuries-old architecture.  Little lakes dotted around the city are encased by busy streets and secret alleyways, which are waiting to be explored.    \n \n For those arriving on time our Leader plans to meet you in the hotel reception at 6pm for the welcome meeting and for those that wish, there is the chance to go out for dinner. There are no other activities planned today, so you are free to arrive in Hanoi at any time. If you would like to receive a complimentary airport transfer today, you'll need to arrive into Noi Bai International Airport (HAN), which is only a 45 minute drive to the hotel. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk.  \n \n If your flight arrives earlier in the day, perhaps you might choose to take a stroll through the narrow lanes of the Old Quarter, or perhaps enjoy a gentle walk around Hoan Kiem Lake."},{"title":"Day 2: Discover the sights of Hanoi including the Old Quarter","description":"This morning we make a tour of the main sights of Hanoi. Architecturally styled like a French provincial town with tree-lined boulevards and substantial low-built houses the city is wonderfully nostalgic. Among the interesting sights are the charming One-Pillar Pagoda, Confucius Temple and the Presidential Palace. Ho Chi Minh himself, a spartan-living and scholarly man, chose not to live in the Presidential Palace; he preferred instead a simple teak stilt-house specially built for him in the grounds. This afternoon we walk through the narrow lanes of the fascinating Old Quarter, where the streets are named after various crafts or specialties: Paper Street, Silk Street, Basket Street and so on. The shops themselves have very narrow frontages but are actually quite deep; they are known locally as tube shops. On the pavements food sellers sell noodles, snacks and stir-fries from shoulder panniers. The smell of food mixes with the smell of incense from small temples dotted around."},{"title":"Day 3: Free time in Hanoi, then drive to Halong Bay","description":"We have some free time in Hanoi this morning perhaps to visit some of the many museums or Ho Chi Minh's austere mausoleum, which resembles Lenin's in Moscow. Afterwards we drive out towards the iconic Halong Bay in the Gulf of Tonkin. Thousands of jagged limestone islands rise out of the jade green waters like the hairy scales of a submerged dragon. In fact Halong means: 'Where the dragon descends to the sea'. As legend has it the rugged seascape was created by the pounding tail of a dragon as he ran from the mountains into the sea, carving the islands in his wake."},{"title":"Day 4: Cruise Halong Bay; from Hanoi overnight train to Hué","description":"This morning we enjoy the romantic scenery of Halong Bay on a cruise amongst the islands. We'll have the chance to stop at a grotto beneath towering cliffs and perhaps visit a beach. It is interesting to see the curious assortment of tourist boats, traditional junks and wooden sampans gliding through the waters. We enjoy a seafood lunch on board the boat, before returning to a hotel in Hanoi to freshen up before boarding the Reunification Express to Hué."},{"title":"Day 5: In Hué; boat along Perfume River to Thien Mu Pagoda","description":"We arrive in Hué, one of the great cultural and religious centres of Vietnam, a quietly impressive place. The Perfume River divides the city in two and has been the inspiration for poets and painters for many centuries. This afternoon we to take a trip by boat along the Perfume River from Hué to the Thien Mu Pagoda. This serene temple is the oldest in Hué and also the symbol of the city."},{"title":"Day 6: In Hué, visit the Imperial Citadel; free afternoon","description":"This morning we appreciate Hué's fascinating history with a visit to the Imperial Citadel. Located on the left bank is the river, this palace was built by the Nguyen dynasty, Vietnam's ruling emperors from the early 1800s to 1945. The Citadel has formal moats and impressive ramparts that were constructed by 20,000 men and was a copy of the Forbidden City in Beijing. Although most of the inner part of the city was totally destroyed during the month-long Tet Offensive in 1968, the vast outer walls and the west wing remain an eloquent reminder of the palace's former glory. The remainder of the day is free to perhaps explore some of the outlying Tombs of the Emperors."},{"title":"Day 7: Scenic drive via Danang to Hoi An","description":"Early this morning there is the option to drive out to the peaceful setting of Tu Hieu Pagoda, nestled in a pine forest a short distance outside the city. Here we can witness the morning chanting before taking part in a meditation lesson led by the head monk. The monk will explain how meditation is central to Buddhism, promoting peace of mind and a healthy mental balance. He will then lead a meditation session for us in the quiet back-corner of the temple. We return to Hue for breakfast, before driving on to Hoi An. \n We enjoy a scenic drive across the spectacular Col des Nuages, otherwise known as the Hai Van Pass observing rural scenes of thatched, wooden houses and lime-green rice paddies as well as enjoying panoramic sea views. Pausing in Danang, once the centre of the Kingdom of Champa (2nd century AD - 1720) we visit the Cham Museum, home to a fine collection of Cham sculptures. Our next stop is at the nearby five peaks of the Marble Mountains, said to represent the five elements of water, wood, fire, gold and earth. Naturally formed grottoes have been transformed into heavily carved Buddhist sanctuaries. A short distance from the mountains we find the white sands of My Khe Beach (nicknamed China Beach by American troops)- an ideal spot for a brief rest. Finally we reach our destination - the UNESCO World Heritage town of Hoi An."},{"title":"Day 8: Free day to explore Hoi An; optional visit to My Lai","description":"The historic, merchant town of Hoi An had become one of the busiest international trading ports of Southeast Asia by the 17th and 18th centuries. First colonised by the Portuguese in the 16th century it still retains its medieval charm today, with many of its old buildings superbly preserved. The day is free to explore at leisure. You may choose to visit the Japanese Bridge or some of the Chinese temples and meeting halls in the Old Town. There are many shops, bars and restaurants in this charming town and it is a great place to buy souvenirs, have clothing tailored or simply watch the world go by in a riverside café. You may wish to take an optional excursion out to the site of the My Lai village massacre memorial. The massacre was a significant turning point in the American War and the horrific story is told through a very emotive exhibition of photography.\n Another option would be to take a fishing trip out to the Thu Bon River Delta, where we learn how to fish using a traditional cast net. Travelling out by boat we meet local fisherman and try our hand at cast net fishing as well as trying the bamboo winches used to haul in the huge drop nets from the river. We also have a chance to go out in a Vietnamese 'basket boat' - a circular boat constructed from bamboo that takes a little practice to row!"},{"title":"Day 9: Visit to ancient My Son; free afternoon in Hoi An","description":"A further day is spent based in this lovely historic town. This morning we take an excursion to the holiest and most evocative of Vietnam's Cham sites, My Son. The Chams were dynastic lords who rejected the authority of China in 2AD and established their own kingdom. Although they benefited from strong sea links with the rest of Southeast Asia the kingdom's interior could not supply sufficient food for a strong military force. For 1000 years they managed to stave off attacks by the Vietnamese and Chinese, before being overcome by the Vietnamese in the 15th century. The track that leads to the site is slow and bumpy through wooded hills, but the site is certainly impressive with several groupings of Cham temples to be visited. Nowhere are the fine masonry skills of the Chams more evident than at My Son, despite the fact that much of the site was bombed in the 1960s. The afternoon is free to enjoy Hoi An further. A cookery class at one of Hoi An's restaurants is a popular choice, as is the lantern-making workshop where you can learn how to make the beautiful lanterns that are ubiquitous in Hoi An. The beach is only a short drive by taxi alternatively a boat trip on the river as the late afternoon sun lights up the riverfront is a treat."},{"title":"Day 10: Fly to Ho Chi Minh City; drive to Mekong Delta","description":"After a short drive to Danang Airport we fly to Ho Chi Minh City, from where we drive further south to Ben Tre in the Mekong Delta. Surrounded with lush and fertile land the area is home to small villages and swaying coconut palms. We take a local ferry to a nearby village, which we explore by trishaw. Later we board sampans, which are small Chinese wooden boats, and cruise along the narrow canals that shoot of the main vein of the Mekong River. After lunch at a local house we have some free time to explore the area further. Finally we return to Ben Tre by boat where we spend the night in a local homestay, with shared facilities and dorm-style accommodation."},{"title":"Day 11: Mekong Delta cruise, then drive to Ho Chi Minh City","description":"We spend the morning exploring the canals of the Mekong Delta, meeting some hard working locals, perhaps with time to see coconut processing and trading. We also have options to walk or cycle along the canal to explore further. Later on we drive back to Ho Chi Minh City."},{"title":"Day 12: In Ho Chi Minh City; explore Old Saigon, and discover 'Secret Weapons Bunker'","description":"This morning we walk around the central sights of Old Saigon, now District 1 of Ho Chi Minh City. We see the Notre Dame Cathedral and the GPO building as well as some of the old French Colonial hotels such as The Rex. We then drive to the Independence Palace (renamed the Reunification Hall) and the graphic War Remnants Museum. \n This afternoon we will experience a different side of Ho Chi Minh City, away from the major sights where we take a walk through Old Saigon's back alleys. We make our way to District 3 and turn off the main thoroughfare and into the maze of narrow streets of this bustling district. Our walk takes us past ramshackle shopfronts, through local markets selling anything from colourful fruit to bootleg DVDs, and past houses, churches and schools, all squeezed into the small buildings that line the narrow alleys. It's a fascinating inter-connected community here that is a stones-throw from the city centre, yet feels a far cry from the modern buildings and throngs of tourists. We stop at a local stall for a traditional Vietnamese coffee (brewed coffee served sweet with condensed milk) where we can also sample 'Banh Mi' - a Vietnamese take on the humble French baguette - freshly baked and packed with a combo of traditional and more exotic, aromatic ingredients.  \n The walk ends the so-called 'secret weapons' bunker'. A small unassuming 'tube house' nestled in a quiet neighbourhood hides a trap door in the floor, concealing a basement stocked full of rifles, grenades and ammunition. The bunker played a key role in the TET Offensive of 1968, it was the base from which the Viet Cong's \"Team 5\" launched their assault, and its location was only revealed after the end of the war. We have some time to explore the house and bunker, filled with decommissioned weapons and photographs, news clippings and memorabilia from the wartime."},{"title":"Day 13: From Ho Chi Minh City, visit Cu Chi Tunnels","description":"This morning we take a short drive out of the city to the infamous Cu Chi Tunnels, which formed an incredible underground command base for 10,000 Viet Cong troops and were a major part of the 1968 Tet Offensive. The site is a fascinating insight into the resourcefulness of the Vietnamese. There is the opportunity to crawl through a small specially adapted section of the tunnels should you wish to sample the claustrophobic conditions in which the Viet Cong lived. Returning to Ho Chi Minh City the remainder of the afternoon is free."},{"title":"Day 14: Tour ends in Ho Chi Minh City","description":"The trip ends after breakfast at our hotel in Ho Chi Minh City.\n \n There are no activities planned today, so you are free to depart from Ho Chi Minh City at any time. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you'll need to depart from Tan Son Nhat International Airport (SGN), which is 20 minutes from the airport.  \n \n If you have time you may wish to pick up some last minute bargains at one of the city's markets."}]},{"name":"VNA008 - 15days Vietnam Beach Holiday","duration":15,"travelStyle":["Beach","Independent","Partially Guided","Holiday"],"oldPrice":0,"price":975,"summary":"Start in Hanoi and end in Ho Chi Minh City! With the Beach tour VNA008 - 15days Vietnam Beach Holiday , you have a 15 days tour package taking you through Hanoi, Vietnam and 6 other destinations in Vietnam. VNA008 - 15days Vietnam Beach Holiday includes accommodation in a hotel as well as flights, an expert guide, meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108613_1645d5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108613_1645d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_48f949cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_37b7ed65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_1f1a6873.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_d974bd71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_a9ddeba1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108613_6701e3bf.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Fly to Hanoi","description":"Fly to Hanoi. Upon arrival, our shuttles bus & guide will be holding a sign with your name and welcome you at Noi Bai International airport, transferred to your hotel for check in. The rest day is free at leisure or explore the city by yourself.\n3* Gondola Hotel: Sup Room \n4*: Tirant hotel: Deluxe Room \n5*: Apricot Hotel: Sketch Room "},{"title":"Day 2: Hanoi City Tour (B/L)","description":"After breakfast, our guide will pick you up at hotel at 8.00 and start sightseeing today includes explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, start a Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh’s Mausoleum and stilt house), the Presidential Palace, the nearby One Pillar Pagoda; the Temple of Literature; West Lake and one of the city’s museums (a choice between the History Museum and the Ethnology Museum). End the day’s explorations with a free shopping at old quarter and overnight in Hanoi. "},{"title":"Day 3: Hanoi - Halong Bay - Overnight on Cruise (B/L/D)","description":"Our guide and shuttle bus will pick you up at lobby of hotel at 8.00 and start journey east to Halong Bay, through picturesque rice-farming villages of the Red River Delta, where we see every day Vietnamese village life. On arrival, we board a beautiful traditional junk and spend a full day and night cruising the bay’s 3000 magnificent limestone islets. In the evening when the boat is anchored in the middle of the stunning lagoon, we enjoy a wonderful seafood meal and later there is opportunity for an evening swim from the side of the boat. Spend the night on our luxurious boat\n3* Swan Cruise: Deluxe Cabin\n4*: Bellezza Cruise: Deluxe Cabin\n5*: Dragon Legend Cruise: Deluxe Cabin"},{"title":"Day 4: Halong Bay - Hanoi (B/L)","description":"Awake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Halong. Have brunch on board the boat before returning to Halong pier to get back Hanoi "},{"title":"Day 5: Hanoi - Fly to Da Nang - Hoi An (B)","description":"Today is free until transfer to airport for flight to Da Nang. Upon arrival, our guide & driver pick up at airport and transfer to hotel for check in. Rest of the day is free at your leisure, overnight in Hoi An. \n3* Calla Villa: Deluxe Room \n4*: Vinh Hung Emerald Resort: Superior Garden\n5*:Allegro Hotel: Little Suite "},{"title":"Day 6: Hoi An - My son (B)","description":"Departs for My Son, My Son 70 km southwest of Da Nang, was the capital of the once almighty Champa Kingdom. It boasts a complex of ancient ruins that date back 1,700 years. This is the most complete example of ancient Champa ruins that Vietnam has maintained. Transfer back to Hoi An and free visiting a lovely old house, still occupied by the descendants of the merchants who built it over 200 years ago, before seeing the elaborate Japanese Bridge, a Chinese temple, the bustling market in your own way. Overnight in Hoi An"},{"title":"Day 7: Hoi An - Cycling to Tra Que (B/Light lunch)","description":"8.00 Cycling through the countryside to the small farming community of Tra Que Vegetable Village. Here you can enjoy the lush green countryside and see the farmers at work, later learn to make Vietnamese spring roll and free on foot massage by herbs. Enjoy a free afternoon back in Hoi An, it is time for you to explore art and handicraft galleries, try on clothes tailor-made, relax at the riverside restaurants or take the short journey to the nearby beach. Overnight in Hoi An"},{"title":"Day 8: Hoi An - Da Nang - Train to Nha Trang (B)","description":"Today is free until transfer to Da Nang station for catching a train to Nha Trang. Upon arrival Nha Trang, our driver will pick you up and transfer to hotel for check in. \n3* Gosia Hotel: Sup Room \n4*: Dendro Gold Hotel: Superior Room\n5*:Inter-Continental: Deluxe Room"},{"title":"Day 09 - 11: Nha Trang (B)","description":"Free at leisure in your own way. "},{"title":"Day 12: Nha Trang - Fly to Ho Chi Minh (B)","description":"Free at leisure until transfer to Nha Trang airport for flight to Ho Chi Minh. Upon arrival, you will be welcomed by our tour guide/ driver and transfer to hotel for check in. The rest day is free at leisure in your own way.  Overnight in Ho Chi Minh\n3* Gk Central Hotel: Superior Room \n4* Grand Silverland: Pre DLX Garden\n5* Rex Hotel: Deluxe Room"},{"title":"Day 13: Ho Chi Minh City - Cu Chi Tunnel (B/L)","description":"Breakfast at hotel, after picked up at 8.00AM, you will take a short sight-seeing: visit Notre Dame Cathedral, the Central Post Office, the War Remnants Museum. Then, a half-day excursion to the Cu Chi Tunnels. At its height, the tunnel system stretched over 250km, from Saigon to the Cambodian border, and was three levels deep. The network included innumerable trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers and kitchens. Today, the remaining tunnels have become a major tourist attraction, giving you a unique experience and a feel of what underground life during the U.S.-Vietnam War must have been like. Return Ho Chi Minh late afternoon and free leisure in your own way. "},{"title":"Day 14: Ho Chi Minh - Cai Be Floating Market (B/L)","description":"After breakfast our guide and driver will pick you up to visit one of the must visited regions of the Mekong delta, we visit Cai be floating market, cruising among the local barges stuffed-full of fruits and vegetables. Visit some local workshops then enjoy a delicious lunch served at a local house in the cool shade of An Binh Island’s orchards. In the afternoon, take a traditional rowboat and venture deeper into the countryside, floating through narrow canals to enjoy the peaceful surroundings. Stop at a nursery garden to discover how farmers along the delta produce their world famous fruits and vegetables. The cruise ends around 3:30 PM and return Ho Chi Minh "},{"title":"Day 15: Ho Chi Minh departure (B)","description":"The morning is at leisure before boarding your flights home. "}]},{"name":"Trails of Vietnam","duration":14,"travelStyle":["Adventure","Group","Fully Guided"],"oldPrice":0,"price":2249,"summary":"Whether it's kayaking beneath towering cliffs in the sea, cycling by vibrant \ngreen paddy fields in the Mekong Delta or trekking amongst colourful \nhilltribes, this dynamic trip allows us to interact with the local people and \nenvironment in a way we couldn't by vehicle alone. We get a great insight \ninto everyday life as well as seeing all the major sights. Of course all this \nactivity needs fuelling, which gives us the perfect excuse for sampling the \nsuperb Vietnamese cuisine.","highlights":["Trek through H'mong country","Learn more about village culture","Enjoy a sightseeing tour of Hanoi","Take a cruise among karst scener"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33204_5f4016.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33204_5f4016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_e5643adf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_a01a45dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_43972486.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_ec5ebd18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_022c235c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_f242c2ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_bdfb4505.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_5ea94a40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_361a8087.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_755aadf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_9897b442.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_fb9d2b30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_d6507146.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_51ac3d48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_1c947c08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_c15629ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_50301ea3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_3c589ea6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_9693b3ff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_0429cdfd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33204_748170d7.jpg"],"destinations":["Hanoi","Mai Chau","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Can Tho","Cai Rang","Vinh Long"],"timeline":[{"title":"Day 1: Start Hanoi","description":"Begin your adventure in Hanoi, a city where an unstoppable energy thrives \nalongside traditional Vietnamese culture and a colonial charm permeates the \nbroad tree-lined boulevards, most noticeably from the faded French \narchitecture.\n\nWhether you’re buying baguettes and inexpensive coffee from the grand \ndoorways of a past era, drifting alongside Hoan Kiem Lake or roaming the \nanimated streets, Hanoi offers a delicious first taste of Vietnamese culture. \nEven crossing one of many manic roads serves as a memorable experience!\n\nThis evening there will be a welcome briefing with your leader followed by an \noptional group dinner at a local restaurant.\n\n*May de Ville City Centre Hotel or similar*"},{"title":"Day 2: To Da Bac; trek through Dzao Tien country; overnight in hill-tribe longhouse","description":"This morning we transfer (approx. 4 hours) to Hoa Binh Province. Travelling \nup and over the Truong Son Mountain Range affords lush green views, serving \nas the perfect precursor of the scenery for the following days. We journey to \nthe peaceful Sung Village, the home of approximately 70 Dzao Tien ethnic \nminority/hill-tribe families.\n\nUpon arrival, we will be served lunch cooked by a local family before heading \noff on an afternoon trek where we will learn about traditional agriculture \nand also visit a limestone cave and an ancient tea plantation. We will spend \nthe night staying with a family and have the chance learn more about rural \nlife in this beautiful part of the country. \n\n*Sung Village Homestay*"},{"title":"Day 3: Trek amongst hill-tribe villages","description":"By now the beeping and bustling of Hanoi will be a faint memory, and the day \nis spent delving deeper into this slice of rural paradise. After an early \nbreakfast, we start our trek. Walking for approximately 5 hours we will pass \nthrough a picturesque valley made of quilt-like rice terraces, palms and \nsmall villages. We’re also rewarded with fantastic views of the Da \nReservoir and its turquoise waters. We will arrive in the village of Da Bia \nin time for lunch served by a Muong family that we will be staying with. \nThere will be some time near the end of the day free for those who might like \nto swim in the reservoir or choose to hire a kayak and explore a little \nfurther. \n\n*Da Bia village Homestay*"},{"title":"Day 4: Boat to Thung Nai; Hanoi city tour","description":"A short walk this morning will take us to the reservoir where we will board a \nprivate boat for our journey (approx. 1-1.5hrs) to Thung Nai harbour. We’ll \nstop for lunch and if time permitting, have the option of visiting the Muong \nethnic minority museum to learn a little more about one the main ethnic \ngroups of the area.\n\nOn return, our city tour of Hanoi introduces the many layers of Vietnamese \nculture and history. Sites include Hoa Lo, the Temple of Literature, and the \nOld Quarter, the centuries-old soul of Hanoi. Stepping into this commercial \nlabyrinth is not as confusing as it first may seem, but only once you realise \nthat it’s ‘36 streets’ indicate the type of products sold. So why not \ntake a turn down Silk Street, Souvenir Street or even Gold Street? The \nremainder of the afternoon/early evening is free, perhaps to enjoy the view \nfrom a lakeside café. If you wish to opt for an optional activity, your tour \nleader can arrange a viewing of the famous water puppets, an art form dating \nback to the 11th century where folktale and legends are playfully recounted \namong the sounds of wooden bells, bamboo flutes and cymbals.\n\n*May De Ville City Centre Hotel or similar*"},{"title":"Day 5: To Halong Bay; cruise/kayak; dinner and overnight on boat","description":"After an early start, we transfer (approx. 4 hours) to Halong Bay where a \nboat awaits us, ready to cruise along the legendary Halong Bay, otherwise \nknown as ‘where the dragon descends into the sea’. Legend has it that \nHalong Bay’s islands were formed by a dragon’s plunge into the waters. \nCarving crevasses on its way, the dragon left what is now roughly 3000 \nexquisitely eroded limestone peaks rising from emerald waters. Soak up the \nenigmatic atmosphere this karst scenery creates, before kayaking to places \ninaccessible by boat (weather permitting). A sea food lunch is served on \nboard, and the evening is yours to unwind upon tranquil waters. The night is \nspent in twin share cabins with en suite facilities.\n*Overnight Boat*"},{"title":"Day 6: Cruise then return to Hanoi; overnight train to Hue","description":"As the boat continues to cruise along the majestic peaks, there will be new \nopportunities to immerse ourselves in Halong Bay’s mystical quality. After \nreturning to port, we will transfer to the train station in Hanoi and board \nthe Reunification Express for the overnight train ride to Hue (approx. 13 \nhours). The overnight train journey is a great way to travel like the locals \nand really experience Vietnam.\n*Overnight Train*"},{"title":"Day 7: Sightseeing by private bus in Hue","description":"Arrive in the morning in the cultural and historical centre of Vietnam, Hue. \nBrimming with charisma, Hue has impacted several poets in its time and serves \nas a reminder of Vietnam’s imperial glories. Today we take a bus transfer \nto the Imperial Citadel and Thien Mu Pagoda to peep into the life of Nguyen \nemperors. With walls six miles in length, the Imperial Citadel is the most \noutstanding sight in town. We will explore the palaces, halls of the \nMandarins and the remains of the Forbidden Purple City, once only open to the \nemperor, his eunuchs, and of course his concubines.\n\nThe rest of the afternoon is free for you to relax and enjoy at leisure.\n\n*Park View Hotel or similar*"},{"title":"Day 8: Visit Tu Duc Mausoleum; drive to Hoi An","description":"This morning after breakfast, we take a transfer by bus to visit Emperor Tu \nDuc's Mausoleum. Standing amidst a lake and a boundless pine forest, this \ntomb is deemed the most extravagant mausoleum of the great Nguyen Emperors \nand one of the most beautiful pieces of royal architecture in Vietnam. \n\nFollowing this, a 130km drive to Da Nang will pass through the beautiful \npeninsula of Lang Co, situated between the crystal waters of a lagoon and the \nEastern Sea, as well as the awe-inspiring Hai Van pass, known as the ‘Pass \nof the Ocean Clouds’. Once in Da Nang, climb the Marble Mountains and \nuncover the large caves used by the Viet Cong as a hospital base during the \nwar. Rewarding views stretching over My Khe beach and the surrounding \ncountryside will be waiting for you once you reach the mountain peak, the \nlatter of which makes up our next home for 2 nights, Hoi An.\n*Le Pavillon Hoi An Boutique Hotel or similar*"},{"title":"Day 9: Walking tour of Hoi An; free afternoon","description":"Embrace the sleepy ambience seeping through Hoi An on our walking tour \n(approx. 3-4 hrs) of  Vietnam’s original European trading port town dating \nback to the mid-16th century. Often described as a living museum, Hoi An \nboasts more than just grace and atmosphere. Wooden merchant houses and \npagoda-style temples line the streets, architecturally reflecting the \nJapanese, Chinese and European influences on the town.\n\nThe afternoon is free to enjoy what many call their favourite town in \nVietnam, and it’s easy to see why. Take a boat trip on the Thu Bon River, \nrelax by the riverside, meander around the thriving riverside markets, or \nindulge in shops famous for their silk. Alternatively, why not hire a bike \nand make your way through Hoi An’s pretty countryside towards Cua Dai \nbeach, past markets, schools and villages (5km). There may also be the option \nto spend the afternoon kayaking through the coconut-palm lined canals in Cam \nThanh village for those keen. \n(Walking tour approx 3-4 hrs)\n\n*Le Pavillon Hoi An Boutique Hotel or similar*"},{"title":"Day 10: Fly to Saigon; afternoon visit Cu Chi Tunnels","description":"Transfer to Da Nang airport and fly to Saigon (approx. 70 mins), a city full \nof chaotic thrills.  Please be aware that as Saigon is located in the south, \nit is likely to be much warmer and humid than the north of the country.\n\nUpon arrival into Saigon, a 1.5 hr drive will then take us to the Cu Chi \ntunnels. Crawl through the infamous and intricate system of tunnels and \nexperience the spirit of guerrilla warfare! Used by the Viet Cong during the \nwar for its escape routes as well as living quarters, the network covers 3 \nlevels and approximately 240km of tunnels. Although they were traditionally \nvery narrow, they have now been widened to allow an extensive exploration of \nthe system. Even so, claustrophobes should feel free to bask outside in the \nsunshine if they do not wish to take part! \n*Huong Sen Hotel or similar*"},{"title":"Day 11: Cycle ride to Cai Be; visit handicraft workshops; drive to Can Tho","description":"Arrive in the small market town of My Tho after a 1.5 hr drive. After hopping \nonto our bikes we will follow the Mekong River through quiet back roads \ntowards Cai Be (approx. 30 km). Known as the ‘rice bowl’ of Vietnam, the \nMekong Delta produces the majority of Vietnam’s tropical fruits, some of \nwhich you will have a chance to sample, as well as sugar cane and coconuts. \nTransfer back to Can Tho to relax and soak up the atmosphere of this quiet \nriverside town, or explore the maze of backstreets and wide boulevards.\n*TTC Can Tho Hotel or similar*"},{"title":"Day 12: Boat trip to floating markets; cycle ride; boat trip to island homestay guesthouse","description":"Early start for a boat trip along the Bassac River towards Cai Rang, the \nlargest and liveliest floating market in the Delta. Float through a maze of \nboats, rife with fruits, vegetables and plants and watch the techniques \nlocals use to make a living. One includes attaching their produce on to long \npoles and hanging them above the boat, enabling them to showcase their items \nto buyers from all angles and distances. Since you’ll be witnessing \nauthentic trading in full swing, there will be countless opportunities for \nyou to capture traditional scenes on camera.\n\nAfterwards, we cycle to Vinh Long through rural villages and scenic \nlandscapes (approx. 40 km). Reaching the end of the day, we will be \ntransferred by motor boat to an island in the middle of the Mekong River for \novernight at a simple homestay guesthouse built in the style of a local \nhouse. Bedding, a mosquito net and a small towel are provided.\n*Homestay Guesthouse*"},{"title":"Day 13: Cruise to Cai Be; to Saigon for afternoon city tour","description":"Cruise by boat along the Cai Be Floating Market and stop to visit small \ncottage industries manufacturing local products such as popped rice, sweets, \npancakes and wine. Recently, Cai Be floating market is becoming less crowded \nand smaller as fruit trading is mostly now done by trucks due to the bridge \nbeing built. However, this is still a great opportunity to see a local market \nand the trade being conducted traditionally on a smaller scale.\n\nReturn to Saigon, a city once devastated by the Vietnam War, and now a \nbustling free market city. A combination of old and new diversifies the city \nwith temples standing defiantly among zooming scooters and modern \ndevelopments. The Reunification Palace is one of the stops on our city tour, \nfamous for its 1960s architecture and slightly garish appeal as much as its \nassociation with the fall of Saigon in 1975. Another stop is the War Remnants \nMuseum, housing a vivid collection outlining the horrors of modern history \nand warfare and effects on innocent civilians. Be aware that these records of \nthe Vietnam War are often very graphic and distressing.\n\nHeading to the romantic Catholic Notre Dame Cathedral throws yet another \nlight on Saigon.\n*Huong Sen Hotel or similar*"},{"title":"Day 14: End Saigon","description":"For land only clients, the tour ends this morning after breakfast. "}]},{"name":"Hanoi Backroad Motorbike Tour to Mai Chau and Ta Xua peak","duration":3,"travelStyle":["In-depth Cultural","Trail/Dirt bikes","Group","Partially Guided","Sightseeing","Holiday"],"oldPrice":0,"price":350,"summary":"This Joyful Hanoi Backroad Motorbike Tour to Mai Chau and Ta Xua Peak for 3 Days gives you a chance to visit highlights of Mai Chau Valley then explore beauty of Ta Xua Peak to experience the stunning natural beauties of Northwest Vietnam and valuable culture & traditions of the locals","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/116791_bb996a8b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/116791_bb996a8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_5706d018.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_7270adf4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_522d7985.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_6ee68748.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_53dd8162.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_aab995d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_66dbc6f4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_152681b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116791_2a490fe3.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi Motorbike Tour to Mai Chau","description":"\nStart our motorbike tour by leaving Hanoi on dyke roads to avoid the heavy traffic around 9.am, we ride our motorcycles west to Mai Chau, an area of beautiful landscape and home to the Thai ethnic minority. We will motorcycle on Highway 6 passing extensive farming lands comprising a sea of paddy fields split by tree-lined roads punctuated by limestone karst scenery.\nAfter a light lunch in Hoa Binh Province, we cross Thung Khe, one of the most beautiful mountain passes in North Vietnam then descent to the mountain valley settlement of Mai Chau. After dinner we join performance, where you can dance and share a range of special liquors (rice wine) with the locals. Overnight in a house-on-stilts of the Thai people. \n\nSummary:\n\nDistance:  160 km\n\nMeals: Lunch, Dinner\n\nAccommodation: Home-stay in villageStart point\n Your Hotel, Hàng Gai, 110700, Quận Hoàn Kiếm, Hanoi, Vietnam 08:00 - 08:30"},{"title":"Day 2: Mai Chau Motorcycle Tour to Ta Xua Peak in Bac Yen - Son La","description":"In the morning, we take a short walk around village to discover local life. Life in the countryside starts early so by sunrise there is a wealth of activity. The Thai women are masterful weavers who ensure that there is plenty of traditional-style clothing to buy in the village centre.\n\nYou will see women weaving on looms under or inside their houses in the village We can buy some handmade traditional-style clothing, knife or cross-bow. After breakfast in home-stay, we say goodbye to villagers and leave Mai Chau around 10 am. We ride from Mai Chau to the direction of Moc Chau, where we have lunch. This highland town produces some of Vietnam’s best tea and is a good place to stock up.\nThe surrounding area is also home to several ethnic minorities, including Green H’mong, Dzao, Thai and Muong. Moc Chau boasts a pioneering dairy industry that started in the late 1970s with Australian (and, later, UN) assistance. The dairy provides Hanoi with such delectable iuxur us as fresh milk, sweetened condensed milk and little tooth-rotting bars called “Banh sua”.\n\nAfter lunch, we turn to the less travelled Road 43 leading to the Da River, crossing the reservoir of Da river at Van Yen ferry, then ride on a beautiful winding secondary road until Bac Yen where we stay in a basic guest-house. \n\nSummary:\nDistance:  160 km\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Guest-house"},{"title":"Day 3: Motorcycle Tour back to Hanoi","description":"In this morning, after having breakfast you’ll be jumping up the iron horse again to get over zigzag & curving spiral roads with wild beautiful flowers such as Do Queen & Tao Men to reach Ta Xua peak which is located at the height of 2.600m above the sea level. We then will ride on the narrow backbone of dinosaur to view cloud flying beneath our feet.\n Standing here is likely we are walking on the cloud or floating on the sea of cloud and your soul will be relieved and free from all tirednesses as well as sorrows about daily normal life. Right here, you can shoot lots of nice photos from the top of the mount. Later on, we’ll ride back to the foot of mountain where we have a lunch before We ride back to Hanoi on dyke roads to avoid the heavy traffic and breaking out of the delta plains along the Red river.\n\nFinish our tour around 3 pm. \n\nSummary:\n\nDistance:  180 km\n\nMeals: Breakfast, Lunch"}]},{"name":"4 Days Da Nang, Hue City and Hoi An Ancient Town","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":369,"summary":"In and around Da NangUpon arriving at Da Nang International Airport, you will be greeted by your local tour guide and driver and afterwards transferred to your hotel. After a short rest, you’ll be taken for sightseeing of Da Nang City and visit the Son Tra Peninsular. For you to experience the local history, you will visit the Cham Museum, which is a great chance to dig down in the fascinating world of the Cham Kingdom. After a day of experiences there will be served dinner at a local Vietnamese restaurant, and after that, you will rest in your hotel in Da Nang","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108440_d7116e41.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108440_d7116e41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108440_e11426fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108440_c9aebdbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108440_fd9ad064.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108440_3be69665.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108440_46d74ac6.jpg"],"destinations":["Hoi An","Hue"],"timeline":[{"title":"Da Nang Arrival (Lunch)","description":"Upon arriving at Da Nang International Airport, you will be greeted by your local tour guide and driver and afterwards transferred to your hotel. After a short rest, you’ll be taken for sightseeing of Da Nang City and visit the Son Tra Peninsular. For you to experience the local history, you will visit the Cham Museum, which is a great chance to dig down in the fascinating world of the Cham Kingdom. After a day of experiences there will be served dinner at a local Vietnamese restaurant, and after that, you will rest in your hotel in Da Nang"},{"title":"Hoi An - Hue (Lunch)","description":"After a good night’s rest, breakfast will be served at your hotel. To start of the day you will depart for Hue. On the way you will make a short stop at Lang Co Beach and have lunch as well. In the afternoon you will visit the intriguing Imperial Citadel from where the Nguyen Dynasty ruled between 1802 and 1945. Here you will also visit the Purple Forbidden City visit Thien Mu pagoda, enjoy the boat trip on the Perfume River on the way back, then take a walk to visit Dong Ba Market . In the evening, dinner will be on the guest’s own account. At night you will be resting in your hotel in Hue."},{"title":"Hoi An (Lunch)","description":"In the morning breakfast will be served for you at the Hotel. After breakfast you will depart for Hoi An Ancient Town. You will cruise on the Perfume River and visit the Royal Tomb of Emperor Tu Duc, the Mausoleum of Emperor Minh Man in serene surroundings of gardens and small lakes. Continuing your journey towards Hoi An, lunch will be at a local restaurant. On the way you will visit Marble Mountain, Upon arrival in Hoi An your overnight stay will be at your hotel. In the evening dinner is at guest’s own account."},{"title":"Day 4: Hue","description":"In the morning, breakfast will be served at the hotel and at 8.00AM you will take a fresh walk to the Hoi An Ancient Town. While wandering around in the small streets of Hoi An, you will be amazed by the small town life with bright yellow buildings and colorful lanterns in the streets. Here you will visit the Tan Ky House, the pink Japanese Bridge, Phuc Kien hall and the Huynh Museum. On the way to lunch, you will feel the buzzing Vietnamese life, as we pass through the local market, and you can enjoy traditional music as well. \nYou will be transferred from Hoi An back to Da Nang International Airport, and this will be the end of our services."}]},{"name":"Terrific Hanoi Motorcycle Tour to Pu Luong and Mai Chau","duration":4,"travelStyle":["Adventure","Eco","Trail/Dirt bikes","Group","Partially Guided","Fishing","Holiday"],"oldPrice":0,"price":490,"summary":"In and around HanoiHanoi Motorcycle tour to Pu Luong, Mai Chai via Tam Coc, Hoa Lu: Hanoi Motorbike tour to Hoa Lu - Tam Coc (-/L/D)  07:00 am, we’ll start our motorbike tour by riding through the city then following the High Way No 1 via some suburb districts of Hanoi like Thuong Tin, Phu Xuyen, and Hanam province to get to Ninh Binh  At around 10:30 am, we arrive at Hoa Lu Ancient Capital. In 968, Dinh Bo Linh declared himself as the King. Since then Hoa Lu existed as the capital for the next 41 years (968 – 1009), of which 12 years was under the Dinh dynasty – King Dinh Tien Hoang, the country named Dai Co Viet, and 29 years later was under the Le dynasty – King Le Dai Hanh.  In 1010, King Ly Thai To moved the capital from Hoa Lu to Thang Long – present day Hanoi. Hoa Lu became the old citadel. In Hoa Lu there are now 2 temples have been built on the ground of the old royal palace, one is dedicated to King Dinh Tien Hoang, the other is to King Le Dai Hanh. The visit offers a chance to know more about part of feudal dynasties and historical periods in Vietnamese history. 11:30 am, we’ll jump on our motorbikes to keep heading to Tam Coc at around 12:00 pm. Right here, we’ll have a lunch at a local restaurant being served with goat meat which is famous as the local specialty.  1:30 pm, 5 minutes walk to the boat station and start a 2-hour boat trip to visit Tam Coc. Known as “Halong Bay on land”, Tam Coc are three limestone caves stretching along Ngo Dong river. The boat trip is a nice journey along the river with a peaceful scenery of limestone mountains, rice paddy and the site of some temples along the way from Hang Ca (first cave) to Hang Hai (second cave) and Hang Ba (third cave).  The rest of time, you’ll be free on your own to explore more local villages around Tam Coc.  overnight at Hotel in Tam Coc  Summary Distance:  150 km Accommodation: Hotel in Tam Coc  Meals:   Breakfast, Lunch, Dinner","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/116778_0c626d3e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/116778_0c626d3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_673cf447.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_cdafd36e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_396831b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_43ae0a6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_f057c51e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_ba8ebc6c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_64a525fc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_b6d373e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_27750647.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_990e0144.jpg","https://cdn.tourradar.com/s3/tour/1500x800/116778_8756fdf8.jpg"],"destinations":["Hanoi","Ninh Binh","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi - Hoa Lu - Tam Coc in Ninh Binh City","description":"Hanoi Motorcycle tour to Pu Luong, Mai Chai via Tam Coc, Hoa Lu: Hanoi Motorbike tour to Hoa Lu - Tam Coc (-/L/D)  07:00 am, we’ll start our motorbike tour by riding through the city then following the High Way No 1 via some suburb districts of Hanoi like Thuong Tin, Phu Xuyen, and Hanam province to get to Ninh Binh  At around 10:30 am, we arrive at Hoa Lu Ancient Capital. In 968, Dinh Bo Linh declared himself as the King. Since then Hoa Lu existed as the capital for the next 41 years (968 – 1009), of which 12 years was under the Dinh dynasty – King Dinh Tien Hoang, the country named Dai Co Viet, and 29 years later was under the Le dynasty – King Le Dai Hanh.  In 1010, King Ly Thai To moved the capital from Hoa Lu to Thang Long – present day Hanoi. Hoa Lu became the old citadel. In Hoa Lu there are now 2 temples have been built on the ground of the old royal palace, one is dedicated to King Dinh Tien Hoang, the other is to King Le Dai Hanh. The visit offers a chance to know more about part of feudal dynasties and historical periods in Vietnamese history. 11:30 am, we’ll jump on our motorbikes to keep heading to Tam Coc at around 12:00 pm. Right here, we’ll have a lunch at a local restaurant being served with goat meat which is famous as the local specialty.  1:30 pm, 5 minutes walk to the boat station and start a 2-hour boat trip to visit Tam Coc. Known as “Halong Bay on land”, Tam Coc are three limestone caves stretching along Ngo Dong river. The boat trip is a nice journey along the river with a peaceful scenery of limestone mountains, rice paddy and the site of some temples along the way from Hang Ca (first cave) to Hang Hai (second cave) and Hang Ba (third cave).  The rest of time, you’ll be free on your own to explore more local villages around Tam Coc.  overnight at Hotel in Tam Coc  Summary Distance:  150 km Accommodation: Hotel in Tam Coc  Meals:   Breakfast, Lunch, Dinner"},{"title":"Day 2: Tam Coc / Hoa Lu - Cuc Phuong National Park","description":"After having breakfast, you’ll be relaxed a bit before taking another ride to Pu Luong Nature Reserve within a few hours. We then have to take a short boat trip then start a 2 to 3-hour walk through beautiful hillside villages, magnificent rice paddies, seeing handcrafted bamboo water wheels to approach where we’ll be staying tonight.  The highlight of this walk is experiencing the beauty of Pu Luong Nature Reserve, the everyday life, and culture of the White Thai people. Become a part of local life when we are welcomed as honored guests at a traditional dinner and stay the night.  Homestay at Ethnic Thai Tribe’s house   Summary Distance:  150 km Accommodation: Homestay  Meals:   Breakfast, Lunch, Dinner"},{"title":"Day 3: Cuc Phuong National Park - Mai Chau","description":"Mai Chau Valley (B/L/D)  After having breakfast at a local family, you’ll be at leisure a bit to experience the fresh & quiet atmosphere & daily life of the locals here then jump on the bikes to go straight to Mai Chau valley. En route, you’ll have chances to stop by visit a plenty of authentic villages of the hill tribes and view stunning natural landscapes of streams, forests, mountains.  Upon reaching Mai Chau, we’ll have a lunch and in this afternoon, our guide will take you on another ride to get deeper into other remote villages to learn more about their culture, traditions as well as lifestyles of the people.  Dinner & overnight at the local family in Mai Chau. Homestay   Summary Distance:  100 km Accommodation: Homestay  Meals:   Breakfast, Lunch, Dinner"},{"title":"Day 4: Mai Chau - Hanoi","description":"Mai Chau to Hanoi (B/L/-)  After breakfast, let’s do a 60km-motor ride around Mai Chau dict on beautiful mountain dirt track and almost empty road  before back to home-stay for lunch. And then we say goodbye to villagers and leave Mai Chau around 10 am. We ride back Hanoi by shorter way.   Summary: Distance:  140 km Meals: Breakfast, Lunch"}]}]