[{"name":"7 Days South to Central of Vietnam","duration":7,"travelStyle":["Discovery","Group","Partially Guided","Coach / Bus","Holiday"],"oldPrice":793,"price":476,"summary":"Minimum 2 people per booking\nBooking at least 30 days in advance\n\nExperience the highlights of South - Central Vietnam in 7 days tour. The trip will take you to many significant and special places in Ho Chi Minh , Da Nang and Hoi An City. \nEnjoying the boat trip on Mekong River to see the colorful floating markets and discover the lifestyle of Mekong people\nWandering the charming streets of Hoi An town – lined with centuries old houses and quiet boutiques, take part in a \bcycling tour to Tra Que Village and enjoy some local special foods...","highlights":["Experience Ho Chi Minh by bike","Cruise through the canals of Mekong","Hike Marble Mountain","Enjoy Local Cuisine"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/81795_e75d4f2d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/81795_e75d4f2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_9827471f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_134453a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_7725df09.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_f8d2a881.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_ad834e01.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_9636d206.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_54cff082.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_dfbd5bc8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_91c05b88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_24a78b73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_162226df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_322d0706.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_890afad9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_80cfcddb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_2444a73b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_47108b82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_e001510c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_d6f1f1d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_f127da18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_eee13f52.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_84907fa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_e87f8482.jpg","https://cdn.tourradar.com/s3/tour/1500x800/81795_0bae771b.jpg"],"destinations":["Ho Chi Minh City","Hoi An"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Arrival","description":"Pick-up and welcome at the airport with the transfer to your hotel.\nOvernight in Ho Chi Minh City."},{"title":"Day 2","description":"2019: Day 2: Food Tour by Motorbike (BD)\nFoodie trails is the perfect way for our guests from all over the world to experience the local cuisine and culture of Viet Nam. On this tour, you will spend an evening dining as the locals do and taste authentically prepared dishes that you won’t find anywhere else. If you want to truly experience Ho Chi Minh City is by motorbike. Your tour guide will pick you up for a motorbike ride around Sai Gon where you can enjoy some local foods. You may spend a few minutes in the traffic but you will forget all about it by the time dessert is served. Enjoy Vietnamese delicacies in the relaxing park setting. Afterwards, we will take a walk around the park to watch the ladies do their aerobics classes and the children practicing martial arts.\nNext we will stop to try some of Sai Gon’s famous steamed and roasted shellfish dishes. Try some well-known local spots. Don’t forget to try a local beer while you’re at it. Then, we will return you to your hotel. Overnight in Ho Chi Minh City.\n\n2020: Day 2: Ho Chi Minh City - My Tho and Ben Tre Coconut Village - Food Tour by Motorbike (BLD)\n08:00 A trip to the Mekong Delta offers a glimpse into the unique and distinct agrarian life of the vibrant southern Delta region. We will enjoy a cruise along the Mekong River to one of the Islands (located in the town of My Tho) where we will be entertained with traditional music while enjoying some tea sweetened with bee’s honey. We will then take a paddle-boat to cruise through the narrow canals of the Mekong. The paddle-boat ride provides an interesting look into local cottage industry of making coconut candies. We will then have a lunch of ‘Elephant Ear’ fish combined with other delicious Vietnamese dishes – a local specialty. \n\n18:00 Foodie trails is the perfect way for our guests from all over the world to experience the local cuisine and culture of Viet Nam. On this tour, you will spend an evening dining as the locals do and taste authentically prepared dishes that you won’t find anywhere else. If you want to truly experience Ho Chi Minh City is by motorbike. Your tour guide will pick you up for a motorbike ride around Sai Gon where you can enjoy some local foods. You may spend a few minutes in the traffic but you will forget all about it by the time dessert is served. Enjoy Vietnamese delicacies in the relaxing park setting. Afterwards, we will take a walk around the park to watch the ladies do their aerobics classes and the children practicing martial arts.\n \nNext we will stop to try some of Sai Gon’s famous steamed and roasted shellfish dishes. Try some well-known local spots. Don’t forget to try a local beer while you’re at it. Then, we will return you to your hotel. Overnight in Ho Chi Minh City.\n"},{"title":"Day 3","description":"2019: Day 3: Ho Chi Minh - My Tho and Ben Tre Coconut Village - Da Nang (BL) – by flight\nA trip to the Mekong Delta offers a glimpse into the unique and distinct agrarian life of the vibrant southern Delta region. We will enjoy a cruise along the Mekong River to one of the Islands (located in the town of My Tho) where we will be entertained with traditional music while enjoying some tea sweetened with bee’s honey. We will then take a paddle-boat to cruise through the narrow canals of the Mekong. The paddle-boat ride provides an interesting look into local cottage industry of making coconut candies. We will then have a lunch of ‘Elephant Ear’ fish combined with other delicious Vietnamese dishes – a local specialty. \nTranfer to the airport for a flight to Da Nang. Upon arrival, pick up and transfer to hotel. Overnight in Da Nang.\n\n2020: Day 3: Ho Chi Minh City - Da Nang (B) – by flight\nTranfer to the airport for a flight to Da Nang. Upon arrival, pick up and transfer to hotel. Overnight in Da Nang."},{"title":"Day 4 Da Nang - Food Tour with Seafood in Da Nang (BD)","description":"In the afternoon, your tour guide will pick you up by motorbike and give you a tour enjoy most famous seafood restaurant street around Da Nang. Return to your hotel. Overnight in Da Nang. \nNote: Foreigners in Viet Nam are allowed to drive a motorbike only with a Vietnamese driver’s license. Purchasing this tour, you should be aware of and abide by the Vietnamese Law"},{"title":"Day 5 Da Nang - Marble Mountain - Hoi An with Tailor Made (B)","description":"The day tour begins with climbing the stone steps carved into Marble Mountain to discover caves, grottoes and a Buddhist Pagoda and marvel at the panoramic view from the top of the mountain. After visit Non Nuoc Stone Carving Village, we will go to Hoi An and visit Ann Tailor for tailor made before check in hotel. Free at leisure in the afternoon.\nOvernight in Hoi An."},{"title":"Day 6 Hoi An - Food tour by Bicycle - Ho Chi Minh City by flight (BL)","description":"Discover Hoi An’s countryside and its local food by bicycle. We will past verdant rice-paddies to visit a very local village. Sample the traditional Hoi An specialty, Cao Lau. Learn how to make the local delicacy- White Rose. Move on to Cam Nam to sample some Ying and Yang food balancing favorites. \nOvernight in Ho Chi Minh City."},{"title":"Day 7: Ho Chi Minh City - Departure (B)","description":"Have breakfast in the hotel and relax until time of transfer to the airport for departure flight. END TOUR"}]},{"name":"Real Vietnam","duration":15,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":1145,"price":1031,"summary":"From Ho Chi Minh City to Hanoi, experience authentic Vietnam on this epic 15-day adventure from south to north. See how the locals live on the Mekong Delta, discover rich history in Hoi An and taste some awesome food in Hue. Drift on the emerald waters around Cat Ba Island by boat and go for a snoop through some of Hanoi's many markets. This is the make-em-jealous, full-on, once-in-a-lifetime trip up the coast of Vietnam you've been waiting for.  We cover a lot of distance on this trip, including on overnight trains. Accommodation and amenities are shared and basic, but the experience of rubbing shoulders with the locals makes it all worthwhile.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/63518_0afcccb5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/63518_0afcccb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_b7c6d3b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_a6dcf4d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_68496077.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_e7d099f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_1a1d31ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_c4a87400.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_7a87c687.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_51d7bcbc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_3df0701b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/63518_0473d339.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Vietnam. Your adventure begins with a welcome meeting at 6 pm. Formerly known as Saigon, Ho Chi Minh City is characterised by a vast array of sights and sounds, and is a fascinating blend of old and new, East and West. The huge number of people rushing about their daily lives in Vietnam's largest city gives it a dynamic atmosphere and the French influence is evident in the excellent baguettes and coffee on offer. Much of city life takes place on the busy streets lined with shops, stalls and vendors, who have their wares spread out on the footpath and sell everything from soup to sophisticated electronics. After your welcome meeting, why not head into the Ben Thanh night market for a serving of pho or bun with your fellow travellers? It’d be crazy not to.\nAccommodation: Hotel"},{"title":"Day 2: Mekong Delta","description":"Today, head down to the Mekong Delta and visit Ben Tre, where the humble coconut is everything and anything. The fertile delta is famous for its abundant harvests of tropical fruits and flowers as well as boating along the canals. On arrival, board a private boat and cruise along the maze of waterways to visit some cottage industries, where you’ll have the chance to interact with locals of the area. In the evening, head to a guesthouse along the water and enjoy some time to relax.\nAccommodation: Homestay"},{"title":"Day 3: Mekong Delta - Overnight Train","description":"Rising early to the sounds of the delta coming alive, enjoy a simple breakfast before boarding a boat and catching a bus back to Ho Chi Minh City. Enjoy some free time in Ho Chi Minh City to go check out a few more sites or some tasty street food snacks. Included for today is a local experience with uni students called Ca Phe Bet, which literally translates to ‘coffee on the flat ground’. Enjoy this city ritual of coffee and a snack in one of the many parks. Late this evening, board an overnight train bound for Hoi An – a historical town on the central coast. Although conditions are basic, overnight trains are all part of the experience and the best way to travel long distances with the locals.\nAccommodation: Overnight sleeper train"},{"title":"Day 4: Hoi An","description":"Arrive in Danang in the early afternoon and travel by minibus to Hoi An (approximately 1 hour). Recently declared a World Heritage-listed site, Hoi An is being beautifully restored and preserved. Known as Faifo to early western traders, it was one of South East Asia's major international ports during the 17th, 18th and 19th centuries. Today, parts of Hoi An look exactly as they did more than a century ago and it retains the feel of centuries past. It's also a shopping mecca, with much to browse and buy. Choose from original paintings, hand-crafted woodwork, ceramics, embroidery, lanterns and more. Hoi An has also become famous for its tailoring, with a great variety of tailors and fabrics to choose from. Bring your favourite piece of clothing or even just a picture, and you'll be able to have it copied. Included today is a walking tour of the Old Town, which finishes with a delicious banh mi for lunch. Afterwards, you’re free to explore Hoi An at your own pace.\nAccommodation: Hotel"},{"title":"Day 5: Hoi An","description":"There's no better way to explore the peaceful countryside of Hoi An than by bike. For a true insight into country living in Vietnam, join your leader in cycling past green rice paddies, over small creeks and through rural villages. Later in the day, you may like to cycle or catch a local bus to Cua Dai Beach near Hoi An centre for an afternoon on the stunning South China Sea. If you would like to see more of the Vietnamese countryside and visit some temples, you could book yourself into a My Son Cham day trip. The best thing is, the afternoon is yours to do as you please.\nAccommodation: Hotel"},{"title":"Day 6: Hue","description":"Departing Hoi An, cross the dramatic Hai Van Pass with a quick stop and photo opportunity before continuing on to Hue (approximately 5 hours including stops). As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past and is a curious mix of bustling streets and tranquil settings. Your afternoon is free to go exploring. The Dong Ba market, which sells everything imaginable, is a great place to spend some time. See the Imperial Citadel, including a visit to the Forbidden Purple City, which was almost totally destroyed during the Vietnam War's Tet Offensive. In the evening, sit back, relax and enjoy a traditional dinner in a local home. These experiences off the beaten track are the ones you’ll remember.\nAccommodation: Hotel"},{"title":"Day 7: Hue","description":"You’ve got the whole day to explore stunning Hue. Head with your group on a street food experience in the morning to pick up a market breakfast and pass by all the local traders. Later on, you may like to take a dragon boat cruise on the Perfume River, and a visit to Thien Mu Pagoda, considered by many to be the unofficial symbol of Hue. It's an active Buddhist monastery with its origins dating back to 1601. One of the most poignant displays is a car belonging to a former monk who, in 1963, drove to Saigon and set himself alight to protest against the treatment of Buddhists by the South Vietnamese regime. Otherwise, you’ll have the opportunity to embark on an optional motorbike tour, riding with a local guide around the sights.\nAccommodation: Hotel"},{"title":"Day 8: Phong Nha","description":"Jump on the bus and make your way to Quang Tri. If you’re keen, it’s just a small fee to visit the Hien Luong Bridge and Vinh Moc tunnels. Hien Luong Bridge separated the North from the South during the war. The tunnels at Vinh Moc are an expansive network of limestone tunnels that locals used as shelters from the bombing. Travel onwards to Phong Nha and spend the afternoon exploring your surroundings. You'll stay just outside Phong Nha Town, which is near Phong Nha-Ke Bang National Park: an amazing landscape full of caves and underground rivers.\nAccommodation: Guesthouse"},{"title":"Day 9: Phong Nha – Overnight Train","description":"Enjoy a free day to explore Phong Nha-Ke Bang National Park. At 400 million years old, this World Heritage site is the oldest karst mountain range in Asia. You might like to take a boat through Phong Nha Cave or check out the spectacular Paradise Cave. If caves aren’t your thing, chat with your leader about a kayaking adventure in Suoi Mooc. Otherwise, chill out with a coffee and soak in the river views. Later today you'll head back to Dong Hoi and hop back on a sleeper train (approximately 8 pm to 6 am) – you'll be a pro at this by now.\nAccommodation: Overnight sleeper train"},{"title":"Day 10: Hanoi","description":"Arrive in Hanoi very early (approximately 5.30 am) and transfer to your hotel. Then leave your gear in a day room at the hotel. The capital of Vietnam is a charming city with over six million people. Hanoi is known for its beautiful lakes, shaded boulevards, lush public parks and its thriving Old Quarter, which is an architectural museum piece with blocks of ochre buildings retaining the air of a 1930s provincial French town. As Vietnam develops to compete with other South East Asian countries, the beautiful Hoan Kiem Lake reflects the contrasts of modern office buildings, old Buddhist temples and the tangle of ancient streets in its still surface. Take a walking tour of the Old Quarter with uni students accompanying the group. You'll visit the Dong Xuan market, the biggest wholesale market in northern Vietnam, stroll through the ancient '36 streets' where you can discover an amazing selection of shops selling everything from souvenirs to exquisite silk clothing and beautifully embroidered tablecloths. Your leader will point out some of the unique architecture around Hoan Kiem Lake and the myths and legends of the lake, and you’ll have the chance to get a sweet Vietnamese coffee along the way.\nAccommodation: Hotel"},{"title":"Day 11: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantation are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (2 kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so please ensure you have suitable footwear for this activity. After a handicraft workshop, return to your homestay accommodation for a hot shower and dinner.\nAccommodation: Homestay"},{"title":"Day 12: Hanoi","description":"This morning, have an opportunity to take in more of the Vietnamese highlands on a 10 kilometre (6.2 mi) trek from Sung Village to Da Bia. The first 8 km of the trek is mostly flat ground along well-worn buffalo tracks. The final 2 km gradually inclines and for a period of approximately 300 m there are some steps to climb, however the walk will be a steady relaxed pace. Keep an eye peeled for the monumental stone at the peak of Da Bia Mountain during the hike that takes us through the local villages, meeting people from the ethnic Muong tribe along the way. Stop for lunch at Da Bia before enjoying a scenic 1.5-hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours). Arrive in Hanoi at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter?\nAccommodation: Hotel"},{"title":"Day 13: Cat Ba Island","description":"Travel by bus and ferry (approximately 3.5 hours) to Cat Ba Island, the largest island in the World Heritage-listed Halong Bay area. With thousands of limestone islands and formations scattered around, this is one of those quintessential Vietnamese scenes where bright green water is dotted with traditional junk boats. Take a boat around Lan Ha Bay with an included rice paper roll making class while you cruise, then get up close and personal with this other-worldly landscape by kayak. There’s also the option to have a net on the side of your kayak and help the locals’ clean-up efforts. This initiative hopes to eliminate the rising amounts of plastic waste in the bay – you’ll make the locals’ day! Stay overnight on Cat Ba Island and enjoy a dip at one of the beaches and a cold beer.\nAccommodation: Hotel"},{"title":"Day 14: Hanoi","description":"Wake up in paradise, maybe starting your morning with a refreshing swim. Ensure you soak up as much sun and sand as possible, as it's back to Hanoi later in the afternoon via ferry and bus. Being such a large city, Hanoi has so much to explore. This afternoon, you could head to the French Quarter to see the European influences on parts of Hanoi’s architecture, or otherwise, get your gang together and stake out a roadside stall for some chargrilled meats or pho cuon (rice noodle rolls).\nAccommodation: Hotel"},{"title":"Day 15: Hanoi","description":"There are no activities planned for the final day and you are able to depart the accommodation at any time. With so much to see and do in Hanoi, why not book an Urban Adventure? Citadels, Karsts & Cycle is our pick – a tour where you’ll cycle through Hanoi and take a sneaky rowboat through caves and past rice paddies. See urbanadventures.com/destination/hanoi-tours for more information. If you would like to spend some more time in Hanoi, we’ll be happy to book some additional accommodation for you (subject to availability)."}]},{"name":"Vietnam Experience","duration":12,"travelStyle":["Discovery","Boat","Group","Fully Guided","Holiday"],"oldPrice":1435,"price":1148,"summary":"Looking for the full experience tour of Vietnam? This trip takes you through Ho Chi Minh, Hoi An, Hanoi & Halong Bay with plenty of action and highlights to immerse yourself into this enchanting culture. Picture yourself relishing the rice region of Mekong Delta by taking a traditional boat through floating markets & local fruit farms, stopping in exciting & iconic hot spots & popular local foodie haunts for a true Vietnam experience.","highlights":["Learn about the Vietnam war, Ho Chi Minh","Have dinner with a local Vietnamese Family, Mekong Delta","Taste authentic Vietnamese food on street food tour, Hue"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/4786_3754ae.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/4786_3754ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_773d82dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_9a01b882.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_68f12ce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_7cddd8e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_622c67f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_c3624801.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_ab83475f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4786_dd58f5e6.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City","description":"Welcome to Ho Chi Minh city, formerly known as Saigon. This is one of Asia's most exhilarating cities, steeped in grand history and post-Vietnam war memories. This evening you'll meet your travel comrades and explore the Ben Thanh markets, offering the freshest traditional Bánh mì, Pho and Bia hơi. Oh yes, this is the right way to get the Vietnam party started."},{"title":"Day 2: Ho Chi Minh City to Mekong Delta","description":"It's goodbye busy city and hello river life today as we make for the Mekong Delta for an extra special overnight experience you won't be forgetting fast.Travelling down the river on local sampans, peace and tranquillity will be at an all time high. This afternoon we'll spend our time getting a serious learning fix by visiting a local tea garden and seeing the floating markets, learning about local industries along the river and the way of life here and meet some of the friendliest people on earth. Definitely one to give us all the local feels, topped off with a night at our Mekong Guesthouse."},{"title":"Day 3: Mekong Delta to Ho Chi Minh City","description":"After an early breakfast we'll make our way back to Ho Chi Minh, detouring past the staggering 250-kilometres of tunnels that make up the Viet Cong’s Cu Chi.See traps, hidden doors & some of the 250kms of tunnels that Vietnamese resistance fighters dug by hand, and even go down into the skinny tunnels to experience them first hand in this look into Vietnam's staggering past.Back in the addictive mayhem of Vietnam's biggest city you will have free time to carry on your explorations. Continuing to eat your way through Vietnam's culinary highlights would be one wise way to use your time (we think)."},{"title":"Day 4: Ho Chi Minh City to Nha Trang","description":"With some traditional R'n'R on our afternoon agenda, the morning can be used to put on our discovering boots. We'll dabble in history and religion before taking flight to a coastal town overlooking the South China Sea.Golden sand beaches, turquoise oceans, water sports galore - this is Nha Trang. This afternoon why not book in for a mineral mud bath and hot thermal spring experience before heading out to dinner with your crew. Ah, the good life."},{"title":"Day 5: Nha Trang","description":"Good news - we're kicking it in Nha Trang for another night. Have a massage, sign up for the optional cruise, or just hang on the beach saving your energy for seaside bar fun as the sun sets."},{"title":"Day 6: Nha Trang to Hoi An","description":"Catch you later Nha Trang and hello Hoi An.Get your bearings with a guided tour through the Old Quarter, and fall deeply in love with this perfect spot. Japanese Bridge, French Colonial vibes and brightly coloured buildings are endlessly charming. You'll be feeling hungry no doubt, so tonight we'll bet we can tempt you with our optional Vietnamese cooking class to get your cooking skills on form and show off to your friends back home. With our expert chef leading the charge, you'll soon be feeling like a bit of an expert. Armed with new skills, ask your Trip Manager about where to head for a night out with the group."},{"title":"Day 7: Hoi An","description":"A short drive from Hoi An are the famous Marble Mountains, a collection of 5 peaks that represent the 5 Elements in Vietnamese folk lore – metal, wood, earth, fire and water. Our local guide would be delighted to take us on a tour through the Thuy Son caves and grottos which are home to some of the most beautiful and intricate stone carvings in the area. The Marble Mountains were also the hiding place of the US Forces during the Vietnam Conflict and even a military hospital! Hear about the history while taking in panoramic views and later, kick back at An Bang Beach before heading back to Hoi An for more Free Time Addons."},{"title":"Day 8: Hoi An to Hue","description":"Though we'll have grown content with Hoi An life, this morning the show must go on. After all, the former imperial town of Hue has invited us over, and we'd be foolish to turn it down.Intricately decorated pavilions, lotus flower ponds, and colourful artworks mark our first sightseeing venture in Hue. Totally in awe of Tu Duc Mausoleum, we move on to the 7-story Thien Mu Pagoda & learn of the horrific history of the Hue Buddhist massacre as well as taking in a cyclo ride to see the city from a whole new angle."},{"title":"Day 9: Hue to Hanoi","description":"Today we fly out of Hue in the direction of Vietnam's time capsule capital. A trio of influences and filled with romance, 2-nights here will see us utterly smitten.With an epic fusion of French, Chinese & Vietnamese influence, you'll be nothing short of ecstatic as we check-in to our Hanoi hotel, right in the middle of the bustling Old Quarter. Our time will be spent weaving through a maze of 36 trading streets filled with colourful goods for sale, and unwinding in the walled gardens of the Temple of Literature. Later, we'll roam French-style boulevards and maybe dine on a nom ngo sen lotus-stem salad, dau chien ron fried tofu & a few bia hoi beers."},{"title":"Day 10: Hanoi to Halong Bay","description":"After a Hanoi history 101 lesson we move on to Halong Bay where a night on a UNESCO World Heritage-listed site awaits.A drive through stunning scenery will evoke plenty of 'oh wow's, but it only gets better as we board our home for the night, a Chinese-style junk boat in Halong Bay. Feel the serenity kicking in immediately as we drift the limestone island seas of the Gulf of Tonkin. We will pass hidden lagoons, thick forests & dreamy grottos, & stop to explore the Sung Sot Caves. A fresh seafood dinner and sunset at our docking spot will polish off a wonderful daypacked with No Regrets moments and simply unforgettable experiences."},{"title":"Day 11: Halong Bay to Hanoi","description":"Today will be all about the leisurely vibes as we wake up to breakfast and a grotto swim. Make the most of your time on the junk boat & kayak your way around Halong Bay - the views don't get much better than this.After heading back to Hanoi we find ourselves enjoying our final night together on tour. Save the choir of tears for tomorrow - this evening is all about making the most of your free time and staying positive. The quirky world-famous water puppet performance in Red River Delta makes for the perfect send off, should you fancy opting for something a bit different."},{"title":"Day 12: Depart Hanoi","description":"Enjoy one final breakfast with the squad this morning before the trip wraps up. Hug it out and make plans to reunite sometime soon - Latin America, perhaps?"}]},{"name":"Vintage Vietnam","duration":15,"travelStyle":["In-depth Cultural","Group","Fully Guided"],"oldPrice":0,"price":2790,"summary":"From south to north, Vietnam is a kaleidoscope of fascinating history, hospitable people and picturesque landscapes. Imagine learning the mysteries of the Viet Minh in Ho Chi Minh City or exploring the beautiful lakes and boulevards of Hanoi, and what better way to get to know the locals than to be their guests at a Mekong Delta guesthouse. Experience historical temples, visit Vietnam's spectacular coastline, enjoy delicious banquets and explore lively cities, all with a touch of comfort, on this 15-day Vietnam journey. Uncover the delights and appreciate the history of Vietnam on a small group adventure.\n","highlights":["Cruise down the Mekong Delta","Explore the seaside town of Nha Trang","Visit the Cai Be floating market","Soak in natural mud baths"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/62383_5c7e45.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/62383_5c7e45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_d64bd411.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_443a41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_f17b67d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_4b0673bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_3be02e93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_557018cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_214815d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_9cc5f972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_063530f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_af87cc61.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_d66542fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_5e692cf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_72aad40b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_39643632.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_ae02c381.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_7917d1f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_b2a578a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_e623d429.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_8bf4ce23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_0bf5df38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_306da05b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_1721e266.jpg","https://cdn.tourradar.com/s3/tour/1500x800/62383_19064f7a.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Arrive in Ho Chi Minh City where you'll be met and transferred to your hotel. There are no activities planned until an important group meeting in the evening, usually at 6 pm. If you do have time, get out and acquaint yourself with the city beforehand – it is a bustling centre of shopping, historic sites and traffic mayhem. Afterwards, enjoy a welcome dinner with your group at one of the city's excellent eateries.\nAccommodation: M Boutique Hotel (formerly the Millennium Boutique Hotel)  or similar"},{"title":"Day 2: Mekong Delta","description":"After breakfast, drive south to Ben Tre for a boat cruise along the intricate and beautiful waterways of the Mekong Delta. En route you'll stop and visit an orchard and sample some local tropical fruit and visit some local cottage industries. As the sun starts to drop, continue to your local guesthouse, your place of rest tonight. Here you will enjoy a beautiful home-cooked meal of local specialties.\nAccommodation: Mekong Delta Guesthouse"},{"title":"Day 3: Ho Chi Minh City","description":"Today you'll return to Ho Chi Minh City, and take a bus and walking tour around the city. You'll visit Reunification Palace, the War Remnants Museum and the Notre Dame Cathedral. Admire the many beautiful French colonial buildings along the way, such as the main Post Office and the former Hotel de Ville (city hall). Ho Chi Minh City is full of history and you will visit many of the major sites today.\nAccommodation: Millennium Boutique Hotel or similar"},{"title":"Day 4: Dalat","description":"This morning after breakfast, head on a half-day trip to the Cu Chi Tunnels – an extensive underground network (some 200 kilometres) of tunnels dug initially by the Viet Minh and later expanded by the Viet Cong. They contained hospitals, dwellings and schools and were used extensively for refuge and storage, as well as being a military base. As you explore this extraordinary labyrinth you will learn more about its history and the 1968 Tet Offensive. A section of the tunnels has been widened to allow tourists to get a feel for what the underground life must have been like. Please note that these tunnels will be hot and can get claustrophobic, so there is an option if you’d like to view from above ground. Later this afternoon, fly to Dalat (approximately 1 hour).\nAccommodation: Dalat Hotel"},{"title":"Day 5: Dalat","description":"Dalat is high in Vietnam’s southern highlands, and is surrounded by hills, pine forests, lakes and waterfalls – it is a natural mountain paradise. Dalat, commonly known as the City of Flowers, is part of a region ideal for growing crops and flowers that cannot be otherwise grown in Vietnam, because of its temperate climate and high rainfall. Today, visit some of these plantations, including the renowned flower and vegetable gardens, a coffee plantation, and an interesting visit to a cricket farm, where you may have the chance to taste these delicacies. Afterwards, see the process of silk making at a silk farm, then head deep into nature in search of some stunning waterfalls. Today is a jam-packed day, so perhaps choose to relax this evening. If you still want to keep exploring, there are some vibrant night markets in the centre of town, spilling into the streets around Nguyen Thi Minh Khai.\nAccommodation: Dalat Hotel"},{"title":"Day 6: Hoi An","description":"Enjoy a free morning in Dalat to perhaps explore the Bao Dai Summer Palace and gardens, or head to the Crazy House – a bizarre guesthouse commissioned by avant-garde architect Hang Nga, who still lives on site. In the afternoon, take a short flight to Danang (approximately 1 hour). From here you will embark on a short ride by private vehicle to Hoi An (approximately 1 hour). Hoi An was originally a Cham port town but has been influenced by traders from many cultures. With its charming low tiled houses and tranquil feel, this is a delightful town to walk around. You'll notice a distinctly Chinese appearance here, with pagodas and assembly halls scattered along the narrow lanes.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 7: Hoi An","description":"A morning walking tour today takes you to a historic house (formerly home to a prominent trader), the Japanese Covered Bridge, a Chinese assembly hall and a museum. Afterwards, sit down to a delicious lunch with the group. This afternoon you are free to make the most of Hoi An and its surrounding areas. Your leader will be able to help with suggestions for extra activities in Hoi An and the surrounding countryside.\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 8: Hoi An","description":"The day is yours to spend as you please in this historic haven. Hoi An is renowned for its specialist tailors and some do same-day turnaround, so perhaps take this opportunity to get some clothing made from some unique local fabrics. If you feel like getting active, beautiful Cua Dai Beach is located nearby and is easily accessible by bicycle (you can rent them in town). Otherwise, book in a tour to My Son Cham to explore the ruins dating back to the 4th century. You might also like to visit a local workshop to learn how to make your own rice paper. A Vietnamese cooking class too is a great way to familiarise yourself with some age-old culinary techniques, not to mentioning feasting on the fruits of your own labour!\nAccommodation: The Villa Hoi An Boutique Hotel or similar"},{"title":"Day 9: Hue","description":"Depart Hoi An today bound for Hue: the former imperial capital and hub of Vietnam's historic past. En route, pass through the Hai Van Pass – a scenic mountainous stretch of highway with views across Lang Co beach. Arrive in Hue and discover its eclectic mix of frenetic streets and peaceful beauty. In the afternoon you will visit the Imperial Citadel, including the Forbidden Purple City. The latter was almost completely destroyed during the Tet Offensive in the Vietnam War, but its humble, foliage-covered ruins remain a testament to its proud history. Here you'll gain some insight into the horrific damage endured during the war.\nAccommodation: Cherish Hotel or similar"},{"title":"Day 10: Hue","description":"Venture out this morning for a local breakfast, feasting on a popular dish called bun bo hue, which contains rice vermicelli (bun) and beef (bo). This is a signature of the city, and is a fresh and delicious start to the day. Head in a private vehicle to Tam Giang lagoon – one of South East Asia’s largest freshwater areas, which provides this part of the country with a rich ecosystem and fruitful fishing ground. It is where the region’s three largest rivers – Huong, Bo and O Lau – meet before they reach the sea. Take a boat trip on the lagoon, passing by local fisherman on their daily catch, and then head to a local home for a prepared seafood lunch. If your fishing adventure did not provide much to eat, not to worry – the locals will ensure that there’s enough food to go around, including vegetarian options. In the afternoon, take a visit to the Thien Mu Pagoda, the unofficial symbol of Hue. The Pagoda is an active Buddhist monastery that dates back to 1601. You will also visit the elaborate royal tomb of Emperor Tu Duc, with its beautiful lake, frangipani and pine trees. Afterwards, travel back to your hotel for a relaxing evening.\nAccommodation: Cherish Hotel or similar"},{"title":"Day 11: Hanoi","description":"Fly from Hue to Hanoi today (approximately 1 hour and 10 minutes). Your departure will mostly likely be in the morning but can vary a little depending on flight schedules. After some free time on arrival, be taken through the ancient 36 Streets and discover a varied selection of shop-lined alleys that sell everything from souvenirs to exquisite silk clothing, jewellery and beautifully embroidered tablecloths. In the afternoon, be treated to a traditional Hat Xam performance. Hat Xam is an artform of Northern Vietnam dating back to the Tran Dynasty, and literally translates to ‘singing in darkness’. Originally, this was performed by blind performers, and was enjoyed by local working-class audiences, right up until the late 1950s, when a wave of communism deemed all art forms to be corrupting influences. Today, this style of performance occurs rarely, but you and your group will be taken to a private club house for an exclusive performance; one of the few places where such artists still perform acoustically. The performance takes around 90 minutes, and includes some story telling aspects, performances and possibly interaction with guests, so be ready to get involved!\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 12: Hanoi","description":"Enjoy a guided half-day tour of Hanoi, visiting the major sights, including the Temple of Literature, One Pillar Pagoda and the former residence of Vietnam’s most famous revolutionary, Ho Chi Minh. Enjoy a delicious lunch at KOTO restaurant – an Intrepid Foundation supported program that teaches disadvantaged youth hospitality skills. In your free time, the Vietnam Fine Arts museum is well worth a visit. Walking is a great way to explore the city, many lakes and parks provide enjoyable escapes. You'll see that this enchanting northern capital can be quieter than its southern counterpart, and the West Lake, north of the main city, is an ideal place to interact with the locals and relax by its banks.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 13: Halong Bay","description":"Leave your luggage at the hotel and pack an overnight bag as you drive to Halong Bay (approximately 3 hours). Take in glorious views of this World Heritage-listed beauty and its spectacular limestone islands. You will travel to Tuan Chau Port (Halong City West) and board a boat for an exploration of the karsts and caves in the bay, stopping to explore Surprise Cave on foot. Access to Surprise Cave is via staircases. Once inside the cave the pathways are a little uneven and slippery. On board your ship, enjoy a seafood lunch and dinner, with other dietary options available. During the warmer months your leader will discuss the option for swimming from Ti Top Island. There is also the option for kayaking to get up close to the towering limestone karsts. A candle-lit dinner on the deck of the boat (weather permitting) is a truly memorable experience, as the views at sunset are stunning.\nAccommodation: Halong Bay Overnight boat (feature stay)"},{"title":"Day 14: Hanoi","description":"In the morning, sail back to the port, disembark and take a bus back to Hanoi (approximately 3 hours). Arriving back in the capital, there will be a few hours free to wander around and enjoy some of the city’s attractions you may have missed the first time. You can shop on Hang Gai Street or perhaps enjoy some afternoon tea at the Metropole Hotel. In the evening, enjoy a dinner in a Hanoi restaurant, sharing stories with your newfound friends.\nAccommodation: Lan Vien Hotel or similar"},{"title":"Day 15: Hanoi","description":"After breakfast, you are free to leave at any time, as there are no activities planned today. If you would like to spend some more time in Hanoi, we’ll be happy to organise some additional accommodation for you (subject to availability)."}]},{"name":"Best of Vietnam","duration":20,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":2345,"summary":"Experience quintessential Vietnam on this comprehensive trip from south to north. Travel from Ho Chi Minh City to Hanoi and experience dynamic cities, tranquil backwaters, imperial ruins, faded colonial elegance and picture-perfect landscapes dotted with reminders of the past. Explore the narrow cobbled streets of Hoi An’s Old Town, explore fossilised coral shelves in Hang Rai and whizz through the back streets of Hue as you uncover the very best of Vietnam.During this trip, there will be several long days of travelling and you'll be sitting on a bus for many hours at a time. However, road trips often have the best views, and most private buses feature wi-fi","highlights":["Visit one of the most important sites in Ho Chi Minh City, the famous Cu Chi Tunnels","Travel south by private bus for about three hours to Cai Be","Take a boat to explore the nearby islands of Nha Trang","Go by bus to Phong Nha-Ke Bang National Park","Make your way to the peaceful town of Mai Chau","Drive to Bai Chay Harbour towards the famous world heritage site of Halong Bay"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/1839_2cad1468.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/1839_2cad1468.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_a7407b47.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_66c5af00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_fced6c50.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_9065e929.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_39f43ba1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_f5a18ae3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_a267cbcf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_807b57de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_43599204.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_f725d381.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_73a6867e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_2a34e7b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_f5f31ef3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_1b5f2a2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/1839_19911edb.jpg"],"destinations":["Ho Chi Minh City","Dalat","Hoi An","Hue","Ninh Binh","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1: Ho Chi Minh City","description":"Xin chao! Welcome to Ho Chi Minh City, Vietnam. Your adventure begins with a welcome meeting at 6 pm today. Because this trip doesn’t spend much time in Ho Chi Minh City, why not arrive a day or two early to see the sights? Ho Chi Minh City has a dynamic atmosphere and a French influence. Perhaps head to Pham Ngu Lao Street to see the local open-aired market, visit Vinh Nghiem Pagoda or one of the amusements parks. After the welcome meeting, you may like to join your group for an optional meal at one of the city's fantastic eating spots.\nAccommodation: Hotel"},{"title":"Day 2: Ho Chi Minh City","description":"For the first full day of your trip, you’ll visit one of the most important sites in Ho Chi Minh City, the famous Cu Chi Tunnels. These complex tunnels were used by the Viet Cong in the long war against the Americans and were instrumental to the Vietnamese victory. Be amazed by the ingenuity of these dangerous tunnels. Later in the day, take a tour of the city, passing the Reunification Palace, Notre Dame Cathedral and the Opera House. Head to the War Remnants Museum for a sobering yet informative lesson on the Vietnam War. Here you’ll see things like old military equipment, an F5A fighter and a UH1-Huey helicopter.\nAccommodation: Hotel"},{"title":"Day 3: Mekong Delta Homestay","description":"Travel south by private minibus for about three hours to Cai Be. When you arrive, you’ll board a boat and explore the intricate waterways of the Mekong Delta. Often referred to as ‘the rice bowl’ of Vietnam, the fertile delta is where rice, tropical fruit and flowers are grown for the whole country. Hop off the boat to visit an orchard and sample some tropical fruit. You’ll then continue on the cruise to visit some local cottage industries. Get to see local life and the industries surrounding the river up close. Around sunset, you’ll make your way up one of the many canals to your homestay where you’ll enjoy a wonderful meal of local specialities. The accommodation tonight will be simple, but the experience will be rewarding.\nAccommodation: Homestay"},{"title":"Day 4: Ho Chi Minh City","description":"Travel back to Ho Chi Minh City (about three hours) and enjoy some free time to do a bit of sightseeing. We recommend exploring the city’s restaurants and trying Ho Chi Minh City’s distinctive food. In contrast to the north of Vietnam, the cuisine here is spicier, sweeter and more varied. There are also plenty of street food stalls if you’d like to take a few bites of the local fare.\nAccommodation: Hotel"},{"title":"Day 5: Dalat","description":"After exploring Ho Chi Minh City, take a bus transfer to Dalat. Temperate and cool compared to the rest of the country, Dalat has gained the name “City of Eternal Spring” due to the mists that cover its nearby valleys nearly all year around. This fairytale nickname spreads to its amazing architecture – the Hang Na guesthouse, an expressionist masterpiece, stands as a towering, melted stone obelisk over the lush garden below. There’s also plenty of charming Art Deco-influenced structures and gardens littering the area as well. Perhaps go for a wander through the streets for a better feel of the city or find a café for a cup of artichoke tea, a regional specialty.\nAccommodation: Hotel"},{"title":"Day 6: Dalat","description":"Dalat’s soothing climate isn’t just a great reprieve from the heat of Vietnam's coast, it also creates the perfect environment to grow a wide selection of fruits, vegetables and herbs. Take a full day to stroll through the tranquil gardens of this city, darting past plantations full of plump vegetables, dazzling flowers, medicinal herbs, aromatic lavender and juicy strawberries.\nAccommodation: Hotel"},{"title":"Day 7: Phan Rang","description":"This morning travel by minibus to the coastal town of Phan Rang (approximately 3 hours). Visit the nearby Po Klong Garai Cham Towers, an archaeological site from the middle ages dedicated to the indigenous goddess. Gain an insight into an ancient tradition with a visit to the oldest pottery village in South East Asia, Bau Truc. Enjoy free time for the rest of the day. Make sure to ask your leader for restaurant recommendations to sample the excellent local seafood.\nAccommodation: Hotel"},{"title":"Day 8: Phan Rang / Overnight train","description":"Take a day trip to Vinh Hy Bay, a picturesque, crescent-shaped harbour between Phan Rang and Nha Trang. Along the way, you’ll stop at the Bau Nai fish market for a glimpse of the bustle of activity as fish are unloaded and locals hurriedly shop for the best deal. Continue to a salt field. Rivalling the beauty of the Vietnamese countryside, central Vietnam’s sprawling salt fields are a sight to behold. Witness workers raking and collecting salt that has evaporated from the salty waters of Vietnam’s coast, which has been funnelled inland into shallow fields. Next, visit another place of great natural beauty – the moss-covered rock formations and fossilised coral reefs of Hang Rai. Finally, arrive at Vinh Hy Bay, where you’ll have plenty of time to swim and snorkel in its warm, coral-filled waters.\n\nThis evening, board an overnight train to Da Nang. Conditions are basic on these trains and hygiene standards may be lower than what you’re used to at home, however overnight trains are the best way to brush shoulders with the locals and make the best use of your time. Most trains have a dining carriage serving simple food, but we recommend stocking up on snacks before you board.\nAccommodation: Overnight sleeper train"},{"title":"Day 9: Hoi An","description":"Begin with an early arrival and bus transfer from Danang to Hoi An. Recently declared a World Heritage site, Hoi An was a major trading port with the West from the 15th to the 19th century. Today it has been restored to look exactly as it did more than a century ago, giving it an old-world feel full of nooks and crannies to explore. \n\nYou’ll have some free time this afternoon. Hoi An is very much a shopping mecca. Why not browse the paintings, woodwork, ceramics, embroidery all made by the locals? The city is also famous for its talented tailors who work with beautiful fabrics for a good price.\nAccommodation: Hotel"},{"title":"Day 10: Hoi An","description":"Enjoy another free day in the town of Hoi An. You’ll have time to see the beautiful Chinese shophouses, enjoy the busy market, visit Cua Dai Beach, cycle to the rice fields or browse the array of art galleries.\nAccommodation: Hotel"},{"title":"Day 11: Hue","description":"Depart Hoi An and visit the white sand and blue sea of My Khe Beach. Continue on the journey and cross the dramatic Hai Van Pass and make a quick stop at the fishing village of Lang Co. Get back in the minibus again and make your way to Hue. The total driving time today will be about five hours. \n\nArrive in Hue, the former imperial capital of Vietnam. Hue contains the treasures of Vietnam’s royal history, and has a curious blend of bustling streets and tranquil settings. Your excursion here will be to the Imperial Citadel. This fortress houses the Imperial City and the citadel-within-a-citadel, the Forbidden Purple City. This icon was almost completely destroyed during the Vietnam War, and the ruins and holes left by bombs are a reminder of the destruction caused by the war.\n\nIn your free time you might like to visit to Dong Ba Market which offers locally made goods, fresh produce and tantalising street food. This is a good place to try the specialties enjoyed by Emperor Nguyen such as the banh khoai royal rice cake.\nAccommodation: Hotel"},{"title":"Day 12: Hue","description":"Today’s adventure will be taken on the back of a motorbike. You’ll have your own driver who will take you first on a drive around the Imperial Citadel, then to the Thien Mu Pagoda, the unofficial symbol of Hue. This site dates back to 1601 and is still an active Buddhist monastery. Here you’ll also see the car left by a monk who set himself alight to protest the treatment of Buddhists by the South Vietnamese regime. Break up your sightseeing with a dragon boat cruise on the Perfume River before getting back on your motorbike and riding to a special lunch spot at a convent where you'll enjoy a delicious vegetarian feast. After lunch, drive to the royal tomb of Emperor Tu Duc, set amid a lake, frangipani bushes and pine trees. The evening is free for you to sample more local specialities.\nAccommodation: Hotel"},{"title":"Day 13: Phong Nha-Ke Bang National Park","description":"Get on a minibus this morning on your way to the Vinh Moc Tunnels. These were used during the Vietnam War as shelter for the villagers who were escaping intense bombing. The locals lived in the underground system that went over three levels. You’ll be able to enter the tunnels which remain in their original form. This afternoon continue on to a picturesque village outside the Phong Nha-Ke Bang National Park. Our accommodation here is situated on a farm, with rooms set in bungalows positioned throughout the property. The 'farmstay' was established to help the small town benefit economically from tourism, while it has also adopted recycling and waste management programs.\nAccommodation: Hotel"},{"title":"Day 14: Phong Nha-Ke Bang National Park / Overnight train","description":"Today visit the Phong Nha-Ke Bang National Park. This UNESCO World Heritage site contains the oldest known karst mountains in Asia. The area is also known for its enormous cave system. You’ll visit the Thien Duong Cave (Paradise Cave), then take a cruise up the Son River towards the Phong Cave. The scale of the place is truly astounding. In the late afternoon, travel to Dong Hoi and catch an overnight sleeper train to Hanoi. The journey will take about 10 hours.\nAccommodation: Overnight sleeper train"},{"title":"Day 15: Hanoi","description":"Arrive in Hanoi early in the morning and transfer to your hotel. Vietnam’s capital is famous for its beautiful lakes, shaded boulevards, public parks and French-style Old Quarter. As an emerging city in South East Asia, Hanoi has an attractive contrast of modern office buildings, old Buddhist temples and a labyrinth of ancient streets. Later in the day, you’ll visit the Ho Chi Minh Mausoleum complex, including One Pillar Pagoda and the Ho Chi Minh Museum.\nAccommodation: Hotel"},{"title":"Day 16: Da Bac","description":"Leave Hanoi after breakfast around 8 am and make the drive to Sung village (approximately 4 hours). There are around 70 families living at Sung Village and the majority are Dzao ‘Tien’ people. Farming and forest plantation are their main source of income. Enjoy lunch at your homestay then take an introductory walk around the village. After getting to know the village better, take a short trek (2 kilometres) to the alluring Sung Cave and visit a 100-year-old tea plantation. The trek has some steep and slippery sections so please ensure you have suitable footwear for this activity. After a handicraft workshop, return to your homestay accommodation for a nice hot shower and a delicious dinner.\nAccommodation: Homestay"},{"title":"Day 17: Hanoi","description":"This morning, have an opportunity to take in more of the Vietnamese highlands on a 10 kilometre (6.2 mi) trek from Sung Village to Da Bia. The first 8km of the trek is mostly flat ground along well-worn buffalo tracks. The final 2km gradually inclines and for a period of approximately 300m there are some steps to climb, however the walk will be a steady relaxed pace. Keep an eye peeled for the monumental stone at the peak of Da Bia Mountain during the hike that takes us through the local villages, meeting people from the ethnic Muong tribe along the way. Stop for lunch at Da Bia before enjoying a scenic 1.5 hour boat cruise on Hoa Binh hydropower reservoir. Arrive at Thung Nai then board a bus transfer to Hanoi (approximately 2 hours). Arrive in Hanoi at around 6 pm. This evening is free for you to explore this delightful city. Why not relax with a bia hoi (freshly brewed draught beer) at one of the microbars in the Old Quarter?\nAccommodation: Hotel"},{"title":"Day 18: Halong Bay","description":"Drive to Bai Chay Harbour towards the famous world heritage site of Halong Bay. The drive will take around four hours and takes you to the blue-green bay studded with limestone outcrops. The area is full of beaches and natural grottos. You’ll take a boat through the limestone peaks and caves filled with stalactites and stalagmites, and have the chance to go for a swim or perhaps take a kayak out on the bay. Spend the night on board the boat beneath a sky alive with starlight. The boat has twin-share cabins with air-conditioning and private facilities. There’s also a dining room and bar where you can enjoy the day’s meals.\nAccommodation: Overnight boat"},{"title":"Day 19: Hanoi","description":"Return to Hanoi, arriving mid afternoon after an approximately four hour drive. Enjoy a performance of water puppetry, a unique and traditional Vietnamese art form. Afterwards, perhaps mark the end of your trip with an optional farewell dinner. Spend a final night in Hanoi before the trip ends tomorrow.\nAccommodation: Hotel"},{"title":"Day 20: Hanoi","description":"There are no activities planned for the final day and you are able to depart the accommodation at any time. There’s so much to see and do in Hanoi, why not stay a day or two longer? We’ll be happy to book additional accommodation for you (subject to availability). In any extra time, you may like to do an Urban Adventure tour. Your leader will be able to assist you in booking the tour of your choice. See urbanadventures.com/destination/hanoi-tours."}]},{"name":"Central Vietnam Culinary Tour","duration":5,"travelStyle":["Food & Culinary","Family","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":450,"summary":"The destination for this tour is Vietnam Centre. The cuisine in central Vietnam is seen by many as the most culturally authentic with the dishes generally well-seasoned and spicy. Plus, the food in this region of the country is heavily influenced by Hue’s culinary traditions and imperial court cuisine. We also have opportunities to discover the 2 heritages site that is Hue citadel and Hoi An ancient town.\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146567_4030f191.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146567_4030f191.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146567_4a2a6c0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146567_ca7d96d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146567_42977659.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146567_ec7c86c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146567_b50d8cda.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Day 1: Hue Arrival","description":"Meal: Dinner- Accommodation: Hotel in Hue\nArrival at Phu Bai Airport, pick up and drive to Hue, the ancient capital of Vietnam from 1802 to 1945. Afternoon, proceed to Thien Mu, an ancient pagoda and symbol for Hue city. Have a walk around Kim Long Village to visit the original ancient house of the former mandarin, mingle with local people and experience their daily activities in the village.  Have a dinner with Royal meal."},{"title":"Day 2: Cooking Class – City Tour in Hue","description":"Meal: Breakfast, Lunch, Dinner- Accommodation: Hotel in Hue\nWe wake up early to discover Dong Ba Market, the biggest wholesale market in Hue for food, vegetable, herb, spices and fruit. Everything is so fresh in the morning and this is best time and best way to have real experiences with the local food and see daily life activities in Hue. After breakfast at the hotel, you will have a chance to enjoy an exciting cyclo trip from the hotel over famous Trang Tien bridge, around the ancient citadel of Hue, getting over the streets, local shops for the overview of daily life and architecture of this famous citadel. The cyclo will take you to  nice restaurant to join in one of the best cooking class in Hue. You will learn how to cook some popular dishes in Hue like Spring roll, Pancake, and Grilled beef, Banana Flower Salad. Then enjoy the food by self-prepared and the restaurant.\nAfternoon, You will then move on your journey to one of Vietnam’s seven UNESCO World Heritage Sites, Imperial Citadel and the Forbidden City, to find out the hidden charm of this little town. Continue to visit Tu Duc Tomb, one of the most beautiful and picturesque and largest works of architecture of Nguyen Dynasty’s royal palaces and tombs. You will enjoy dinner with typical kind of Hue cake. Overnight in Hue."},{"title":"Day 3: Hue – Danang – Hoi An","description":"Meal: Breakfast, Lunch, Dinner- Accommodation: Hotel in Hoi An\nMorning departs to Danang through Hai Van Pass. Upon arrival, visit Cham Museum with a great collection of sandstone artifact from 4th to 13th century. Arrive in Hoi An, the little attractive town which was originally one of the major trading centers of Southeast Asia in the 16th century. Lunch at Restaurant.\nAfternoon, you will stroll on Ancient Hoi An street to discover Hoi An town with Phuc Kien congressional assembly hall, Japanese Cover Bridge and Tan Ky ancient house. In the evening, you will have a chance to try to most famous and popular local food in Hoi An in the restaurant. Overnight in Hoi An."},{"title":"Day 4: Hoi An Cooking Class","description":"Meal: Breakfast, Lunch – Accommodation: Hotel in Hoi An\nMorning you will visit to Tra Que herb village near Hoian. This is a lovely village grow organic herb for supplying to Hoi An people. You will have a chance to interact with the local farmer and learn about many type of herb and the way how they grow them. You then transfer for one of the best cooking class in Hoi An. Starting with learn about Vietnamese ingredients & how to choose fresh foods in the local market.  Next is a short talk on the art of Vietnamese gastronomy, vegetables, herbs & spices & how to prepare & use them. You then back to the class to practice with learning cooking & cutting techniques & how to use a Vietnamese vegetable grater & knife. The menu for this class is:\n\nFresh Spring Rolls & Shrimp\nGreen Papaya Salad\nGrilled tuna in banana leave\nCrispy Pancake\nAfternoon depart for the cyclo trip to Cam Nam Village, is a nice getaway from the hectic pace of central Old Town. You will have the first stop for the photo opportunity of the activities and scenery on the Thu Bon River. You will cycle along the Thu Bon Riverbank, where you can have a panorama view of Hoi An from another side of the river. Continue riding along the riverside through Cam Nam village to enjoy the peaceful and see the daily life off local people. You can experience the local daily life along river, such as fishing, farming, catching clam…. Come back to Hoi An around sunset time. Overnight in Hoi An."},{"title":"Day 5: Hoi An – Danang – Departure","description":"Meal: Breakfast – Accommodation: N/A\nYou will be free until the convenience time, our car will transfer to the airport for your departure flight."}]},{"name":"Treasure of Vietnam (North to South)","duration":10,"travelStyle":["In-depth Cultural","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":986,"summary":"Our Treasure of Vietnam tour is designed to give you the best Vietnam holidays in 10 days, offering you a taste of the country","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119777_3aa70bdf.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119777_3aa70bdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_413127c2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_6c1ad8c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_3084905e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_42a85917.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_adc15b6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_3571beb2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_c82bd0ef.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_1a962bd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_12f06682.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_ee48fbbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_21b52fc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_9a03070c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_b366f248.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_1bb06dae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_ea2fa598.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_66ebec0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_05ce4811.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_cb1d534a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_ace52715.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_1d1e126d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_3f737ac2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_bc3dab9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119777_2ff5c50a.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Meals: Dinner\nWelcome to Hanoi – Vietnam’s historic and charming capital. Your driver and tour guide will meet you at Noi Bai International Airport and take you to your hotel in the city center. In the afternoon, enjoy a city tour visiting Hanoi’s main attractions like: Hoan Kiem Lake, Ngoc Son Temple, The Old Quarter, Hanoi Opera House, and St. Joseph Church.\nEnjoy dinner at a Vietnamese restaurant."},{"title":"Day 2: Hanoi - City Tour","description":"Meals: Breakfast, lunch\nToday you have a full day to explore the capital of Vietnam. You will start with the Ho Chi Minh Mausoleum, the Presidential Palace, Ho Chi Minh’s stilt house at the back, the One Pillar Pagoda in its vicinity, the Temple of Literature – the first University of Vietnam, and the delightful scene around West Lake at the heart of Hanoi, including the well-preserved Tran Quoc Pagoda and Quan Thanh Temple. Learn more about Vietnamese people with a visit to Ethnology Museum that houses a fabulous presentation of Vietnam’s ethnic minorities, featuring well-presented tribal art, artefacts, and everyday objects gathered from across the nation, and miniatures of traditional village houses.\nLater in the afternoon, you will enjoy a traditional Water Puppet performance for an intimate insight into Vietnamese rural life throughout history. Originated in the Red River Delta in the 11th century, water puppetry hails from the country’s wet rice culture and is as old as the city itself, sketching a lively and colorful picture of an agricultural society typical of the North with a humorous twist to every skit. Stay overnight in Hanoi."},{"title":"Day 3: Halong Bay","description":"Meals: Breakfast, lunch, Dinner.\nNo best Vietnam holiday can be complete without the ravishing seascapes of Halong Bay to feed your love for tropical beaches. After getting picked up from your hotel, you will be transferred to the astounding Halong Bay, one of most popular Vietnam holiday destinations, at 12:00 pm. You will be welcomed aboard and sailing into the bay, through innumerable islands and islets, while lunch is being served. After lunch, you will take a short trek to a nearby summit to feed your eyes on the magnificent panoramic view of the bay dotted with golden sails. Seize this chance to swim in the calm water or kayak around this ethereal seascape or just simply sunbathing on the sundeck.\nLater in the afternoon, pay a visit to a quaint fishing village for an opportunity to talk with fishermen who have inhabited the bay for almost three generations. Go back to the ship to watch the crepuscular rays fade into a riveting abyss of orange and enjoy dinner as the ship sails to a peaceful body of water for an overnight stay on board."},{"title":"Day 4: Halong Bay / Hoi An","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Hanoi.\nKickstart your day with an early Tai Chi Session on the sundeck and you will be rewarded with an unparalleled visual glory of the sun peeking above the watery horizon. After breakfast, you will visit an enigmatic limestone grotto and then go back to the ship for a final glimpse of Ha Long Bay as you cruise back to the dock. Check out as the ship arrives at the harbor by noon and drive back to Hanoi for your flight to Danang. Upon arrival, you will be transferred to your hotel in Hoi An and stay there for the night."},{"title":"Day 5: My Son - Hoi An","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Hoi An.\nMeals: Breakfast, lunch\nIn the morning, you will go back in time with a visit to My Son Sanctuary, also known as “the Angkor Wat of Vietnam” – a cultural heritage recognized by UNESCO in 1999. The majestic capital of the once-thriving Champa Kingdom with multiple Hindu temples devoted to the god Shiva, unfortunately, is now a cluster of ruins due to age and bombing, standing as a witness to the glorious bygone era.\nLater in the afternoon, you will take a half-day walking tour through the narrow winding alleyways visiting some well-preserved historical sites such as Chua Ong Pagoda, Chinese Assembly Halls, the 200- year old Tam Ky ancestral house, and the Japanese Bridge. After that, there will be free time for you to shop or relax. You will stay overnight in Hoi An."},{"title":"Day 6: Hoi An - Hue","description":"Meals: Breakfast, lunch- Accommodation: Hotel in Hue\nThis morning, you will be transferred to the poetic city of Hue – Vietnam’s former imperial capital from 1802 to 1945 and one of its seven UNESCO World Heritage Sites, via the Han Van Pass. Stop en route to pay a visit to the Marble Mountain – famous for delicate stone sculptures and crafts, and arrive in Hue in the afternoon. After checking in to your hotel, spend the rest of the day on your own arrangement."},{"title":"Day 7: Hue - Ho Chi Minh City","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Ho Chi Minh City\nToday, our guide will take you to Minh Mang Tomb, located around 12 km to the south of Hue City center. Embark on a scenic boat trip on a Royal Dragon Boat to the historic seven-storey Thien Mu Pagoda dating back to the 17th century serenely perched on Ha Khe Hill, overlooking the shimmering waves of the Perfume River dreamily winding its way through the ancient capital. The picturesque combination of the Perfume River and Thien Mu Pagoda has been immortalized in poetry and silk paintings for centuries.\nTake in the poetic cityscape of Hue and let the hidden charm of Hue, manifested itself in the Imperial Citadel and the famed Forbidden City, transports you to a Vietnam of yore. The lively Dong Ba Market provides rich pickings for shoppers so you might want to consider doing some shopping before the guide sends you to the airport to board your next flight to Ho Chi Minh City. Upon arrival, you will be picked up and sent to your pre-booked hotel."},{"title":"Day 8: Ho Chi Minh City- Cu Chi Tunnel","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Ho Chi Minh City\nAfter breakfast, proceed to the Cu Chi Tunnels, comprising more than 200 km of underground tunnels and standing as a witness to the searing memories of the Vietnam War. The main axis system branches out to underground hideouts, bomb shelters, and entrances to other tunnels. Its underground system is comprised of numerous trap doors, living areas, sleeping chambers with bamboo beds, storage facilities, weapon factories, field hospitals, command centers, and kitchens. Nowadays, the remaining parts have become a major tourist attraction, offering its visitors a unique insight into life during wartime. Go back to the city center for lunch on your own arrangement.\nAfter lunch, tour around the city with en route visits to The War Remnants Museum, the centuries-old Notre Dame Cathedral, the Old Post Office, and The People’s Committee Hall."},{"title":"Day 9: Ho Chi Minh City","description":"Meals: Breakfast, lunch – Accommodation: Hotel in Ho Chi Minh City\nThe trip to the Mekong Delta offers you an immersive experience exploring its exotic water civilization and luxuriant fluvial landscapes with sprawling rice paddies. Our tour guide and driver will meet you at your hotel and take you to Cai Be Floating Market. Take a cruise amongst local barges piled up with fresh produce, pay a visit to some local workshops and enjoy lunch al fresco under the cool shade of An Binh Island’s lush orchards.\nIn the afternoon, hop on a sampan and venture into the countryside and witness the living, breathing work of art that she is. As you glide through the narrow canals, take in the tranquillity of the surroundings and lose yourself in the labyrinth of water arteries, lush orchards, exuberant mangrove vegetation, and velvety rice fields. Stop by a nursery garden to watch farmers grow their famous fruit and vegetables. Your cruise ends in Vinh Long. Your driver will be waiting for you at the dock to take you back to Saigon City center."},{"title":"Day 10: Ho Chi Minh City Departure","description":"Meals: Breakfast – Accommodation: N/A\nAfter breakfast at the hotel, our guide will accompany you to the airport to catch your scheduled flight. Hopefully, you will have the best Vietnam holidays with our Treasure of Vietnam tour."}]},{"name":"Highlights Of Vietnam","duration":12,"travelStyle":["In-depth Cultural","Group","Fully Guided","Coach / Bus","Historical","Holiday"],"oldPrice":2639,"price":2375,"summary":"Float on the sparkling emerald waters of Halong Bay on a traditional Vietnamese Junk. Glide past hidden islets, giant limestone karsts and colourful fishing villages, stopping only to gain insight into the lives of the local fishermen at Cua Van and to practice T'ai Chi in exquisite surroundings.","highlights":["Float on the sparkling emerald waters of Halong Bay","Learn the lives of the locals at colourful fishing villages","Practice the art of T'ai Chi in exquisite surroundings","Enjoy lunch at one of the great garden houses of Hue"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/93085_fe6c6c3a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/93085_fe6c6c3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_e2af3b65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_762bfc68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_6aa72902.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_3a7ef7e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_ff55cdd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_a61ec027.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_40cd4f31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_c2a88842.jpg","https://cdn.tourradar.com/s3/tour/1500x800/93085_9d7e63c7.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: ARRIVE HANOI (2 NIGHTS)","description":"Relish the warm embrace of Vietnam and her welcoming people, who will touch you with their humility and entrepreneurial spirit throughout your journey across this intoxicating land. Upon arrival, transfer to your hotel before meeting your Travel Director and fellow travellers for a Welcome Reception with drinks and local appetisers."},{"title":"Day 2: HANOI SIGHTSEEING","description":"This morning is dedicated to the revolutionary leader who fanned the flames of Vietnam's independence. We begin our day with a visit to the final resting place of \"Uncle Ho\", the imposing Ho Chi Minh Mausoleum. A short walk from here, we'll find Ho Chi Minh's house on stilts, where we'll 'Dive Into Culture' exploring the grounds surrounding the humble abode of Vietnam's most famous son. We'll continue to the Temple of Literature, the first university for the sons of Mandarins, to gain insights into Hanoian culture. This afternoon, we'll embark on a cyclo tour, weaving through the lively Old Quarter past colourful shopfronts and street food vendors. Enjoy an evening at leisure or consider joining one of our recommended Optional Experiences to watch a show that uses the ancient art of water puppetry to story-tell the daily lives of Vietnamese people."},{"title":"Day 3: HANOI - HALONG BAY CRUISE","description":"We leave the busy streets of Hanoi behind, bound for the serenity of Halong Bay where we'll board a traditional-style Vietnamese Junk boat. The limestone karsts and tropical islets rising up from the emerald waters provide an ethereal backdrop for our leisurely cruise. After lunch on board, we'll take a small boat transfer to the Tien Ong Cave and Cua Van Fishing Village, whose residents still live in traditional floating houses. We return to our Junk boat for a cooking demonstration with the chef or enjoy a mesmerising sunset on the top deck before dinner and a peaceful overnight stay in this UNESCO-listed natural wonder."},{"title":"Day 4: HALONG BAY - HANOI - DANANG - HOI AN (3 NIGHTS)","description":"The graceful practice of T'ai Chi eases you into your day as is the local custom. Join a 'Local Specialist' on the deck of the Junk boat for a morning class in exquisite natural surrounds. You'll have time for an early morning swim at one of Halong Bay's quiet beaches and, if you're feeling energetic, a brisk walk to catch one last view of scenic Halong Bay before your drive to Hanoi Airport to catch your flight to Danang. On arrival, transfer to your hotel in Hoi An."},{"title":"Day 5: HOI AN SIGHTSEEING","description":"'Dive Into Culture' this morning, embarking on a walking tour around the ancient town of Hoi An. Embrace its charm of yesteryear - the narrow lanes, colourful marketplaces and ancient temples providing insights into the Vietnam of old. See the old merchant houses and 400-year-old Japanese Covered Bridge, before visiting Thanh Dong Organic Village where you'll spend some time helping local farmers and learning about their daily working routines. Kick back and enjoy a relaxing foot massage that will set the pace for the rest of the day and evening at leisure."},{"title":"Day 6: HOI AN","description":"Enjoy some free time this morning to explore Hoi An further or simply relax at your hotel. Your choice of activities this afternoon could see you learn how to craft your own colourful lantern or gain insights into life as a local fisherman (subject to weather conditions). Create a work of art to bring your home luck and happiness, or cast your net wide for the catch of the day - the choice is yours."},{"title":"Day 7: HOI AN - HUE (2 NIGHTS)","description":"The healthy flavours of Vietnamese cuisine take centre stage as we travel by boat to the Red Bridge Cooking School to learn about the traditional ways of preparing and cooking Vietnamese food. We'll have an opportunity to savour the dishes we've prepared for lunch before returning to Hoi An. This afternoon, our journey takes us over Hai Van Pass en route to Red Beach, where the American Marines first landed in Vietnam during the decades-long war. We continue to Danang for a visit to the Cham Museum before arriving in Hue, the former imperial capital of Vietnam, for our overnight stay."},{"title":"Day 8: HUE SIGHTSEEING","description":"We'll navigate the busy streets of Hue on the back of a cyclo en route to the UNESCO-listed Imperial Citadel, once home to Nguyen emperors. From here, we drive to Thien Mu Pagoda, Hue's best-preserved religious monument. Boarding a local dragon boat next, we cruise along the Perfume River to the house of the former Princess Ngoc Son where we'll 'Connect With Locals' and meet a family member for a 'Be My Guest' lunch to gain a glimpse of their life in this historic house. The afternoon is ours to enjoy at leisure or consider joining one of our Optional Experiences."},{"title":"Day 9: HUE - HO CHI MINH CITY (3 NIGHTS)","description":"A short flight this morning brings you to Ho Chi Minh City, where you’ll enjoy some time at leisure before lunch at BLOOM restaurant. Your visit will 'Make A Difference' to this Culinary Vocational Training facility developed by the charity ‘Aid to Children Without Parents’ that provides training to disadvantaged young people in the hospitality industry enabling them to become self-reliant. The iconic sights of Ho Chi Minh are revealed on a walking tour of Dong Khoi Street next. See the Opera House and the former Hotel de Ville. Then, wander up to Notre Dame Cathedral and the Central Post Office, designed by the renowned Gustave Eiffel. Continue to the War Remnants Museum where you’ll have a vivid glimpse of the war through the eyes of the locals. Your final stop today is Ben Thanh market, one of the earliest surviving structures in old Saigon, before arriving at your hotel."},{"title":"Day 10: MEKONG DELTA","description":"The mighty Mekong beckons today, as we take a day trip to My Tho, a nearby Delta market town. We'll transfer to a small sampan boat and navigate the maze of small canals before stopping for a lunch of delicious Mekong Delta specialities. After a short walk along village roads, we'll visit the house of a former soldier, a 'Local Specialist' who survived fighting the Khmer Rouge. Indulge in the family's colourful stories and learn how they make a living crafting rice paper, before returning to Ho Chi Minh City for an evening at leisure."},{"title":"Day 11: HO CHI MINH CITY","description":"We'll delve into Vietnam's turbulent history from the previous century with a visit to the Cu Chi Tunnels, an immense network of connecting underground tunnels built to protect the Viet Cong guerrillas from the French air and ground sweeps. We'll explore the underground compounds with a VC veteran and gain an understanding of the history of the tunnel, which once served as living quarters and housed hospitals, food and weapons caches. Returning to Ho Chi Minh City by private speedboat, we'll enjoy some free time this afternoon. Later, we'll 'Dive Into Culture' during a visit to the home of the former American Ambassador to South Vietnam in the 1960s, Mr. Henry Cabot Lodge, followed by a Farewell Dinner."},{"title":"Day 12: DEPART HO CHI MINH CITY","description":"Our discovery of the iconic and unexpected highlights of Vietnam at its end, take a transfer to the airport for your onward flight."}]},{"name":"Hello Vietnam","duration":8,"travelStyle":["In-depth Cultural","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":780,"summary":"Today’s Vietnam is a paradox living in the limbo of the old and the new. Every day, this resilient S-shaped country is wrestling to keep their centuries-old way of life alive while trying to adapt to the modern world. From its ancient treasures to glitzy skyscrapers, from the sleepy countryside to the vibrant city life, from bewitching mountainous spectacles to ethereal seascapes, the sheer diversity of Vietnam makes every journey a rewarding experience. Aside from the backbone 4 H’s: Hanoi, Halong Bay, Hoi An, Ho Chi Minh City, the verdant Mekong Delta is also one of the best holiday destinations in Vietnam. In the span of 8 days, you will be shown a Vietnam through the prism of a local and get to witness the living, breathing work of art that she is.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119780_cfc79027.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119780_cfc79027.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_99db7b43.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_dc204bd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_71be7c51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_87c9e92e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_1854f486.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_d08f4c2f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_287d826e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_f3aa975d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_3e21e776.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_29ea9829.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_6a15df0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_9dd4765e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_3f0f6b72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_1d012212.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_36454149.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_985af579.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_0abbd1ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_e0b49191.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_d747603a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_5f6cf3ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_09e2c026.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_9189dc19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119780_6ed0c71a.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Hanoi","description":"Meals: NA/Accommodation: Hotel in Hanoi\nYou’ll begin your adventure with a day discovering the scenic back roads of Hanoi, a city with a thousand years of history.\nUpon arrival, your guide will assist you with check-in at your hotel. Take your time wandering around Hanoi 36 streets and guilds, the very soul of this sprawling city. Join the locals on a giant buffet on the sidewalk; Hanoi’s street food is something no one should overlook. \n"},{"title":"Day 2: Hanoi","description":"Meals: Breakfast, lunch/Accommodation: Hotel in Hanoi. \nHanoi with its strategic position has gone through all the ups and downs of history to retain its core values and at the same time, embrace the foreign impacts to enrich itself. Starting with Ho Chi Minh Mausoleum, the final resting place of modern Vietnam’s founding father, find your way to Presidential Palace and Ho Chi Minh’s stilt house get a piece of the country contemporary history. \nDig a little deeper into ancient Vietnam by paying a visit to One Pillar Pagoda, an exotic architecture that resembles a lotus. \nTake a step into the ancient religious-governed Vietnamese society by a trip to Temple of Literature, the very first university of the country, Tran Quoc Pagoda, and Quan Thanh temple, the worship place of two of Hanoi’s protecting gods. \nAfter lunch, hop on a rickshaw and weave through Hanoi’s 36 streets and guilds. \nYour guide will then escort you back to your hotel where the remainder of your evening can be enjoyed at your leisure. \nDinner by your own arrangement. \n"},{"title":"Day 3: Halong Bay","description":"Meal: Breakfast, lunch, dinner– Accommodation: Overnight on Cruise. \nRide through the rich farmland of the Red River delta, which has nurtured the ancient Vietnamese civilization to reach Halong Bay, the spectacular scenery that makes it one of the world’s new natural wonders. \nBoard a cruise ship and watch the legendary karst limestone mountains of Halong passes by. The names of the mountains are deprived of their shapes so let your imagination runs wild and try guessing what mountains you’ve just seen. \nHalong Bay is peppered with caves so don’t leave without paying them a visit. Overnight on board and let the sound of the ocean lures you into sleep. \n"},{"title":"Day 4: Halong Bay - Hanoi","description":"Meal: Breakfast-Brunch/Accommodation: On Cruise\nWake up your every sense with a Taichi session on the cruise’s deck and watch sunlight fills the sky. Spend the last few hours on the bay by visiting a limestone grotto before getting back to the dock. Bid the staff goodbye as you will head back to Hanoi at noon. \n"},{"title":"Day 5: Hanoi / Ho Chi Minh City","description":"Meals: Breakfast/Accommodation: Hotel in Ho Chi Minh City\nBid goodbye to the charming Hanoi as we are heading to the year-round party atmosphere of Ho Chi Minh city. \nThis afternoon is dedicated to the all-time favorite sites such as the Reunification Palace, Notre Dame Cathedral, the Old Post Office and bustling Ben Thanh Market. It might come as a surprise that Ho Chi Minh City was once a small Khmer village surrounded by prowling tigers, but now it is a metropolis stalked by glassy skyscrapers. \n"},{"title":"Day 6: Ho Chi Minh City - Cu Chi Tunnel","description":"Meal: Breakfast, lunch- Accommodation: Hotel in Saigon\nAfter breakfast, Cu Chi tunnel, Vietnam’s underground legacy is next on your itinerary. It is a complex of more than 200 km subterranean passages and camouflaged entrances. Try squeezing through the tight passages to reach the former living areas, field hospitals, command centers and kitchens, a sobering experience that not many places in Vietnam can provide. \nAfter lunch, a take a short sightseeing tour around China Town, Thien Hau Pagoda, Binh Tay Market.\n\n"},{"title":"Day 7: Ho Chi Minh City - My Tho - Ben Tre","description":"Meals: Breakfast, Lunch/Accommodation: Hotel in Ho Chi Minh City\nEnjoy the scenic journey along the National Highway bordered by green rice fields.\nOn arrived at My Tho, take a leisurely boat ride along the river, view the stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shadow of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of “Southern Vietnamese folk music”, performed by locals.\nVisit a family business which epitomizes the idyllic rural lifestyle, taste the delicious coconut candy & observe the pastoral life as you roam through the fruit plantation and village. Meet the bus and return to HCMC.\nThis trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.\nTransfer back to your hotel."},{"title":"Day 8: Ho Chi Minh City","description":"Meals: Breakfast/Accommodation: NA\nSpend your last hours at your leisure in Ho Chi Minh City before transferring to the airport for a trip home. \n"}]},{"name":"Vietnam Highlights","duration":10,"travelStyle":["In-depth Cultural","Group","Fully Guided","Coach / Bus","Holiday"],"oldPrice":1105,"price":884,"summary":"Vietnam Highlights is the perfect way for a taste of Vietnam's best in a short amount of time. Experience the hustle and bustle of Ho Chi Minh City & Hanoi, relax and soak up the rays on a beach in Nha Trang, hit Hoi An by bike & chill out in the amazing scenery of Hue. Later, sit back & discover the amazing limestone formations of Halong Bay aboard a traditional junk boat as you indulge in Vietnam's coolest spots.","highlights":["Take a tour of the Marble Mountains, Da Nang","Visit the wild grottos of the Sung Sot Caves","Learn how to make fresh Vietnamese food, Hoi An"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/4788_f37d27.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/4788_f37d27.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_7a226160.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_29c4369c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_062e8c0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_e22ff0e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_d3960320.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_ad516365.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_a1d73d9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_d4ace436.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_30a29fb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4788_2295e1f3.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrive Ho Chi Minh City","description":"Welcome to Ho Chi Minh city, formerly known as Saigon. This is one of Asia's most exhilarating cities, steeped in grand history and post-Vietnam war memories. This evening you'll meet your travel comrades and explore the Ben Thanh markets, offering the freshest traditional Bánh mì, Pho and Bia hơi. Oh yes, this is the right way to get the Vietnam party started."},{"title":"Day 2: Ho Chi Minh City to Nha Trang","description":"With some traditional R'n'R on our afternoon agenda, the morning can be used to put on our discovering boots. We'll dabble in history and religion before taking flight to a coastal town overlooking the South China Sea.Golden sand beaches, turquoise oceans, water sports galore - this is Nha Trang. This afternoon why not book in for a mineral mud bath and hot thermal spring experience before heading out to dinner with your crew. Ah, the good life."},{"title":"Day 3: Nha Trang","description":"Good news - we're kicking it in Nha Trang for another night. Have a massage, sign up for the optional cruise, or just hang on the beach saving your energy for seaside bar fun as the sun sets."},{"title":"Day 4: Nha Trang to Hoi An","description":"After a zippy flight north & a short coastal drive we find ourselves in a canal town overflowing with beauty and ancient history.With Japanese, Chinese, Vietnamese and European influences, Hoi An has no shortage of charm and architectural interest. Bike riding through rice fields, roaming the old quarter & ordering custom made clothes at an artful tailor are just some of the activities that will colour our day. Tonight you can opt onto a Vietnamese cooking class, whipping up a storm of up to 4 traditional dishes."},{"title":"Day 5: Hoi An","description":"A short drive from Hoi An are the famous Marble Mountains, a collection of 5 peaks that represent the 5 Elements in Vietnamese folk lore – metal, wood, earth, fire and water. Our local guide would be delighted to take us on a tour through the Thuy Son caves and grottos which are home to some of the most beautiful and intricate stone carvings in the area. The Marble Mountains were also the hiding place of the US Forces during the Vietnam Conflict and even a military hospital! Hear about the history while taking in panoramic views and later, kick back at An Bang Beach before heading back to Hoi An for more Free Time Addons."},{"title":"Day 6: Hoi An to Hue","description":"Though we'll have grown content with Hoi An life, this morning the show must go on. After all, the former imperial town of Hue has invited us over, and we'd be foolish to turn it down.Intricately decorated pavilions, lotus flower ponds, and colourful artworks mark our first sightseeing venture in Hue. Totally in awe of Tu Duc Mausoleum, we move on to the 7-story Thien Mu Pagoda & learn of the horrific history of the Hue Buddhist massacre as well as taking in a cyclo ride to see the city from a whole new angle."},{"title":"Day 7: Hue to Hanoi","description":"Today we fly out of Hue in the direction of Vietnam's time capsule capital. A trio of influences and filled with romance, 2-nights here will see us utterly smitten.With an epic fusion of French, Chinese & Vietnamese influence, you'll be nothing short of ecstatic as we check-in to our Hanoi hotel, right in the middle of the bustling Old Quarter. Our time will be spent weaving through a maze of 36 trading streets filled with colourful goods for sale, and unwinding in the walled gardens of the Temple of Literature. Later, we'll roam French-style boulevards and maybe dine on a nom ngo sen lotus-stem salad, dau chien ron fried tofu & a few bia hoi beers."},{"title":"Day 8: Hanoi to Halong Bay","description":"After a Hanoi history 101 lesson we move on to Halong Bay where a night on a UNESCO World Heritage-listed site awaits.A drive through stunning scenery will evoke plenty of 'oh wow's, but it only gets better as we board our home for the night, a Chinese-style junk boat in Halong Bay. Feel the serenity kicking in immediately as we drift the limestone island seas of the Gulf of Tonkin. We will pass hidden lagoons, thick forests & dreamy grottos, & stop to explore the Sung Sot Caves. A fresh seafood dinner and sunset at our docking spot will polish off a wonderful daypacked with No Regrets moments and simply unforgettable experiences."},{"title":"Day 9: Halong Bay to Hanoi","description":"Today will be all about the leisurely vibes as we wake up to breakfast and a grotto swim. Make the most of your time on the junk boat & kayak your way around Halong Bay - the views don't get much better than this.After heading back to Hanoi we find ourselves enjoying our final night together on tour. Save the choir of tears for tomorrow - this evening is all about making the most of your free time and staying positive. The quirky world-famous water puppet performance in Red River Delta makes for the perfect send off, should you fancy opting for something a bit different."},{"title":"Day 10: Depart Hanoi","description":"Enjoy one final breakfast with the squad this morning before the trip wraps up. Hug it out and make plans to reunite sometime soon - Latin America, perhaps?"}]}]