[{"name":"Hanoi, Halong and Sapa tour in 7 Days","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":641,"summary":"In and around HanoiUpon your arrival at Noi Bai Airport, welcomed by Bravo Indochina local tour guide and transferred to hotel in Hanoi center for check in and relax.\nRelax and stay overnight in Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108354_87ad9c3d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108354_87ad9c3d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_9a9e46d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_505da536.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_01525fd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_3578894e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_2e7c5310.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_086f2ece.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_5e45cad7c46dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_5e45cad7c46df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_5e45cad7c46e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_5e45cad7c46e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108354_5e45cad7c46e4.jpg"],"destinations":["Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Hanoi Arrival","description":"Upon your arrival at Noi Bai Airport, welcomed by Bravo Indochina local tour guide and transferred to hotel in Hanoi center for check in and relax.\nRelax and stay overnight in Hanoi"},{"title":"Hanoi City Tour Including Water Puppet Show and Cyclo Ride","description":"Explore vibrant Hanoi with a private guide on a full-day sightseeing tour that hits all the highlights of Vietnam's capital city. Visit the Ho Chi Minh Mausoleum, Temple of Literature and Vietnam Museum of Ethnology, in addition to sites such as One Pillar Pagoda and Ngoc Son Temple. You'll also attend a water puppet show and see the Old Quarter up close on a cyclo tour. Your tour includes a typical and tasty Vietnamese lunch, plus Vietnamese coffee to start your day and a local beer to wind down."},{"title":"Halong bay with Overnight Cruise","description":"9.00: Our driver will pick up at your hotel\n12.00: Embark at Hon Gai International harbour.\n13.00: Check-in, enjoy a welcoming drink and cruise briefing.\n13.30: Have lunch while cruising in the magnificent Bai Tu Long Bay, admiring the fascinating rock formations in the bay.\n15.00: Enjoy swimming in the crystal clear water.\n15.40: Explore the secluded Thien Canh Son Cave.\n16.45: Short cruise to Hon Co Island where you can relax on a white sandy beach, swim or kayak.\n18.00: Back to the junk for relaxation.\n19.00: Have dinner and stay overnight on board"},{"title":"Halong Bay - Hanoi - Sapa","description":"07.30: Enjoy the bay’s morning landscape with a cup of tea or coffee. Have breakfast in the open air.\n08.30: Visit Vung Vieng fishing village in a rustic rowing-boat, meet the local people and pass through the floating school and fish farms.\n09.30: More leisure time for swimming in the middle of the bay.\n10.00: Cruise back to the harbour while an a la carte lunch is served\n11.45 – 12.00: Disembark cruise\n17.00: Arrive in Hanoi. Dro off at hotel. Free to relax at lobby and enjoy dinner on your own.\n19.30: Our driver will pick up at hotel and transfer to Hanoi railways station for night tain at 21.10 to Lao Cai.\nOvernight on train."},{"title":"Lao Cai – Sapa – Sin Chai – Cat Cat – Y Linh Ho","description":"Upon arrival at Lao Cai railways station, you will be met up by local guide and driver then transferred to restaurant for breakfast.\nAfter having breakfast, you will travel by car to Sapa. Leave your luggage in hotel. Then start to visit to Sin Chai village. This is a beautiful village, located right at the foot of Hoang Lien mountain range and inhabited by Black Hmong minority. There we start our trekking journey uphill. Once we reach to the top, you will take a small trail descending to Catcat village. Your lunch will be provided near a waterfall.\nIn the afternoon, we will take another trail sneaking through mountain. The scenery is also spectacular. Trekking to visit Y Linh Ho village. After that, we will get on car back to Sapa. Check in hotel.\nOvernight in Sapa.\n\n"},{"title":"Lao Chai – Ta Van – Giang Ta Chai – night train to Hanoi","description":"Breakfast at hotel.\n8.00: Our tour guide will pick up and start hiking through the breathtaking scenery of Sa Pa valley. Follow a small track and cross Muong Hoa River and pass well tended rice terraces on your way to the Black Hmong village of Lao Chai. Continuing through the colorful rice terraces you will reach Ta Van village and trek along the Muong Hoa River you will cross a small suspension bridge, roughly 2km from the settlement. Here you can discover a fascinating collection of rock carvings. These engravings depict some beautiful images of man, stilt houses and some beautiful decorative patterns.\nEnjoy lunch in a home in the village.\nAfter lunch, we will walk through a bamboo forest to Giang Ta Chai, a Red Dao ethnic minority village. Then come to main road where our car waiting you to come back Sapa town. Take your luggage and get on car to Lao Cai Raiways station. Have dinner before taking a night train to Hanoi.\nTrain leaves at 20.10. Overnight on train."},{"title":"Hanoi Departure","description":"Train arrives in Hanoi at 4.30.\nOur driver pick up and transfer to hotel for checking in. Have breakfast at hotel. Free to relax until our driver pick up and transfer to the airport for the flight departure."}]},{"name":"12 Days in Vietnam From Ho Chi Minh city Up to Hoi An and Hanoi","duration":12,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":889,"price":711,"summary":"Exploring Vietnam in 12 days from South up to the North of Vietnam with several impression. The difference among Three lands in Vietnam will be presented during your vacation. Tasting the local foods with little different flavour in South, Central and North. Experiencing the local lives through Vietnam. It is surely that you will have the unique experience what you've nerver ever did. Let’s us customizing your best unique vacation!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132958_8784b01f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132958_8784b01f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_7f85b2a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_e8c3f81b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_f74b54b9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_57fdb952.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_58a45a49.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_477955f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_c45de364.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_42b559b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_6351dadd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_0b1f66ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_0fd90fe4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_d0cc9aff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_ba684cf2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_a6223ff6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_5ed40a89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_6c0c80bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_aff2fe81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_7c6f8a7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_a748384b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_81c95d9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132958_ad895b25.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh city arrival – Hotel check in (Meal: No)","description":"Welcome to Ho Chi Minh city – the biggest city in Vietnam. Driver is waiting for you at the airport to transfer you to the hotel in the center.\nCheck in the hotel and free time to take your first step exploring the city.\nOvernight at the hotel in Ho Chi Minh city.\nPlease Note: Hotel check-in time: 13:00\n"},{"title":"Day 2: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in HCM city. "},{"title":"Day 3: Ho Chi Minh free and easy (Meal:B)","description":"Today you have free time to relax and explore the city by your own. Taking your leisurely time to visit HCM city by your own with destinations as: Ben Thanh Market, China town…Tasting and feeling the local foods, daily life\nOvernight at hotel in Ho Chi Minh city.\n"},{"title":"Day 4: Ho Chi Minh – Flight to Da Nang – Hoi An check in (Meal: B)","description":"Enjoy your own time to visit Ho Chi Minh city, tasting some local foods and drink, until driver picks you up at the hotel and transfer you to the airport for the flight to Da Nang.\nUpon arrival Da Nang, driver meets and take you to the hotel in Hoi An old town.\nOvernight at hotel in Hoi An.\n"},{"title":"Day 5: Hoi An - My Son Sanctuary 1 Day (Meal: B,L)","description":"7:30 – 8:0: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide.  \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon River. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river  \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch.\nOvernight at hotel in Hoi An.\n\n"},{"title":"Day 6: Hoi An free time (Meal: B)","description":"Let’s feeling how lovely and peaceful is Hoi An old town by your own today. It is not only the town with rich history, warm people, delicious local foods, but also is a great place to tailor made items of clothing. \nOvernight at hotel in Hoi An\n"},{"title":"Day 7: Hoi An – Da Nang Train station – Overnight train to Hanoi city (Meal:B)","description":"Hoi An old town is built in the past with the combination of Japanese, Chinese and Vietnamese architecture. Walking time is the best way to visit Hoi An town with old pagodas, temples, local houses and also you can see the local people’s style life, local food what locals is eating,.. you also can go to the silk shop where you can make a costume tailor – best place to make a costume tailor in Vietnam Driver will pick you up and transfer you to Da Nang train station for train to Hanoi. Train takes about 16 hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight at on the train.\n"},{"title":"Day 8: Hanoi arrival – Transfer to the hotel (Meal:No)","description":"Upon arrival Hanoi train station, driver will meet and transfer you to the hotel in Hanoi old quarter.\nCheck in the hotel and get your own time exploring the old town in Hanoi.\nOvernight at hotel in Hanoi.\n"},{"title":"Day 9: Hanoi Street Food Walking Tour (Meal:B,D)","description":"6:00 -6:15 pm: Your tour guide picks you up from hotel to our meeting point. Star the journey discovering the local foods in Hanoi like street Foodie. Walking through some old streets there, you will discover historical and culture tourist site, visit Heritage House to learn more about Traditional House of Ancient Hanoi. You have chance to enjoy “Bánh Cuốn” from famous local restaurant,  “Bánh Cuốn” (steamed rice rolls) which  is steamed and made from rice flour and filled with a savory ground pork and  ear mushroom mixture. Then stop off at traditional space to try “Che” (sweet gruel)- a very special and famous sweet soup Hanoi old quarter. Then, keep walking to enjoy a bowl of  Pho- taste of  heaven that you could not be anywhere better than Hanoi. Spring roll is very meaningful dish for tourist; many restaurant and company organize cooking class. You will visit Local market to see people show all products, it is really interesting to learn about lifestyle and culture of local people. You will enjoy Bun Cha (Vermicelli with grill pork), an absolute highlight of authentic local culinary you must try as anyone’s the first visit of Hanoi. Then you will savor the real taste of Hanoian at a small corner of Hanoi by drinking a cup of “Bia Hoi”(Fresh beer).  Finally, get the chance to enjoy a very special flavor of the Vietnamese-“Cafe Trung”( egg coffee).\n8:00 pm: Turn back to the hotel. \nOvernight at hotel in Hanoi."},{"title":"Day 10: Hanoi – Halong Bay – Overnight on cruise (Meal:B,L,D)","description":"8:00 – 8:30 am: Meeting your tour guide at the hotel and depart for Halong bay trip. Short break-time on the haft way for relax before reaching Halong Bay. \nVietnamese Lunch will be served after check in the cabin on cruise and cruising through the bay to the center.\nExploring the beauty of Surprising cave – the most beautiful and biggest one in the bay. Leisurely time hiking and swimming on the beach of Titop island.\nGet back the boat for Sunset Party with fresh fruit & local glass wine.\nDinner with delicious local dishes and free evening to feeling Halong Bay.\nOvernight on the cruise\n\n"},{"title":"Day 11: Halong Bay – Kayaking - Hanoi (Meal:B,L)","description":"You should wake up little early to enjoy the Sunrise in Halong Bay.\nAfter breakfast, doing Kayaking by your own to discovering Halong Bay. \nLearning how to make Vietnamese Spring-roll in Cooking Demonstration on the cruise.\nLunch time while cruising back the harbor.\nGet on the bus back to Hanoi.\n17:00: Arrive the hotel in Hanoi.\nOvernight at hotel in Hanoi city\n"},{"title":"Day 12: Hanoi Departure (Meal:No)","description":"Hanoi old quarter is most interesting place in Hanoi city where you can taste several street foods, local famous Vietnamese coffee, or shopping the souvenir for your family and friend, until Driver will pick you up and transfer you to the airport for your flight out.\nNote: This is group joining, there is a different group each trip during your vacation. \nWho should participate? - This tour is suited for all, including children as well. \nPrice structure: - Price quoted is based on per person basis.  \nPlease note: If you are Solo traveller booking Share Room, you will stay at Share Dorm Room during your vacation.\nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! If you want to extend the trip, or add any more night in any city, or start from the North, please advise!"}]},{"name":"Ho Chi Minh, Hanoi and surrounding in 7 days","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":619,"summary":"You will visit the bustling city of Ho Chi Minh City, explore the legendary Cu Chi tunnels system with the unbreakable village in the Vietnam War, experiencing the authentic local life in the Mekong Delta and their trading on floating Market. Treat yourself after the long excursion with the cruise time on fabulous Ha Long Bay","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e53.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e53.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e57.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146328_5e45e73671e5c.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 : Ho Chi Minh Arrival","description":"Upon arrive at Tan San Nhat airport and be greeted by your local guide and driver who will transfer you to your hotel. Take an orientation tour of the city in the afternoon (if time permits). Enjoy a dinner cruise on the Saigon river. Stay overnight at your hotel of choice in Ho Chi Minh"},{"title":"Day 2 - Ho Chi Minh CIty City tour","description":"Your breakfast is at your hotel. You will visit the Reunification Palace, which was the former residence of the President of South Vietnam until the end of the war in April 1975, check out some classic French colonial structures including Notre Dame Cathedral and the Old Central Post Office, the Emperor Jade Pagoda and the War Remnants Museum. Your lunch’s at the local restaurant. In the afternoon, heading to Cu Chi to visit the legendary tunnels and shopping at Ben Thanh markets where everything is for sale. Staying overnight at your hotel in Ho Chi Minh City."},{"title":"Day 3 : Mekong with Cai Be Floating Market","description":"Your breakfast at the hotel. Then you will depart toCai Be, stopping on the way to take photos in Tan An town overlooking picturesque flat rice fields. On arrival in Cai Be, set off by motor boat to visit the Cai Be floating markets and watch locals trading fruit and many other commodities on board their vessels. Then wander into small villages to visit an orchard and fruit plantation. Keep cruising to Vinh Long through a series of small canals to experience the charms of the Upper Mekong Delta. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Arrive in Binh Hoa Phuoc village, the green pearl of Vinh Long town, where you can immerse yourself in nature. Enjoy a lunch of fresh river food served in the heart of a garden accompanied by traditional southern Vietnamese folk music. Take a delightful walk through a bonsai garden. Meet the driver in Vinh Long. Return to HCMC. Dinner at your expense. Stay overnight at your hotel of choice in Ho Chi Minh city."},{"title":"Day 4 : Fly to Hanoi","description":"Breakfast at your hotel. Transfer to Tan Son Nhat airport to board flight. You will be welcomed by your local guide and driver and transfer to your hotel. In the afternoon, visit the Museum of Ethnology, Hoan Kiem lake, Ngoc Son temple and enjoy riding in a cyclo for 1 hour in the old quarter of Hanoi and its teeming streets filled with fascinating shops. Enjoy a water puppet show in the evening. Enjoy dinner at the Cha Ca La Vong restaurant. Stay overnight at your hotel of choice in Ha Noi city."},{"title":"Day 5 : Hanoi - Halong Bay with overnight on cruise","description":"After breakfast at your hotel, departing to Ha Long Bay through the Red River Delta. Board the Junk and enjoy a welcome drink on arrival, check in to your cabin. You will eat your seafood lunch served on board. Cruise on the Bay and enjoy beautiful views of this world natural heritage site with limestone cliffs growing up from the green tranquil water. See Dinh Huong Island, Ga Choi Island, Dog Island and Sail Island. Visit the Vung Vieng fishing village by local rowing boat (01 hour) or Kayak into the village then return to the vessel for your leisure or join one of the following optional activities: Sunbathing, traditional massage, swimming etc Have dinner and relax in the quiet and calm of the Bay. Overnight on board."},{"title":"Day 6 : Halong - Hanoi","description":"Wake up and start your day with Tai-chi on the sun desk. Have breakfast, coffee, tea and pastries… for breakfast are served in the dining room with morning view of bay’s landscape. Transferring by tender to the Surprise Cave. Walk up about 100 steps to the cave entrance and tour the cave for approximately 45 minutes. Walk down about 100 steps and return to the boat. Having lunch/brunch while cruising back to the pier. Returning to Ha Noi.You will stay overnight at your hotel in Ha Noi."},{"title":"Day 7: Hanoi City and depart","description":"Ater eating breakfast at your hotel, you will visit the Ho Chi Minh Complex, including the Ho Chi Minh Mausoleum, the Presidential Palace, Ho Chi Minh's stilt house and One Pillar Pagoda. Continue on to the Temple of Literature, Vietnam's first university and almost 1000 years old. Free leisure time until you transfer to the airport for your departure. End of services. Finish your Vietnam at glance tour."}]},{"name":"Best of Vietnam - From Top to Tail 14 Days","duration":14,"travelStyle":["Coach / Bus","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1280,"summary":"\n  Enjoy a cyclo ride of Hanoi's Old Quarter to learn about traditional Vietnamese architecture \n  Experience the uniquely northern Vietnamese water puppet performance.\n  Spend a night cruising Halong Bay aboard a traditional Junk\n  Visit the sights of UNESCO World Heritage-listed Hoi An on foot \n  Tread in the footsteps of emperors from the Forbidden Purple City to the imperial tombs of Hue\n  Explore the engrossing underground network of Cu Chi Tunnels \n  Visit the Mekong Delta - Vietnam’s ‘rice basket’, cruise the watery through sleepy villages and green fields\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95286_d8af98bd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95286_d8af98bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_f3919081.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_fef2b40a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_323d62d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_87a58d2e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_71dc3fb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95286_5f6e45d5.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City","Ben Tre","Can Tho"],"timeline":[{"title":"Day 1: Welcome to Hanoi","description":"When you arrive at Noi Bai International airport in Hanoi, you'll be welcome by one of our representative and transferred to your hotel in the downtown. The remainder of the day will be your own. Overnight in Hanoi.   "},{"title":"Day 2: A Day in Hanoi - Vietnam's Capital","description":"After a truly scrumptious breakfast, you'll jump head-first into Hanoi's sights and sounds on a tour that covers all the essentials. You'll visit the Ho Chi Minh Complex, which includes the Mausoleum, Uncle Ho's former stilt-house residence, the Presidential Palace, the Ho Chi Minh Museum and The Temple of Literature, which, dating back to 1070, is Vietnam’s oldest university.\nYour lunch today will be at a one-stop-shop for street food of every variety and region of Vietnam. Sit around the restaurant's giant central tree, and take your pick from the food stalls on all four sides busily cooking spectacularly lip-smacking delicacies to order.\nIn the afternoon, explore the enthralling Museum of Ethnology, which contains an extensive display of life-size structures dedicated to Vietnam’s 54 ethnic minorities. Next, enjoy an hour-long cyclo ride winding through the narrow, chaotic streets of the Old Quarter - a must for any visitor to Hanoi! The day finishes with a traditional performance of the famous Vietnamese water puppets. Overnight in Hanoi    \nNote: the Ho Chi Minh Mausoleum is closed all day on Monday and Fridays, as well as from 1st October to 30th November (approx.) for annual conservation."},{"title":"Day 3: Hanoi - Street Food & Market Tour ½ Day – Free Afternoon of Leisure","description":"After a brief transfer from your hotel, you will start with a pleasant stroll to Truc Bach Lake for your first tasting - Pho Cuon with lots of opportunities to take photos. Next stop is Chau Long Market for a tour of the market highlighting the ‘wet’ / unusual fruits / livestock / frogs. Sample of market foods of your choice i.e tree tomatoes or green mango with chili, silkworms, pork with green rice. Continue with a short taxi ride to to a Shrimp restaurant to sample West Lake’s most famous dish. Continue with another taxi transfer to one of the best Bun Cha stalls in Ha Noi where you will enjoy Bun Cha - grilled pork patties and pork belly with sticky rice noodles. On our way back, you will stop at a traditional Ha Noi café, established in 1936 to enjoy specialties of the café, black sticky rice or green rice with yoghurt, coffee with yoghurt or great passion fruit with yoghurt. Return to your hotel, the remainder of the day is free at leisure. Overnight in Hanoi  "},{"title":"Day 4: Off to Halong Bay (Join with other travelers on the cruise)","description":"After breakfast, you'll leave for Halong Bay with a refreshment break en route. Meet the crew upon boarding the traditional wooden junk, then relax and enjoy lunch while the boat heads towards the secluded islands. Visit ancient limestone caves and go sea kayaking and swimming if the weather permits. Return to the junk refreshed and invigorated and relax on deck with a drink to watch the sunset. Enjoy a freshly prepared seafood dinner under the stars. Overnight on a wooden junk in Halong Bay  "},{"title":"Day 5: Halong Bay Cruising - Hanoi - Flight to Danang, Transfer to Hoi An","description":"Enjoy an early morning swim (if weather permits) followed by breakfast. The tour then visit one of the famous caves in the middle of the bay before cruising back to the main harbor for the 4 hour drive straight to Noi Bai airport in Hanoi for a late afternoon flight to Danang. On arrival, met and transferred to your selected hotel in Hoi An. Overnight in Hoi An"},{"title":"Day 6: Hoi An - Guided Walking Tour ½ Day – Free Afternoon of Leisure","description":"09:00 a.m., your guide will meet you at your hotel lobby and show you around the old town. You'll start a walking tour with numerous places of interest: the 400-year old Japanese Covered Bridge, the Phuc Kien Assembly Halls, a museum and the colorful local market. Following the narrow lanes, you walk along tiny streets with houses influenced by Chinese, Japanese, French and European architectures.\n\nAfter your walking tour, your time will be at leisure to wander around or go shopping. Your lunch will be at a local restaurant. The remainder of the day will be your own. Overnight in Hoi An"},{"title":"Day 7: Hoi An – Free Day of Leisure","description":"A free day at leisure in Hoi An. Overnight in Hoi An\n\nNote: There are various optional activities for your free time in Hoi An such as joining a cooking class, visiting rural villages around Hoi An by bicycle, take a day trip to My Son Ruins. Those options can be added at additional cost."},{"title":"Day 8: Free Morning in Hoi An - Drive North to Hue","description":"A free morning at leisure in Hoi An. Afternoon drive north to the Royal City of Hue with en-route stop to visit either the Cham Museum in the city centre OR the famous Marble Mountain, which stands for the five essential elements that establish nature. Continue the scenic route to Hue, enjoy the view of the coast line and Danang from the top of the Hai Van Pass (Pass of the Clouds) makes your journey interesting and have your camera ready for some great photo opportunities. Overnight in Hue"},{"title":"Day 9: Hue - Imperial Citadel & Royal Tomb","description":"After breakfast, you'll spend the full day for a city tour of Imperial City of Hue, firstly with the ancient walled Citadel including the former Imperial Palace. You'll then visit the Dong Ba market to learn about local produce and specialties of Hue. You might get some great deals done at the local Dong Ba Market. Have lunch in a local restaurant.\n\nIn the afternoon, you will cruise the Perfume River by a dragon boat to serene Thien Mu Pagoda and drive to visit the majestic Royal Tomb of King Ming Mang or King Khai Dinh. Return to your hotel by road just before sunset. Overnight in Hue"},{"title":"Day 10: Flight to Ho Chi Minh City - Visit Cu Chi Tunnels","description":"After breakfast, drive to Phu Bai airport in Hue for an afternoon flight to Ho Chi Minh City. When you arrive, you will be met by another local expert guide who will escort you for 1,5-hour drive to Cu Chi Tunnels. After lunch at a riverside restaurant, visit the amazing network of underground tunnels was used during the Vietnam War by the Viet Cong. This huge construction was a habitation for villagers in the war time. With 3 levels of depth, it was never discovered by the US during the Vietnam War despite its proximity to Saigon. Visit the fighting tunnel system with your local guide. Returns to Ho Chi Minh City, arriving at around 18.00. Overnight in Ho Chi Minh City"},{"title":"Day 11: Explore Ho Chi Minh City Tour (Formerly Saigon)","description":"Today, you'll embark on a guided city tour starting with the War Remnants Museum - a real eye-opening  part of Vietnam's proud history; followed by the Reunification Palace; the former South Vietnam Presidential Palace; the Notre Dame Cathedral and Old Post Office to get your camera working overtime peeking into the past of Vietnam's biggest, most energetically progressive city.\nIn the afternoon, the sights of Chinatown beckon, with a walking tour through its back-streets to become part of the local daily life. Stop off for a visit to Thien Hau temple, which was built in the early 19th Century in tribute to the goddess of seafarers. Delve deeper into Chinatown by visiting the amazing Cholon and Binh Tay Market (or Ben Thanh market) for an insight into where the locals actually shop. Then it's back to your hotel by around 5. Overnight in Ho Chi Minh City"},{"title":"Day 12: Explore the Mekong Delta by Boat and Bicycle","description":"At 8.00am, depart for a 2 hour drive to Ben Tre, one of the country's southern provinces, situated in the Delta of the Mekong River. Take in the highway as you leave behind the busy city. On arrival, take a boat on Ben Tre River – one of tributaries of Mekong River to witness lively activities along river such as fishing, water transferring. Stop at brickwork to see how to make bricks in traditional style by printing and baking. You will visit one of plenty of coconut processing workshops located along canal. Turn on natural scissors creeks where they look smaller and smaller to go to village. Take a walk to family workshop making sleep mats and enjoying some fruits. Later, take a motor-cart on shady village paths, passing by green rice fields and vegetable plains to be able to touch on real life and find out about tropical culture from peasants. \nAfter lunch at a riverside restaurant, enjoy rowing-boat along water palm creek, and boat trip back to pier where you will be taken by your private car to Can Tho for overnight accommodation. Overnight in Can Tho"},{"title":"Day 13: Cai Rang Floating Market – Ho Chi Minh City","description":"Today an half hour boat cruise will take you to visit the vibrant Cai Rang floating market to experience a special type of market in which all purchasing activities take place on boats and ships. Then continue to small a canal to visit a fruit garden where your guide will show you around before having a plate of delicious fruits. Return to Can Tho and observing the rural life and the lush vegetation along the riverbanks. Drive back to Ho Chi Minh City with lunch en-route, arriving in the late afternoon. Overnight in Ho Chi Minh City"},{"title":"Day 14: Depart Ho Chi Minh City","description":"Your time will be your own until being picked up to head to Ho Chi Minh City's Tan Son Nhat Airport for your onward journey or departure flight. "}]},{"name":"Vietnam Family Holiday","duration":13,"travelStyle":["Family","Group","Fully Guided","In-depth Cultural","Holiday"],"oldPrice":0,"price":1485,"summary":"With great food, lush scenery and lots of warm, friendly locals, the whole family will fall in love with Vietnam. Sail beautiful Halong Bay. Delight at water puppets in Hanoi. Learn about rich emperors in Hue. Get a new outfit tailor-made in Hoi An. Maybe even take a dip in the Vietnam East Sea. With so much to share and do together, you'll experience the culture, flavours, and highlights of a Vietnamese adventure your family will always remember.This is Vietnam, so days are hot and sticky and nights can get quite cool! Be sure to wear layers, use adequate sun protection and drink plenty of water.","highlights":["Visit Hanoi's beautiful lakes","Traverse the Hai Van Pass","Dragon boat cruise on the Perfume River","Swim in the famed South China Sea"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/4470_c29a7e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/4470_c29a7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_e828b88a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_7c8f4f89.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_93c3eeb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_31c6802f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_94de746f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_8dbf8d3e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_88bdeaec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_7b2fed15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_ddb606c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_583b7e8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_68aa385c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/4470_0020da8c.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin chao! Welcome to Vietnam. Hanoi is famous for its beautiful lakes, shaded boulevards, verdant public parks and its thriving Old Quarter. The latter is a veritable architectural museum piece, with blocks of ochre buildings retaining the air of a 1930s provincial French town. You will be transferred from the airport to your hotel, and your adventure begins with a welcome meeting at 5pm. Afterwards, perhaps enjoy some dinner with your family and fellow travellers (this is optional).\nAccommodation: Hong Ngoc Cochinchine Hotel or similar"},{"title":"Day 2: Hanoi","description":"Embark on a full-city tour of town. You will visit the Ho Chi Minh Mausoleum and Museum, and the tranquil Temple of Literature – an oasis of calm in the heart of town. Also head to the Museum of Ethnology to learn more about the diverse heritage of Vietnam. Enjoy some lunch at KOTO restaurant, an excellent establishment and longtime friend of Intrepid which lives by the philosophy of 'know one, teach one'. It supports the underprivileged local youth by giving them a chance at making a career in the hospitality industry. In the evening, sit down to a traditional water puppet performance. This northern tradition, dating back nearly a thousand years, is performed alongside traditional Vietnamese music that employs drums, wooden bells, horns and bamboo flutes.\nAccommodation: Hong Ngoc Cochinchine Hotel or similar"},{"title":"Day 3: Halong Bay","description":"Travel by minibus to the spectacular World Heritage-listed site of Halong Bay (approximately 4 hours). The bay is a breathtaking secluded harbour, with some 2,000 limestone islands jutting out of the waters of the Bac Bo Gulf. Board your private boat and cruise among the dramatic limestone peaks. There's an opportunity to swim in the famous Vietnam East Sea and explore caves filled with stunning stalactites and stalagmites. Spend a peaceful night on board, beneath a sky alive with stars. Your sailing junk has twin-share cabins that have air-conditioning and private facilities. There's also a dining room and bar.\n\nNotes: Due to recent, unforeseen changes by local authorities, many boats are no longer permitted to stay overnight on the bay. This has resulted in a boat shortage. To ensure Intrepid travellers are all accommodated, a larger boat, usually with 12 cabins, may be used, and passengers may be split across multiple boats. An Intrepid group leader will be present on each boat, and the route and onboard inclusions will remain the same.\nAccommodation: Halong Bay Junk"},{"title":"Day 4: Hue","description":"Enjoy breakfast on the boat this morning and perhaps head out for an optional early morning kayak. Return to Hanoi by bus (approximately 3.5 hours). From there you will board an overnight train bound for Hue. As the former imperial capital of Vietnam, Hue holds the treasures of Vietnam's royal past. It's a curious mix of bustling streets and tranquil settings. Although conditions are basic on your train journey, overnight trains are a classic South East Asian experience and the best way to travel long distances with the locals. Lie back and enjoy the ride! Most trains have a dining carriage serving simple food, but it's a great idea to stock up on fresh bread, cheese and fruit before you head off.\n\nNotes: Sleeper trains typically have four-berth compartments (occasionally six-berth, depending on seasonal variations) which have bench seats that convert into sleeping bunks. A sheet, pillow and blanket are provided, although some travellers prefer to bring their own sleeping sheet. On occasion, passengers of different genders will be required to share a compartment and there will be occasions where you'll be sharing with local travellers or travellers who are not part of your group.\nAccommodation: Overnight Sleeper Train"},{"title":"Day 5: Hue","description":"Welcome to Hue! Your leader will help you chose a local, tasty breakfast option this morning after you disembark the overnight train. Afterwards, enjoy a dragon boat cruise along the Perfume River. The trip includes a visit to Thien Mu Pagoda, which is considered by many to be the unofficial symbol of Hue. It's an active Buddhist monastery originating in 1601. One of the most poignant displays here is a car belonging to a former monk who, in 1963, drove to Saigon and set himself alight to protest against the treatment of Buddhists by the South Vietnamese regime. You will visit one of the royal tombs, that of Emperor Tu Duc, and see the central lake set amid a grove of frangipani and pine trees. There is also the chance to visit the tomb of Minh Mang. Its lush forest backdrop and impressive architecture make it perhaps the most majestic of all the royal tombs.\nAccommodation: Thanh Lich 2 Hotel  or similar"},{"title":"Day 6: Hue","description":"Delve further into the fascinating former capital today. You will visit the Imperial Citadel, which is the best-preserved remnant of a large citidel and Royal centre that once existed on this fortified site. The unique fortifications are fascinating, even though much of this place has sadly been destroyed by war. The foliage-covered ruins make for an interesting couple of hours of exploring. You will visit the Forbidden Purple City, which was almost totally wiped out during the Tet Offensive in 1968. The gaping holes left by bombs give an idea of the shocking destruction wreaked upon the country during the war.\nAccommodation: Thanh Lich 2 Hotel or similar"},{"title":"Day 7: Hoi An","description":"Travelling by bus, head south through coastal rice paddies, then traverse the spectacular Hai Van Pass along the mountains en route to Hoi An (approximately 4 hours). Recently declared a World Heritage site, Hoi An is beautifully preserved and exudes a tranquil atmosphere. It's perfect for strolling around at a leisurely pace, with many beautiful Japanese houses and Chinese temples lining the narrow lanes. Parts of Hoi An look exactly as they did more than a century ago. It's also a shopping mecca – browse local markets and shops for original paintings, handcrafted woodwork, ceramics, embroidery and lanterns. Hoi An has also become famous for its tailoring, with a great variety of fabrics and tailors to choose from.\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 8: Hoi An","description":"After breakfast we head out to spend the morning at Cua Dai beach. This beach is known for its stunning palm-fringed white sand and views of the Cham islands. Transfer back to town for lunch, before spending the afternoon learning how to prepare White Rose Cake. This hands on experience is one the whole family will enjoy!\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 9: Hoi An","description":"Enjoy further free time in this beautiful old town. Perhaps take up a cooking class and learn the secrets of preparing local specialties like cao lau – dark pork broth with thick yellow noodles, sliced pork, bean sprouts, green vegetables and croutons. Street food tours can also be arranged. Alternatively, hire some bikes and take the family out on a cycling trip into the gorgeous surrounding countryside. Another great activity which kids will enjoy is a bamboo basket ride down the waterways of the jungle. For more optional day- and half-day trips, chat to your leader.\nAccommodation: Thuy Duong Hotel or similar"},{"title":"Day 10: Ho Chi Minh City","description":"Take a short flight to the economic hub of Ho Chi Minh City (approximately 1 hour). Formerly known as Saigon, Ho Chi Minh City is characterised by a vast array of sights and sounds – a fascinating blend of old and new, East and West. Check out Ben Thanh Market and experience a delicious local lunch of street food, and enjoy an orientation walk. Afterwards, you're free to explore the city on your own. Your leader will have plenty of interesting and fun ideas for you and the kids. Consider scooting off on cyclos to Cholon, the Chinatown area of Ho Chi Minh City, for a bit of temple-hopping. Or visit the Vietnamese version of a department store for some serious shopping.\nAccommodation: Lavender Hotel or similar"},{"title":"Day 11: Mekong Delta","description":"Head down to the Mekong Delta and visit unexplored Ben Tre where coconut is everything and anything. The fertile delta is famous for its abundant harvests of tropical fruits and flowers. On arrival, board your private boat and cruise along the maze of waterways to visit some local cottage industries. This is a fascinating behind-the-scenes look at a different part of the local economy. Then head to your overnight homestay by the water. Be invited into a family home for a true local experience – a chance to see daily life from the inside. You'll be sleeping on simple camp beds in dorm-style rooms, with all meals included. Bedding and mosquito nets are provided.\nAccommodation: Homestay"},{"title":"Day 12-13: Ho Chi Minh","description":"Life in the delta starts with the sun, so embrace the day early. You will visit a local market and soya bean workshop before heading back to Ho Chi Minh City for one more night. You should arrive in the afternoon, which will give you time for a final exploration of the city. On Day 13 your trip comes to an end, and you are free to leave at any time. For those who have booked an airport transfer, the leader will confirm your departure time and onward flight details.\nAccommodation: Lavender Hotel or similar"}]},{"name":"Vietnam South to North Outlook 7 Days","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":535,"summary":"Vietnam Outlook  7 days takes you from a culture-rich ancient Hanoi to a vibrant Ho Chi Minh City, from a mystically exquisite Halong Bay to a vast Mekong Delta, this tour will give you a quick yet full view of Vietnam’s North and the South. While visiting  the old quarters’ streets and watching a water puppet show in Hanoi bring a deep touch of culture and nostalgia, visiting the historical sites in Ho Chi Minh city as  War Remnants Museum and the amazing Cu Chi Tunnel network  will get you to appreciate Vietnam’s graceful yet courageous past. Likewise, cruising through the magnificent maze of craggy karst islets in Halong Bay reminds you how wondrous nature can be. But navigating through the canals of the Mekong Delta on a sampan and interacting with warm-hearted locals is most likely to be an experience of people and land harmony.  See the very essential Vietnam, in 7 captivating days!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/133267_37993262.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/133267_37993262.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133267_fd9e8f40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133267_127e4581.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133267_5387935d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133267_8c743c5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133267_e4c27f98.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Arrival","description":"As you arrive at Tan Son Nhat International Airport, our tour guide from Indochina Vibes will welcome you and transfer to your hotel. Ho Chi Minh City formerly named Saigon is the largest city and economic center of Vietnam always bustled with activities of modern life. It is where businesses converge and shoppers indulge themselves into unlimited choices. However the city also carries with it a rich historical legacy in contrast with its dazzling glamor. \n Start point\n Tan Son Nhat Airport , Tan Son Nhat International Airport, Trường Sơn, Quận Tân Bình, Hồ Chí Minh 736400, Vietnam "},{"title":"Day 2: Ho Chi Minh City - Cu Chi Tunnel","description":"Morning, our guide meets you at hotel and everyone transfers to visit the Cu Chi Tunnels. The tunnels in Cu Chi district, 75 km North west of downtown Ho Chi Minh City, which were once a major underground hideout and resistance base of Viet Cong forces during the two wars against the French and later o n Americans. The tunnels, entirely hand-dug, formed a highly intricate labyrinth-like network of interlinked multilevel passageways at times stretched as far as the Cambodian border and totaling over 120 km in length. Its complexity is beyond imagination containing meeting rooms, kitchens, wells, clinics, schools, depots, trenches and emergency exits all aimed for guerrilla warfare. The tunnels were deep and strong enough to withstand destructive bombings and self-contained enough to outlast prolonged sieges. \n \nAfternoon, get back to Ho Chi Minh City and take a sightseeing tour that includes the War Remnants Museum, which features a comprehensive collection of the machinery, aircraft, weapons, photos, and documentation of Vietnam War with the both the French and Americans; Saigon Notre-Dame Basilica as a French-built neo-Roman cathedral; Saigon Old Central Post Office; former Presidential Palace; Thien Hau Pagoda which was built in 1760 to worship a female Sea deity and Cho Lon, the city’s China town.  "},{"title":"Day 3: Ho Chi Minh city - Mekong Detla ( My Tho ) - Hanoi/ Evening Flight","description":"Morning, get on our air-conditioned car and travel to the Mekong Delta, the world’s largest delta and Vietnam's largest rice bowl. On arrival in My Tho City, capital of Tieng Giang Province, embark on a boat and navigate through intricate canals while observing the local daily life up close as well as the lan dscape of waterways and lush islands. Stop and step on the Unicorn Island to enjoy wandering through verdant orchards, tasting fresh fruits and listening to some Southern Vietnamese traditional music “Đờn ca tài tử”. \n \nMove on to the second delta province, Ben Tre, where you will watch local villagers make coconut candy in a rural workshop, walk around briefly and try riding a horse-pulled carriage. Visit bee-keeping households to taste fresh homegrown honey and honey tea.  Go back Ho Chi Minh City and transfer to Tan Son Nhat Airport for flight to Hanoi.\nUpon arrival in Hanoi, local guide welcome you and take you to hotel for check in."},{"title":"Day 4: Hanoi City Tour","description":"Morning, start a full day city tour beginning with Ho Chi Minh Complex which features the life of Ho Chi Minh, the nation’s founder. At the complex, visit Ho Chi Minh Mausoleum where the nation’s founder’s body is preserved (closed on Monday, Friday and through October - November) and the rural style house on stilts where Ho Chi Minh lived and worked. Stop by one of Hanoi’s icons, the One Pillar Pagoda, built in the 11th Century in dedication to Bodhisattva Avalokiteshvara or Buddha of Compassion and reminiscent of a lotus blossom rising from a pond. Continue to the Temple of Literature, known as the first university of Vietnam built in 1070 by the Ly Dynasty to honor Confucius, sages and outstanding Vietnamese scholars. \n \nAfternoon, continue Museum of Ethnology. Go to Hoan Kiem Lake, the center point of Hanoi whose name meaning “The Return Sword Lake” originated from a legend of a sacred sword and home to a rare endangered giant turtle species and visit Ngoc Son Temple on the lake. Next, take a one-hour xichlo (3-wheeled rickshaw) tour of the Old Quarter of Hanoi with its ancient streets representing traditional trades from the past. Finish the tour at the Thang Long Opera Theatre with a traditional Vietnamese water puppet show. Drop you at hotel. Free at your leisure in the evening."},{"title":"Day 5: Hanoi - Halong Bay/ Overnight on cruise","description":"Morning pickup at 8:00 AM from your hotel for transfer to Halong Bay, which is about 160 km or 3.5-hour drive away. The transfer is approximately 3 hours. You will see some rural areas of the Red River Delta with plenty of chances to take photos of Vietnamese farmers working in paddy fields and you may stop on the way to admire the local scenery. \nArrive in Halong City at 11:30 AM and check in aboard the booked junk right after the welcome drink is served. Start cruising while having lunch on board and enjoy the mighty bay view.\nArrive in Halong City at 11:30 AM and check in aboard the booked junk when your journey across Halong Bay starts. Halong Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage sites whose formation dates back 500 million years, consists of around 2,000 karst islands and islets scattered over an area of 1,553 km2.\nAfter lunch, take a short trek to a nearby summit for a panoramic view of the bay dotted with golden sails, go swimming on a quiet beach or sunbath on the sundeck. Later in the afternoon, you will visit an interesting fishing village with an opportunity to interact with local people who have been living in the bay for almost three generations. An optional kayaking trip is available weather permitting. Back onboard enjoy a lavish dinner and enjoy the bay view at sunset. Spend a night on board."},{"title":"Day 6: Halong Bay - Hanoi","description":"Wake up with Tai Chi exercises on the sundeck and continue cruising the Bay. Enjoy breakfast buffet in the restaurant, then visit the limestone grotto. Enjoy lunch on board and disembark in Halong City around 12.00 noon and private transfer to Hanoi airport. Say goodbye to the crew then transfer to Hanoi. Arrive at your hotel in the late afternoon.\n11:00: Transfer back Hanoi by private vehicle. Arrive in Hanoi around 17.00, drop you at hotel and free at your leisure in the evening."},{"title":"Day 7: Hanoi Departure","description":"Have breakfast at hotel. Free until time to go airport for flight departure. End trips.End point\n Noi Bai airport, Noi Bai International Airport, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "}]}]