[{"name":"4-day Pu Luong and Ninh Binh with round trip from Hanoi","duration":4,"travelStyle":["Adventure","Mountain Hikes","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":218,"summary":"\n\tThe Pu Luong-Ninh Binh tour is the perfect choice to discover two beautiful places of Vietnam. Pu Luong reserve is an authentic place unspoiled by tourism. Minorities in Pu Luong (as Black Thai) live from agriculture. Trekking through the villages will offer you the chance to meet them, discover their culture and daily life, learn about their agriculture system (especially the waterwheels system). The nature in Pu Luong is intact and swim by a waterfall in the middle of the jungle is an amazing experience that this tour provides to you. Then, in Ninh Binh , another part of the culture and Vietnamese history will be introduced to you visiting the Ancient Capital Hoa Lu. After lunch, you will board a boat to discover the Halong Bay on land, Trang An.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/135535_59b765f7.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/135535_59b765f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_e9416f40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_db49098d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_456f5bf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_a5056f4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_71ad4288.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_0ea944ad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_fed0dd0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_c8edbb46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/135535_234059bf.jpg"],"destinations":["Hanoi","Ninh Binh"],"timeline":[{"title":"DAY 1: Hanoi – Pu Luong. (L, D) 200km","description":"Easy Trek to Chieng Lau, Yen, Ba villages, Bamboo rafting on Cham Stream:\n07:00 – 07:30 = Pick-up at Hotel in Hanoi Old Quarter to go to Pu Luong Nature Reserve by Limousine bus.\n09:00 = Short break in Luong Son (Outside of Hanoi).\n11:00 = Stop at the local market of the Muong Ethnic Minority; enjoy the beautiful scenery of ThungKhe Pass (One of the 10 most beautiful passes in Vietnam).\n12:00 = Arrival in Mai Chau and transfer to a van to go to Pu Luong Reserve nature\n13:00 = Check in and lunch at Pu Luong Eco Garden – The Mountain Retreat.\n14:30 – 17:30 = Board the van to the starting point. Following the small road through the terrace rice and sugar cane fields, cross the Hanging Bridges to visit other remote rural villages of Thai Ethnic. Stop at the giant waterwheels, ducks farm to learn about the agriculture before getting on the Bamboo Raft for a relaxing cruise on Cham stream (cruise depending on weather conditions).\n17:30 = Pick up the van to go to the Eco Garden – Mountain Retreat. Enjoy swimming in the Infinity Pool.\n19:00 = BBQ Dinner at the lodge, enjoy some local rice wine. Have a quiet night in the middle of the Reserve."},{"title":"Day 2: Pu Luong – Hieu Waterfall full day trek (B,L,D ). (Hard Trek 10kms):","description":"07:30 – 08:30 = Have breakfast at Pu Luong Eco Garden. Enjoying the breathtaking view from the lodge.\n09:00 – 12:30 = Board the van to Pho Doan to start your trek. (Visit local market of Pho Doan only on Thursday and Sunday morning) From there , follow the small road, trail through the terrace rice fields, jungle to reach Hieu Waterfall. Have lunch by the waterfall.\nAfternoon =  Free time to relax and swim in the waterfall or trekking to explore the surrounding village and jungle.\n17:00 = Board the van to go back to Pu Luong Eco Garden – The Mountain Retreat\n18:00 – 19:00 =Free time to relax by the infinity pool.\n19:00 = BBQ Dinner at the lodge, enjoy some local rice wine. Have a quiet night in the middle of the Reserve."},{"title":"Day 3: Explore Kho Muong village and Doi Cave – NinhBinh 120km. (B,L,D)","description":"06:30 – 07:30 = Breakfast at the homestay, check out and say goodbye to the lovely hosts.\n07:30 – 08:30 = Board the van and back to the lodge\n08:30 – 12:00 = Trek following the small roads through the terrace rice fields and cross the stream to visit remote hidden village of Kho Muong to learn about the local people in Pu Luong.(6kms) Explore Doi Cave (Bat cave), this is the largest cave in Pu Luong. (Depending on the weather condition)\n12:00 = Back to the Eco Garden - Mountain Retreat, check out.\n13:00 = Have lunch and have free time to relax in the Infinity pool or walking around the village before boarding the Limousine bus to go back to Hanoi at 14:30.\n17:30 = Arrive in NinhBinh Retreat, check in and have free time.\n19:00 = Have dinner at the retreat"},{"title":"Day 4: Cycling to Hoa Lu Ancient Capital and boat ride in Trang An (B,L)","description":"7:30 – 8:30 = Breakfast at the Retreat\n8:30 to 12:00 = Cycling through the limestone karsts to reach 2temples of the first 2 Emperors in the 10 th Century in Hoa Lu Ancient Capital hike up the Ma Yen Mountain to visit the King’s tomb in 10th century and enjoy the panorama view from the mountain. On the way back, stop in a local family to discover daily life and culture and share a tea with them.\n12:00 -13:30 = Check out and have lunch at the Retreat\n13:30 -16:00 = Go to TrangAn for a boat ride in between the karst pics and enjoy the beautiful scenery and peaceful atmosphere.\n16:00 = Drop you off at NinhBinh Railway station or bus station or board the bus to go to Hanoi.\n19:00 = Drop off in Hanoi old quarter. Tour ends."}]},{"name":"Trekking Experience in Sapa 4 days","duration":4,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":270,"summary":"Explore spectacular landscapes of the Hoang Lien mountain range and Hoang Lien national park. Learn about the unique culture, custom and way of living of the Hmong, Zao, and Tay ethnics with 2nights home stay in tribal villages for local life experiences.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/173938_e9cc75e5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/173938_e9cc75e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_1af66130.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_4771f69f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_96a9e202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_e5776e13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_406f999a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_2e8e9153.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_db366de2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_59b1e528.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_d45b5f2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_f3f5bcb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/173938_c936170b.jpg"],"destinations":["Hanoi","Sapa","Lao Cai","Cat Cat Village"],"timeline":[{"title":"Hanoi – Sapa (No Meal ) by train","description":"Driver will pick you up at hotel in Hanoi old quarter then transfer to train station to Sapa. \nOvernight on train."},{"title":"Sapa – Y Linh Ho – Lao Chai – Ta Van - Sapa","description":"Pick up at the bus station when you arrive and transfer to Sapa by a tourist shared bus.\nEarly check in is possible when you arrive if the room available otherwise we will provide you a basic room where you can have shower.\n\n\nStart the trip at 9:30 as below.\nFirst start of 6km of walking down to the south east of Sapa along the side of Muong Hoa valley to Y Linh Ho village of the Black H’mong. Continue a 2km-trekking down to Lao Chai village, through terraced rice fields to Ta Van village of the Dzay minority people. \n\n\nLunch at a local family, it gives you a worth chance for you to learn about the local house architecture which is full of their daily life styles and exclusive custom. Enjoy the landscapes…on the way. Last trek is about 2Km to the bus stop in Tavan then get back to Sapa by jeep or minivan..\n\n\n•\tBreakfast, Lunch and dinner are all included. Overnight at the hotel in Sapa.\n•\tTrekking level: 6/10\n•\t10Km trekking, 8Km driving from Tavan village back to Sapa"},{"title":"Cat Cat & Sin Chai","description":"A walk down to the South-west of Sapa (around 4 km) to visit Cat Cat village of the Black H’mong. Relax at the food of the stunning waterfall and the vestige of a hydroelectric power station that was constructed by the French during the colonial time in Vietnam.\n\n\nEnjoy picnic lunch by the side of the river, and then next 3 km to Sin Chai, the village located at the foot of Fansipan Mountain, “the roof of Vietnam and Indochina”. From here you can enjoy huge stunning landscapes before climbing up on the way a jeep to return to Sapa.\n\n\n•\tBreakfast, Lunch and dinner are all included.\n•\tTrekking level: 4/10\n•\t7KM trekking, 3Km driving from Cat Cat back to Sapa. \n\n\nTransfer to train Station to get back Hanoi. Overnight on train."},{"title":"Hanoi Depature ( No meal )","description":"Arrival Hanoi early morning.\n\n\nEnd of services !"}]},{"name":"Hanoi Street Food Discovery 1 Day plus Bakhan Village Resort","duration":3,"travelStyle":["Discovery","Family","Custom","Food & Culinary","Group","Partially Guided","Holiday"],"oldPrice":0,"price":145,"summary":"Experience local daily life\nSavor diverse flavors of Vietnamese cuisines\nEnjoy unique and special drinks\nFind out more about Hanoi’s history and culture with the attractive sites\nGet new companions and communicate with locals\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95655_c5f351f8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95655_c5f351f8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_3dcb0dd8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_6216c485.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_1fd8c4ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_d38d6229.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_d0f084eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_5280dea1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_c3073703.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_70237616.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_0b08f967.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_e89c3c87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_645df017.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_829da0c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_0a1d0de4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95655_56871af7.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1: Hanoi Street Food Discovery","description":"A friend of mine from Holland told me that she knows the reason why I often get home-sick when travel abroad after her trying our Vietnamese food. It is because our food is amazing tasty. You don’t believe? Let’s follow our guide on street food tour to be convinced!\nWe start a street food walking tour with an insight into traditional Vietnamese food at different eateries. Well, the first stop is near the Hoan Kiem Lake called “Bun Cha”. It is mixed grilled pork meat with noodle and sweet & sour sauce. \nThen, we could continue to tour with other food. On the way, the guide will tell about history of the Old Quarter and Hanoi as well while we’re wandering on the winding old streets and quiet residential lanes where you can observe locals’ daily life, their daily work.\nThe guide will then take you to one of the best café in Hanoi. You’ll be so surprised until you savor the Egg-Cofee which is absolutely delicious and has the unique taste among Vietnamese coffee.\nAfter enjoying the coffee, let’s go to another tourist attraction to visit is Quan Chuong Gate – an architectural work and a cultural, historical and geographical vestige of Hanoi. This gate has been one of the twenty-one city gates of Hanoi since 1749.\nWe’ll reach to the traditional house at 87 Ma May street is typical of the traditional architecture in the Old Quarter. It was recognized as Vietnamese National Heritage in 2004.\nWhen we leave the old house, it’s time for drinks. Enjoy local beer (draught beer) with Potato chips at the “international” corner Ta Hien where each night, hundreds of travelers and a large number of locals flock here to hang out. Specially, all seats just need small plastic stools, drink beer and observe the local daily life follow the characteristic way at the Old Quarter.\nIf your stomach still has some space, keep going to try the Steamed Rice Pancake Rolls (Banh Cuon). This dish is made from rice starch and maybe grilled pork.\nAt the end of the tour, Hoan Kiem lake is a usual site to finish the tour. Before saying goodbye, the guide will tell a legend story referring to this lake. Then, you can either continue exploring on your own, take a taxi or ask the guide’s assistance for directions to get back the hotel and suggestions anything.\nTrip ends at your hotel in Hanoi. (Hotel accommodation arranged by your own)."},{"title":"Day 2: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 3: Bakhan Village - Hanoi (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nCheck in hotel and overnight in Hanoi. Trip ends at your hotel in Hanoi. Good bye and see you again!"}]},{"name":"3-day Hanoi - Pu Luong Natural Reserve - Ninh Binh: Hoa Lu & Trang An","duration":3,"travelStyle":["Adventure","Mountain Hikes","Group","Partially Guided","Hiking & Trekking","In-depth Cultural","Holiday"],"oldPrice":0,"price":190,"summary":"\n\tThe Pu Luong - Ninh Binh 3 days tour is the perfect combination to visit a beautiful Nature Reserve and the Halong bay in land, Ninh Binh.\n\n\tYou will spend two days trekking in the amazing Pu Luong Reserve. This valley surrounding by mountains covered by rice field terraces or jungle is preserved from tourism. The local Black Thai Minority living there still live on a traditional way from agriculture using the impressive waterwheels for irrigation. \n\n\tThe third day, you will have the chance to learn about the Ancient Capital Hoa Lu, ride on the Historical Sao Khe river in Ninh Binh. You will then cycle between the karst mountains to a local family house to learn about their daily life and customs.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca13.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca13.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca17.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca19.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca1b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca21.jpg","https://cdn.tourradar.com/s3/tour/1500x800/132214_5e449c7eaca22.jpg"],"destinations":["Hanoi","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi – Pu Luong (L, D) 200km","description":"07:15 – 07:50 = Pick-up at Hotel in Hanoi Old Quarter and start the Pu Luong Ninh Binh 3 days tour.\n09:00 = Short break in Luong Son (Outside of Hanoi).\n11:00 = Visit local market of the Muong Ethnic Minority to learn about their daily life and customs; enjoy the beautiful scenery of Thung Khe Pass (One of the 10 most beautiful passes in Vietnam).\n13:00 = Arrive in Pu Luong Nature Reserve. Have lunch and check in.\n14:30 – 17:30 = Trek following the small roads through the terrace rice fields and cross the stream to visit remote rural villages of Black Thai Minorities to learn about the local people in Pu Luong.(6kms)\n19:00 = Dinner at the lodge, enjoy some local rice wine with the family. Have a quiet night in the middle of the Reserve.\n*Sleeping options: Traditional dorm room in the house on stilts or Private Room no Air-con (High standard accommodations) at Pu Luong Nature Homestay"},{"title":"Day 2: Easy Trek, Bamboo rafting on Cham Stream , Pu Luong Ninh Binh 120km (B,L,D)","description":"07:30 – 08:30 = Have breakfast in the homestay. Say goodbye to the host and continue your trek through another paths of the Reserve to pick up the van to go to Cham stream.\n10:30 = visit the Ba village and cross the hanging bridge to discover the giant waterwheels, and duck farm to learn about Local agriculture system.\n11:30 getting on the Bamboo Raft for a relaxing cruise on Cham stream.\n12:30 = Pick up the van to go back to the lodge for Lunch.\n13:00 = Have lunch and have free time to relax or walking around the village before boarding the van to go to Ninh Binh “the first Vietnamese Capital in 10th century”.\n17:30 = Arrive in Ninh Binh Retreat, check in and have free time.\n19:00 = Have dinner at the retreat\n*Sleeping options: Communal dorm in house on stilts, private bamboo bungalow or deluxe villa with A/C (High standard Acommodation) at Ninh Binh Retreat"},{"title":"Day 3: Cycling to Hoa Lu Ancient Capital and boat ride in Trang An (B,L)","description":"7:30 – 8:30 = breakfast at the Retreat\n8:30 to 12:00 = Cycling through the limestone karsts to reach 2 temples of the first 2 Emperors in the 10 th Century in Hoa Lu Ancient Capital hike up the Ma Yen Mountain to visit the King’s tomb in 10th century and enjoy the panorama view from the mountain. On the way back, stop in a local family to discover daily life and culture and share a tea with them.\n12:00 -13:30 = Check out and have lunch at the Retreat\n13:30 -16:00 = Go to Trang An for a boat ride in between the karst pics and enjoy the beautiful scenery and peaceful atmosphere.\n16:00 = Drop you off at Ninh Binh Railway station or bus station or board the bus to go to Hanoi.\n19:00 = Drop off in Hanoi old quarter. Tour ends."}]},{"name":"Sapa & Bac Ha Market - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":244,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n","highlights":["Explore the stunning Northern highlands hill-station of Sapa","Experience spectacular landscapes and fascinating hill tribes","Discover unique treasures at the area’s biggest market, Bac Ha"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/59485_d7964016.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/59485_d7964016.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_24e219db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_eb862d4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_f9e2f2e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_a03bf16b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_b0c69ac4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_9f332ce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_4fc86879.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_aa6c8063.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_a182563f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_d8cd09b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/59485_8ae2d8bc.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Lao Cai"],"timeline":[{"title":"Day 1: Sapa, picturesque landscapes and colorful hill tribes (-/L/D)","description":"In the morning, you will be transferred to the Ha Noi bus station to Sapa.\nYou will be picked up by a local guide, we will start our long trek to discover the life of the minority people. The walk takes you from Lao Chai Village of the Black H'mong Minority to Ta Van Village of the Giay Minority with a stop at the local Catholic Church. Along the way, we will take in the different traditions, cultures and costumes of the Giay and Hmong peoples. Return to Sapa. Overnight in Sapa.(LD)"},{"title":"Day 2: Bac Ha Sunday Market (B/L/D)","description":"Enjoy breakfast before taking a scenic two-hour drive to Bac Ha Market. Bac Ha is one of the biggest and well known markets and a place where many ethnic minorities such as Flower Hmong, Phu La, Black Dao, Tay and Nung minorities gather to buy and sell local products that cannot be found elsewhere. This makes the market become a portrait photographers dream of. \nAfter that, we will walk to Ban Pho Village to visit the Flower H’Mong Ethnic people. Here, we have a chance to spend some time and understand a little more about the lives of people. And you can experience your life on the mountainous and remote area. This is really interesting and makes holiday more memorable and meaningful. Arrive in Sapa in the afternoon. Overnight in Sapa (BLD)"},{"title":"Day 3: End of the trip, full of experiences (B/-/-)","description":"Free day for shopping and discovering Sapa town. \nAs a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal-modelled wooden souvenirs or clothes with colourful patterns. It is interesting \nto buy some presents for your relatives and friends .\nCheck out, transferring to Sapa bus station back to Ha Noi. (B)"}]},{"name":"Hanoi Tour Package 4 Days 3 Nights ( Hanoi, Halong Bay and Ninh Binh)","duration":4,"travelStyle":["Coach / Bus","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":250,"summary":"Asia Focus Travel provide package tour 4 days 3 nights for clients has limited the time to visit Hanoi and this package you can visit Ho Chi Minh House and Ho Chi Minh's Mausoleum\nVisit to Buddhist Tran Quoc Pagoda on West Lake\nHa Long Bay and Ninh Binh \nDeparture everyday","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/142546_1d2c3e48.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/142546_1d2c3e48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_b8859b4a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_e675f516.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_0ccdc619.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_d26b2023.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_0ca8f8a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_814ddea6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_9e2544b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_f81c7306.jpg","https://cdn.tourradar.com/s3/tour/1500x800/142546_cca85e8a.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ha Long Bay ( Included: Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide ,start the trip to Ha Long Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board Dragon Cruise to start a wonderful time enjoying stunning landscapes of Ha Long.\nSavor lunch on board while passing beautiful islets of Stone Dog, Incense Burner, “Fighting cock”.\nVisit Thien Cung “Heavenly Palace” cave, the most beautiful cave in Ha Long Bay. \nStop at the harbor again to catch the bus to back Hanoi. \n20:00 Arrive back in Hanoi. Tour ends."},{"title":"Day 3: Hanoi - Ninh Ninh - Hoa Lu - Tam Coc (Included: Breakfast, Lunch)","description":"07:40 - 08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\nDepart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \nLearn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. Overnight in Hanoi "},{"title":"Day 4: Hanoi City Tour - Departure (Included: Breakfast, Lunch)","description":"Tour guide pick you up from 7:45 – 8:30, depending where you stay in the old town.\n08:30 : Visit Ho Chi Minh complex, you have a chance to see the embalmed body of  Ho Chi Minh then walk around Ho Chi Minh garden to see 2 houses where he lived & worked from 1954 to 1969.\n09:30 - 09:45: Visit One Pillar Pagoda where worshipping the Goddess of Mercy – It is the most unique pagoda  in the world\n10:15 : Visit the Lacquer Paintings workshop – the biggest center in Ha Noi\n10:45 : Visit one of these :\n•\tOption 1 : Bat Trang ceramics & pottery village\n(On Mondays – Wednesdays  – Fridays )\n•\tOption 2 : Vietnam Museum of Ethnology\n(On Tuesdays – Thursdays – Saturdays & Sundays)\n12:30: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese cuisine with 8 delicious dishes. \n13:30 – 13:45 : Continue to visit Temple of Literature – the first university in Vietnam in the feudal system.\n15:00 : Visit Tran Quoc Pagoda – was first built in Ha Noi in 6th century. You will see the oldest Bodha Tree in Vietnam planted by Ho Chi Minh.\n15: 45 : Leaving for Hoan Kiem Lake to visit Ngoc Son Temple where worships General Tran Hung Dao who defeated Mongolian invader in 13th certury.\n16:15 : Tour finishes. \nOur driver will pick you up at your hotel as your flight departure.  \nEnd of Services \n\n"}]},{"name":"Phu Quoc & Ho Chi Minh City - 3 Days","duration":3,"travelStyle":["Beach","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":346,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\nCome with us on a three-day trip to the remote tropical island paradise of Phu Quoc.\n Away from the mainland, snuggled into the Gulf of Thailand, this 48kms-long island is home to a bounty of heavenly white-sand beaches and sparkling turquoise waters that are always warm.","highlights":["Spend your days relaxing on heavenly white-sand beaches","Take a dip into sparkling turquoise waters that are always warm","Escape from the daily hustle and bustle of Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33742_929a192e.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33742_929a192e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33742_2c402a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33742_beb1a9d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33742_5dd14898.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33742_c75ba711.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33742_e12de25f.jpg"],"destinations":["Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Phu Quoc (-/L/D)","description":"No need to worry about transportation to the airport, we will pick you up from your hotel to the airport for a short flight to Phu Quoc. (Return flight between Ho Chi Minh City - Phu Quoc is at your own expense). Once we land, we will check into a hotel and have lunch at a local restaurant in Phu Quoc. In the afternoon, we will visit Dinh Cau, Thung House (a local maker of fish sauce) and Ham Ninh Fishing Village, where fresh seafood is sold. Our day will conclude with a peaceful dinner and plenty of time to relax."},{"title":"Day 2: Phu Quoc (B/L/D)","description":"In the morning, we will visit Ho Quoc Pagoda the biggest pagoda in Phu Quoc built with wood and stones. You will have chance to enjoy the beautiful landscape from the pagoda. We will also visit Bai Sao beach- one of the most beautiful beaches in Phu Quoc where you can go swimming, have lunch and relax on the beach. We will continue to visit the Harbor of An Thoi Town, the busiest harbor where ships gather after fishing."},{"title":"Day 3: Phu Quoc - Ho Chi Minh City (B/L/-)","description":"Phu Quoc is known for its fresh seafood and after breakfast, we will visit the Duong Dong Market and see what the local merchants have to offer. Our day will finish with a short flight back to Ho Chi Minh City. (Return flight between Ho Chi Minh City - Phu Quoc is at your own expense). We will provide transfer from the airport to your hotel."}]},{"name":"3-Day Ha Long Bay on 5-star Cruise with Kayaking, Amazing Cave & Titop Island,...","duration":3,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":388,"summary":"- Exceptional 3-day cruise to explore Halong Bay - a World Heritage Site recognized twice by UNESCO.\n- Accommodation in luxurious cabins with private balconies, fully furnished bathrooms and two-way air-conditioning\n- Savor our new menu: A unique fusion of fresh Vietnamese ingredients prepared with our professional chef.\n- Joying cooking class and or early morning Taichi Session on sundeck or onboard boardgames.\n- Swimming in the smoodly blue water.\n- Immerse in impressive grottoes and caves around the bay.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/156568_16475256.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/156568_16475256.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_ea66329a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_b5edd75b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_84c17330.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_ecda9d68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_c23c118e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_e730b21d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_e6118f73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_9f3e6f18.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_2191cef5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_faa697f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_9c995136.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_47520425.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_8fb0a6a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_4f1a2955.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_17a881f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/156568_2e0a1871.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI – HA LONG BAY (LUNCH/DINNER)","description":"08:00AM: Transfer from Hanoi to Halong Bay, driver pick you up at your hotel/stay in Old Quarter\n12:00PM: Arrive Tuan Chau island.\n12:45PM: Board the boat and start your journey. Enjoy welcome drinks during the itinerary and safety briefing from Cruise Manager\n13:00PM: Let the vacation begin with a set lunch as the boat cruises towards the southeast of Halong Bay, passing Fighting- Cock and Finger Islet. \n14:30PM: Explore Surprise cave, one of the biggest caves in Ha Long Bay with beautiful stalactites\n15:15PM: Swim or hike on Titov Island.\n16:00PM: Optional onboard activities traditional spa extra charge, sunbathing on board.\n17:30PM: Traditional Vietnamese cooking and fruit carving demonstration on sundeck (or in the restaurant in case of inclement weather) while boat cruises to overnight anchorage area.\n19:30PM: Set menu dinner is served in the restaurant.\n21:00PM: Relax in your cabin or join our staff at the reception for squid fishing.\nOvernight on 5-star cruises with clean-conditioned private cabin"},{"title":"DAY 2: HALONG BAY (BREAKFAST/LUNCH/DINNER)","description":"06:15AM: Start off your day with a Tai Chi lesson on the sundeck.\n07:00AM: Enjoy breakfast while the boat cruises further through the beauty of Ha Long.\n08:30AM: Transfer to a Day Boat passing to Dau Nguoi, Hien Ngua Islets.\n09:30AM: Visit Dark lagoon. Kayak or swimming near Trong Cave area.\n11:30AM: Return to the boat to relax on board.\n12:30AM: Enjoy lunch when it heads toward Halong Bay.\n14:30AM: Visit pearl farm or Me Cung cave.\n15:30AM: Enjoy sunset party.\n16:20AM: Back to the main boat.\n17:30AM: Traditional Vietnamese cooking and fruit carving demonstration on sundeck (or in the restaurant in case of inclement weather) while boat cruises to overnight anchorage area.\n19:30AM: Dinner is served in the restaurant.\n21:00AM: Relax in your cabin or join our staff at the reception for squid fishing.\nOvernight on 5-star cruises with clean-conditioned private cabin"},{"title":"DAY 3 : HALONG BAY - HANOI (BREAKFAST/BRUNCH)","description":"06:15AM: Start your day with a Tai Chi lesson on the sundeck.\n07:00M: Light breakfast is served. The vesel weighs anchor to cruise through more of Ha Long Bay.\n07:45AM: Visit Luon Cave area by bamboo boat or kayaking\n09:00AM: Brunch is served in the restaurant while the boat heads back to the harbour.\n11:00AM: Disembark at Tuan Chau Marina. Take your transportation and get back Hanoi\n14:00PM: Drop you off at your hotel and trip ends!"}]},{"name":"Hanoi & Halong Bay - 3 Days","duration":3,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":334,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\n","highlights":["Cruise past limestone islands majestically rising out of emerald water","Learn the art of how to cook traditional Vietnamese cuisine","Indulge in the sounds and smells of Hanoi's colourful markets"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33778_9ba34591.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33778_9ba34591.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_e543c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_9f1c4b1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_157ccead.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_f53fc366.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_b502838f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_18c8aef0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_892a4a95.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_a52eed20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_71e3bc54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_1eee55ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33778_994476b0.jpg"],"destinations":["Ho Chi Minh City","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Ho Chi Minh City – Ha Noi City Tour (-/-/-)","description":"Transfer to airport to take a flight to Ha Noi. Return domestic flights between Ho Chi Minh City - Ha Noi is at your own cost. Arrival Noi Bai airport, pick-up and transfer to Ha Noi city. Afternoon, drive to the historic complex of Ba Dinh. Visit Ba Dinh Square, where the late President Ho Chi Minh read Viet Nam’s Proclamation of Independence on 2 September 1945. Visit Ho Chi Minh’s Mausoleum and continue to One-Pillar Pagoda, a must-see monument in Ha Noi. One-Pillar Pagoda is an ancient Buddhist pagoda supported by only one pillar. Built in the early 11th century during the reign of King Ly Thai Tong, the pagoda resembles a lotus blossom. We will also visit Van Mieu - Quoc Tu Giam (temple of literature), the first Imperial school in Viet Nam built in 1070 during the dynasty of King Ly. Overnight in Ha Noi."},{"title":"Day 2: Ha Noi - Ha Long Bay (B/L/D) by shuttle bus","description":"The shuttle bus will pick you up at the hotel and drive you through the scenic countryside to Ha Long Bay. The wondrous Ha Long Bay is truly one of Viet Nam’s most impressive sights. Heading out of town, we will embark on a boat for exploration of the legendary Ha Long Bay. This exciting five-hour cruise will provide a fantastic view of the picturesque scenery. Ha long Bay is home to some 3000 limestone islands that rise out of the clear emerald water. The limestone karsts formations are littered with beaches, grottoes and beautiful caves. Along the way, we will anchor for a leisurely swim in a secluded cove and enjoy a visit to one of the many hidden grottoes beneath towering cliffs. Stay overnight on the Junk Cruise. "},{"title":"Day 3: Ha Long Bay - Ha Noi - Ho Chi Minh City (B/L/-) by shuttle bus","description":"After breakfast, spend your morning swimming in the bay or relax and sunbathe on the beach. Have lunch before returning to Ha Noi. Transfer to Noi Bai airport to return Ho Chi Minh City. Return domestic flights between Ho Chi Minh City - Ha Noi is at your own cost. Transfer back to hotel."}]}]