[{"name":"Hanoi - Halong bay - Ninh Binh 5 days With Overnight on Cruise","duration":5,"travelStyle":["Boat","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":415,"summary":"Highlight of Northern Vietnam start from Hanoi with beautiful temple, and Hanoi Old Quarter where you can  spend hours checking out the coffee shops, spoiling yourself with a massage or haggling with the locals over souvenirs as diverse as chopsticks and oil paintings. Then enjoy stunning scenery with still and calm waters and the intrigue of limestone caves in Halong bay – one of the Seven Wonders of the World. Next destination would be Ninh Binh, it is blessed with diverse topography of both mountainous and coastal areas. In Ninh Binh, we can’t hep mentioning Tam Coc with rock formation, caves, water and landscape have made the major tourist attraction of Northern Vietnam \n ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150720_48367241.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150720_48367241.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150720_e2126795.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150720_b63273b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150720_16596108.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150720_f87e96d0.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"HANOI ARRIVAL - HALF DAY CITY TOUR","description":"Arrive at Noi Bai International Airport, you are welcome by our guide and transfer to restaurant for lunch. Then you will be dropped at hotel for check in. Hanoi or “River-bound City” as its name literally means is Vietnam’s capital with a thousand-year-old history dating back to 1010. The city’s fascinating beauty which is characterized by unique cultural relics, ancient streets of antique houses, elegant French colonial buildings, tree-lined boulevards and romantic lakes has made it one of the most charming cities of Asia.\nIn the afternoon, visit Temple of Literature - Originally built in honour of Confucius by Emperor Ly Thanh Tong in 1070, a university was added to the grounds six years later. The university provided education to the royal family and children of the aristocracy or \"mandarins\". The University remained here until Emperor Gia Long moved the countries administrative capital from Hanoi to Hue in the 18th century. Visit St. Joseph's Cathedral in Hanoi, walking to Ngoc Son temple and Hoan Kiem Lake, located on an islet in the lake. Hoan Kiem Lake is the center point of Hanoi and home to a rare endangered giant turtle species. Its name “Returned Sword” comes from a legend of a sacred sword being lent to an ancient Vietnamese King by a holy turtle from the lake and later returned to the turtle. Stay overnight at hotel in Hanoi. \n\n. "},{"title":"HANOI - HALONG BAY/ OVERNIGHT ON CRUISE","description":"Morning pickup at 8:00 AM from your hotel for transfer to Halong Bay, which is about 160 km or 3.5-hour drive away. The transfer is approximately 3 hours. You will see some rural areas of the Red River Delta with plenty of chances to take photos of Vietnamese farmers working in paddy fields and you may stop on the way to admire the local scenery. \nArrive in Halong City at 11:30 AM and check in aboard the booked junk when your journey across Halong Bay starts. Halong Bay meaning Descending Dragon Bay in Vietnamese as legend has it that it was where a holly dragon landed down from sky. The bay, famous as one of the world’s wonders and heritage sites whose formation dates back 500 million years, consists of around 2,000 karst islands and islets scattered over an area of 1,553 km2.\nAfter lunch, take a short trek to a nearby summit for a panoramic view of the bay dotted with golden sails, go swimming on a quiet beach or sunbath on the sundeck. Later in the afternoon, you will visit an interesting fishing village with an opportunity to interact with local people who have been living in the bay for almost three generations. An optional kayaking trip is available weather permitting. Back onboard enjoy a lavish dinner and enjoy the bay view at sunset. Spend a night on board."},{"title":"HALONG BAY","description":"Wake up with Tai Chi exercises on the sundeck and continue cruising the Bay. Enjoy breakfast buffet in the restaurant, then visit the limestone grotto. Enjoy lunch on board and disembark in Halong round 12 noon. Drive back to Hanoi , drop you at hotel. You are free at your leisure in the evening. "},{"title":"HANOI - HOA LU ANCIENT CAPITAL - MUA CAVE - TAM COC - HA NOI","description":"After breakfast, you will be picked up at hotel lobby and depart to Ninh Binh with 2,5 hours driving. \n10.30 Arrive in Ninh Binh, We make a short transfer (4 km) down a peaceful country road to Hoa Lu, Vietnam’s ancient capital eleven centuries ago. Here, there are two temples dedicated to King Dinh and King Le, the founders of the ancient capital during the 10th century.\n11.15: Visit Mua Cave and start an amazing trek up to the top of Ngoa Long mountain for watching the spectacular rice valley with a precious view of nature.\nHave lunch at local restaurant. \n After lunch you will get on bamboo boat - rowed by the local people - in Hoang Long river to visit Tam Coc (three caves) on the way. You pass through three enormous caves that provide a brief respite from the intense summer sun. It takes approximately two hours to go up and down the river and along the way, you witness local fisherfolk, village life along the river and, of course, the striking limestone karst formations that Tam Coc is famous for.After the boat trip, we return to the bus and head back to Hanoi city. Drop you at hotel in Hanoi. "},{"title":"HANOI DEPARTURE","description":"Have breakfast at hotel. You are free for shopping until time to go airport for departure flight.  End of your trip with great experience in Vietnam."}]},{"name":"Hanoi & Sapa with Fansipan Mountain 5 days","duration":5,"travelStyle":["Hiking & Trekking","Group","Partially Guided","Holiday"],"oldPrice":0,"price":436,"summary":"A truly an excursion to discover the cultural and natural charms of the historic Hanoi and authentic Sapa highland town. See the diversity of Vietnamese culture during 5 days of experience and discovery!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/170238_2df5fd6f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/170238_2df5fd6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_ac1edd31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_87b846fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_000d535d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_cb1bd60a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_90af33a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_10a7c69e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_2f018484.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_56cfd77f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/170238_e8043d2e.jpg"],"destinations":["Hanoi","Sapa","Cat Cat Village","Lao Cai"],"timeline":[{"title":"HANOI ARRIVAL - TRAIN TO LAO CAI","description":"Welcome to Vietnam. Upon arrival at Noi Bai Airport, obtain your Vietnam visa, and then clear Immigration and Customs. After collecting your baggage, exit the airport to meet outside our driver and you will be privately transferred to your lovely hotel.\nAt night, our driver will take you to Hanoi train station to catch the night train to Lao Cai.\n"},{"title":"LAO CAI - SAPA - FANSIPAN MOUNTAIN - CATCAT VILLAGE","description":"Arrive Lao Cai train station, you will be welcomed by our local tour guide and transferred to a local restaurant near the railway station for showering and a breakfast. Then drive uphill to Sapa. Along the way, you can stop anywhere to admire of green valleys, rice terraces, and local people – hill tribes working on the slope of hill, water buffalo or pig on slope of mountains.\nSet your feet in Sapa town, start a day tour to visit:\nwe head to the Sapa Cable Station for very amazing trip to Indochina’s Rooftop – Mount Fanxipan by cable car. This is particularly interesting in these northern mountains of the country, where travelers seek the rice terraces and traditional arts of a minority peoples.\nCultivating the land to an altitude of around 2,200 meters are the ethnic minorities the lowland Vietnamese generically call ‘Meo’ – savages – and above them looms the bulk of Hua Xi Pan: “giant protruding rock”. You can challenge yourself when hiking 600 stone stairs more to reach the rocky peak of The Roof of Indochina. Have lunch at local restaurant. \nIn the afternoon, visit Cat Cat Village, 2km from Sapa Town, is an age-old village of H'Mong ethnic group remaining unique customs and practices that are lots in other villages. Visitors to Cat Cat have an opportunity to admire a lively and colorful picture. Visitors to Cat Cat have an opportunity to admire a lively and colorful picture. That is the image of young women sitting by looms with colorful pieces of brocade decorated with designs of flowers and birds. Free at your leisure in the evening to discover Sapa by night. \n"},{"title":"SAPA - LAO CHAI - TA VAN - SAPA - HANOI BY LUXURY LIMOUSINE","description":"From Sapa, we trek via Y Linh Ho through beautiful scenery to the Black H’mong Village of Lao Chai where we spend time looking around the village and learning about life in the village.\nThen, we walk through rice terraces and on local paths to the Zay village of Ta Van.\nThis is the only village in the Sa Pa area where the Dzay people live. We spend time looking around the village.\nAt 16:00, you get on shuttle bus to go back to Hanoi (no guide).Arrive in Hanoi around 21.30.\nStay overnight in Hanoi\n"},{"title":"HANOI CITY TOUR","description":"8.15 - 08:30: Our guide meets you at hotel and start Hanoi city tour \n- Start the trip with Tran Quoc pagoda is the oldest pagoda in the city, originally constructed in the sixth century during the reign of Emperor Ly Nam De, thus giving it an age of 1,400 years. When founded the temple was named Khai Quoc (National Founding) and sited on the shores of the Red River, outside of the Yen Phu Dyke. When confronted with the river's encroachment, the temple was relocated in 1615 to Kim Ngu (Golden Fish) islet of Ho Tay (West Lake) wh ere it is now situated. A small causeway links it to the mainland. The last major repair to the temple was undertaken in 1815 when the main sanctuary, reception hall and posterior hall of the dead were renovated.\n- Visit Ho Chi Minh complex, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n- Visit Temple of Literature, known as the first university of Vietnam built in 1070 by the Ly Dynasty to honor Confucius, sages and outstanding Vietnamese scholars.  \n12:30 Relax and have lunch at a local restaurant in Hanoi Old Quarter.\n- Explore daily life of traditional ceramics village of Bat Trang Ceramic Village, it is a traditional porcelain and pottery village with history of seven centuries,\n- Visit Hoan Kiem lake and Ngoc Son Temple located on an islet in the lake. Hoan Kiem Lake is the center point of Hanoi and home to a rare endangered giant turtle species. Its name “Returned Sword” comes from a legend of a sacred sword being lent to an ancient Vietnamese King by a holy turtle from the lake and later returned to the turtle.15:30 Drop you off at hotel. \n"},{"title":"HANOI DEPARTURE","description":"After enjoying breakfast at your lovely hotel, you will have your own free leisure time to sample souvenir and relax before heading to the airport. End trip.\n\n"}]},{"name":"Best Of Vietnam - Sapa/ Mekong Delta/ Mekong Delta","duration":14,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1704,"price":920,"summary":"Vietnam has many things to offer, you will see sights that challenge your mind, from splendid valleys and mountains in Sa Pa to spotless beaches in Hoi An. Not to mention your heart will be taken by the charming old town of Hoi An. Besides that, you can not miss the magnificient Ha Long Bay and be ready to be fascinated by the famous Cu Chi Tunnels used during the Vietnam war. You'll start in the colonial Hanoi and conclude your visit in the vibrant Ho Chi Minh City. This is going to be a remarkable trip in your life as Vietnam will also surprise you with friendly people and stunning cuisine.  ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/136789_6f8fabd2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/136789_6f8fabd2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_82ae58b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_fc9e5a29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_b07fdb08.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_49bd8976.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_69b9d6e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_3d1d9d30.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_d3580c9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_03764b5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_a5e252e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_41264583.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_fbf79964.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_3e6c6ebd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_ac192092.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_1b4b88cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_1fbde52f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_7aba6f42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_be04f222.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_6556da31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/136789_8ea34279.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep. "},{"title":"BAVI ECO TOUR (B) - PRIVATE TOUR","description":"You will be picked up from hotel at 07:30 and transferred to Ba Vi. You will visit 3 villages, at each village, the local host will show you Vietnamese countryside life. You will be welcomed by Mr Duoc – a veteran, listen to his stories about his life during and after the Vietnam War. He also is an expert on handling the raw tea leaves and making it into the products to sell on the market Then you will visit a tea village with 30-years old tea trees. There besides walking and helping local people to harvest the tea leaves, you will know how to pick the best part of the tea tree to make the most wonderful beverage in the world. Then heading to Mrs. Chin’s house for a cooking lesson and have lunch with in the garden. After the lunch have some rest and your host will take you around her village and you will visit the local workshops. You will learn how to make tofu, unshell the rice and will see the workshop of local hammerer who is working there for 70 years. Cycling through the rice fields then you will arrive to the house of your next host Mr. Chau, have your feet soaking in warm water with herb leaves following the recipes of Muong ethnic minorities. Continue the boat trip along the Da river and viewing the stunning scenery and discover the life of local people alongside the river. \n\nDrive back to Hanoi in the evening, end your Bavi Eco Tour at the hotel around 18:30.\n\nOvernight in Hanoi."},{"title":"HANOI – NIGHT TRAIN TO SAPA","description":"Have a free day in Hanoi - an unique Asian city with tree-lined boulevards, French colonial architecture, peaceful lakes and oriental pagodas and temples dating back thousand years ago.\nYou could visit Ho Chi Minh complex, the Temple of Literature, History or Ethnology museums or just have a walk around the Old Quarter or around West Lake. Please note that the Ho Chi Minh Mausoleum is closed on Fridays and Mondays and most museums are closed on Mondays.\nGet back to the hotel and get ready for the night train trip.\n20:30 - 21:00 Pick-up at the hotel. Transfer to railway station for a night train to Sapa (schedule 21:50 - 06:30).\nOvernight at the A/C soft sleeper cabin to Lao Cai (schedule: 21:00 – 05:00)"},{"title":"SAPA - Y LINH HO - LAO CHAI - TA VAN (B/L/D) GROUP TOUR","description":"You will be picked up at the Lao Cai station and transferred to Sapa for breakfast and some rest.\n\nThen start 12 km trekking. You will visit  Y Linh Ho and Lao Chai villages of the H’mong minority, where you will see their traditional life, walk through the rice terraces and a small trail on the hill mountainside. Then have lunch, after which you will continue hiking to Ta Van village of the Dzay people, where you will stay overnight at a local family. Here you will have an opportunity to experience their daily life, work, and original customs.\n\nOvernight at the Dzay local house."},{"title":"TA VAN - GIANG TA CHAI - SAPA - HANOI (B/L)","description":"Breakfast before start tour with 08 km walking to visit Giang Ta Chai - a village of the red Dzao. Visit a beautiful waterfall and rattan bridge. Enjoy the breathtaking landscape. Have lunch. After the lunch you will get back to Sapa town, which you could explore at your own pace. \n\nAt 17:00 we will transfer you to the Lao Cai train station for the night train back to Hanoi.\n\nOvernight at the A/C soft sleeper cabin to Hanoi (schedule: 21:00 – 05:00)."},{"title":"HANOI – HA LONG BAY (B/L/D) – SHARING CRUISE, BUS","description":"Upon arrival in Hanoi, we will transfer you to a day-stay hotel, where you could have breakfast and get refreshed before your pick up to cruise. Take the  most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to explore the limestone rocks and the karst grottoes.\n\nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which there will be a trip to the famous Limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can optionally attend the activities taking part on the boat or relax for the day.\n\nOvernight on cruise."},{"title":"HA LONG BAY – HANOI (B/L) – SHARING CRUISE","description":"Rise early for a lesson in Tai Chi or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Free at your leisure time.\n\nOvernight in Hanoi."},{"title":"HANOI FLY TO HOI AN (B) – FLIGHT INCLUDED","description":"Have breakfast at the hotel, have a free leisure time until there will be a private cab transfer you to the airport, and get ready for the next flight to Hoi An.\n\nOvernight in Hoi An"},{"title":"HOI AN LEISURE","description":"Custom tailoring is a huge industry in Hoi An. Hoi An is home to more than 400 tailoring shops and thousands of tailors who are not only talented at making clothes but are skilled in making shoes and handbags as well! Average turn around time for full suits is a day and about 4 hours for handbags or shoes! If you are interested in getting custom made items, try to find a shop of your liking as early as possible during your visit.\n\nThe afternoon is the perfect time of day to see some of the famous sights within Hoi An. But first, before you set out on food to discover the city, we recommend that you grab a Banh Mi sandwich to fuel you for the afternoon. Banh Mi Sandwich in Hoi An is both famous and different from any sandwich you will get in other parts of Vietnam. The bread and fillings are unique to the region and it is a great first insight into local cuisine. We highly recommend Madam Khanh’s stand, who has been dubbed the Banh Mi Queen in Hoi An.\n\nAfter dark, the Old Town in Hoi An transforms into a mystical row of lights and lanterns. In fact, Hoi An is a big center for paper lantern manufacturers and merchants. Every shop or establishment will have a few lanterns outside, but the real sight is the lantern market. Here you’ll be able to see how these lanterns are made and will have a plethora of choices should you wish to take some home with you.\n\nAfter a stroll through the market, check out the outdoor traditional theatre. You will have a chance to see Vietnamese folk dancers and musicians perform traditional pieces. The theatre runs from 9 pm to 10 pm at the square on Nguyen Thai Hoc street. It is completely free and open to the public so it’s interesting to see, even if it’s just for a few minutes as you pass by. Before you get back to your hotel, be sure to light a candle box and set it in the water. Many kids sit along the banks of the channel and offer candles to you – remember to make a wish.\n\nOvernight in Hoi An"},{"title":"HOI AN LEISURE","description":""},{"title":"HOI AN FLY TO HO CHI MINH CITY (B) – FLIGHT INCLUDED","description":"Breakfast at the hotel. Then, taking the flight to Ho Chi Minh City. Check in your hotel and free at your leisure time to get your energy back.\n\nOvernight in Ho Chi Minh"},{"title":"MEKONG DELTA (B/L) – GROUP TOUR","description":"(start 7:20 am  – return around 17.30 )\n\n7:20 am Pick up from hotel.\n\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\n\nStop over at Unicorn Island, go walking aroundthe country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation.\n\nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit a honey-bee farm, enjoy honey tea and coconut candy workshop.\n\nHave lunch at a local restaurant. Break time.\n\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh.\n\nOvernight in Ho Chi Minh"},{"title":"HO CHI MINH – CU CHI TUNNEL (B/L) – GROUP TOUR","description":"\tDepart for Cu Chi tunnel, the trip will take approximately one and a half hours driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by an introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\n\nBreak time for relax or time for those who want to try the real shooting gun. Return to Ho Chi Minh.\n\nOvernight in Ho Chi Minh"},{"title":"TIME TO SAY GOODBYE - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends."}]},{"name":"Vietnam Heritage Discovery - 15 Days Tour","duration":15,"travelStyle":["Sightseeing","Group","Fully Guided","Holiday"],"oldPrice":1799,"price":900,"summary":"\n  The best quality and unbeaten price for 15 Days Trip\n  100% Guaranteed Departure\n  NO hidden Cost, NO Optionals\n  Start in Hanoi and finish in Hanoi or Ho Chi Minh City\n  Visit Hanoi, stay in Boutique hotel inside the Old Quarter\n  Stay overnight on Boat in Halong Bay - World Heritage Site\n  Escape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\n  Learn about Vietnam history of Kings throughout Hue Imperial City\n  Explore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\n  Taste wonderful Vietnamese local cuisines along the trip\n  Discover 4 World Heritage Sites: Halong Bay, Hue, Hoi An and My Son Sanctuary\n  And more...\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187172_b6ef9b64.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187172_b6ef9b64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_b4f92e03.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_cdc41cfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_339d3942.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_cdc402cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_ce99ca83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_2029c6c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_5d354c6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_2a7011bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_24db2333.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_a2c145b7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_ef414404.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_a075453d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_a54157d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_faef6c88.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_bb5af6d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_a1b9dac6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_14a9db83.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_5209fed1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_f4f15a28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_275046b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_dd127a51.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_43726d16.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187172_36641376.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 2: Hanoi - Halong Bay with overnight on Cruise (B, L, D)","description":"At 8:00 am we will pick you up, by Shuttle mini-van/bus, at the hotel and begin our journey to Halong city. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the at port. Board your private boat, an authentic Chinese Junk, and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave”, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck. Stay overnight on Boat.\nGarden Bay Cruise 3* or similar"},{"title":"Day 3: Halong Bay - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs, We stop to visit a floating fishing village and listen to some legendary stories of the fishermen’s daily life. Have lunch on boat while cruising back to the Halong city pier, return to Hanoi around 4:00pm.\nCheck in & overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 4: Hanoi City Tour full day (B, L)","description":"Depart at 8:00 am from your hotel by van. We will begin our day by visiting Uncle Ho, learning about his great life at the Ho Chi Minh Mausoleum, Presidential Palace, and his residential place. Next stop is the nearby Temple of Literature. The site of Vietnam´s first University, built in twelfth century, to teach Confucius’s theory to royals. Here we will also have a chance to see a traditional music performance. Lunch will be served at a local restaurant for a taste of authentic Hanoi Pho (noodle soup). In the afternoon, choose one from the numerous museums or temples around Hanoi (Museum of Ethnology, Women´s Museum, History Museum or Quan Thanh Temple). In the late afternoon walk around Hoan Kiem lake and Hanoi´s fascinating Old Quarter for some great fun, shopping, and street side traditional food, may be to try one “Hanoi bia”. This is your chance to be part of typical Hanoian style and its traditional Vietnamese culture. We finish our relaxing but informative day by attending a Water Puppet Show, a favorite experience for all visitors to Vietnam. The show ends around 6:00pm\nCheck in hotel and stay overnight in Hanoi.\nPomihoa Hotel Hanoi 3* or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort 4*"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Hue City (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Hue City. Overnight on the Train (4 Berth Cabin sleeper sharing) without breakfast in the day 7th."},{"title":"Day 7: Hue City arrival","description":"Spend overnight with good sleep on the night train. Arrive Hue City around 08:30 am! Pick up at Railway Station upon arrival then transfer to hotel in Hue Imperial City. Check in & have a rest or discover Hue Citadel by yourself. No sightseeing activity today!! Overnight in Hue City.\nHue Cherish Hotel 3* or similar "},{"title":"Day 8: Hue City Full Day (B, L)","description":"Get started at 8:00am from your hotel, we walk and transfer to the boat dock for cruising on the Perfume River viewing the city and the tranquil villages on the riverbank. Walk up to visit the Thien Mu Pagoda, overlooking the Perfume River and the beautiful scenery beyond. Take some time here to learn about the influences of Buddhism in Vietnam. In the afternoon we will visit the town, Forbidden Purple City. End of the day round 5:00 pm. Check in hotel and stay overnight in Hue City.\nHue Cherish Hotel 3* or similar "},{"title":"Day 9: Hue - Hoi An Ancient Town (B)","description":"Breakfast at hotel in Hue City. You`ll have free morning time to discover more Hue City until 1:00pm.\nAfter it will be time to begin our transfer to Hoi An (about 3.5 hours). There is fabulous sightseeing en route and we may make stops at: Lang Co Beach, Hai Van Pass, Cham Museum, and maybe the Marble Mountains if time permits. Hoi An in the evening. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 10: Hoi An Excursion/Thu Bon River Boat Trip (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families. Trip ends at 3:00pm.\nReturn to your haven on world-famous \"Cua Dai Beach,\" with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 11: Cycling Tra Que Village - Cooking Class (B, L)","description":"8:00am: Have breakfast at hotel. Our guide welcomes you at hotel in Hoi An and ride bicycle to Tra Que Vegetable Village far from Hoi An Ancient Town 3km. You ride through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. Arrive in Tra Que Vegetable Village; you can experience the living and working of local farmers at this organic vegetable and herb garden. Your learn how to prepare soil, grow vegetable, water to get fresh vegetables as you see at the garden from previous tourists. You have 15 minutes foot massaged by herb to fresh yourself. Here is the chance for you to join in cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods like Tam Huu Spring Roll, BanhXeo pancake… Have lunch at the family. And then ride bicycle back Hoi An Town or hotel. Trip ends at 3:00pm.\nPm: This afternoon you have more free time to experience around the town to get some souvenir gifts or spend your time at Cua Dai beach - 4km from the ancient town. Free to have your own dinner. \nPhu Thinh Resort 4* or similar"},{"title":"Day 12: My Son Sanctuary half day Tour (B)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town around 1:00pm.\nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 13: Hoi An Town free for leisure/shopping (B)","description":"Hoi An Ancient Town is considered as Shopping and Sightseeing Heavens so today you`ll spend your whole day to discover and go shopping in Hoi An Ancient Town.\nStay overnight in Hoi An.\nPhu Thinh Resort 4* or similar"},{"title":"Day 14: Hoi An - Hanoi or Ho Chi Minh City (B)","description":"Today you are free in Hoi An until catch flight to Hanoi/Ho Chi Minh City. Picked up at airport upon arrival. Transfer to Hanoi for check in. Overnight in Hanoi/Ho Chi Minh City. The Trip ends.\nNote: We can arrange the flight ticket for you to come back to Hanoi or you can continue your trip to Ho Chi Minh City (Flight ticket and airport pickup included)\nPomihoa Hotel Hanoi or Liberty Parkview Hotel Saigon or similar"},{"title":"Day 15: Free for leisure (B)","description":"Today you are free for leisure. Time belongs to you. You will discover Hanoi/Ho Chi Minh City by your own or combine your other trip! Good bye and see you again in the next times!"}]},{"name":"Classic Vietnam: Hanoi to Ho Chi Minh City","duration":10,"travelStyle":["In-depth Cultural","Adventure","Group","Fully Guided"],"oldPrice":0,"price":1169,"summary":"Sail through limestone karsts aboard a traditional junk boat and walk the streets of imperial capitals. From vibrant Hanoi, the natural beauty of Halong Bay, the atmospheric imperial capital of Huế, and the charms of Hoi An to the modern day life of Saigon, experience the energy of Vietnam in 10 jam-packed days. An experienced Chief Experience Officer will lead you to must-see highlights with time in between to do your own thing.","highlights":["Stargaze as you sail through spectacular Ha Long Bay","Treat yourself to tailor-made clothes in Hội An","Learn how to cook traditional Vietnamese cuisine","Visit the Imperial Citadel and Royal Tomb in Hue","Explore traditional Hanoi and energetic Ho Chi Minh City"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/5576_ce47ce.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/5576_ce47ce.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5576_e6367741.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5576_ddfef8af.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5576_3bbc10c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5576_127572b5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5576_fa568080.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"There are no planned activities today until an evening welcome meeting. After the meeting, opt for dinner out with the group.\n\nAccommodation:\n- Bonne Nuit Hotel (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n\n\n"},{"title":"Day 2: Hanoi/Ha Long (1B, 1L, 1D)","description":"Drive to Bai Chay harbour, the jumping off point for Ha Long Bay. Thousands of islands with intricate cave systems rise dramatically from the waters. Sail past limestone karst mountains in the junk boat and stop to visit some of the islands and caves.\n\nIn the evening, devour a seafood dinner, then opt to enjoy a drink on deck under the stars.\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Shared Van 03:00 Hr(s)\n- Junk: Ha Long\n\nIncluded Activities:\n- Halong Bay Overnight Cruise\n\n\n"},{"title":"Day 3: Ha Long/Huế (1B, 1L)","description":"Interested in local cuisine? Opt to pre-book the \"Hanoi Foodie Culture Tour\" activity on the checkout page to include this optional on your tour.\n\nAccommodation:\n- Asia Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Basic Overnight Train (beds) 13:00 - 14:00 Hr(s)\n- Private Vehicle 04:00 Hr(s)\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 4: Huế","description":"Arrive early to Hue, once the imperial capital of Vietnam. Start the day with a visit to the Tien Mu Pagoda followed by a visit to the tomb of one of Vietnam’s former emperors. After, opt for a vegetarian lunch at a local nunnery.\n\nWhile in the city, try some local Hue specialties such as banh khoai (Hue savoury pancakes), and banh bot loc boc tom thit (thin rice paper filled with meat and shrimp). Wash it all down with a Hue beer.\n\nOpt to pre-book the \"Hue Motorbike Tour\" activity on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- Asia Hotel (or similar).\n\nIncluded Activities:\n- Tien Mu Pagoda Visit\n- Imperial Citadel Tour\n- Royal Tombs Visit\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 5: Huế/Hoi An (1B)","description":"Cross the Hai Van Pass (weather permitting), with fantastic views in all directions, before arriving to Hoi An in the afternoon. \n\nWith three nights here, there's plenty of time to explore all this charming town has to offer.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 6: Hoi An (1B, 1L)","description":"Explore all Hoi An has to offer. Dive into the culture, hang out on the beach or get clothes tailor-made in one of the many shops around town. Enjoy a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 7: Hoi An (1B)","description":"Spend a free day exploring all Hoi An has to offer.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n\n\n"},{"title":"Day 8: Hoi An/Ho Chi Minh City (1B)","description":"Drive to Da Nang for the flight to Ho Chi Minh City, once the capital of South Vietnam and the country’s commercial centre. Start exploring the small alleys and busy streets, keeping an eye out for laquerware shops and delicious local food stalls.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Plane: Hoi An to Ho Chi Minh City 01:00 Hr(s)\n\n\n"},{"title":"Day 9: Ho Chi Minh City (1B)","description":"With some free time in the city, opt to visit the Thien Hau and Giac Vien pagodas and stroll through the immense Ben Thanh Market. Also well worth a visit are the Reunification Palace (the residence of South Vietnam presidents before 1975), the city's Chinese quarter of Cholon, and the War Remnants Museum.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cu Chi Tunnels Guided Tour\n\n\n"},{"title":"Day 10: Ho Chi Minh City (1B)","description":"Not ready to leave? Your CEO can help with travel arrangements to extend your adventure.\n\nMeals Included:\n- Breakfast\n\n\n"}]},{"name":"Vietnam Super Saver Package - 13 Days","duration":13,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1392,"price":696,"summary":"The best quality and unbeaten price for 13 Days Trip\n100% Guaranteed Departure\nNO hidden Cost, NO Optionals\nStart in Hanoi and finish in Hanoi/Ho Chi Minh City\nVisit Hanoi, stay in Boutique hotel inside the Old Quarter\nStay overnight on Boat in Halong Bay - World Heritage Site\nEscape from City to Bakhan Village Resort - the best brand new Mountain resort in the Northwest of Vietnam\nExplore Hoi An Ancient Town & My Son Sanctuary - World Heritage Sites\nAnd more...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/187100_b5532056.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/187100_b5532056.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_1c5f5a8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_489c7efe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_7934fe1c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_ef41514c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_122483a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_e5b4cc59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_8027119c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_39ac41d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_2ed527a6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_637c44b2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_aabcaded.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_ee3f1202.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_24d65cfc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_0d981c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_2a4b6fc0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_8fb28438.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_03873406.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_c7cac4fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_c3a8ea5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_c8863294.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_e735abdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_04997916.jpg","https://cdn.tourradar.com/s3/tour/1500x800/187100_d93c8e24.jpg"],"destinations":["Hanoi","Halong Bay","Mai Chau","Hoi An"],"timeline":[{"title":"Day 1: Hanoi Arrival","description":"Welcome to Hanoi, we will meet and take you to your hotel, check-in and today is free at your leisure to rest or explore, discovering your own first impressions of Vietnam. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 2: Hanoi City Tour full day (B, L)","description":"Depart at 8:00 am from your hotel by Mini Van. We will begin our day by visiting Uncle Ho Museum Complex, learning about his great life at the Ho Chi Minh Mausoleum, Presidential Palace, and his residential place. Next stop is the nearby Temple of Literature. The site of Vietnam´s first University, built in twelfth century, to teach Confucius’s theory to royals. Here we will also have a chance to see a traditional music performance. Lunch will be served at a local restaurant for a taste of authentic Hanoi Pho (noodle soup). In the afternoon, choose one from the numerous museums or temples around Hanoi (Museum of Ethnology, Women´s Museum, History Museum or Quan Thanh Temple). In the late afternoon walk around Hoan Kiem Lake and Hanoi´s fascinating Old Quarter for some great fun, shopping, and street side traditional food, may be to try one “Hanoi bia”. This is your chance to be part of typical Hanoian style and its traditional Vietnamese culture. We finish our relaxing but informative day by attending a Water Puppet Show, a favorite experience for all visitors to Vietnam. \nPomihoa Hotel Hanoi or similar"},{"title":"Day 3: Hanoi - Halong Bay with overnight on Cruise (B, L, D)","description":"At 8:00 am we will pick you up, by Shuttle mini-van/bus, at the hotel and begin our journey to Halong city. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the at port. Board your private boat, an authentic Chinese Junk, and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave”, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck.\nGarden Bay Cruise Halong Bay or similar"},{"title":"Day 4: Halong Bay - Hanoi (B, L)","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs, We stop to visit a floating fishing village and listen to some legendary stories of the fishermen’s daily life. Have lunch on boat while cruising back to the Halong city pier, return to Hanoi.\nArrive hotel in Hanoi around 4:00pm.\nCheck in hotel and overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Day 5: Hanoi - Mai Chau Valley - Ba Khan Village Resort (B, L, D)","description":"08h30. Depart from Hanoi. Enjoy a scenic drive along one of the most beautiful country road to the peaceful Bakhan Village via Hoa Binh City.\n10:30: Take a short break for tea/coffee in the middle way.\n12h00. Lunch at Bakhan Village Restaurant. Check-in room.\n15h00. Afternoon walk around the Muong Village of Khan Ha and village’s West hill for a breath taking view of the valley.\n19h00. Dinner time at Bakhan Restaurant.\n20h00 -21h00. Enjoy the unique traditional dance by Villagers\nOvernight at Bakhan Village Resort\nBakhan Village Resort Mai Chau"},{"title":"Day 6: Bakhan Village - Hanoi - Night Train to Danang (B, L)","description":"09h00. Take another great workout in nature with our East Mountain trek route. \n11h00. Back to the resort. Rest and relax \n12h00. Check out. Enjoy lunch at the resort\n13h30. Depart for Hanoi.\n17h00. Arrive Hanoi Old Quarter.\nTake a short rest and walk around the Old Quarter until transfer to Railway Station to catch the train to Da Nang City. Overnight on the Train (4 Berth Cabin sleeper)"},{"title":"Day 7: Arrive Danang - transfer to Hoi An","description":"Spend overnight with good sleep on the night train. Arrive Danang City (40km from Hoi An) around 10:30am! You`ll prepare the breakfast by your own because train doesn`t serve breakfast included in the ticket. Pick up at Railway Station upon arrival then transfer to hotel in Hoi An. Check in & have a rest or discover Hoi An Ancient Town by yourself. No sightseeing activity today!! Overnight in Hoi An..\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 8: Hoi An free for leisure (B)","description":"Today you are free to discover Hoi An Ancient Town by yourself. You can have a visiting around the Town and go shopping. Time belongs to you whole day!\nStay overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 9: Half day Tour to My Son Sanctuary (B)","description":"Leave hotel at 8:00am. Drive to My Son, a World Heritage, 50 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered to be in the same league as some of Southeast Asia's greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries. Return to Town around 1:00pm.\nIn afternoon, free go shopping in Hoi An Town. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 10: Hoi An full day Tour with river Cruise (B, L)","description":"Enjoy a full-day excursion to Hoi An, a major trading center, once known as \"Faifo\" to the earliest Western traders. It was also an important port for the Dutch, Portuguese, Italian, Chinese, Japanese and other merchant vessels from the Far East. Visit a temple with partially gilded statues in the center, a pagoda dedicated to sailors and fishermen and a chapel with origins in the 1700s that reflects the influences of Chinese and Japanese styles. Stop at the Sa Huynh Museum, located near the Japanese Covered Bridge, which contains exhibitions from the earliest period of Hoi An's history. Late this afternoon, take a boat trip on the Thu Bon River to Kim Bing Village on Cam Kim Island to see the wood workers and shipbuilding families.\n3:00pm: Return to your haven on world-famous \"Cua Dai Beach,\" with the evening at your leisure. Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 11: Cycling Tra Que Village - Cooking Class (B, L)","description":"8:00am: Have breakfast at hotel. Our guide welcomes you at hotel in Hoi An and ride bicycle to Tra Que Vegetable Village far from Hoi An Ancient Town 3km. You ride through peaceful villages and enjoy the beauty of countryside surrounding Hoi An. Arrive in Tra Que Vegetable Village; you can experience the living and working of local farmers at this organic vegetable and herb garden. Your learn how to prepare soil, grow vegetable, water to get fresh vegetables as you see at the garden from previous tourists. You have 15 minutes foot massaged by herb to fresh yourself. Here is the chance for you to join in cooking class with the family. Under the instruction how to prepare ingredients, you will cook Hoi An special foods like Tam Huu Spring Roll, BanhXeo pancake… Have lunch at the family. And then ride bicycle back Hoi An Town or hotel\n3:00pm: This afternoon you have more free time to experience around the town to get some souvenir gifts or spend your time at Cua Dai beach - 4km from the ancient town. Free to have your own dinner.  Overnight in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Day 12: Hoi An - Hanoi/Ho Chi Minh City (B)","description":"Today you are free in Hoi An until catch flight to Hanoi/Ho Chi Minh City. Picked up at airport upon arrival. Transfer to Hanoi for check in. Overnight in Hanoi/Ho Chi Minh City. The Trip ends. (Package scheduled the flight back to Hanoi). The trip ends at hotel in Hanoi/Ho Chi Minh City\nNote: We can arrange the flight ticket for you to come back to Hanoi or you can continue your trip to Ho Chi Minh City (Flight ticket and airport pickup included)"},{"title":"Day 13: Free for leisure (B)","description":"Today you are free for leisure. Time belongs to you. You will discover Hanoi/Ho Chi Minh City by your own or combine your other trips! Good bye and see you again in the next time!"}]},{"name":"Sapa 3 Days 2 Nights Trekking Tour From Hanoi (1 Night In Ta Van Village, 1 Night In Hotel)","duration":3,"travelStyle":["Hiking & Trekking","Local Living","Mountain Hikes","Group","Fully Guided","Holiday"],"oldPrice":182,"price":127,"summary":"This tour is designed for travelers who want to stay longer in Sapa and want to experience 1 night at basic homestay in hill tribe village and 1 night at hotel in Sapa, even save lots of money in comparison to going by night train. You will have free times between the lines to enjoy Sapa’ hidden charm, especially you can enjoy friendly services provide by Vietnam Travel Top The first night in bungalow can be changed to the second night. This depends on group size and bungalow availability. Our tour leader will informs you in the bus on the way to Sapa. Please note that this tour consists of a combination of day tours, so you may have different tour guides on different days and you will meet different people during the activities.","highlights":["Hike the lush green mountains of Sapa","Experience local life","Learn to make tasty traditional Vietnamese dishes","Explore the traditional cultures and local diversity of the Sa Pa valley"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147254_5df9f909ee66c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147254_5df9f909ee66c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_793e6219.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_ce732230.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_7f6d1b00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_b8a8af31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_73965415.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_341c7198.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_46ea8f23.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_e7ac0262.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_f32612dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_617ca340.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_9e2ce935.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147254_f42edd94.jpg"],"destinations":["Hanoi","Sapa"],"timeline":[{"title":"Day 1: Hanoi - Sapa by bus with a short trek Cat Cat Village (L, D)","description":"6.30 – 7.00: Pick up from your hotel/accommodation in Hanoi Old Quarter, transfer to big bus and depart for Sapa Town.\n9.30: Follow the highway to Lao Cai city with the first comfort break\n11.00: Second comfort break at Lao Cai city before approaching Sapa.\n13.00: Arrive Sapa Town with colorful traditional costumes of H’Mong, Dzao, Tay ethnic People. And Waiting about 30min at the bus station for the tour guide & driver pick up you to Hotel.\nWelcome drink and itinerary briefing, enjoy the lunch with local Vietnamese dishes\nTrekking distance is about 3,5 kms and it lasts for 2 hours\n14.30: A short drive to the gate of Cat Cat Village which is home of Black H’mong ethnic people and is located near the bottom of a deep valley at the foot of Fansipan Peak. Our local guide will show you the daily life activities of the locals, trek down to the valley bottom to the waterfall where the French built a Hydraulic Power Station, stop for photo with bridge and waterfall then you will walk uphill for bus to pick up to get back to Sapa in the afternoon.\n16.30: Come back to Sapa Town. Have dinner and overnight in hotel with night activities.\nMeals included:  Lunch, Dinner"},{"title":"Day 2: Long trek Sa Pa - Y Linh Ho - Lao Chai - Ta Van Village (B, L,D)","description":"8.30: Have breakfast at hotel in Sa Pa town, check out your hotel and start a new day with more interesting trek.\n\nTrekking distance is about 12 kms and it lasts for 4 hours\n\n10.30: A short drive to Y Linh Ho then trek through the rice terraces and along Muong Hoa Stream to the Black Hmong village of Lao Chai to see the spectacular landscape of Hoang Lien Son Mountain.\n\n12.00 – 13.30: Welcome drink at Bungalow, have lunch with delicious Vietnamese dishes made by family. You approach Ta Van Village where Dzay Ethnic People inhabits in late afternoon.\n\n14.30: Check in bungalow; get to know the family of Dzay People. Spend time to enjoy the mountain life on Sunset. You may attend cooking local dishes with the family and enjoy dinner in peace.\n\nIn the evening, you can join the local bar nearby with music and socialize with other tourists then overnight at Bungalow in Ta Van Village.\n\nMeals included: Breakfast, Lunch, Dinner"},{"title":"Day 3: Ta Van - Giang Ta Chai - Sapa - Ha Noi (B, L)","description":"8.00: Have breakfast prepared by the family and start a new day with more interesting trek.\n\n8.45: Keep walking to the rice paddies where you have a nice photo session of the amazing surrounding\n\nlandscapes; a trek through the bamboo forest; stop to have a panorama view of Giang Ta Chai village – home of red Dzao People.\n\nTrekking distance is about 3 kms and it lasts for 3.5 hours\n\n11.00: Trek through the Giang Ta Chai Bridge to main road, bus picks you up to come back Sapa Town.\n\n13.30 - 14.45: Relax and leisure on your own, have shower in the public bathroom in the hotel if you want.\n\n14.45 - 15.00: Meet all group members at hotel to get ready for Hanoi.\n\n15.30: Get on bus to go back to Hanoi with two comfort breaks.\n\n21.15- 21.30: Arrive Hanoi Old Quarter. Trip ends.\n\nMeals included: Breakfast, Lunch"}]},{"name":"Vietnam Romantic Honeymoon and Phu Quoc Island Extension - 14 Days Trip","duration":14,"travelStyle":["Discovery","Custom","Honeymoon","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1637,"summary":"Once the buildup, planning, and big day have come and gone, you’ll need someplace warm, beautiful, and romantic to undo all the stress that weddings ironically create. Whether you prefer quiet beach time or cultural adventure, you won’t be disappointed with our Vietnam.\nVietnam is a Southeast Asian country best known for its wonderful tranquil beaches, gushing rivers and bustling cities. As a honeymoon couple, you can really enjoy your best moments together here in Vietnam. This trip offers you a peaceful vacation with friendly local people and deep love with beauty of nature and fantastic local food.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/95441_b6a3a0cd.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/95441_b6a3a0cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_10ac297e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_969b28fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_00f7332c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_9413a536.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_e7092597.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_876121d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_597d5714.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_885b2c7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_91968d59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_4f7731b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a01fcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a0e141.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a1382a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a187bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a1d9c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a22ea7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e02fb5a280f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e03067084ba9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e0306708e60e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e03067093150.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e03067097f45.jpg","https://cdn.tourradar.com/s3/tour/1500x800/95441_5e0306709dee1.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Phu Quoc Island"],"timeline":[{"title":"Hanoi Arrival","description":"Land at Noi Bai international airport today, be warmly welcomed with our local guide and transferred to your chosen hotel. Next, transfer to Highland Coffee Shop nearby Opera House to enjoy Vietnam Trung Nguyen Coffee. Free for photos shooting in front of Opera House and street with full filled of almost motorbike.\nStay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi City Tour full day by walking (B, L)","description":"Breakfast in the hotel in Hanoi. Today you have great time to explore Hanoi - capital City of Vietnam!\nYou can choose One Of the Following Afternoon Activities:\n1-hour cyclo tour around Hanoi 36 old quarters.\n45-minute of Water puppet show in Hanoi Thang Long Theater.\nOptional highlight: You can enjoy the dinner by candlelight at one of the most charming restaurant in Hanoi – Home restaurant or follow our guide lead to the most exciting street Ta Hien, Dao Duy Tu, Ma May etc to enjoy Hanoi nightlife and local street food. You will not regret for this try.\nFree for going around Hanoi Old Quarter. Stay overnight in Hanoi.\nPomihoa Hotel Hanoi or similar"},{"title":"Hanoi - Halong Bay overnight on Cruise (B, L, D)","description":"You honeymoon vacation will be forever lasting memories with amazing trip to Halong Bay on overnight cruise's cabin with private balcony. Each vessel features a stylish restaurant and bar for an exclusive dining experience on the third deck. The top deck serves as a perfect place to enjoy lingering in the sunshine and discovering the splendid beauty of Halong bay - the most stunning bay in Vietnam with a 360 view, thus promising unforgettable and thoroughly relaxing moments during your Halong Bay Cruising Tours.\nOne of The highlight of the cruise trip is dinner. In an atmosphere of elegant luxury, you can enjoy sumptuous buffets and tasty menus served by a crew in traditional Vietnamese costumes - fine dining harmoniously combined with the aromas of the sea. A wide selection of the best vintages from around the world will complement fine fusion cuisine and creative Asian-inspired flavours. You seem to be the only one on cruise will have a romantic dinner by candlelight.\nGarden Bay Cruises or similar"},{"title":"Halong Bay - Hanoi - flight to Hue City (Breakfast)","description":"Continue to discover the bay & cave on our cruise while enjoying your buffet breakfast.\n10:30am: Disembark cruise and get on our car to take you back to Hanoi. There will be a rest stop on the way for your personal refresh or shopping some local handmade products as souvenir.\nAfter Bay trip, you will head to Noi Bai airport today afternoon for flight to Hue City.\nArrive in Hue, be greeted and welcomed to Hue - Imperial City! Stay\nCherish Hotel Hue or similar"},{"title":"Hue - Ancient Capital Discover (B, L)","description":"Hue is one of Asia’s most alluring honeymoon destinations. From exploration of evocative imperial monuments, to sampan cruises on the Perfume River to visit Thien Mu Pagoda and Minh Mang Tomb.\nAfter lunch, take a visit to Thai Hoa citadel .\nStay overnight in hotel in Hue.\nCherish Hotel Hue or similar"},{"title":"Hue - Hoi An ancient town (B)","description":"After breakfast, free at leisure at hotel till departure time to Hoi An ancient town. On the way, you could stop at Hai Van Pass for photos shooting, Cham museum, Mable Mountain.\nA special nice view room with roses, candles, chocolate and wine is ready for you to check in at your resort/hotel in Hoi An.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An ancient town (B)","description":"Today’s activities will offer all lovers the chance to visit the charming Hoi An ancient Town, discover the peaceful rural area by bike and stay at one of comfort resorts close to the beach. Your personal advisor will assure your dream vacation unforgettable and carefree:\nHand in hand discovering the peaceful and charming atmosphere of Hoi An ancient town and peaceful rural area of Hoi An on cyclo.\nEnjoy very romantic moment on the boat cruising along Thu Bon River and Sunset view.\nCooking Class at Local Vietnamese Tra Que Village to know how the local people cook the dishes as Spring roll, Banana flower salad, local “Xeo” pancake. Overnight in Hoi An Ancient Town.\nPhu Thinh Resort Hoi An or similar"},{"title":"Hoi An - Da Nang for flight to Ho Chi Minh City (B)","description":"After breakfast, free at leisure till transfer to Da Nang airport for flight to Ho Chi Minh City - an alluring city full of wide boulevards, elegant colonial architecture and bustling market.\nEnjoy a short city tour to visit Notre Dame Cathedral - a neo-Romanesque cathedral constructed between 1877 and 1883 using bricks from Marseilles and stained-glass windows from Chartres; Old Sai Gon Post Office; Cho lon - the Chinatown of the City and the Emperor Jade Pagoda (Phuoc Hai - one of the most interesting pagodas in Vietnam). These are the signature sites of Saigon that every Vietnam tour makes should not missed. Rest of the day is free at leisure. Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Saigon Vicinities Explore (B, L)","description":"Spend your day to discover Saigon vicinities with your lover. Here is our suggestion to choose:\nEnjoy a half day tour to visit the Cu Chi Tunnels in the morning. The Cu Chi tunnel was built during the war time by the Vietnamese for fighting with enemies, but nowadays it has become an interesting and fun place for tourists. You will have fun in discover the complicated tunnel system in the forest.\nOr Discover Mekong Delta. Enjoy a full day tour from Saigon to My Tho to discover the Mekong River Delta, which is famed as the ‘rice bowl’ of Vietnam. You will take a private boat tour through the water coconut forest to center of Mekong Delta, you will appeal to seeing the local life, and to see how local people make coconut candy. Then enjoy a biking tour (about 1 hour) to visit the villages on island and a sampan trip through the narrow canals, have fun!\nLunch will be arranged in local restaurant in the village with special deep fried Mekong Fish and other local tasty food.\nTransfer back to Ho Chi Minh City City for leisure and overnight.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Ho Chi Minh City free for leisure (B)","description":"Today you`ll be free for whole day for leisure at hotel or walking around Saigon City for shopping and sightseeings. Time belongs to you! Stay overnight in Ho Chi Minh City.\nLiberty Parkview Hotel Saigon or similar"},{"title":"Boarding to Phu Quoc Island","description":"Upon arrive in Phu Quoc Island, you will be welcomed by your local guide at the airport and then escorts you to choosen resort.\nRest of the day is at leisure, enjoy the beach and relax.\nSaigon Phu Quoc Resort or similar"},{"title":"Phu Quoc Island (B)","description":"You could choose the full day for leisure on sandy beach with your lover, or get a full-filled busy day with visiting the most interesting sightseeing of this pearl island as : Phu Quoc ridge back dogs, the sea eagles and the traditional Phu Quoc house found in early 20th century, Phu Quoc Pearl Farm (Find out procedures of pearl production. A wide collection of cultured pearls is also displayed for your contemplation and shopping), Sao beach where sea, sand & sun blended in a perfect harmony. You will be also captured by a lively and cheerfully atmosphere of the marketplace from vendors in conical palm hats sitting on the ground offering fresh sea food to sell to people at their well-stocked stands. The last stop at a traditional fish sauce factory for learning about the Phu Quoc fish sauce production and enjoy the unique aromatic flavor of Phu Quoc fish sauce. Finish tour at 13.00 PM. Rest of the day is free at leisure.\nSaigon Phu Quoc Resort or similar"},{"title":"Phu Quoc Island - Free at Leisure (B)","description":"Meals: Breakfast\nFree at leisure to enjoy the sunshine, beach and fun activities on the beach.\nMay we suggest an evening walk along beach to begin your love affair with Phu Quoc… Welcome to Paradise island on earth.\nSaigon Phu Quoc Resort or similar"},{"title":"Flight to Saigon & Connect to your homeward flight (B)","description":"Enjoy relaxing time in morning until pick up from hotel and transfer to airport for onward flight to Saigon. Upon arrive in Saigon, connect to your homeward flight to your sweet home or onward flight to your next destination of your Indochina tour."}]},{"name":"12 Days Ultimate Vietnam From Hanoi To Central and South","duration":12,"travelStyle":["Discovery","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":769,"summary":"How to describe enough beauty of Vietnam! If you want to see how lovely and interesting Vietnam is, please join with us. Experiencing the local daily in North, Central and South of Vietnam. Tasting several delicious local foods and drinks. Visiting and exploring the beauty of Hanoi, Hue, Hoi An and Ho Chi Minh city. Discovering the stunning view of Tam Coc by rowing boat. Sitting behind motorbike driver to rural local villages. Surprising in reathtaking landscape of Hai Van Pass. Lesurely time in ancient Hoi An town. Understanding more about local history in Cu Chi war tunnel…Let’s join with us to fall down your love in Vietnam.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/128797_f8742084.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/128797_f8742084.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_b2eedcfb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_1ff14d00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_c5a3b3cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_61ef4ecd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_c7ed62c9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_d2104024.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_daf5f0bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_91f3f060.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_ed37335a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_2058769c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_cc7e9f93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_3ed8e106.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_f51f3d77.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_59d30b5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_12a2dc2a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_cde80276.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_de980a5f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_840877c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_43d3c074.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_6b3353bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_380785ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_53ea8a68.jpg","https://cdn.tourradar.com/s3/tour/1500x800/128797_7f7c097d.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Welcome to Hanoi – Airport pick up – Hotel check in (Meal: No)","description":"Welcome to Hanoi city – catipal of Vietnam. Your driver will picks you up and transfer you to the hotel in Hanoi old quarter.\nHotel check in and your own time visiting and exploring the old quarter.\nHotel check-in time: 13:00\nOvernight at hotel in Hanoi\n"},{"title":"Day 2: Hanoi Street Food Walking Tour (Meal: B,D)","description":"6:00 - 6:15 pm: Your tour guide picks you up from hotel to our meeting point. Start the journey discovering the local foods in Hanoi like street Foodie. Walking through some old streets there, you will discover historical and culture tourist site, visit Heritage House to learn more about Traditional House of Ancient Hanoi. You have chance to enjoy “Bánh Cuốn” from famous local restaurant,  “Bánh Cuốn” (steamed rice rolls) which  is steamed and made from rice flour and filled with a savory ground pork and  ear mushroom mixture. Then stop off at traditional space to try “Che” (sweet gruel)- a very special and famous sweet soup Hanoi old quarter. Then, keep walking to enjoy a bowl of  Pho- taste of  heaven that you could not be anywhere better than Hanoi. Spring roll is very meaningful dish for tourist; many restaurant and company organize cooking class. You will visit Local market to see people show all products, it is really interesting to learn about lifestyle and culture of local people. You will enjoy Bun Cha (Vermicelli with grill pork), an absolute highlight of authentic local culinary you must try as anyone’s the first visit of Hanoi. Then you will savor the real taste of Hanoian at a small corner of Hanoi by drinking a cup of “Bia Hoi”(Fresh beer).  Finally, get the chance to enjoy a very special flavor of the Vietnamese-“Cafe Trung”( egg coffee).\n8:00 pm: Turn back to the hotel. \nOvernight at hotel in Hanoi."},{"title":"Day 3: Hanoi – Halong Bay - Overnight on cruise (Meal: B,L,D)","description":"8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on boaoard with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbthing on the sundeck, photo hunting while cruising among the hundred of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attand the Squid fishing game\nOvernight on board "},{"title":"Day 4: Halong Bay – Hanoi (Meal: B, L)","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi"},{"title":"Day 5: Hanoi Free & Easy – Overnight Train to Hue (Meal: B)","description":"Exploring Hanoi old quarter - the most intersting place for tourist. Walking in the old quarter to see Hanoian daily life. You also find out the norrow houses where there are some families sharing the same house. Small and narrow entrance on street what is the entrance of some houses inside. \nTasting several street food, viewing the old houses, and a lot of thing what will make you interesting.\nLate afternoon, driver will pick you up at your hotel and transfer you to Hanoi Trin station for Night train to Hue city.\nOvernight on the train."},{"title":"Day 6: Hue arrival – Train station pick up – Hotel check in (Meal: No)","description":"Upon arrival, driver picks you up at Hue train station and transfer you to the hotel in Hue.\nCheck in the hotel and get your own free time to visit Hue city.\nOvernight at hotel in Hue\n\n"},{"title":"Day 7: Hue city - Imperial Palace Day Tour (Meal: B,L)","description":"7:45 – 8:30: Our tour guide and driver will pick you up at your hotel and depart Hue city tour.\nTake a visit:\n-        Dragon boat trip to Thien Mu pagoda - The oldest pagoda in Hue city.\n-        Imperial Citadel by car – The home of Vietnam's last royal dynasty - the Nguyen Dynasty.\n-        Hue Royal Antiques Museum - A collection of ornaments from the Nguyen Dynasty.\n-        Dong Ba Market to see the daily life of local people.\n-        Taking the boat trip on Perfume River to see the local life along the river.\nEnjoy Lunch at local restaurant.\nAfter Lunch time, continue to visit:\n-        Khai Dinh King’s Tomb - a blend of Western and Eastern architecture.\n-        Minh Mang King’s Tomb, one is impressed by the majesty and symmetry of the architectural constructions.\n-        Conical hat making village, incense stick making village\n16:00 – 16:30:  Back to your hotel.\nOvernight at hotel in Hue.\n"},{"title":"Day 8: Hue – Hai Van giant Pass – Hoi An ( Meal: B )","description":"After breakfast, driver will pick you up at your hotel to visit the most breathtaking and giant Hai Van Pass. You do not only have the opportunity to see the nice sightseeing along the way to Hoi AN, but also you can see how panorama is this Pass. Stopping time on the Pass road to take photo of stunning and giant valley of Pass will be an increadible choice what everyone never wanna miss. You can see how small people are while standing in Mother huge nature.\nArrive the hotel in Hoi An. Check in the hotel and have free time to visit Hoi An ancient town with a lot of lanterns, Pagoda bridge, Old houses…\nOvernight at hotel in Hoi An\n"},{"title":"Day 9: Farming & Fishing Trip (Meal: B,L)","description":"09:00-09:30 AM: Tour guide meet you at your hotel, cycle to a local farming village travelling along picturesque country roads, you have a chance to capture some amazing pictures with the farmers on the field, fishpond and the buffalo, you can also try to riding the water buffalo if you love it.\nKeep riding to local home. Here, you will be welcome local water \"En water\". Then, the farmer will take you to the boat station, boarding across the coconut-palm flanked waterways far from the traffic the motor scooters, and the noises the city to learn and try how to use the local traditional fishing techniques using round and cast nets and paddle the Vietnamese bamboo basket boats. \nAfter that, you will be shared the daily work in the rural by local farmers, you will join in the activities of the farmers – collecting seaweed fertilizer, sowing, raking, watering and picking. \nLeaving the garden, you will back to the farmer's home and enjoy foot massage with the local herbal treatment.\nAfter lunch, take a cycling back to you hotel.\n13:30-14:00: Arrive your hotel. You get the free time to walk around exploring the beauty of Hoi An old town.\nOvernight at hotel in Hoi An."},{"title":"Day 10: Hoi An – Flight to Ho Chi Minh city (Meal: B)","description":"A peaceful atmosphere will appear while walking on the small and old street in Hoi An old town. The ancient Japanese, Chinese and Vietnamese architecture impressive you. Loca and simple people, daily life will offer you an unforgettable memory.\nUntil the transferred time, driver will pick you up at the hotel and transfer you to Da Nang airport for flight to HCM city.\nReaching Tan Son Nhat airport in HCM city, meeting driver at the airport and going to the hotel in HCM city.\nOvernight at hotel in HCM city.\n"},{"title":"Day 11: Cu Chi war tunnel trip (Meal: B,L)","description":"Cu Chi tunnel system was built by the Communist guerrilla troop knows as Viet Cong during the Vietnam War to combat the American colonial and South Vietnamese force. The system is of over 220 km of tunnels became a legendary and special architecture lying deeply underground. The tunnels were a function, including a lot of trap doors, storage facilities, specially constructed living areas, hospitals, command centers & kitchens. Nowadays, Cu Chi tunnel became very popular for both of Vietnamese and foreign travellers.\n08:00 - 08:30: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. The system is of over 220 km of tunnels became a legendary and special architecture lying deeply underground. The tunnels were a function, including a lot of trap doors, storage facilities, specially constructed living areas, hospitals, command centers & kitchens. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\nOn here you can try to Crawl through tunnels (do not apply for very fat people and very old people)\n12:00 Have lunch in a local restaurant\n13:00 Back to Ho Chi Minh City\n14:00 Arrive in your hotel in Ho Chi Minh City.\nOvernight at hotel in HCM city.\n"},{"title":"Day 12: Ho Chi Minh Departure (Meal: B)","description":"Today you are free to visit Ho Chi Minh City and shopping for souvenirs until transfer to Tan Son Nhat airport for your flight back home. Trip ends. \nHotel check-out time: 12:00\nWho should participate? - This tour is suited for all, including children as well.  \nPrice structure: - Price quoted is based on per person\nIf you are Solo traveller, you will stay at the Share Dorm Room at the hostel during your vacation.\nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! \nIf you want to travel from Ho Chi Minh city in South up to North, please advise!\n"}]}]