[{"name":"14 Days In-depth Vietnam Tour with 4-star Well Selected Hotels","duration":14,"travelStyle":["In-depth Cultural","Group","Partially Guided"],"oldPrice":0,"price":2529,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nThis wonderful trip will start from the northern city of Vietnam, Hanoi. You will visit Ho Chi Minh's Former Residence to learn more about the life story of this great Vietnamese leader, hike two famous villages Cat Cat and Sin Chai to appreciate the picturesque terraced rice fields and board the cruise in Halong Bay and relax yourself in the beautiful natural scenery. Then, in the central Vietnam, you will wander through the old city of Hue and travel back to ancient Vietnam. We will also leave one day for you to explore My Son Valley, where lies the famous religious temple complex. Afterwards, we will continue our journey southward to Ho Chi Minh City and Mekong Delta to experience the local floating market. After this 14-day in-depth Vietnam tour, you will surely be impressed by this Southeast Asian country.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/177023_a5d92c60.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/177023_a5d92c60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_c0445ce6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_4b92479b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_da57786a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_f46d0af4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_c13b09bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_12447d65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_b1ac5953.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_567a49c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/177023_22994631.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Ben Tre","Can Tho"],"timeline":[{"title":"Day 01: Arrival in Hanoi","description":"Upon arriving at the airport in Hanoi, your personal guide will meet you and take you to your hotel. In the afternoon, there is an initial walking tour to the main sites of Hanoi: the Opera House, the Old Quarter, Hoan Kiem Lake and the Ngoc Son Temple. In the evening, a welcome dinner of authentic Vietnamese food will be arranged at a good local restaurant.\nMeal: Dinner\nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 02: Hanoi City Tour - Night train to Laocai","description":"This morning, you will visit the Ba Dinh Square, the Mausoleum of Ho Chi Minh and its stilt house, One Pillar Pagoda and the Presidential Palace. After that you will have a relaxing time at the beautiful West Lake with a short visit to the Quan Thanh Temple and the Tran Quoc Pagoda. In the afternoon, we visit the Temple of Literature and the Ethnology Museum. In the evening, you will enjoy a traditional Water Puppet Performance before taking an overnight soft sleeper train to Laocai.\n\nMeals: Breakfast, Lunch\nAccommodation: overnight soft sleeper train"},{"title":"Day 03: Laocai - Sapa","description":"You will arrive at Laocai in the early morning. You will be picked up at the train station and then transferred to the hotel in Sapa. After breakfast at the hotel, you will have some time to rest. Later, you will have a two hour's trekking trip through the terraced rice fields to visit the villages Cat Cat and Sin Chai. The rest ofthe day is free for you to explore the town on your own.\nMeal: Breakfast\nAccommodation: Pistachio Hotel Sapa (4 stars) or similar"},{"title":"Day 04: Sapa - Lao Cai - Night Train to Hanoi","description":"Today you will have a longer trek to explore the Sapa town further and discover the local minority people's life in depth. Depending upon your physical ability, you may choose to have an easy trek which of about 3km, a medium trek of 6km or a long trek of 12km. The hill tribe villages you will pass through are the homes of the H'mong, Dzao and Dzay people. Lunch is arranged at a hill tribe village today. And after the excursion, you are driven back to Laocai and take an overnight soft sleeper trainback to Hanoi.\nMeal: Breakfast, Lunch\nAccommodation: overnight soft sleeper train "},{"title":"Day 05: Hanoi - Halong Bay - Overnight on cruise","description":"The train arrives in Hanoi in the early morning. You will take way to hotel nearby the railway station. After having breakfast and a short break, you will be transferred to enjoy another highlight in the Hanoi holiday package: the Halong Bay. The transfer to Halong Bay takes 3 to 3.5 hours. After having lunch onboard, enjoy the scenery as we sail out into the bay. The islands we will cruise around in the afternoon through many islets. And you will also visit one of the main caves, and have a relaxing time on a sheltered white-sand beach if weather permits. Tonight, you will stay aboard your cruise.\n\nMeals: Breakfast, Lunch & Dinner\nAccommodation: Signature Cruise (4 stars) or similar "},{"title":"Day 06: Halong Bay - Hanoi - Fly to Hue","description":"Join in Tai Chi class on the top deck in the morning. Later after you enjoy a morning cup of coffee or tea, you will set out to explore some nearby islands by an interesting rowboat. Return to the junk and take your time on the sundeck to enjoy the majestic view of Bai Tu Long Bay. Brunch is served on board during your return trip to Halong City. You will be picked up at the pier and transferred to Noi Bai Airport for your flight to Hue, a former ancient capital of Vietnam. Upon arrival, your guide and driver in Hue will meet you at the airport warmly and take you to check in at the hotel for a good rest.\nMeal: Brunch\nAccommodation: Moonlight Hotel (4 stars) or similar"},{"title":"Day 07: Hue","description":"Today, you start Hue city tour with the Imperial City (The Citadel), which is the imperial palace of Nguyen dynasty. The places you will visit in the afternoon include Hue Royal Palace, Tomb of Tu Duc and the vibrant Dong Ba riverside market.\nMeals: Breakfast, Lunch\nAccommodation: Moonlight Hotel (4 stars) or similar"},{"title":"Day 08: Hue - Danang - Hoian","description":"In the morning, you will take a private boat cruising down the river to visit the Lady Pagoda, also named Thien Mu Pagoda and then visit the ornate Minh Mang's tomb. After having lunch at a riverside restaurant, we drive to Hoian passing over the 500m-high Hai Van pass. You will also stop en route in Danang to visit the Cham Museum and handicraft villages at the foot of Marble Mountain. Arrive in Hoian in the late afternoon and you will be free for the rest of the day to explore the town on your own.\nMeals: Breakfast, Lunch\nAccommodation: The Beach – Little Boutique Hoian (4 stars) or similar"},{"title":"Day 09: Hoian - My Son","description":"This morning you will be escorted by your guide to visit My Son Valley for its exquisite ruins. Then we will return to Hoian and the remaining time is free for you to explore the town or do some shopping.\nMeal: Breakfast\nAccommodation: The Beach – Little Boutique Hoian (4 stars) or similar"},{"title":"Day 10: Hoian - Danang - Fly to Ho Chi Minh City","description":"Drive to Danang and take a flight to Ho Chi Minh City. Your guide will pick you up at the airport for your check in at the hotel. In the afternoon, you have a city tour to the key sites of Ho Chi Minh City: the Reunification Palace, the War Remnants Museum, the solemn and majestic Notre Dame Cathedral and the nearby City Post Office.\nMeal: Breakfast\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 11: Ho Chi Minh City","description":"Today, you will first visit the Cu Chi Tunnels, which are underground passageways used during the war as protection from the enemies. Then you will visit the beautiful Cao Dai Temple in Tay Ninh. You will be transferred back to Ho Chi Minh City in the late afternoon.\nMeal: Breakfast\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 12: Ho Chi Minh City - Ben Tre - Can Tho","description":"Today you will spend a day away from the busy city of Ho Chi Minh and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong river. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where we will head to Can Tho city - the heart of Mekong Delta.\nMeals: Breakfast, Lunch\nAccommodation: Victoria Can Tho Resort (4 stars) or similar"},{"title":"Day 13: Can Tho - Ho Chi Minh City","description":"In the morning, we make the boat cruise to see the Cai Rang floating market (the nicest one with heaps of rowing boats), truly highlights where you will enjoy the beautiful scenery and see the daily activities of the locals who live along the Mekong canals. Later, you will roam through the village to visit a rice husking mill, rice noodles making shop which are nice chances to discover the daily life of Vietnamese people in Mekong Delta. Around noon, we will transfer back to Ho Chi Minh City and you will have the rest of the time at leisure.\nMeal: Breakfast\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 14: Ho Chi Minh City Departure","description":"After breakfast, you will have some free time prior to your departure to the airport. Your memorable Vietnam tour ends here as we see you off on your homeward flight.\n\nMeal: Breakfast"}]},{"name":"Tour 6 days – Hue – Bach Ma National Park – Hoi An","duration":6,"travelStyle":["Eco","Group","Partially Guided","Holiday"],"oldPrice":0,"price":755,"summary":"This interesting 6 days tour brings you unforgetable memory, interesting experence and a chance to discover the amazing view from culture to nature with three World Heritage Site recognized by UNESCO including Hue, Hoi An Ancient town and My Son Hollyland and explore Bach Ma national Park is about 40km to the south of Hue city. With the beauty of semi- tropical rain forest and cool climate.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96754ac6e6b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96754ac6e6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96754ac6e62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96754ac6e67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96754ac6e69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198049_5e96756910083.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"Da Nang Airport – Hue City (No meal)","description":"Welcome to Vietnam! Our tour guide will come to pick you up and transfer to Da Nang Railway station to catch the train to Hue (4-bed compartment with soft beds). Your 3-hour long trip will be full of great views The beautiful Hai Van Pass lies in the middle between Da Nang and Hue, showing off stunning views of the mountains and the jungle on one side, and amazing tropical beaches and the sea on the other side.\nCheck in and relax in Hue."},{"title":"Hue City Tour (B,L)","description":"In the morning: Car and guide will pick you up at your hotel and drive to visit the Imperial Citadel from where the Nguyen Dynasty ruled between 1802 and 1945, Hue museum of Royal Fine Arts and Thien Mu pagoda. Have lunch at local restaurant.\n\nIn the afternoon: Drive to visit royal tomb of Emperor Minh Mang, Emperor Khai Dinh Mauseleum and Dong Ba market. Overnight in Hue"},{"title":"Hue – Bach Ma National Park: Ecological Tour (B,L)","description":"In the morning: After breakfast you are picked up form hotel and depart to Bach Ma National Park. Stop at the Visitor Centre, our guide will give an introduction about the park. Driver to the summit of Bach Ma and from Hai Vong Dai (Sea-view tower) you can see the wonderful panorama of mountains, lagoons and East Sea. After a trek to the Five Lakes, swim in the cool and clear streams of water and take a rest at the huge rocks. Lunch will be served.\n\nIn the afternoon: Visit the Rhododendron Fall (the beautiful and huge fall with the height of 300m) and Rhododendron flower forest with numerous legends about it. After that, come back and overnight in Hue"},{"title":"Hue – Hoian town – Hoi an walking tour (B,L)","description":"Breakfast at the hotel. Pick up at hotel then transfer to Hoi An town by private car\nVisit Hoi An Market and explore tiny alleys. Taste some delicious street food. Overnight in Hoi An"},{"title":"Boat trip to visit Thanh Ha Village – Kim Bong Carpenter Village – My Son Holly Land (B,L)","description":"In the morning: Our local guide will meet you, walk through the old streets and then embark on a boat from the bank of the Thu Bon River. Enjoy the beauty of ancient Hoi An from the river. Visiting: Thanh Ha pottery village; you will opportunity discover the daily life of the villagers. View the various stages of producing the many kinds of pottery products like: jar, vase, pot, earthen pot, decorative lamps and so on.\nContinue to visit Kim Bong carpenters’ village, listen to the village’s history and visit the shipbuilding yards, and see the handicrafts and sculptures.\n\nIn the afternoon: Drive to My Son, a World Culture Heritage, 40 km southwest of Hoi An. Located in a lush valley, My Son was a capital and religious center of Cham people, now remaining with red brick towers and sanctuaries. My Son, considered tobe in the same league as some of Southeast Asia’s greatest archaeological sites, including Angkor in Cambodia, Bagan in Myanmar, Ayutthaya in Thailand and Borobudur in Indonesia. These towers and sanctuaries was built from the 7 to 13 centuries.\nAfter that, come back and overnight in Hội An"},{"title":"Hoi An – Da Nang Airport – depart (B)","description":"Breakfast at the hotel. Pick up and transfer to the Da Nang airport for flight"}]},{"name":"Spirit of Vietnam - 2020","duration":12,"travelStyle":["Discovery","Adventure","Group","Fully Guided","Holiday"],"oldPrice":4489,"price":4040,"summary":"Delve into the fascinating culture and history of Vietnam, as you travel from iconic cities to island-dotted bays in perfect luxury. Participate in Vietnamese cooking classes, learn about local hidden gems from passionate experts and marvel at dazzling landscapes along the way.","highlights":["Experience the vibrancy of Ho Chi Minh City","Join a veteran and visit the underground Củ Chi tunnels","Explore Hoi An and see the Japanese covered bridge","Ride a traditional bamboo basket boat to Thanh Dong","Ride an electric cart and see the main sights of Hanoi","Board your deluxe junk boat for an overnight cruise"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/112385_c1d08cb8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/112385_c1d08cb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_6dfe4cd4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_1df879e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_bd8641e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_33d9d6fd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_8ec85be5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_89f60680.jpg","https://cdn.tourradar.com/s3/tour/1500x800/112385_265a48f1.jpg"],"destinations":["Ho Chi Minh City","Hue","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Dynamic Ho Chi Minh City.","description":"On arrival at the Tan Son Nhat International Airport, you will be greeted and escorted to your hotel. At 19:00, join your Travelling Concierge for a night to remember at the Art Salon Saigon, where you will enjoy a Welcome Dinner set in a sophisticated atmosphere and accompanied by live music.(Dinner with Wine)"},{"title":"Day 2: Marvels of Saigon.","description":"See the best of Saigon as you travel from the city’s glittering skyscrapers to the green paddy ﬁelds scattered along the Saigon River. Your destination is the Cu Chi tunnels, which were dug in 1948 for guerrillas to hide from combatant forces during the Vietnam War. These extraordinary tunnels form part of a network of tunnels that cover most of the country. During your visit to these underground villages, meet a Viet Cong veteran who used to live here and find out how challenging the living conditions really were. Back in the city, embark on a leisurely walking exploration that reveals highlights including Notre Dame Cathedral and Gustave Eiffel's Central Post Ofﬁce. Over a cup of Vietnamese coffee, gain an appreciation for local street-side cafe culture.(Breakfast / Lunch)"},{"title":"Day 3: Cruise the Mekong Delta.","description":"Travel to the Mekong Delta and board a private charter. At your first stop see coconut production and processing, then enjoy a taste of the freshest juice possible. Further along, stop to see where locals still use centuries-old methods to make bricks at a small brick kiln. Next you'll enjoy a ride on a tri-motorcycle along narrow village roads, arriving at a rice noodle factory to see the most popular breakfast in the region being produced. Continue your cruise to Mango Home for a tasty lunch of Mekong Delta specialties. Then walk along the shady village roads to the home of Mr. Sau Tuong, a former soldier who fought the deadly Khmer Rouge, known for orchestrating the Cambodian genocide. Learn how life in Vietnam has evolved for him and his wife since the 1960s and how they earn a living from making rice paper.(Breakfast / Lunch)"},{"title":"Day 4: Royal Refinement in Hue.","description":"Marvel at vistas of lush countryside, as you fly to Hue for the next chapter of your journey. Enjoy a cyclo ride through rice ﬁelds to Thanh Toan village and visit the Vietnamese Agriculture Museum for an insight into rice production. Then you will stroll along the canals, visit the vibrant local market and admire the ancient, arched, tile-roofed Thanh Toan Bridge, which was built in the 17th century. This evening, you will savour a delicious meal at a local restaurant.(Breakfast / Dinner)"},{"title":"Day 5: Highlights of Hue.","description":"Rise early for a private, VIP visit to the UNESCO World Heritage Site of the Imperial Citadel, before it opens to the public. Enjoy an escorted journey on a state-of-the-art electric cart, as a renowned local historian guides you through the towering main gates and shows you the majestic architecture and splendid gardens of the former royal court. Return to your hotel for breakfast, then visit the royal tomb of Minh Mang, the second Emperor of the Nguyen Dynasty. Your exploration continues to the 18th Century Dong Thuyen Pagoda, where you can relax in the peaceful precinct and enjoy a delightful vegetarian lunch specially prepared by the Buddhist nuns. You'll have the opportunity to speak with the nuns and gain a better understanding of their beliefs and food philosophies. After lunch you will meet the headmaster of the Vietnamese Royal Martial Arts Academy at an ancient temple. Learn about the intricate training activities of the practitioners and attend a performance showcasing the different martial arts techniques. The evening is at your leisure, perhaps ask your Travelling Concierge to make restaurant reservations for you.(Breakfast / Lunch)"},{"title":"Day 6: Romantic Hoi An.","description":"Enjoy a scenic drive over the spectacular Hai Van Mountain pass to reach Hoi An, a UNESCO World Heritage Site. During your walking exploration of this ancient town, see the old merchant's houses, the 400-year-old Japanese Covered Bridge, Assembly Hall and the market where stalls are brimming with local specialities, including silk. Enjoy time at leisure to explore as you wish or ask your Travelling Concierge for local recommendations. Perhaps admire the spectacular sunset on a kayak trip along the poetic Thu Bon River, or board a local river boat to the Cua Dai Sea if you prefer a gentler pace? For a Your Choice Evening, take your pick of one of three hand-selected, local restaurants, each specialising in different cuisine from traditional to modern Vietnamese, or an east-meets-west fusion.(Breakfast / Dinner)"},{"title":"Day 7: The locals in Hoi An.","description":"Visit the beautiful Cam Thanh Village with its dense coconut jungles that were once a shelter for local people and soldiers during the Vietnam War. Today the village is an important supplier of seafood, vegetables and rice to the region. Step into a traditional bamboo-basket boat and glide across the water to the Thanh Dong village where you'll learn from the villagers how they cultivate and harvest vegetables according to local customs. Continue your voyage through a peaceful water coconut forest to a riverside restaurant overlooking the rice fields. Enjoy traditional Vietnamese folk games and participate in a hands-on cooking class alongside a local chef. Savour your creations for your Highlight Lunch.(Breakfast / Lunch)"},{"title":"Day 8: Hanoi street-food tasting tour.","description":"Board a morning ﬂight to Hanoi, Vietnam’s glistening capital city known for colonial-style architecture, ancient temples and vibrant culture. Enjoy a ride aboard an electric cart to see the historic Opera House, avenues lined with French mansions, Sword Lake and the 18th century Jade Mountain Temple. Join a local foodie in the Old Quarter for an exploration of Hanoi’s robust street-food culture, that will delight all the senses. Learn what locals love to eat and taste the city’s very best dishes, including rice paper rolls, crab spring rolls, beef noodle soup, com cake and other delights. The rest of the day is at your leisure to relax at your five-star hotel or ask your Travelling Concierge to recommend city-centre attractions nearby.(Breakfast / Dinner)"},{"title":"Day 9: Cruise along Ha Long Bay.","description":"Travel to Ha Long Bay, known as the bay with a thousand islands and glistening emerald water. Step aboard a deluxe junk for a memorable overnight cruise. Visit the mysterious Tien Ong Cave, where human bones dating back to 10,000 B.C. were discovered by archaeologists, and explore the Cua Van area. In the evening you'll have the choice to participate in a hands-on cooking class with the on-board chef, or simply relax on the top deck as the sun gently dips beyond the horizon, before sitting down to dinner.(Breakfast / Lunch / Dinner)"},{"title":"Day 10: Ha Long to Hanoi.","description":"Start the day with a session of Tai Chi on the upper deck, or enjoy an early morning swim, or perhaps venture to a white sandy beach and climb the hilltop for views over Halong Bay? Return to the boat for breakfast as you cruise to Ha Long City to disembark. Journey back to Hanoi where the evening is at leisure.(Breakfast)"},{"title":"Day 11: The Temple of Literature.","description":"Visit the Temple of Literature, built in 1076 as the ﬁrst university for the sons of mandarins. Meet a scholar who will share their insights into this famous institution. Learn about Hanoian culture and Vietnamese architecture before exploring the temple grounds. In the evening, join your travel companions and toast to your travels during your Celebration Dinner.(Breakfast / Dinner with Wine)"},{"title":"Day 12: Farewell Vietnam.","description":"Your journey comes to an end after breakfast with a transfer to the airport for your onward flight.(Breakfast)"}]},{"name":"8 days explore the Northern Part of Vietnam – Ha Noi – Pu Luong – Ha Long","duration":8,"travelStyle":["Eco","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1020,"summary":"This tour allows you to discover the northern part of Vietnam with magnificent landscapes. You will have opportunity explore the Pu Luong Nature Reserve, a mountain range with dense forest, beautiful rice terraces and breathtaking scenery. In additon, you will undoubtedly be on an unforgettable cruise in Halong Bay, a World Heritage Site with spectacular seascapes of limestone pillars emerging from emerald waters.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f6a.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f71.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f73.jpg","https://cdn.tourradar.com/s3/tour/1500x800/198192_5e9921d969f74.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Ha Noi arrive (no meal)","description":"Welcome to Vietnam! Warmly welcome by our driver and transfer privately to the hotel in Ha Noi.\nCheck in hotel and relax in Ha Noi city."},{"title":"Ha Noi – Bicycle Tours to Hanoi Countryside (B,L)","description":"After a truly scrumptious breakfast, join a bicycle day tour to the countryside of the city. This tour includes cycling 45 km on flat roads.\n\nAround 8:00 am in the morning, you are picked up to our bicycle store to choose your suitable bikewhich makes you feel comfortable. You have a safety instruction here.Your exploration for the day:\nBack to your hotel for a rest after the full day. Overnight in Ha Noi."},{"title":"Hanoi – PuLuong Reserve (B,L,D)","description":"In the Morning: After breakfast you are picked up form hotel and depart to PuLuong. This 4-hour drive will take you to Pu Luong. On the way, you will have one stop on the haft way for a short break.\nAround 12.30: You will enter Pu Luong Nature Reserve by road via a breath-taking mountain pass giving you a panoramic view of the whole valley. Check in and have a delicious lunch.\nAround 14.30: You will be transferred to a suspension bridge over the Cham River, where you begin your walk passing the rice field to stunning water wheels area. Get up close to each wheel and discover how water is moved from river to handmade bamboo aqueducts via simple constructions of all sizes. Arriving at a Local Fisherman’s House, you have a short rest to gear up for the rafting adventure. Float along the calm river and enjoy the views, in between learning how to paddle and steer your handcrafted bamboo rafts. Arriving at scenic Tan Lap Bridge, you disembark to be transferred back to Homestay or Retreat for dinner."},{"title":"Enthralling trekking routes (B,L,D)","description":"In the morning: Having breakfast and then start early to descend into the beautiful where you walk around tumbling rice terraces. Trek through small paths shrouded in vegetation to slowly reveal a picturesque village sitting at the base of a towering mountain.\nContinuing to the base of the valley, you weave between roads and farm land, villages and wild fields, ponds and rivers, mountains and open land. Savour the ever-changing scenery as you trek to a beautiful spot to enjoy a simple picnic lunch. After enjoying delicious food, you have free time to explore the refreshing water to the nearby river.\nAround 15.30: Moving to pick up point to be transferred back to the Homestay or Retreat."},{"title":"PuLuong – Visiting Local village short trek – Hanoi (B,L)","description":"In the morning: Having your breakfast and start early to descend into the beautiful where you walk around tumbling rice terraces. Trek through small paths shrouded in vegetation to slowly reveal a picturesque village sitting at the base of a towering mountain.\nContinuing to the base of the valley, you weave between roads and farmland, villages and wild fields, ponds and rivers, mountains and open land. Savour the ever-changing scenery as you trek to a beautiful spot.\nThen you will be transferred back to Homestay or Retreat for lunch and return to Ha Noi\nAround 17.00: Arrive your hotel in Hanoi City."},{"title":"Ha Noi – Ha Long Bay (B,L,D)","description":"Join group tour for 2 days and 1 night to visit Ha Long by cruise.\nOur shuttle bus picks up you at the hotel in Ha Noi old quarter then depart to Halong. This 4-hour drive will take you to Halong Bay, a World Heritage Site recognised by UNESCOin 1994. Located in the Gulf of Tonkin, Halong Bay includes some 1,600 islands and islets, forming a spectacular seascape of limestone pillars. Because of their precipitous nature, most of the islands are uninhabited and unaffected by a human presence. The site’s outstanding scenic beauty is complemented by its great biological interest.\nUpon arrival in Halong bay, you board our Junk for an overnight boat trip. After lunch you begin our fantastic cruise in Halong Bay. The scenery is truly breathtaking and is continuously changing. This includes a visit to Sung Sot Cave, round over Tuan Chau Island, Dinh Huong Island, Ga Choi Island, Dog Island, Sail Island and a swim at Titov beach. Enjoy dinner on board while watching the sunset.\nOvernight on Cruise."},{"title":"Ha Long Bay – Ha Noi (B, L)","description":"After an early breakfast you continue the cruise to visit Man‘s Head island, Tortoise Island, Bai Tu Long Bay, Toad Island and Bai Tho Mountain.\nAt noon,  return to the shore and disembark from the cruise as our crew say farewell.\nGet on bus to get back to Hanoi.\nOvernight in Ha Noi."},{"title":"Ha Noi – depart (B)","description":"Have breakfast. Free relax in Ha Noi.\nThen Transfer to the airport for your return flight home"}]},{"name":"Vietnam Explorer 2022/2023","duration":12,"travelStyle":["In-depth Cultural","Group","Fully Guided","Easy","Historical","Holiday"],"oldPrice":0,"price":5900,"summary":"The true spirit of Vietnam\n\nFocusing on the must see highlights of Vietnam, this tour explores all three major regions in one compact journey.\n\nIn the north, vertiginous limestone islets and karsts provide an incomparable backdrop to Halong Bay. Spend two unforgettable nights exploring the subtleties and sensations of this incredible place. To truly appreciate the over 1000 year old city of Hanoi, you need three nights and time, all whilst staying in indulgent accommodation. In the cities of Hoi An and Hue, located in the center of Vietnam, discover the many World Heritage listed sites over four easy paced nights. Lastly, in the south discover over two nights Vietnam’s most vibrant and lively city of Ho Chi Minh, commonly referred to as Saigon.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/203075_5105be0f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/203075_5105be0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/203075_5f45a4cf1d5b1.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Hue","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to vibrant Vietnam. Enjoy the day at leisure and settle into a two night Special Stay in Hanoi."},{"title":"Day 2: Hanoi","description":"Freechoice: Visit the History Museum and Hoa Lo Prison, or join an authentic cooking class. Alternatively, visit Ho Chi Minh Quarter and Mausoleum, including a visit to the Temple of Literature.EnrichAfter attending a customary performance of Hanoi’s famous Water Puppets, learn the secrets behind this illusionary show thanks to your special backstage pass."},{"title":"Day 3: Hanoi > Halong Bay Cruise","description":"Journey to Halong Bay and board the elegant Au Co for an awe-inspiring two night Special Stay cruise through the picturesque waters of this spectacular World Heritage-listed icon."},{"title":"Day 4: Halong Bay Cruise","description":"Begin the day with a Tai Chi lesson. Cruise deeper into the National Park and try some kayaking, explore a cave and discover Cat Ba Island.SundownersExclusive to Scenic guests on board, enjoy a wine tasting against the backdrop of the karst islands at sunset."},{"title":"Day 5: Halong Bay Cruise > Hanoi","description":"Relax during your morning cruising before returning to Hanoi for another Special Stay and undertake a historical bunker tour at the hotel.Freechoice Dining: Tonight enjoy a Vespa foodie tour of Hanoi’s Old Quarter, or dine at the La Terrace at Sofitel. Alternatively, dine in a classic French villa at Home Moc restaurant."},{"title":"Day 6: Hanoi > Hoi An","description":"Fly to Danang and continue to the ancient town of Hoi An where you will enjoy a three night stay, which includes a daily spa journey as part of your stay.Freechoice Dining: Dine at the Morning Glory Restaurant. Alternatively, visit Brother’s Café or Hoi An Café, both located along the river front. "},{"title":"Day 7: Hoi An","description":"Step back in time as you take a walking tour of Hoi An’s World Heritage-listed Old Quarter including the Japanese Bridge and central market before stopping at the home of a former merchant to learn all about what life is like in Hoi An.SundownersThis evening relax at a reception in the Blue Bar with included beer and wine."},{"title":"Day 8: Hoi An","description":"Freechoice: Visit the ancient temple ruins of My Son. Alternatively, enjoy an interactive cooking class at Red Bridge Restaurant or cycle to a farming village through the rice fields outside Hoi An. "},{"title":"Day 9: Hoi An > Hue","description":"Travel via the breath taking Hai Van Pass to Hue, the former imperial capital. Wander through the grandeur of Hue’s Imperial Citadel before checking into your hotel for the night.EnrichThis evening’s Royal Dinner is held in a traditional private garden house accompanied by Hue Royal Court music."},{"title":"Day 10: Hue > Ho Chi Minh City","description":"Visit the Mausoleum of Emperor Tu Duc before flying to Ho Chi Minh City. After arriving at your hotel for the next two nights, take a leisurely guided orientation walk of the nearby sites."},{"title":"Day 11: Ho Chi Minh City","description":"Travel to the Cu Chi Tunnels and learn about the underground labyrinth of war-time passageways.Freechoice Dining: Enjoy a Vespa foodie tour of Saigon by night, enjoy a meal in an old French colonial house or a restaurant specialising in Saigon street food. Alternatively, try Italian at Basilico or international fare at Nineteen Restaurant."},{"title":"Day 12: Ho Chi Minh City","description":"After checking out from your hotel, learn all about Vietnam’s modern history during a visit to the Reunification Palace and War Museum. Following lunch, the remainder of the day is yours until your transfer to the airport for your flight home.This itinerary is a guide only and may be amended for operational reasons such as high and low water. As such, the cruise may operate altered from that stated above."}]},{"name":"Feel Free Vietnam - 10 Days","duration":10,"travelStyle":["Adventure","Beach","Group","Partially Guided","Discovery"],"oldPrice":0,"price":909,"summary":"Trip Highlights","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204418.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204418.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c3720441d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204420.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c3720441e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204425.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204421.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204422.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193633_5e50c37204424.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An"],"timeline":[{"title":"Day 1 - ARRIVE & LET THE ADVENTURE BEGIN!","description":"Today is the beginning of your big adventure in Vietnam. We will pick you up from the airport, get you checked in, then introduce you to anyone else who has already arrived. You may want to take a nap before we head out for dinner and drinks in the evening."},{"title":"Day 2 - EXPLORE THE CRAZY CAPITAL","description":"There is no better way to start your adventure here in Hanoi than by wandering the narrow streets. We stop to try some local flavours before jumping in our 3 wheeled rickshaw to explore the rest. Vietnamese people really khow how to throw a party… let’s grab a stool on ‘Beer Street’ and see where this crazy city takes us!"},{"title":"Day 3 - OVERNIGHT BOAT IN HA LONG BAY","description":"Today’s the day we’ll be cruising through 1 of the 7 natural wonders of the world, Ha Long Bay. We jump onboard a traditional Junk Boat, get checked into our private cabins and enjoy lunch as we set sail, taking in the incredible views… just epic! After lunch we adventure through caves on kayaks, cool off with a swim before sipping on cocktails for sunset!"},{"title":"Day 4 - HA LONG TO KING KONG!","description":"After waking up onboard surrounded by stunning limestone cliffs we make our way further off the beaten track to Ninh Binh. Known for its dense jungle and towering dark limestone cliffs, Ninh Binh was home to the recent King Kong movie - Skull Island. Allow us to introduce you to our local friends and enjoy dinner with the family in their homestay… it doesn’t get much more local than this!"},{"title":"Day 5 - LET’S PADDLE OUR WAY THROUGH NINH BINH","description":"Today is a real highlight for most as we cycle through the countryside stopping to chat to locals while taking in our surroundings. We’ll park our bikes and jump aboard traditional paddle boats cruising through caves & rice fields… a truly unique experience not to be missed! After enjoying a local lunch we trek to the top of the Dragon viewpoint for an incredible 360 view of Ninh Binh and the valleys below. Tonight we board the overnight train to Hue."},{"title":"Day 6 - GIVING BACK TO THOSE WHO NEED IT MOST","description":"A big part of what we do here at Feel Free Travel is integrating with local communities and experiencing local life. Today we head into the countryside to visit some of the poor areas outside of Hue. Our local guide introduces us to the community, educates us on local life before we as a group give back to these heartwarming locals to help support their children with tuition fees. It’s a pretty special feeling that will have your heart throbbing for sure."},{"title":"Day 7 - OPEN TOP JEEPS TO THE CITY OF LANTERNS","description":"Time to take the ride over one of the most iconic roads in Vietnam, the Hai Van Pass. Spend the afternoon cruising in open top jeeps through the windy mountain roads. We’ll stop for lunch on the beach, cool off in the river and check out incredible viewpoints along the way before arriving in the lantern filled Hoi An for a party!"},{"title":"Day 8 - MAKE A LANTERN & CHILL AT THE BEACH","description":"Today is a great day to enjoy it as you want… chill out, go shopping, make your very own lantern or cycle down to the beach for some chill time it’s completely up to you! Or why not visit a local tailor and get some super cheap clothes made! Enjoy a free evening to really explore the City of Lanterns."},{"title":"Day 9 - LEARN TO COOK ON THE RIVER","description":"There is nothing more exciting than being spun around by a crazy local in a bamboo basket boat while attempting to fish for crabs! Sounds like fun huh? It really is! We explore the coconut groves before arriving at our Vietnamese cooking class on the river. Today is the final day for some of the group so we head out in the evening for the final dinner and drinks ;)"},{"title":"Day 10 - CHECKOUT & ONWARD TRAVEL","description":"Today is check out day and the end to an incredible trip in Vietnam. We’ll help you sort out your onward travel, giving you ideas on where to go next with the new friends that you have made on the trip or simply helping you get the airport before you fly to your next destination/ home."}]}]