[{"name":"Authentic Vietnam (Plus Golden Bridge) - 13 Days","duration":13,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":1383,"price":899,"summary":"Minimum 2 people per booking\nBooking at least 30 days in advance\nStart in Da Nang City and end in Hanoi! With the discovery tour Authentic Vietnam Plus Golden Bridge, you have a 13 day tour package taking you to the real Vietnam, especially, you will have a chance to visit Golden Bridge - a magical, beautiful tourist destination in Ba Na Hills, Danang City.\nThis is a small group tour that includes accommodation as well as flights, an expert guide, meals, transport and more.","highlights":["Marvel at the golden wonder stretching throughout the Ba Na Hills","Fall in love with the cultures and traditions of the local people","Indulge in the sounds and smells of Hoi An’s colourful markets"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143759_9f1307ec.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143759_9f1307ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_99392972.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_f4762450.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_eaccbf12.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_932c08a2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_b1d8b986.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_38770641.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_f06a6f26.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_bae5fa33.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_2e102a29.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_2662eda9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_9854bd99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_37bff374.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_748619a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_f7e4726f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_7e5a59bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_b7cffbf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_766997b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_bf1515bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_25b280e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_920b069d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_649c718b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_99f54b4e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143759_ec8322c4.jpg"],"destinations":["Hue","Hoi An","Hanoi","Sapa","Ninh Binh"],"timeline":[{"title":"Day 1: Da Nang – Arrival","description":"Arrive at Da Nang Airport. Pick up and transfer to hotel. Overnight in Da Nang.\n"},{"title":"Day 2: Da Nang Discovery (B/L/-)","description":"We will visit Ho Chi Minh and Fifth Military Zone Museum, Da Nang Museum, Cham Sculpture Museum. Continue to Thuan Phuoc Bridge at Tien Sa Port, a wonderful bridge in Da Nang City. The next stop is Dragon Bridge, a very unique and modern bridge.\n\nAfter lunch, we will visit Marble Mountains (Vietnamese: Ngu Hanh Son; literally \"five elements mountains\") and head to Son Tra Peninsula visit the spectacular Son Tra Quan Yin, or Goddess of Mercy statue. See the sheer size and beauty of the Lady Buddha up close then learn the legend behind this patron saint of seamen. Overnight in Da Nang.\n"},{"title":"Day 3: Ba Na Hills – Massage & Relax (B/L/-)","description":"Ba Na which is 1487 meters above sea level and known as the second Da Lat or Sapa of Vietnam. The tour begins with visiting Golden Bridge which is a 150-metre long pedestrian bridge with two giant stone hands supporting the structure. It is designed to connect the cable car station with the gardens and to provide a scenic overlook and tourist attraction. Enjoy a ride to the top of Ba Na Mountain in one of the longest cable cars in the world, then hop on the hiking train to continue travelling in comfort. The Hiking Train transport tourists to several popular destinations including Linh Ung Pagoda, Le Jardin Garden and a complex of ancient villas. We will visit Linh Ung Pagoda, Tinh Tam Garden, Nghinh Phong Peak, Vong Nguyet Hill, etc. Come to Da Nang, in addition to visiting the ravishing scenery or explore the inherent characteristics of a city where is worth for living and tranquil, guests will enjoy a moment of Sapa right in Da Nang by the experience of Massage Da Nang services and bath with medicinal herbs of Dao Do ethnic. Overnight in Da Nang."},{"title":"Day 4: Hue, Imperial City – Hoi An (B/L/-)","description":"Check out. Head to Hue, along the North coast of Da Nang to the top of Hai Van Pass where bunkers remaining from the war can be explored. Upon arrival in Hue, we will visit the Citadel, Hue’s prime attraction, which contains the Imperial City, the Forbidden Purple City and the Emperor’s Private Residence. \nFollowing the morning activities, we will have a short break for lunch and afterward, we will take a boat trip on the Perfume River with a stopover at Thien Mu pagoda. From here, we will go to visit the serene Khai Dinh Royal Tomb, designed to blend in with its natural surroundings and built on principles of feng-shui. Overnight in Da Nang.\n"},{"title":"Day 5: Ao Dai Hoi An Cyclo Tour (B/-/-)","description":"Exploring Hoi An in Ao Dai – Vietnamese traditional costume is one of the best ways to take in the city’s charm. You will have the opportunity to wear the traditional Ao Dai styles and colors. The tour includes visits by cyclo to Hoi An Museum, many of the town’s renowned Ancient Houses which boast remarkable architecture, Assembly Halls of Chinese influence, Art Craft Manufacturing Workshop, and of course the must-see Japanese Covered Bridge. These spots are considered as typical architecture styles in Hoi An and reflect clearly the cross culture among France, Japan, China and Vietnam. Sitting on a cyclo with the traditional long dresses, you feel comfortable and discover the quiet and peaceful beauty. Overnight in Hoi An."},{"title":"Day 6: Scooter Tours Countryside (B/-/-)","description":"The tour kicks off in style with coffee at local coffee shop in the center of Hoi An. After that it’s time to hop on your scooter to start exploring Hoi An’s hidden gems and charismatic locals. Take a drive past the old town to Cam Nam Island where we’ll visit some local houses and places where people lives and works traditional lives such as local ship repair yard,  local shoes-making shop, a rice cracker place and lantern making house.\n\nAfterwards, on our drive through the countryside, you’ll experience the resplendent beauty of the rice paddies, grazing buffalo and monkey bridges, all of which you can take photos of. We’ll cruise on to Tra Que Village, a beautiful herb and vegetable garden which supplies vegetables for the restaurants in the ancient town. At the end of the tour, guests can unwind at a stunning beach lounge overlooking one of the best beaches in Vietnam, An Bang Beach, with a refreshing drink. Overnight in Hoi An.\n"},{"title":"Day 7: Hoi An - Dinner & Shows (B/-/D)","description":"At night Hoi An ancient town transforms into what’s also known as lantern town. The night market is filled with beautiful handmade arts and crafts but the real charm lies in the colorful lanterns that adorn all the buildings and streets. You can capture some unforgettable shots when your boat passing through the Hoai river. Treat yourself to the spectacle of twinkling evening lights which rival the stars overhead. After that, enjoy Water Puppet show in Hoi An before heading to a nice restaurant locating on a bank of Hoai River. Overnight in Hoi An."},{"title":"Day 8: Hoi An - Da Nang - Ha Noi (B/-/-) by flight","description":"Pick up and transfer to Da Nang for a flight to Ha Noi. Upon arrival, pick up and transfer to hotel. Overnight in Ha Noi."},{"title":"Day 9: Sapa, picturesque landscapes and colorful hill tribes (B/L/D)","description":"In the morning, you will be transferred to Sapa and have lunch. After lunch, take a scenic one-hour drive up to the hill station of Sapa. From there we will take a short 30-minute journey south toward Muong Hoa Valley, a stunning place boasting the largest terrace rice fields in Sapa. If your visit is between May and October, the local harvest period, you will have a chance to see the local farmers in action. It is a great opportunity to take in the scenery and a great photographic moment. The walk takes you from Lao Chai Village of the Black H'mong Minority to the Ta Van Village of the Giay Minority with a stop at the local Catholic Church, taking in the different traditions, cultures and costumes of the two minority groups. Have dinner. Overnight at homestay."},{"title":"Day 10: End of the trip, full of experiences. Return to Ha Noi (B/-/-)","description":"Free day for shopping and discovering Sapa town. As a tourist attraction in the northwest mountains of Vietnam, Sapa is an ideal destination for those who are looking for unique shopping experiences in an area of picturesque hilly nature and rich ethnic cultures. Strolling around Sapa town’s placid streets, you will soon find some souvenir shops here and there. In no time, you will become captivated by various handicrafts delicately designed in the style of minorities such as silver accessories, animal – modelled wooden souvenirs or clothes with colourful patterns. It is interesting to buy some presents for your relatives and friends. Check out, transferring back to Ha Noi. Overnight in Ha Noi."},{"title":"Day 11: Hoa Lu – Trang An (B/L/-)","description":"Hoa Lu, the Ancient Capital of Vietnam in the 10th and 11th century, stood as the capital for 41 years (968 - 1009), the first 12 years of which were under the Dinh Dynasty of King Dinh Tien Hoang. Later the Le Dynasty under King Le Dai Hanh ruled for 29 years. Both King Dinh and King Le have temples dedicated to them here.\nAfter lunch at a local restaurant, we will take an amazing boat trip to visit Trang An Grottoes, which is known as Vietnam’s “Inland Ha Long”. With a gathering of 31 valleys and 50 cross-water caves, Trang An is home to 600 different species of flora and over 200 types of fauna, many of them rare and endangered. Rowing through Trang An Grottoes is a nice experience. Overnight in Ha Noi."},{"title":"Day 12: Ha Noi – Free day (B/-/-)","description":"Free at your leisure day. Overnight in Ha Noi."},{"title":"Day 13: Ha Noi – Departure (B/-/-)","description":"Transfer to airport for departure."}]},{"name":"Vietnam - An old school trip by train","duration":10,"travelStyle":["Train & Rail","Group","Partially Guided","Discovery","In-depth Cultural","Historical","Holiday"],"oldPrice":0,"price":2304,"summary":"A unique package for train lover ! Jump in a cabin with soft bed and take a trip through Vietnam by train. Travel by old-school style and charming about riding trains. Between the conductors, and the world flying by outside your window, there's a nostalgic appeal to train travel. Traveling by train can be incredibly scenic. You can see cities, mountains and rivers from the seat of a train. Train travel is just an all around better, more relaxing experience than its air and car counterparts. The best part is” “Good bye, road rage !”, no more traffic jam. Strongly suggestion for those who hate get in lines at airport: check-in lines, security lines, boarding lines. There may be a line to board, but it should go quickly. For the most part, you just arrive and walk on to your train","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186125_3237126b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186125_3237126b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_9177e8ba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_6a020e9d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_101ef8e4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_60c087c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_24e2a007.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_45f11286.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_10934d6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_46bef219.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186125_9fadfbf9.jpg"],"destinations":["Hanoi","Halong Bay","Lao Cai","Cat Cat Village","Sapa","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi - Welcome by signature egg coffee","description":"Pick up at Noi Bai airport and transfer to hotel for check-in (after 14:00). The rest of day is at leisure. Dinner at local restaurant.  After dinner, enjoy a cup of hot and sweet egg coffee. A famous specialty in Hanoi that you cannot be missed ! "},{"title":"Day 2: Hanoi - Overnight in Ha long bay world's Heritage","description":"Breakfast at hotel.  08h00 Take 3-hours and half drive by private car from Ha Noi to Ha Long bay. On the way, stop over at ABC rest stop. 7:30-8:00 AM you will be picked up from hotel lobby for the journey to Halong Bay. After 3.5 hours driving and viewing simple, countryside, rice paddy life, we arrive at the port. 12:30 PM Board your boat and start your amazing cruise through this World Heritage Site. Lunch is served on board, a selection of the freshest seafood. We visit “the amazing cave” or other ones, followed by a swim in the tranquility of Halong Bay and its emerald water. We will cruise further into a quiet area where we will anchor and stay overnight. Dinner and relax as the sun sets. Then you are free to swim in the phosphorous water, retire to your cabin, or fall asleep under the stars amidst the magic of Halong on the top deck Overnight on cruise in Ha Long bay."},{"title":"Day 3: Ha long - Hanoi - Night train to Highland Lao Cai","description":"Wake up early in the morning for a great sunrise and a breath of fresh ocean air. Breakfast served on boat then we do a leisurely cruise through thousands of seemingly never ending islands. These are great opportunities to capture some amazing photographs. \n 2\n  \nHave brunch/early lunch on boat while cruising back to the Halong city pier, return to Hanoi. On the way, stop over at Dai Viet rest stop. Reach Hanoi, walk through Hanoi old quarter, you will have time for shopping at Dong Xuan market. Have dinner at local restaurant. After dinner, proceed to Hanoi railways station for the night train to Lao Cai. Overnight on train (04 berth cabin, share cabin with other tourists). "},{"title":"Day 4: Cat Cat, Sin Chai Minority Village - Fansipan The Rooftop of Indochine","description":"Pick up at Lao Cai station, then transfer to Sapa which is only 38 km from Lao Cai. Have breakfast at 3* hotel. After that, following the road down to the valley by steps for about 5 km. While walking to the H’mong village in Cat Cat you will have the opportunity to see the villagers working on the paddy fields and their animals, such as: chickens, water-buffaloes and pot – bellied pigs. You can also see the old hydro-electric power station which was built by the French time in the early 20th Century, and a beautiful waterfall that is a good place for resting and taking pictures.  Going up and down by steps and then we keep walking to Sin Chai village where the black H’mong people also live. On the way to the village we can meet villagers.  Transfer to visit Fansipan, take cable car (included) to visit Fansipan mountain which is highest in Indochina & considered as “ Rooftop of Indochina”. The cable car system of Fansipan Legend which conquers the “Indochina Rooftop”, is the highest, longest and most modern system of its type in the world. It has been recognized by the Guinness World Records Organization with two records: • The longest non-stop three-rope cable car: 6292,5m. • The greatest elevation difference by a non-stop three-roped cable car: 1410m. Client will have a chance to experience the tram (included) from cable car station to the top of Fansipan during a good panaroma view from the high.  Return to Sapa Lunch & dinner at local restaurant. Overnight in Sapa. "},{"title":"Day 5: Sapa - Ta Van - Lao Cai - Night train to Hanoi","description":"Breakfast at hotel. Embark on a lovely trek that will take along buffalo paths and trails and through several hill tribe villages Lao Chai and Ta Van, home to Black H’mong and Dzay people. This is an absolutely spectacular walk through stunning scenery inhabited by some of the friendliest people you can meet. Once on the valley floor you can really appreciate the wonderful scenery surrounding you. The walls of the valley are covered with multi-layered rice terraced fields. Return to Sapa. Lunch at local restaurant. Walk around for last minute shopping. Transfer to Lao Cai city & then proceed to China border for taking photo. Dinner at local restaurant. Board on night train to Hanoi.  Overnight on train (04 berth cabin, share cabin with other tourists). "},{"title":"Day 6: Hanoi - Train to Hue ancient formly capital","description":"Pick up at Hanoi train station then transfer for breakfast at 3* hotel. Enjoy your city tour, visit Ho Chi Minh mausoleum (from outside), Ho Chi Minh house on stilt & One Pillar pagoda. Continue to visit Literature temple which is regarded as the first university of Vietnam Then take 01-hour cyclo tour to visit the bustling Hanoi Old Quarter & Restored Sword lake. Visit Museum of Ethnology. You will see many exhibits, photographs and actual houses inhabited by some of the 54 ethnic people in Vietnam. It will offer a truly colorful introduction to these ethnic tribes Enjoy water puppet show, a unique art performance of Vietnam. \n 3\n  \nHave dinner at local restaurant. Proceed to Hanoi train station for night train to Hue (Sharing 04 berth cabin with other tourists).  Overnight on train. "},{"title":"Day 7: Hue - Discover king's tomb and secret from past dynasties ( B/L/D )","description":"Breakfast on train. Take a boat trip on the romantic Huong (Perfume) river to visit Hue's best-known religious site, Minh Mang king‘s mausoleum, Thien Mu 7-storey pagoda. Continue to visit Imperial Citadel (by car) where the Nguyen Dynasty ruled between 1802 and 1945.  Lastly, visit an Dong Ba market, an oldest market in Hue ancient city. Have dinner at local restaurant. Overnight in Hue. "},{"title":"Day 8: Hue - Da nang - Wildlife a side of hustle and bustle city ( B/L/D )","description":"Have breakfast at hotel. Visit Khai Dinh king’s mausoleum and Tu Duc king’s mausoleum. Transfer to Da Nang via Hai Van pass (Cloud Pass), you will have change to see new & morden Da Nang city of Vietnam from the pass, also taking many beautiful picture when stopover at the pass.   Then, drive around Son Tra peninsula named as Monkey Mountain – the screen of Da Nang City. Visit the first Linh Ung Pagoda, where exists the highest Goddess of Mercy Statue of Viet Nam. The pagoda offers stunning views of Danang beach and Cham Islands in the distance.  Transfer to Hoi An. Have dinner at local restaurant. Overnight in Hoi An."},{"title":"Day 9: Ho Chi Minh city _ Mekong Delta, the land with 70% is water ( B/ L/ D)","description":"Breakfast at hotel Take a full day trip to the watery world of the Mekong Delta, just some hours by coach from Ho Chi Minh City. My Tho is a prosperous town of 175,000 inhabitants in the Mekong Delta. It is famous for its extensive orchards and immense rice fields. Take a cruise on Mekong River to visit islands. Here, you can have chance to visit coconut candy workshop & to taste fresh candy- specialty. Enjoy tropical fruits, honey tea & listen to Southern traditional music. Get on a small boat to discover a natural canal of Ben Tre province. Take a short walk in the coconut farm to visit a typical house in Mekong Delta. Back to big boat by rowing boat on small canal.  Have lunch at garden restaurant. Visit Vinh Trang pagoda. Back to Ho Chi Minh city. In the evening, enjoy dinner at local restaurant. Overnight in Ho Chi Minh city"},{"title":"Day 10: Ho chi minh city - Departure","description":"After having breakfast at hotel, free at leisure. Check-out hotel (before 12:00 – noon time). Transfer to Tan Son Nhat airport for departure flight. End of services. "}]},{"name":"Vietnam Culinary Delights - 10 Days","duration":10,"travelStyle":["Food & Culinary","Group","Partially Guided","Holiday"],"oldPrice":1275,"price":765,"summary":"Minimum 2 people per booking\nBooking at least 30 days in advance.\nLearn all the incredible food in Vietnam and explore one of our beautiful beach on a comprehensive ten-day tour.","highlights":["Learn the art of how to cook traditional Vietnamese cuisine","Discover the secrets of the Vietnam War in the Cu Chi Tunnels","Indulge in the sounds and smells of Hoi An’s Colourful Market"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/79056_f21388d1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/79056_f21388d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_28318eac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_94d5ce93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_7c30acab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_e21bf6d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_31869aab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_06b53660.jpg","https://cdn.tourradar.com/s3/tour/1500x800/79056_05d70da1.jpg"],"destinations":["Ho Chi Minh City","Hoi An"],"timeline":[{"title":"Day 1: Ho Chi Minh City - Arrival (-/-/-)","description":"Arrive at Tan Son Nhat airport. Our representatives will support you to get visa. Pick-up and transfer to your hotel. Overnight in Ho Chi Minh City."},{"title":"Day 2: Ho Chi Minh City - Cooking class (BL)","description":"08:30 This tour will give you the opportunity to kick off your professional cooking career, or at least, to become a better cook of local Vietnamese cuisine. We will begin the day by heading to a local market to see how Vietnamese people select their ingredients for cooking. Choosing ingredients for cooking is very important for Vietnamese cuisine, so the cooks are always pay attention to these. Otherwise, the cuisine is not good and fresh enough. Local markets in Vietnamese are very comfortable and convenient for bargaining and purchasing. After that, we have an idea of the local products and meats that the locals typically choose; we will depart from the market and head to a Cooking Center. The classes provided here are a fun and interesting way to learn about the local ingredients and how to make some of the most popular Vietnamese dishes. You will learn when and how to use the numerous herbs and spices which are ingrained in Vietnamese culture. You will be guided on how to select the ingredients for dishes and instructed on how to prepare them. After preparation, you will cook under the instruction of the chef. Your final task will be to enjoy your finished dishes! Overnight in Ho Chi Minh City."},{"title":"Day 3: Ho Chi Minh City - Cu Chi Tunnel - Da Nang - Hoi An (BL) by flight","description":"07:35 Cu Chi Tunnels, a network of tunnels stretching over 250 kilometers, have proven to be one of the most famous and historical aspects of the Vietnam War. The tunnel system was created in 1948 to assist the Viet Minh as they fought the French for independence. Digging and building of tunnels continued over the next 25 years until it was an underground city with living areas, kitchens, storage, weapons factories, field hospitals and command centers. The tunnels could house thousands of people who lived almost entirely underground for years. There, people led relatively normal lives, which included getting married and raising children. During the American War, the entire area of Cu Chi was designated as a free fire zone; and was therefore, heavily attacked and bombed. In 1988, two sections of tunnels were opened up for visitors. Now you have the chancto enjoy this wonderful and informative experience. Created with “moving parts” these structures were designed to livable for long periods of time. And for those who are interested, there is an opportunity for you to fire off rounds from a war era M16 or AK47 at the nearby firing range. (This activity is optional; Fees for firing range are not included).\n\nTransfer to airport for a flight to Da Nang. Upon arrival, pick up and transfer to Hoi An. Overnight in Hoi An.\n"},{"title":"Day 4: Hoi An - Contact Ann Tailor - Home cooking class (BL)","description":"08:00 Are you excited to learn how to cook Vietnamese food? Then join our unique, hands-on cooking class. During our cooking program, you will be able to visit Hoi An’s Colorful Market and experience the amazing sights, sounds and aromas all over the area. You will also have the opportunity to interact with the merchants to purchase the ingredients that you’re going to use in the cooking lesson. Choosing ingredients for your cuisines is very important, if your ingredients are fresh, green enough, your cuisines are delicious and fragrant otherwise, they are not good at all. Vietnamese food is various with different flavours and ingredients. The chef is fun and enthusiastic and he/she will demonstrate how to prepare each dish before guiding you in the preparation of your own dish. Besides, while preparing your cuisine, you can create your ideas for making your cuisine more good looking and better. Preparing a good cuisine is an art which you must think and develop with your own. After the lesson, you will enjoy the meal you have prepared. Hopefully, through this trip you can understand and know more about Vietnamese cuisine in general and Hoi An cuisine in particular. Overnight in Hoi An."},{"title":"Day 5: Hoi An – Foodie tour (BL)","description":"09:00 Discover Hoi An’s countryside and its local foods by bicycle. We will start our tour with a ride through the countryside to a local village with a stop to enjoy a bowl of Cao Lau. Cao Lau is a traditional Hoi An specialty composed of local noodles, pork, fresh vegetables and rice paper. The noodles are made with local sticky rice soaked in the water that must be taken from Ba Le Well: the oldest well in Hoi An, believed to have the best water anywhere. You will also be able learn to make special white rose cakes with a local family and have the opportunity to enjoy them. Before the end of the tour, we will go to Cam Nam to enjoy the Ying and Yang food such as: Banh Dap, Che Bap. This tour is definitely an interesting journey. Overnight in Hoi An."},{"title":"Day 6: Hoi An - Da Nang - Nha Trang (B) by Train","description":"Pick up and transfer to Da Nang train station for a ride to Nha Trang. Upon arrival, pick up and transfer to hotel. Overnight in Nha Trang."},{"title":"Day 7-8: Nha Trang – Free day (B)","description":"Free as your leisure day. Overnight in Nha Trang."},{"title":"Day 9: Nha Trang – Ho Chi Minh City (B) by flight","description":"Pick up and transfer to airport for a flight to Ho Chi Minh City. Upon arrival, pick up and transfer to hotel. Overnight in Ho Chi Minh City."},{"title":"Day 10: Ho Chi Minh City – Departure (B/-/-)","description":"Breakfast and free time until time to go to the airport for departure flight. "}]},{"name":"The Golfer Conquest - Tee off through Amazing Vietnam","duration":7,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1600,"summary":"Be a normaly golfer is not enough, be a conquer golfer by challenge yourself through all golf courses across Vietnam. Top 10 golf course of Vietnam and Top 10 golf course in Asia are available here. We have design with international standard, options suitable for beginner until pro-player. Of course a golf course from the legend Colin Montgomerie is can not missed in our list. Pick up some friends, take your golf bag and tee off everyday with a 7days package from the North to the Sounth. TOUR ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186126_df2ded41.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186126_df2ded41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_20e542dd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_b84b352d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_72cb498a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_b03a975e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_5b9e20a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_49d33383.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_20c34b70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_8eba208a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_fb9d1a6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186126_1fb400fb.jpg"],"destinations":["Hanoi","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi Arrival - Tee Off Near Great Lake Side at Dai Lai Star Golf","description":"Pick up at Noi Bai airport & transfer to play golf at Dai Lai Star Golf (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee). www.dailaigolf.com.vn  After golfing, back to Hanoi. Overnight in Hanoi"},{"title":"Day 2: Hanoi Arrival - Tee Off at Romantic Valley Chi Linh Star Golf","description":"Breakfast at hotel.  Transfer to play golf at Chi Linh Star Golf club (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee) www.chilinhstargolf.com.vn. After golfing, back to Hanoi. Overnight in Hanoi. "},{"title":"Day 3: Hanoi - Departure Da Nang Da Nang Golf Club Designed by Legend \"Greg Norman \"","description":"Breakfast at hotel. Check-out (before 12:00 PM – noon time). Free at leisure until transferring to airport for departure flight.  Pick up at Da Nang airport (noon flight) and transfer to play golf at Danang Golf Club (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee). www.dananggolfclub.com After golfing, transfer to hotel. Free at leisure. Overnight in Danang. Note: Coach standby until 21:00 "},{"title":"Day 4: Danang _ Montgomerielinks Golf Club designed by King of Golf Course \"Colin Montgomerie\"","description":"Breakfast at hotel. Transfer to play golf at Montgomerielinks Golf Club (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee). www.montgomerielinks.com  After golfing, transfer to back to hotel. Free at leisure. Overnight in Da Nang. "},{"title":"Day 5: Danang _ Departure to Ho Chi Minh City - The first Private and Exclusive twin doves golf club","description":"Breakfast at hotel.  Free at leisure. Check-out hotel (before 12:00 – noon time). Transfer to Da Nang airport for departure flight.  Upon arrival, pick up and transfer to Twin Doves Golf Club to play golf (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee). www.twindovesgolf.com  After golfing, back to hotel. Overnight in Ho Chi Minh city "},{"title":"Day 6: Ho Chi Minh City - Tee Off at Long Thanh Golf Course near biggest river in Ho Chi Minh City","description":"Breakfast at hotel. Transfer to play golf at Long Thanh Golf Club – Lake course (1 round of 18 holes game with green fee, caddy fee & TWN share buggy fee). www.longthanhgolfresort.com  After golfing, back to hotel. Overnight in Ho Chi Minh City. "},{"title":"Day 7: Departure.","description":"Breakfast at hotel. Check-out (before 12:00 PM – noon time). Free at leisure until transferring to airport for departure flight.  End of services. —"}]},{"name":"12 Days Impressive Vietnam From Ho Chi Minh city","duration":12,"travelStyle":["Discovery","Adventure","Family","Group","Fully Guided","Holiday"],"oldPrice":0,"price":699,"summary":"Perhaps Vietnam is still a bit strange to you. Let us help you understand Vietnam in 12 Days from Ho Chi Minh city up to the Central and North. The real image of Vietnam will be your eyes with South up to North Vietnam. 12 Days Impressive Vietnam From Ho Chi Minh includes accommodation in a hotel as well as an expert guide, meals, transport and more.\nHighlight:\nBoat trip Mekong Delta\nVisiting My Son holyland\nKayaking among thousands of island in Halong Bay\nTrekking on the terrace rice field in Sapa","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119017_6d6fed78.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119017_6d6fed78.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_2f36e4b4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_c493c2a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_f103a0e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_b50cf208.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_7d45c803.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_85de99a9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_fb85f5bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_d054c72a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_5550c198.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_2f99b1d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_d5337179.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_5f65c8e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_c2dc3640.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_7061b924.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_b0fe027a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_5e5f8bdd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_f21e2490.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_d1281a11.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_f4c60407.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_2eeec10a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_6a6ad249.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_f0d462fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119017_87db000d.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay","Sapa"],"timeline":[{"title":"Day 1: Ho Chi Minh arrival (Meal: No)","description":"Welcome to Ho Chi Minh, Vietnam. Our driver will pick you up at Tan Son Nhat airport and transfer you to the hotel in the center of Ho Chi Minh city.\nCheck in the hotel and get your own time to visit the city.\nNote: Hotel check in time: 13:00\nOvernight at hotel in Ho Chi Minh city\n"},{"title":"Day 2: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in Ho Chi Minh city."},{"title":"Day 3: Ho Chi Minh city free and easy – Flight to Da Nang – Hoi An (Meal: B)","description":"You have the free time to exploring Sai Gon by your own. Viewing Notre Dame Cathedral, Reunification Palace, War Remnants Museum… Discovering the local life in the center, tasting the local food… until the transferred time to the airport for the flight to Da Nang city.\nArrive Da Nang city and meeting your driver at Da Nang airport, take the time to view the city along the way to the hotel in Hoi An.\nOvernight at hotel in Hoi An.\nOptional: Cu Chi war tunnel half day tour\n"},{"title":"Day 4: Hoi An free time (Meal:B)","description":"Take your nice time to visit Hoi An old town with Vietnamese traditional architecture, is mixed among Japanese and Chinese one. Hoi An old town still be preserved the houses what was built from 17th century. Visiting the lantern shop, costume made tailor to make your nice dress. Spend the sunny time to sunbathing on the beach, or cycling to local village to understanding much more the local farmer…\nOvernight at hotel in Hoi An\nOptional: Farming & Fishing trip, Hue city tour 1 day"},{"title":"Day 5: Hoi An – My Son sanctuary 1 Day tour (Meal: B,L)","description":"7:30 – 8:0: The bus and tour guide pick you up at your hotel for My Son trip. Leaving Hoi An for My Son HolyLand. After one hours driving, arrive in My Son - the Holyland surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. As a tower garden, My Son is a huge religious complex with over 70 towers and temples of different architectures. Wander through the elaborate carvings and sculptures of the Cham people, tourists are welcomed at the Old Tower of the Cham. Not only visit an interesting place, but also you can understand much more about the culture and civilization of ancient Champa people. Spending about 2 hours to enjoy and discover the beauty of Ancient buildings at of the Champa Kingdom with our tour guide. \n12.00: Leaving My Son, get on the boat at boat station and taking a boat trip on Thu Bon River. All the local life of local people will appear on your eyes. You could visit the living of the local people and feeling the fresh air. You will have soft lunch on the boat and see the beautiful views along the river \n13:30: The boat trip will finish at Bach Dang Boat station. Our driver will pick you up to local restaurant for lunch. Back to your hotel after lunch & End your trip! \nOvernight at hotel in Hoi An.\n"},{"title":"Day 6: Hoi An free time – Overnight train to Hanoi (Meal: B)","description":"Take your nice time to visit Hoi An old town with Vietnamese traditional architecture, is mixed among Japanese and Chinese one. Hoi An old town still be preserved the houses what was built from 17th century. Visiting the lantern shop, costume made tailor to make your nice dress. Spend the sunny time to sunbathing on the beach, or cycling to local village to understanding much more the local farmer…\nMeeting your driver to go to Da Nang train station. Get on the train and going to Hanoi.\nTrain takes about 16 hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight on the train"},{"title":"Day 7: Hanoi arrival - Train station pick-up - Hotel check-in (Meal: No)","description":"Welcome to the capital of Vietnam. Your driver will meet you at Hanoi train station and transfer you to the hotel in Hanoi old quarter.\nWith several historic monument in the city, you could go to visit Hoan Kiem Lake, Ngoc Son temple, walking in the old town to see the local life style.\nOvernight at hotel in Hanoi\nOptional: Water Puppet Show, Hanoi street food walking tour\n"},{"title":"Day 8: Hanoi – Halong Bay – Overnight on cruise (Meal: B,L,D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on board with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbathing on the sundeck, photo hunting while cruising among the hundreds of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov Island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game\nOvernight on cruise"},{"title":"Day 9: Halong Bay – Hanoi (Meal: B,L)","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\n"},{"title":"Day 10: Hanoi - Sapa – Ylinh Ho – Lao Chai – Ta Van village (Meals: B, L, D)","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, trekking/ walking shoes, sandals, and any thing you need for trip.\n\n12km trekking through the terrace fields to homestay.\n6:30-7:00 am: Shuttle bus will pick you up at your hotel and transfer you to the sleeper bus for Sapa trip with short break-time on the half way.\n12:30 pm: Our guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house."},{"title":"Day 11: Ta Van – Giang Ta Chai village – Sapa – Hanoi (Meals: B, L)","description":"You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tell your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields. \nGet back to Sapa town by shuttle bus. \nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:00: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi. Shuttle bus will transfer you back to your hotel/stay in Hanoi Old Quarter.\nOvernight at hotel in Hanoi"},{"title":"Day 12: Hanoi Departure (Meal: B)","description":"Still have more interest you should explore in Hanoi city. From the street vendor to the old house in the tiny alley on any street, or taking photo of busy traffic while shopping souvenir for family,… you’ll get more and more nice and friendly image in Vietnam.\nDriver would like to transfer you to Noi Bai airport for your flight out.\nIf you did not want to leave, please let us know to extend your vacation. \nNote: This is group joining, there is a different group each trip during your vacation.\nIf you are Solo traveller, you will stay at Share Drom Room at the hostel during your vacation.\nWho should participate? - This tour is suited for all, including children as well.\nPrice structure: - Price quoted is based on per person basis. \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!"}]},{"name":"Luxury Escape – explore Best of Vietnam in 10 Days incl Hanoi – Halong Bay – Hue – Hoi An – Ho Chi Minh – Mekong.","duration":10,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1099,"summary":"Start in charming Hanoi, Vietnam’s artistic and intellectual capital. Explore the fascinating Old Quarter and its hundreds of specialty shops selling silk clothing, lacquerware, embroidered linens, furniture, bamboo, cooking utensils, ceremonial objects and more. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/169419_4c40a759.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/169419_4c40a759.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5e410066b5a22.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_907efa25.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_ecd3c1e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5e410066b5a28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_84872f9f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_91f6fbc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_4e3895ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_8a6bc4f7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_51f4c0c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_f904b5a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_0b2b5fc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5dc2bc31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5e410066b5a36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5e410066b5a38.jpg","https://cdn.tourradar.com/s3/tour/1500x800/169419_5e410066b5a39.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi","description":"Arrival in Hanoi. We welcome and transfer you to hotel. Rest of the day is your leisure time to explore the city on your own.\nOvernight in Hanoi.Start point\n International Arrival Hall, Sân bay quốc tế Nội Bài, Sóc Sơn, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi","description":"Hanoi city tour. Visit some famous places in Hanoi that includes The Temple of Literature, Hoan Kiem lake, Ngoc Son Temple and Vietnam Museum of Ethnology.\nTake a cyclo tour for sightseeing around the Old Quarter of Hanoi.\n\nOvernight in Hanoi.\n\nMeal: (B,L)"},{"title":"Day 3: Halong Bay","description":"Morning, enjoy breakfast at hotel. We leave Hanoi for Halong bay around 8.00am. Upon arrival in Halong, embark and have delicous lunch onboard. We cruise through thousand amazing islands and islets during the lunch. After lunch, take a refresh in your room before visiting Surprising Cave, kayaking, swimming… Go back to the boat, get a drink and enjoy a sunset scenery in the bay.\nOvernight on boat in Halong bay.\n\nMeal (B,L,D)\n-------------------\n(ADD-ON if you want to add one more night on cruise)\nSpend one more night in Halong bay. Scenic cruising to the most tranquil areas of Halong Bay. Get on an island for swimming, sunbathing… Spend another night aboard.\nMeal (B,L,D)"},{"title":"Day 4: Hue","description":"Morning, breakfast on board. Cruise further and stop at a Pearl Farm village. Continue cruising through many island and islet to explore the hidden charm of the bay. Lunch on board while going back to the prier. Transfer back to Hanoi. Get to airport for flight to Hue.\nOvernight in Hue.\n\nMeal (B,L)"},{"title":"Day 5: Hoi An","description":"Hue city tour. Get a boat trip to Thien Mu Pagoda. We then continue our visit at the Citadel & Hue Royal Antiques museum. Visit Dong Ba Market and have lunch at a nearby restaurant.\nAfter lunch, visit tomb of King “Minh Mang” and Tomb of King “Khai Dinh”. Proceed our tour at a nearby village where people making incense stick and conical hat. After that, we transfer you to Hoi An\n\nOvernight in Hoi An.\n\n(B,L)"},{"title":"Day 6: My Son","description":"Morning, visit My Son Sanctuary, a UNESCO World Heritage site. Afternoon, visit Hoi An town on foot: Hoi An’s Colorful Local Market, Tan Ky Old House, Fu Jian Assembly Hall, and the 400-year-old Japanese Covered Bridge.\nOvernight in Hoi An.\n\nMeal (B,L)"},{"title":"Day 7: Ho Chi Minh City","description":"Breakfast at hotel. Spend a little leisure time then our driver transfers you to airport for flight to Ho Chi Minh. Uppon arrival at Tan Son Nhat airport in Ho Chi Minh, you will be taken to hotel for check-in. Rest of the day is your own time to explore the city yourselves.\nEvening, enjoy your dinner on a Restaurant boat.\n\nOvernight in Ho Chi Minh."},{"title":"Day 8: Ho Chi Minh City","description":"Morning, enjoy breakfast at hotel. After that, take a city tour. Places to visit: The Re-Unification Palace, the Notre Dame Cathedral & the War Remnants Museum.\nAfternoon, leave the city for Cu Chi. Explore the Cu Chi Tunnel. Return the city.\n\nOvernight in Ho Chi Minh.\n\nMeal (B,L)"},{"title":"Day 9: Mekong Delta","description":"After breakfast at hotel, leave Ho Chi Minh for Ben Tre. Take a boat trip on Mekong river to a family business which epitomizes the idyllic rural lifestyle, walking through the fruit plantation village. Back to Ho Chi Minh.\nOvernight in Ho Chi Minh.\n\nMeal (B,L)"},{"title":"Day 10: Ho Chi Minh City","description":"Enjoy breakfast at hotel.\nSpend your leisure time in the city until we transfer you to the airport for departure flight.\n\nSay Goodbye Vietnam!\n\nMeal (B)"}]},{"name":"Explore Vietnam Heritage & Cultural 11 Days","duration":11,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1190,"summary":"In and around HanoiUpon arrival at Noi Bai Airport in Hanoi, Paradise Travel’s tour guide and driver are ready to welcome you at airport exit gate.\nOn the way from airport to hotel, our tour guide will briefly introduce your tour program, general and necessary information for the time you are in Vietnam, double check with you with things you may need to make clear, reconfirm with you for the next day pick up time\nIf time permit, we have a cyclo around old quarter, join the Water Puppet Show in late afternoon, have welcome dinner\nOvernight at hotel in Hanoi","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/147158_bd6fa61c.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/147158_bd6fa61c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_e2ce7fd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_de84fc54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_5e45e7d4f3be3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_5e45e7d4f3be5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_5e45e7d4f3be7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_5e45e7d4f3be8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/147158_5e45e7d4f3bea.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay","Phong Nha-Kẻ Bàng National Park","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi Arrival","description":"Upon arrival at Noi Bai Airport in Hanoi, Paradise Travel’s tour guide and driver are ready to welcome you at airport exit gate.\nOn the way from airport to hotel, our tour guide will briefly introduce your tour program, general and necessary information for the time you are in Vietnam, double check with you with things you may need to make clear, reconfirm with you for the next day pick up time\nIf time permit, we have a cyclo around old quarter, join the Water Puppet Show in late afternoon, have welcome dinner\nOvernight at hotel in Hanoi"},{"title":"Halong Bay","description":"After breakfast at hotel, we leave Hanoi around 8.30AM for Halong Bay (180KM).\nArrive at the bay at noon when the junk crews welcome guests on board at Hon Gai Wharf.\nEnjoy welcome drinks and check in your cabin, lunch with fresh local seafood while cruising into Ha Long Bay. Get to Vung Vieng after 2 hours. Start exploring Vung Vieng fishing village and the hidden lagoons in Bai Tu Long Bay by kayak you will recognize many of these iconic karsts which appeared several times throughout Kong: Skull Island.\nBack to junk to enjoy relaxing or the sunset. Dinner and overnight on board nearby Vung Vieng village (or Trinh Nu cave)"},{"title":"Halong Bay - Ninh Binh","description":"AM: Early risers can enjoy the sunrise and the quiet breath – taking beauty of Bay’s landscape. From 7.30 to 10.30, Ala carte serving (Guests can order any dishes in the menu whenever they want).\nAround 8.00, Start discovering Ba Cua beach where the guests enjoy swimming, sunbathing or relaxing. Back to junk, arrange luggage and check out cabin while cruising back. Around 11.30: disembark.\nPM: Transfer to Ninh Binh (200KM from Ha Long Bay)\nUpon arrival in Ninh Binh, we check in and relax before dinner.\nOvernight in Ninh Binh"},{"title":"Ninh Binh","description":"After breakfast at hotel, we start a full day tour of Ninh Binh.\nFirst, we visit Hoa Lu, the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then, we take a trip to Van Long wharf and set off on a short boat trip into the reservoir at Van Long Nature Reserve – the largest wetland in northern Vietnam. This is also where many of the scenes from Kong: Skull Island took place.\nHave lunch at nearby restaurant.\nIn the afternoon, we take a boat trip to discover Trang An, one of the places the Kong: Skull Island was shot, which have forested limestone mounts contrasting in emerald water, caves, lowland and rivers. We will visit 11-cave-network with beautiful stalactites of all shapes and colors.\nLater in the afternoon, we get on our vehicle for coming back Hanoi (110KM) for dinner\nRe-check in hotel and overnight in Hanoi"},{"title":"Hanoi - Quang Binh","description":"Today, we visit highlights of Hanoi which include:\n– The Ho Chi Minh Mausoleum and his house on stilts. Here, you will hear about the man who led Vietnam’s campaign for independence from French colonial rule.\n– The Imperial Citadel, the apex of regional political power for more than a millennium where research and excavation is still underway\nAfter lunch, we visit the Temple of Literature, which was built as an homage to the Chinese scholar Confucius.\nThe tour continues with Ethnology Museum where you have great chance to know about culture, custom, languages, houses of 54 ethnic groups in Vietnam,\nBack to hotel for refresh\nOur tour guide will meet you at your hotel after checking out for dinner and transfer you to Hanoi train station to catch the train at 19:30. The train arrives in Dong Hoi, Quang Binh around 05.30 the next day"},{"title":"Phong Nha - Tu Lan - Explore the Home of Kong","description":"Upon arrival, a driver will be waiting to transfer you for breakfast. Then, we take one-day trek into the heart of tropical Tu Lan, experience the epic natural majesty of Phong Nha National Park – home to the largest cave in the world, also known to be the home of Kong in the movie.\nTake an excursion visiting Hang Chuot, Hung Ton Caves and To Mo Valley. Explore karts, jungles, waterfalls and river caves in a journey into the heart of central Vietnam’s natural reserve.\nSee the immense formations of Hang Chuot (Rat Cave) before trekking to impressive Hung Ton Cave and To Mo Valley.\nBack to hotel for dinner and relax. Overnight in Chay Lap Farm Stay"},{"title":"Quang Binh - Da Nang - Hoian","description":"After early breakfast, we check out and transfer to railway station for train at 07:25AM to Da Nang\n13:00: Arrive in Da Nang, transfer to hotel in Hoi An for checking in and relax\nAfternoon walking tour in Hoian.\nWe will start the walk from small alley from Phan Chu Trinh Street to Nguyen Thi Minh Khai Street. This is the typical ancient street of Hoi An, that can show you great atmosphere of the ancient town. Visit the Japanese Cover Bridge – the symbol of Hoi An.\nAfter that, we visit Tan Ky, the most well known and authentic ancient house in town. Then take a walk along the Nguyen Thai Hoc – the ancient street of Hoi An to the market of the town. Visit the local market of Hoi An and Phuc Kien Congressional Assembly Hall, the communal place for Chinese community from Fukien province in China as well the worshiping temple to Thien Hau, the Goddess protecting people on the sea – that was so important for the Chinese Merchant and Fishman in the past.\n\nThen you have free time for discovering the town on your own or shopping."},{"title":"Hoi An - Ho Chi Minh","description":"After your breakfast at hotel, we and start biking tour to Tra Que Village. (Car is available upon inquiry)\nWe will cycle to a local farm in Tra Que village. A short stroll will take you around the vegetable garden and then you can join the farmers in preparing the land and fertilizing it with seaweed from the local lake following steps are raking the ground, sowing, watering, vegetable picking and many other gardening activities. After all these activities, we will take a short rest before getting to preparing lunch with a local family\nOur lunch will consist of many local delicacies including ‘Tam Huu’ spring roll, Banh Xeo or local pancake of people in Vietnam middle region. you can join the cooking with the chef on these meals. After your morning excursions and lunch, we will take a Vietnamese traditional postprandial nap before learning how to harvest and wrap the vegetables.\nReturn to hotel, check out and transferred to Da Nang airport for afternoon flight at 15.35 PM to Saigon, Ho Chi Minh City\n17.05 PM, pick up at Saigon airport and transfer to hotel for checking in.\nWe will have dinner at nearby restaurant\nOvernight at hotel in HCM City"},{"title":"Mekong Delta","description":"After your breakfast, we start a full day to explore the Mekong Delta. On the way (3 hours drive) we can see the green paddy fields stretching towards the horizon.\nUpon arrival in Cai Be, we board on boat for an exploration of lush vegetation of Mekong Delta and the lively floating market buyers bargaining. Next a rowing boat rides on the maze of shady canals to arrive at a local orchard to visit the daily activities the handicraft villages of local people. Break time for lunch at the fruit garden\nAfter lunch, we take a boat along the Mekong River to Vinh Long – a center of tropical fruit; stop in for a short visit to Vinh Long market. Travel across My Thuan suspension bridge and drop by Mekong Rest Stop before going back to Saigon.\nHave dinner at restaurant\nOvernight in Saigon"},{"title":"Ho Chi Minh City and Cu chi tunnels","description":"After breakfast, we start a full day HCM City and Cu Chi Tunnels tours\nWe start with Notre Dame Cathedral and the Central Post Office. Notre Dame Cathedral was built between 1877 and 1883 and the stone used to create it was imported entirety from France.\nNext to the cathedral stands the Central Post Office, construction finished in 1891. It is another fine example of French architecture and is Vietnam’s largest post office.\nWe continue with The Reunification Palace which was the former residence of the President of South Vietnam until April 30, 1975.\nIn the afternoon, we have an excursion to the famous Cu Chi tunnels. This network of tunnels, which stretched for over 200KM, became legendary during the 1960s.\nThe tunnels have been widened for our benefit (otherwise we would not be able to enter). For those interested, there’s even the opportunity to try an AK47 or MK16 at the nearby rifle range.\nWe return to HCM City and have farewell dinner\nRelax and overnight in HCMC\nThen, we visit the War Remnants Museum which has a wealth of images from the wars, the most moving being a gallery entitled ‘Requiem’ which is dedicated to Vietnamese and foreign journalists and photographers who perished during the French and American conflicts.\nWe have lunch in HCMC"},{"title":"Ho Chi Minh Departure","description":"We have breakfast at hotel.\nOur vehicle and tour guide will accompany group for shopping at nearby famous markets then transfer to airport for your home flight."}]},{"name":"Vietnam Signature- From North to South","duration":13,"travelStyle":["In-depth Cultural","Family","Group","Fully Guided","Holiday"],"oldPrice":1836,"price":991,"summary":"\n\tVietnam is a great combination for nature lovers and cultural seekers. Within 13 days, you can experrience the most compelling landscap as well as experience some of the cultural aspects of each destination, start the tour from classic and charming capital, Hanoi. Then head to Northern Vietnam for marvellous Sapa with interaction with local ethnic minority groups and sailing to the emerald waters in the most picturesque bay of Vietnam. Travel to the Central of country and find yourslef lost in the hidden paradise in Phong Nha National Park, not to forget Hội An - an enchanting larten town, star of the region. Finish off with warm welcome from cosmopolis Ho Chi Minh city whilst discover the rice basket of VIetnam in the mighty Mekong Delta as well as deep into history with excrusion to Cu Chi Tunnels.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/137664_e7cbf45d.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/137664_e7cbf45d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_304481bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_2887101c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_551a5e5d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_4a9c4965.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_d229639b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_0518eeba.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_107416f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_5ec8aff2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_79dc3802.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_5f5c2657.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_985e0b3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_5f2aa89b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_410d26d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_61456aac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_4b535cb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_bc461790.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_07f75b20.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_a898e8d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_01b284c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_238dca4e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_3f6c460c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_000370fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/137664_4f7a2bc3.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"WELCOME TO VIETNAM - HANOI ARRIVAL","description":"Your trip begins with arrival in Vietnam. Your private driver will meet and greet you at the airport. You will be escorted to the hotel by the private transportation. Check-in to the hotel and get over the jet lag. \nYou can mooch through the streets of the city. Historic charm, architectural marvels, and products’ variety are splashed all over this area. \nAfter enjoying the first day yourself and return to the hotel for a relaxing sleep.  "},{"title":"IMMERSE YOURSELF IN A LOST WORLD(B/L)","description":"Today you will experience the ancient culture and history of Vietnam as well as seeing the stunning landscape and beautiful scenery when we travel to the Ninh Binh Province. This area is known as “Ha Long Bay on land” and is located 80 km South of Hanoi\n\nAM: 8:00 - 8:30. Our guide & driver will pick you up at your hotel in Hanoi Old Quarter, then leave by coach to Hoa Lu (2.5 hrs). Visit the historic capital of Vietnam and the famous ancient temples of Le and the Dinh Dynasties. Then our bus will transfer you from Hoa Lu to Tam Coc for lunch around at 12:30PM.\n\nPM: After lunch, boat trip to visit Tam Coc to see the beauty of the karst formations as you pass along their base and row into one of the many caves carved through the limestone. Then, cycle for an hour on quiet roads through villages, rice fields, rivers and rocky outcrops in Tam Coc - Bich Dong (around 5 km). Drive back to Hanoi and drop off at your hotel around at 18:00PM.\n(Meal : Breakfast, Lunch)"},{"title":"IMMERSE YOURSELF IN HANOI STREET FOOD - COMFORT SLEEP ON TRAIN TO SAPA","description":"Your expert English-speaking local guide will give you an insight into the intricacies and traditions of Vietnamese food culture including details on ingredients and historical backgrounds of popular northern dishes. We eat as we go, trying seasonal fruits and sampling a tasty French-inspired snack from a street cart.\nWalking through the maze of bustling streets that make up Hanoi’s Old Quarter, we tempt our taste buds with the famed Hanoi dish such as Bun Cha Hanoi , Banh Cuon at a local eatery. Watch in awe as the skilled chefs demonstrate for you how this tasty dish is put together. Continuing into the atmospheric heart of the Old Quarter, we wander past street stalls and quiet residential lanes where you can observe local life that has changed little since Hanoi was founded over 1000 years ago. \nOur next two snack stops are at outdoor barbecue stalls. We sit down with the Hanoi locals and sample various meat, vegetable and bread specialties that are flame grilled over hot coals for extra flavour.  It’s then time for dessert as we venture down a small alley to join in the local tradition of feasting on fresh fruit served in a cup and smothered with crushed iced and condensed milk – this specialty is one not to be missed!\nYour local guide will then take you to one of Hanoi’s best kept secrets, a hidden street food restaurant to taste top ten street foods in Hanoi is Banh My Hanoi, Vietnamese Rice Wine and famous Egg Coffee. This hard-to-find café is one of the few left in the narrow street inside the old quarter of Hanoi. Or, if coffee is not your style, a cold beer awaits! At the end of the trip you are free to continue exploring the area or your guide will assist  you with directions or a taxi back to your hotel.\n20:30 - 21:00 Pick-up at the hotel. Transfer to railway station for a night train to Sapa (schedule 21:50 - 06:30).\n(Meals: breakfast, lunch)"},{"title":"TREEKING THROUGH THE COLOURFUL LAO CHAI VILLAGE (B/L/D)","description":"Pick up at Lao Cai station transfer to Sapa for breakfast and check-in hotel (if available).\n\n12 km of trekking, visit Y Linh Ho and Lao Chai villages of the H’mong minority. after lunch at a local family in Lao Chai or in a drinking shop nearby the river bank, we keep on hiking to Ta Van village of the Dzay where we stay overnight in a local family. Here you have opportunity to experience their daily life, work and original custom.\n\nHome-stay at the Dzay local house."},{"title":"WONDERFUL LAO CHAI - TA VAN SU PAI - NIGHT TRAIN BACK TO HA NOI (B/L)","description":"Breakfast before start tour with 08 km walking to visit 2 villages of the red Dzao, the H’mong (Giang Ta Chai & Su Pan). Visit a beautiful waterfall and rattan bridge. Enjoy landscapes… through bamboo forest on the way to the main road to get the Car to return to Sapa.by bus\n\nFree at your own program until 17:00\n\nOvernight at the A/C soft sleeper cabin to Hanoi (schedule: 21:00 – 05:00). Finish Sapa Trekking Tours\n\n"},{"title":"CRUISING TO THE SPECTACULAR HALONG BAY (B/L/D)","description":"In the morning, check-out from hotel and get pick-up by the Cruise. Take the most scenic route to reach Halong Bay, taking you across the Red River Delta with emerald green rice paddies stretching for as far as the eyes can see. On arrival at Halong, you get to enjoy a cruise on the Bay to better explore the limestone rocks and the karst grottoes. \nAfter you are done with your exploration of the bay, it is time to enjoy an utterly delicious seafood lunch, after which a trip to the famous limestone cave in Ha Long bay, you’ll get to spend some time here, kayaking or swimming, so that you can get closer to the floating villages and shops. Towards the evening, you will return to the boat for an early dinner, followed by some time at leisure. You can opt to attend the activities taking part in the boat or relax for the day.\nOvernight on cruise\n(Meals: breakfast, luch, dinner)"},{"title":"WAKE UP WITH THE DRAGON IN THE BAY (B/L)","description":"Rise early for Tai Chi lesson or just to enjoy a hearty breakfast. The boat will make its way back to the port stopping at the Limestone Cave, full of stalagmites and stalactites. From here, it’s clear sailing back to the main harbor and the return Hanoi around 17:00. Then, taking the flight to Hoi An. Check in your hotel and free at your leisure time to get your energy back.\n(Meals: breakfast, lunch)"},{"title":"BEING A LOCAL IN ONE DAY (B/L)","description":"Start of the tour - 8:00 - 8:30, finish 12.00-12.30 \nWould you like to go fishing with the local fisherman? Why don't you have a fun experience with the funny basket boat. You shouldn't have any hesitance because the day will put a broaden smile at your face. It is very interesting to fish here on the river with the local fisherman as you catch your fish and we cook for you. On the Fishermen & the Waterways of a Past War Tour you will enjoy a wide range of experiences - from learning traditional fishing techniques to paddling the strange and unique Vietnamese bamboo basket boats while exploring the now tranquil coconut-palm flanked waterways of a past war. On this tour we provide an authentic social and cultural insight into the local Vietnamese way of life. As well you will take part in some hands-on activities that are fun, safe and interesting to people all of ages. \n(Meals: breakfast, lunch)"},{"title":"TRAVEL FROM HOI AN TO HUE (B)","description":"Have breakfast at the hotel then enjoy a scenic transfer from Hoi An to Hue with a private vehicle via magnificent Hai Van Pass. Also known as “The Cloudy Pass” this winding mountain road overlooks lush countryside, sandy beaches and the blue waters of the East Sea. Then cool off in the East Sea at Lang Co Beach. Arrive at your accommodation in Hue and enjoy your lovely evening.\nOvernight in  Hue.\n"},{"title":"WALK INTO ANOTHER UNIVERSE (B/L)","description":"Pick you up at hotel in Hue city around 7:30 am and head to the Phong Nha Ke Bung National park. On the way you could enjoy the surrounding views of Hien Luong Bridge, Ben Hai River, Dong Ha City and Vinh Moc Tunnels. Have a stopover at the ruins of La Vang church where blessed Virgin Mary was seen there in 1798. Than take a drive on famous Legendary Trails of Ho Chi Minh route.\nHave lunch at local restaurant. \nIn the afternoon enjoy a beautiful boat cruise on Son River, along rustic village and Limestone Mountains. After discover Phong Nha Cave by rowing boat and walking inside the cave for sightseeing amazing stalactites and stalagmites and other beautiful parts of nature along river outside. Return in Hue at about 20:00. Then transfer to the airport and take flight from Hue to Ho Chi Minh City. \nOvenight in Ho Chi Minh City \n(Meals: breakfast, lunch)"},{"title":"DISCOVER FASCINATING CU CHI TUNNELS (B/L)","description":"(Start 7:30 - 8:00; return18:30 - 19:00)\nDepart for Cu Chi tunnel, the trip will take approximately one and a half hours driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon. End trip.\n( Meals: breakfast, lunch)"},{"title":"EXPLORE THE \"RICE BOWL OF VIETNAM\" - MEKONG DELTA (B/L)","description":"(start 7:20; return around 17.30)\n7:20 am Pick up from hotel.\nKick start your day with a hearty breakfast and a trip to Mekong Delta follows, depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Then visit the fruit plantation. \nRide a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family workshops and honey-bee farm, enjoy honey tea and coconut candies. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh.\n(Meals: breakfast, lunch)"},{"title":"TIME TO SAY GOODBYE - HO CHI MINH DEPARTURE (B)","description":"Relish a healthy breakfast on the final day of your trip. Complete the hotel check-out formalities after which you can visit the local markets and buy souvenirs for your loved ones.  Later, proceed for departure and board your flight back home. Trip Ends.\n(Meals: breakfast)"}]},{"name":"14 DAYS VIETNAM FAMILY HOLIDAY","duration":14,"travelStyle":["Sightseeing","Group","Partially Guided","Easy","Holiday"],"oldPrice":0,"price":799,"summary":"Explore Vietnam on an in-depth journey that takes you from North to South. 14-day best North to South Vietnam tour has all Vietnam's top destinations – 4 UNESCO Natural and Cultural heritage sites: Fascinating Halong Bay, romantic Hue, charming Hoi An and Mysterious My Son - highlights of all Vietnam travel package. Start with the colonial charm of Vietnam’s capital, Hanoi, then travel to the natural wonderland of Halong Bay. Visit Hue to see the intricate Citadel and Forbidden Purple City, the former home of Vietnam’s emperors. Explore charming Hoian which one of the loveliest towns in Vietnam. Enjoy the lush landscape of the Mekong Delta and the bright lights and urban bustle of Saigon and more. This tour takes you deep into our beautiful country, immersing you in our rich culture and elegant landscapes. You can start the tour in Hanoi and finish in Ho Chi Minh city or vice versa with the same price.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/163815_5e044927126c0.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/163815_5e044927126c0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_8b8239f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_469f2a81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_f8124244.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_71f06899.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_b41c9b8c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_1b40c4ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_e9b0fc84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_30f41414.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_7b41f7ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_043f6cf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_38196f8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_1f00c39e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_261ebce9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_e0cc67d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_ab100f0f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_0134a91e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_131d245b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_efc09964.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_81e16a15.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_88589c84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_509e7d82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_f2dd18d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163815_0fb45c63.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi arrival (Meals: No)","description":"Our driver will pick you up from the airport or train station to the hotel. Then you will have time for discovering by yourselves the attractions of Hanoi City. Why not arrive early to see the sights? Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\nOptional Activities ( Not Included)\nHanoi Foodie Tour on foot (Traditional food tour and Old Quarter Sightseeing): https://swallowtravel.com/tour/hanoi-lovers-foodie-private-tour-ct500.html.\nMy Village Show (Vietnamese Bamboo Circus with live traditional music ):  https://swallowtravel.com/tour/my-village-show-ct504.html.\nNight 1: Overnight at the hotel in Hanoi"},{"title":"Hanoi - Halong – Halong Cruise (B,L,D)","description":"Have breakfast at your hotel.\n\n7.45-8.30: Pick-up at the hotel then travel to the spectacular World Heritage site of Halong Bay in the Gulf of Tonkin (approximately four hours) with a short break on the way. The bay is dotted with sandy coves, grottoes and 1,600 limestone islands, which have been formed over millennia by wind and water erosion.\n\n12.00 – 12.30: Embark on Lavender Cruise followed by a short cruise briefing and enjoy welcome-drink. Check in the cabin.\n\n13.15: Enjoy lunch with sampling regional fresh seafood while cruising on exquisite water, passing Incense Burner island, Fighting Cock islet, Stone Dog… Lavender Cruise will bring you to explore Ha Long Bay on the most wonderful route where just a few cruises go through.\n\n15.00-16.30 Do kayaking through the magnificent landscape with Limestone Mountains, visit Titov Island and swimming or just relaxing on the sun-deck for fantastic views at The Bay. After kayaking, you will be back to Lavender Cruises and join sunset party.\n\nThe cruise passes by Soi Sim Beach, “Rang Dua” Island to sleeping area near The Surprising cave.\n\nJoining our Cooking Class in the restaurant. Let’s see how to make the fresh/fried spring rolls and mix fish-sauce.\n\n19:30: Under the magnificent night sky, our set-menu dinner is served with a variety of Vietnamese and Asian foods.\n\nEvening activities:\nJoin squid fishing on boat with our crews, playing card, karaoke or laze yourself with our happy-hour drinks at the bar. To end the day, spend a peaceful night aboard the boat beneath the night sky.\n\nNight 2: Overnight on Lavender Cruises"},{"title":"Halong Bay – Hanoi (B,L)","description":"06:15: Morning exercises on the Sun-deck. \n\n07:15: Have breakfast with Coffee, tea and Bakeries on board. \n\n08:00: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong. \n\n09:30: Check out time. Then relax on the sun-deck or inside the restaurant to enjoy the bay’s scenery. \n\n10h15: Enjoying a traditional Vietnamese lunch while cruising back to the pier. \n\n12:00: Check out cruise. Our car will be at your disposal to pick you up then drive back to Hanoi. \n\n16:30: Arrive in Hanoi. End of the trip! \n\nNight 3: Overnight at the hotel in Hanoi"},{"title":"Hanoi –Free and easy (B)","description":"You have breakfast at the hotel then have the whole day free in Hanoi to relax, go shopping and explore this city by yourself. Check out your reflection in beautiful Hoan Kiem Lake, wander along shaded. Museum-wise, why not visit the Mausoleum of Ho Chi Minh, drop into the serene Temple of Literature or get arty at the city's Fine Arts Museum.\n\nOptional Activities (not included)\n\nHanoi City Tour : https://swallowtravel.com/tour/hanoi-city-group-tour-ct422.html\n\nHoa Lu Citadel – Tam Coc Boat Trip Tour: https://swallowtravel.com/tour/hoa-lu-tam-coc-group-tour-ct425.html \n\nTrang An Grottoes – Bai Dinh Pagoda Tour :https://swallowtravel.com/tour/trang-an-bai-dinh-pagoda-group-tour-ct428.html\n\nNight 4: Overnight at the hotel in Hanoi     "},{"title":"Hanoi – Night train to Hue(B)","description":"You will have breakfast at the hotel then have free time to explore Hanoi city till our driver picks you up then leaving to Hanoi railway station. You will catch a night train to Hue city.\nNote: There are 4-soft berth per tourist cabin with A/C. You may share it with other passengers. It takes around 13 hours from Hanoi to Hue. Please contact us if you want to upgrade to the private train cabin or internal flight from Hanoi to Hue.\nNight 5: Overnight on night train"},{"title":"Hue arrival – Free and easy (Meals: No)","description":"Arrive into Hue and transfer to the hotel. Once the imperial capital of Vietnam, Hue holds the treasures of the country’s royal past. You’ll have free time to rest or explore Hue city by yourself.\nNight 6: Overnight at the hotel in Hue"},{"title":"Hue city full day tour (B,L)","description":"08:00am - 08:30am: Our tour guide will pick you up from your hotel then start the tour.\nIn the morning, we will accompany you to visit these places:\n12:30pm: Have lunch at local restaurant\nAfter lunch, we continue to visit:\n04:00pm - 04:30pm: We will drop you off at your hotel in the center of city. Tour ends.\nNight 7: Overnight at the hotel in Hue"},{"title":"Hue – get transferred to Hoi An by private car (B)","description":"You will have breakfast at the hotel then get transferred by private car to Hoi An. We will drop you off at Lap An Lagoon, Lang Co Beach, Hai Van Pass, Marble mountain for taking photo if you request. Arrive Hoi An. Drop off at hotel. Then you have free time to explore Hoian ancient town by yourself. Don't hesitate to contact us if you want to join us any optional activities.\nOptional Activities:\nhttps://swallowtravel.com/tours/hoi-an-day-tours-c464\nNight 8: Overnight at the hotel in Hoian"},{"title":"Hoi An - My Son Sanctuary - boat trip on Thu Bon river or Tra Que Cooking Class Tour (B,Light Lunch)","description":"Have breakfast at your hotel.\nYou can pick one option as below:\n\nOption 1: My Son Holly Land and Thu Bon Boat Trip (Light Lunch)\n\n8:00 – 8:30: We will pick you up at your hotel\n\n8:30: Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n\n9:45: Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4th to 15th century.\n\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area your guide will explain the history of the religious site which served as a burial place for the Cham monarchs centuries ago.\n\nAround 12:00: Commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village. You will have a soft lunch (Quang-style noodle with pork and shrimp) served on boat.\n\n14:00 - 14:30: The boat trip will finish at the dock in the old town and back to your hotel.\n\nOption 2: Tra Que Cooking Class and Foot massage ( Lunch)\n\n8:00 Local guide pick up at the hotel, then you will go bicycle to Hoi An’s colourful central market. Here you will have the opportunity to interact with the local sellers and learn about the ingredients you will use in the cooking lesson later.\n\n9:00 Ride pass small roads, rice padddy fields, take pictures of water buffalos, cow or farmers on daily working at their fields and fish – ponds. Explore many beautiful views of VietNam country side meet many warm hearted local people. They will pass through the bendy small narrow roads in the village to one of the typical local houses\n\n10:00 Take a rest with special welcome drink. You will be taken around the herbs garden where local farmers work on their field using organic methods from 300 years ago. Then you will enjoy foot massage with local herbs (lemongrass, basil thai….)\n\n10:30 Learn the traditional ways of preparing and cooking Vietnamese food.( Made some flowers and animals by vegetables for decoration). After the lesson, enjoy what you have cooked.\n\n12:30 - 13:00 Return to the hotel.\n\nNight 9: Overnight at the hotel in Hoian"},{"title":"Hoi An – Free and easy day (B)","description":"You will have breakfast at the hotel. Today you have a free day to relax, go shopping or take a free bicycle to look around Hoian ancient town and the surrounding countryside. Many people like to just wander around and soak up the ambience of the town, perhaps visiting a couple of the old traditional Chinese mansions. Others shop till they drop, spend time at the tailors or head out to the beach outside town, which has glorious white sand.\n\nOptional Activity (Not Included)\n\nBa Na Hill – Golden Bridge Day Tour: https://swallowtravel.com/tour/bana-hill-golden-bridge-day-tour-with-buffet-lunch-ct489.html\n\nNight 10: Overnight at the hotel in Hoian"},{"title":"Hoi An – Danang- Fly to Ho Chi Minh city (B)","description":"After breakfast at your hotel, you are free till our driver come to transfer you to the airport. Today you will have a flight to Ho Chi Minh city and stay at the most touristic area of Ho Chi Minh City.\n\nNight 11: Overnight at the hotel in Ho Chi Minh"},{"title":"HCM – Mekong Delta deluxe group (B,L)","description":"A trip to Mekong Delta to immerse yourself in the natural beauty and the rich culture of the vibrant southern Delta region. Boating down the river to experience the local life, fishing port, fishing floating house, enjoy the local folk song music and seasonal fresh fruit.\n\n7:30 - 8:30: Leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Upon arrival, visit Vinh Trang pagoda which sated back to the late 19th century. Then  boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation.\nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop.\n\nHave lunch at local restaurant. Break time.\n\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. \n\n17:30: Drop off at your hotel. Trip ends.\n\nNight 12: Overnight at the hotel in Ho Chi Minh"},{"title":"Ho Chi Minh-Cu Chi tunnel deluxe group (B,Light Lunch)","description":"7:45-8:30: Our tour guide and driver will pick you up at your hotel and then start driving to Cu Chi which located 70 km from the Ho Chi Minh City Center to the Northwest.  Cu Chi was known as the “area of steel” in the war time, and the tunnel systems were over 200km, which was considered the unbreakable underground village in the Vietnam-American war. It is legendary for its network of tunnels and is a popular destination for both Vietnamese and foreign visitors.\n\nThe trip to Cu Chi will take approximately one and a half hours bus driving.\n\nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served.\nBreak time for relax or time for those who want to try the real shooting gun.\n\n13:00: Return to Ho Chi Minh city. Have light lunch at the restaurant\n\n14:30: Get transferred back to your hotel. Trip ends.\n\nNight 13: Overnight at the hotel in Ho Chi Minh"},{"title":"Ho Chi Minh – Back Home (B)","description":"Have breakfast at the hotel then have free time until our driver comes and transfers you to the airport. Trip ends.\nPlease contact us if you want to extend your stay or want to visit other places in Vietnam, Cambodia, Laos, Myanmar and Thailand"}]}]