[{"name":"Ben Tre Homestay - 3 Days","duration":3,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":304,"summary":"Minimum 2 people per booking.\nBooking at least 30 days in advance.\nA three-day boat and bicycle tour that gives you hands-on experience of riverside life in this vast Mekong Delta region. Learn how residents make their livelihoods on and alongside this mighty river and help them out with some of their duties! From fishing using bamboo traps to farming the land, cooking with your homestay hosts and much more.","highlights":["Sail and cycle for a hands-on experience of riverside life in the Mekong Delta","Learn how residents make their livelihoods on and alongside this mighty river","Fall in love with the cultures and traditions of the local people"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/33746_bef3a220.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/33746_bef3a220.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_ebadea4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_7a6aef59.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_c4e8cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_32acc4bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_c89263ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_22e634e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_c09bbd1e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_32a5b40a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_a16183ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_b16270ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_c26b0195.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_7f97ea94.jpg","https://cdn.tourradar.com/s3/tour/1500x800/33746_2ac61313.jpg"],"destinations":["Ho Chi Minh City","Ben Tre"],"timeline":[{"title":"Day 1: Cai Be Floating Market - Ben Tre (-/L/D)","description":"We will depart from Ho Chi Minh City for Tien Giang and travel for around 2 hours. Upon arrival in Tien Giang, we will travel by boat to Cai Be Floating Market. The boat trip will take you along the where you will have a glimpse into the life of the working locals. We will have lunch at a local house. In the afternoon, you will be able to try your hand at fishing with traditional tools by casting nets and laying traps on the canal. Then, you can help to prepare dinner with the host. Enjoy dinner. Overnight at the homestay."},{"title":"Day 2: Live The Life Of Local People In The Countryside (B/L/D)","description":"After breakfast, travel by bicycle to a local market. It is similar to the flea market where local people gather together and trade. Afterward, we will return to the homestay, where you will participate in farming with the local people to experience the work of farmers in the area. Lunch will be served at a local home. In the afternoon, you will have the opportunity to dress in the typical style of Southerners in Vietnam. You will bail out water and catch fish in the traditional outfits. Next, you will lend a hand in preparing dinner with the host. Relax after dinner on a hammock near the river shore. Surround yourself with peacefulness and quiet that the city cannot offer. Overnight at the homestay."},{"title":"Day 3: Cai Mon Orchard Garden (B/L/-)","description":"We will visit the Cai Mon Orchard Garden (also known as the “kingdom of fruits”), in Ben Tre Province. Continue your trip to visit the Cai Mon Church - one of the oldest churches in the Mekong Delta. According to the history, Caïman, French word was read off by Vietnamese equivalent “Cai Mon” because in the past there were a lot crocodiles here. This church was built in the 1800s by a French priest. This church is famous for its unique architecture works: steeples, main hall… The last stop on this tour is the potted plants and saplings in Vinh Bac. Have lunch, back to Ho Chi Minh city."}]},{"name":"Private Package Hanoi 4 Days","duration":4,"travelStyle":["Coach / Bus","Family","Custom","Private","Partially Guided","Holiday"],"oldPrice":0,"price":499,"summary":"Asia Focus Travel provide package tour 4 days 3 nights for clients has limited the time to visit Hanoi and this package you can visit Ho Chi Minh House and Ho Chi Minh's Mausoleum\nVisit to Buddhist Tran Quoc Pagoda on West Lake\nHa Long Bay and Ninh Binh \nDeparture everyday. \nSize of group depend on your group: min from 2 people and max 10 people.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/143453_fda19d4b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/143453_fda19d4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_90288bdf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_c37ab0a4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_3738341c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_f306d654.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_c4657193.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_64232fa0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_c52bd948.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_58b70ea4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_61afb890.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_8d55e67f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_29e2568d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_cde8ee37.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_f2eaa61d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/143453_50c7701f.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy\nOvernight in Hanoi."},{"title":"Day 2: Hanoi - Ha Long Bay ( Included: Breakfast, Lunch)","description":"08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields\nto Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:15 Board our Halong Cruise and start cruising among limestone islands and photograph of\nstunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life.\nCruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n15:00 Visit Thien Cung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n16:15 Stop at the harbor again to catch the bus to Hanoi.\n20:00 Arrive back in Hanoi.\nOvernight in Ha Noi\n"},{"title":"Day 3: Hanoi - Ninh Ninh - Hoa Lu - Tam Coc (Included: Breakfast, Lunch)","description":"08:30 Meet your tour guide at suggested places around Hanoi Old Quarter.\nDepart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs.\nArrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century. \nVisit temples of two dynasties of Dinh and Le with a very unique architectures in the old time. \nLearn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century. \n12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby.\nBoard the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi. \n18:00 Arrive in Hanoi. \nOvernight in Hanoi "},{"title":"Day 4: Hanoi City Tour - Departure (Included: Breakfast, Lunch)","description":"08h30: Pick up at your hotel and then drive to Tran Quoc Pagoda – the oldest pagoda in Ha Noi built in the 6 th century.\n9:30: Visit Ho Chi Minh complex, you have a chance to see the embalmed body\nof Ho Chi Minh then walk around the garden to see 2 houses where he lived &amp; worked\nfrom 1954 to 1969. Then visit One Pillar Pagoda where worships the Godess of Mercy –\nIt is the most unique padoga in the world\n11h00: Continue visit Temple of Literature – the first university of Vietnam,\nestablished in the 11 century.\n12h30- 13:00: Have lunch at our restaurant. You have an opportunity to enjoy Vietnamese\ncuisine \n14:00 visit Bat Trang ceramíc village to explore the daily life of the local &amp; learn about the\nprocess how to make a perfect product.\n15h45: Leave for Hoan Kiem Lake to visit Ngoc Son Temple, which honors General\nTran Hung Dao who defeated the invader in 13 th certury.\n16h15: come back to your hotel\nDepend your flight to arrange the driver to pick you up at your hotel transfer to the airport take flight to home or another destination. \nTour finished!"}]},{"name":"Hanoi and Ha Long Bay 4 Days 3 Nights","duration":4,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":290,"summary":"High light for this package:\n•\tLearn more about the history of Vietnam and the culture of the local people\n•\tExperience the uniqueness of local life\n•\tConquer the breathtaking set-up of approximately 2000 different islands on Halong bay – 1 of New 7 Wonders in the World.\nThere is a Vietnamese saying goes: Halong bay – “Descending Dragon” and Hanoi – the heart of Vietnam. This 4-day tour (2 days Halong Bay from Hanoi) includes the popular Halong classic wonders and the highlights in Hanoian culture.\nEnjoy the deep-rooted cultural and traditional music show in Hanoi, relax at breathtaking karst scenery in Halong bay, taste the exquisite lifestyle by being a guest in a traditional-styled Vietnamese family with 3 generations living in one house. Let’s immerse into the rich and diverse Vietnam Hanoi to Halong Bay.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/134506_4cab8ca4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/134506_4cab8ca4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_0810edc7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_3ca28eb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_4ff2696e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_2edb7139.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_77b649f6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_b3b45f28.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_a58c7184.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_4c6835df.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_c0042eed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_ee7b900a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_3052a938.jpg","https://cdn.tourradar.com/s3/tour/1500x800/134506_f79c987c.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Ha Noi Arrival - City Tour by Private ( Lunch)","description":"Welcome to Vietnam: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited.\nIn the morning\n•\tOn your arrival in Hanoi airport, you will be warmly welcomed by our guide and driver then transferred to your hotel in Hanoi\n•\tYou will visit a local restaurant for lunch\nIn the afternoon\n•\tAt 14:00, you will firstly leave for The Tran Quoc Pagoda, which is the oldest Buddhist temple in Hanoi, is located on a small island near the southeastern shore of Hanoi’s West Lake. Then you may spend time walking around the West lake to enjoy the fresh air of the biggest lake in Hanoi\n•\tNext you will be transferred to Dong Xuan market. This is the largest covered market of Hanoi where the wholesale traders sell everything from clothes, household goods to foodstuffs.\n•\tWalking along the street you will reach Temple of Jade Mountain sitting on a small island in the northern part of Hoan Kiem Lake and dedicated to the King Tran Hung Dao\n•\tAfterward, you will sit in front of Cyclo to move around the old quarter and experience the local life in 30 minutes. The cyclo tour will take you back to your hotel\n"},{"title":"Hanoi - Halong Bay (Breakfast, Lunch, Dinner)","description":"8:00- 8:30 Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12:00- 12:30 Embark on the Cruise followed by a short cruise briefing.\n13:00 Savor a delectable lunch as Ha Long cruises among the limestone islands.\n14:00- 16:00 Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay\n16:00- 17:00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17:00- 17:30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way\n17:30- 19:00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19:00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on Ha Long Cruise in the middle of Ha Long Bay\n"},{"title":"Day 3: Halong Bay - Hanoi (Breakfast, Lunch)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi\n17:00 Arrive Ha Noi\nOvernight in Hanoi "},{"title":"Day 4: Hanoi Departure (Breakfast)","description":"Free and easy in Hanoi. \nDepending on your flight time, our driver will pick you up at your hotel and transfer you to the airport for your departure flight."}]},{"name":"Discover Vietnam 17 Days 16 Nights From North to South","duration":17,"travelStyle":["Discovery","Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1109,"summary":" Vietnam – a beautiful country in South East Asia, might still trange with you. And we would love to bring you the real Vietnam with 17 days from North to South. You have the chance to live in nature and beauty of Halong Bay – World Natural Heritage, stunning terace rice fields in Sapa, visit Hoa Lu ancient capital in 10th century, Hoi An old town with colourful lanterns, floating daily life in mekong River…All with leave in your mind as an increadible memories. Let’s contact Vietnam Real Tour for your best holiday in Vietnam. If you wanna travel from South to North, please contact us! ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/113934_5266b1c1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/113934_5266b1c1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_bb54b298.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_89eec32a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_93625561.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_6194b81d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_7d09a80c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_c0567031.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_3ffb917d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_163eb075.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_595a3686.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_28349fe2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_ef0296d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_75ae89f3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_f1741e5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_401b5bf6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_331a0704.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_9bc2458c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_caaeb6ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_ef9ca0aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_2318b1e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_53c7b3e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_000b31a5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_bd03f96e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/113934_7d1d9c64.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi arrival – Airport pick up – Hotel check in ( Meals: No )","description":" \nDriver of Vietnam Real Tour will pick you up the airport and then transfer you to the hotel in Hanoi centre – the most exciting place for tourist.  After that you are free to visit Hanoi City by yourself.\nNote: Hotel check in time is 13:00 P.M.\nOvernight at hotel in Hanoi"},{"title":"Day 2: Hoa Lu ancient capital – Tam Coc – Cycling 1 day ( Meals: B, L )","description":" \n8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2  Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful  and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi"},{"title":"Day 3: Hanoi – Halong bay – Overnight on cruise ( Meals: B, L, D )","description":" \n8:00 – 8:30: Tour guide and bus pick you up at the hotel. Heading to Halong bay after 4 hours in bus with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on boaoard with Welcome drink. Check in the cabin and enjoy the traditional Vietnamese Lunch.\nAfter lunch time, free time to sunbthing on the sundeck, photo hunting while cruising among the hundred of mountains.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful cave in Halong Bay.\n16:00: Heading to Ti Tov island where you can hike up to the top to view whole bay, sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and Wine.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can experience to practice by yourself.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attand the Squid fishing game\nOvernight on board"},{"title":"Day 4: Halong Bay – Kayaking – Hanoi ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast\n8:15: Going to do Kayaking among mountains, explore the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nThen, leisurely time to rest on sundeck to view the bay.\n11:00: Brunch will be served. Enjoy the meal while cruising back to Halong harbor\n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi"},{"title":"Day 5: Sapa – Ylinh Ho – Lao Chai – Ta Van village ( Meals: B, L, D )","description":" \n12km trekking through the terrace fields to homestay.\nOur our guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance to trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also tour guide will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, not tourist.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepaire the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other. Learning how to cook the local food, custom and tradition of H’Mong ethnic.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house."},{"title":"Day 6: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":" \nYou can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tel your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields.\nGet back to Sapa town by shuttle bus.\nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\nOvernight at hotel in Hanoi"},{"title":"Day 7: Hanoi free time – Night train to Hue ( Meals: B)","description":"Today, you are free to visit Hanoi Old Quarter by your feets until the transfer you to Hanoi train station for the night train to Hue.\nYou can take a time to visit Ho Chi Minh mausoleum, Temple of Literature – First University of Vietnam, Hoan Kiem Lake with Ngoc Son temple.\nTrain takes about 12  hours, along the train trip, you have the chance to see how beautiful is Vietnam with countryside scenery, local farmer’s life, simple and warmly villages…\nOvernight on the train"},{"title":"Day 8: Hue arrival - Hue city tour ( Meals: L )","description":" \nDriver and tour guide will pick you up at Hue train station and explore the ancient capital of Vietnam. Visit Imperial capital during Nguyen Dynasty: the Royal Citadel, Forbidden City, Hue Royal Museum and the seven – storey Thien Mu Pagoda on the riverbank, you get on the boat for a sight-seeing along the Perfume River. After the tour, the boat will drops off you at the Hue River Bank in the city center.\nAfter having lunch, you still have the chance to visit famous sites:\nEnd the Hue city trip at the hotel in Hue city. You check in the hotel and enjoy the lovely evening in Hue.\nOvernight at hotel in Hue"},{"title":"Day 9: Hue – Hai Van giant Pass – Hoi An ( Meals: B )","description":" \nAfter breakfast, driver will pick you up at your hotel to visit the most breathtaking and giant Hai Van Pass. You do not only have the opportunity to see the nice sightseeing along the way to Hoi AN, but also you can see how panorama is this Pass. Stopping time on the Pass road to take photo of stunning and giant valley of Pass will be an increadible choice what everyone never wanna miss. You can see how small people are while standing in Mother huge nature.\nArrive the hotel in Hoi An. Check in the hotel and have free time to visit Hoi An ancient town with a lot of lanterns, Pagoda bridge, Old houses…\nOvernight at hotel in Hoi An"},{"title":"Day 10: Hoi An – My Son sanctuary 1 day ( Meals: B, L )","description":" \n08:00 - 08h30: Our bus and tour guide will pick you up at your hotel/stay in Hoi An. Leaving Hoi An crossing the Cua Dai bridge with its spectacular views of the Hoi An river system, mountains and Cham islands, we arrive at the fishing village, alive with activity as the market traders sell their evenings catch, providing some great photo opportunities.\n09h45:Arriving at My Son, this \"Valley of Kings\" as described by French historians was once the capital of the Chăm Pa Kingdom from the 4thto 15thcentury.\nFollowing a traditional dance performance, your walking tour to the Cham ruins begins with a short ascent along a jungle bordered track. While you explore the area  your guide will explain the history of the religious site which served as a burial place for the Cham monarchs centuries ago.\nAfter Lunch time, commence the drive back to Hoi An to start our boat trip on Thu Bon river. Departing from Nguyen Hoang dock, your boat journey of approximately two hours will take you past Duy Hai fishing village, Tra Nhieu - weaving village, Kim Bong carpentry village and Cam Thanh coconut jungle village.\n15h30: The boat trip will finish at Nguyen Hoang dock in the old town. You will be free to explore the old town or return to your hotel by your own means.\nOvernight at hotel in Hoi An"},{"title":"Day 11: Farming & Fishing Trip ( Meals: B, L )","description":"09:00-09:30 AM: Tour guide meet you at your hotel, cycle to a local farming village travelling along picturesque country roads, you have a chance to capture some amazing pictures with the farmers on the field, fishpond and the buffalo, you can also try to riding the water buffalo if you love it.\nKeep riding to local home. Here, you will be welcome local water \"En water\". Then, the farmer will take you to the boat station, boarding across the coconut-palm flanked waterways far from the traffic the motor scooters, and the noises the city to learn and try how to use the local traditional fishing techniques using round and cast nets and paddle the Vietnamese bamboo basket boats. \nAfter that, you will be shared the daily work in the rural by local farmers, you will join in the activities of the farmers – collecting seaweed fertilizer, sowing, raking, watering and picking. \nLeaving the garden, you will back to the farmer's home and enjoy foot massage with the local herbal treatment.\nAfter lunch, take a cycling back to you hotel.\n13:30-14:00: Arrive your hotel. You get the free time to walk around exploring the beauty of Hoi An old town. \nOvernight at hotel in Hoi An. \nInclusion: Mini-van for hotel pick up and drop off only in Hoi An; English Speaking guide; Bicycles; Helmet; Boat cruise plus Vietnamese bamboo basket boats; Enjoy Basket boat dancing performance; Origami teaching such as bird, grasshopper, flower and etc; Light traditional local rice dishes at local farmer house; Lunch on boat cooked by Captain Cook; Many, many photo opportunities\n"},{"title":"Day 12: Hoi An free time ( Meals: B )","description":" \nIf you wanna swim on the white and yellow sandy beach, it is a good time to relax on the beach in Hoi An. Sunbathing on the sunny beach, diving in the pure water, taste some local foods on the beach. It is hard to to second time in our life.\nOvernight at hotel in Hoi An"},{"title":"Day 13: Hoi An – Da Nang airport - Fly to Ho Chi Minh city ( Meals: B )","description":" \nToday, you can spend the leisurely walking time in the old town to take photo, buying some good clothes before goinf to Da Nang airport. Driver will transfer you to the airport for the flight to Ho Chi Minh city.\nOur driver will pick you up at Tan Son Nhat airport and transfer you to the hotel in Ho Chi Minh city.\nOvernight at hotel in Ho Chi Minh city"},{"title":"Day 14: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30 - 08:15: Driver and tour guide will pick you up at your totel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. Return to Ho Chi Minh City.\n17:00: Drop you off at your hotel.\nOvernight at hotel in Ho Chi Minh city"},{"title":"Day 15: Ho Chi Minh city free time ( Meals: B )","description":"How to see the daily life of the biggest city in Vietnam? You can take the time to walk slowly around. Here, you can see the difference between North and South. Visit some famous places in the city such as Ben Thanh market, Reunification Palace, President of South Vietnam until end of the war in April 1975, Notre Dame Cathedral, the Old Central Post Office. Tour of Chinatown and Thien Hau & Quan Am pagodas…\nOvernight at hotel in Ho Chi Minh city\n\n"},{"title":"Day 16: Cu Chi war tunnel ( Meals: B, L )","description":"Cu Chi tunnel system was built by the Communist guerrilla troop knows as Viet Cong during the Vietnam War to combat the American colonial and South Vietnamese force. The system is of over 220 km of tunnels became a legendary and special architecture lying deeply underground. The tunnels were a function, including a lot of trap doors, storage facilities, specially constructed living areas, hospitals, command centers & kitchens. Nowadays, Cu Chi tunnel became very popular for both of Vietnamese and foreign travellers.\n08:00 - 08:30am: Our tour guide and driver will pick you up at your hotel and then start drive to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destructions, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was\" A Free Target Zone \". The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants.\nhere you can try to Crawl through tunnels (do not apply for very fat people and very old people)\n12:00 Have lunch in a local restaurant\n13:00 Back to Ho Chi Minh City\n14:00 Arrive in your hotel\nOvernight at hotel in Ho Chi Minh city"},{"title":"Day 17: Ho Chi Minh – Flight out ( Meals: B )","description":"Enjoy the Ho Chi Minh city by your own until the transfer you to Tan Son Nhat airport for your flight out. Ho Chi Minh is the biggest city in Vietnam with several things to explore. From the local life on street to the famous monument such as Ben Thanh Market, you have a great time visit all. Then, driver will transfer you to Tan Son Nhat airport for your flight out. Trip ends.\nNote: \n- If you are Solo traveller booking Share Room, you will stay at Share Dorm Room during your vacation.\n- This is group joining, there is a different group each trip during your vacation.\nWho should participate? - This tour is suited for all, including children as well.\nPrice structure: - Price quoted is based on per person basis. \nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package!"}]},{"name":"Easy Vietnam 16 Days","duration":16,"travelStyle":["Self-Guided","Group","Holiday"],"oldPrice":0,"price":962,"summary":"Start in Ho Chi Minh City and end in Hanoi! With the Self-Guided tour Easy Vietnam 16 Days, you have a 16 days tour package taking you through Ho Chi Minh City, Vietnam and 6 other destinations in Vietnam. Easy Vietnam 16 Days includes meals, transport and more.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/163821_ad5574b8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/163821_ad5574b8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_c3ec428b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_cd69c69c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_ac59d49b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_958dfddb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_b4483bdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_a0ff3f65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/163821_da6d06d8.jpg"],"destinations":["Ho Chi Minh City","Dalat","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Arrival in Ho Chi Minh City with Airport Transfer","description":"Welcome to Ho Chi Minh City, upon your arrival at the airport, please wait outside the exit gate and our representative who will be holding a placard with your name will pick you up and bring you to the hotel in Ho Chi Minh City.\n\n"},{"title":"Cu Chi Tunnels Tour","description":"Pick up from your hotel to transfer to Cu Chi tunnel. The trip to Cu Chi will take approximately one and a half hours bus driving. Upon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. Break time for relax or time for those who want to try the real shooting gun. Return to Saigon."},{"title":"Cai Be Fullday Market & Tan Phong Island- Mekong Delta Tour","description":"Full day special tour Cai Be Floating market - Vinh Long that Mekong Delta Private Day Tour will bring you to join real life local people. For those who want to see the floating market within one day this trip is the perfect choice for you. Travel to the heart of the Mekong Delta, this trip is your chance to experience the famous floating market of Cai Be and see locals trading fruit and other produce direct from their boats as well as witness everyday life in the watery world. Following is the visit to Tan Phong Island, the green pearl of Vinh Long town where you can immerse yourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese dishes.\nSee the seasonal picturesque flat rice fields and witness the daily activities on the Cai be floating market. Wander into the small villages to visit the orchard, fruit plantation and enjoy the traditional southern Vietnamese folk music, overnight homestay with local farmers, cycle in the island paths and bring home nice pictures of Mekong delta."},{"title":"Saigon to Da Lat (Bus Transfer)","description":"Today, you will take a bus from Ho Chi Minh City to Dalat. After arriving, please make your own way to your hotel.\n"},{"title":"Canyoning Tour","description":"EXPERIENCE to live stronger, that's the message we want to send to the young people who desire to conquer, experience and dedicate. Hidden in a gentle, romantic and sluggish Dalat, There is another Dalat, a city fiercely challenging. Life is plenty of difficulties but do not let it overturns us, this is your world.  The fear, the weakness will push you to the limit to let you know who you are and what you can do and that is reason why we organize The Dalat Canyon Tour. START:  Depart at your hotel in Dalat,we take you along picturesque road to the South of the city, head the Datanla waterfall. Stop at Gathering point,You will learn the basics of knot tying, harness wearing and abseiling techniquesto begin conquering the 10km adventure activities hide deeply in the jungle with this challenge to other challenges. Station 1 - Dry cliff at 18m This is the first activity after we mastered the skills to rappel down the steep cliffs. Quiver is for sure because of the first time to test your skills but very excited to launch yourself into the air and landed safely. Station 2 – Water sliding  By the time, the stones have been eroded by the water, creating idea venue for us to water slide down into rapid water. Gently lean over, hands keep the shoulders, take a deep breath is when you slide down the water pulled from the wall, pushing you into the depths of water then up in the water with an excited feeling. Station 3 - “Sky” Falls Water pours down massively. Negative thoughts appear in your head and against you to challenge your mental power. All you need now is a strong heart, a cool head and be alert to face and conquer the human weakness in you. Station 4 – Being a Batman This is a real challenge for you to take jumps from 7m and 11m cliff into a deep lake. Do not hesitate, be strong, nothing can stop your steps. It would be a major change in thinking when you accomplishing. Station 5 – “Washing Machine” You will walk down until your back touches the waterfall, take a deep breath to increase hot blood up to your brain, straight the legs, wide eyes and relax your body. It will spin you around, clean your body and push you out of the falls before hiking up to thehighway and meet our vehicle for transport back to town. Duration: From 4 – 5 hours Activites: Hiking, swimming, rappelling, free jump from high cliffs, water sliding... The tour included:  - Pick up & drop off at hotel - Lunch - Professionally trained guides, all necessary forest and tourist permits, first aid kit,fruit snack, purified drinking water, transport,the best canyoning Equipments.  The tour excludes:  - Drinks - Personal expenses - Tipping/ Gratuities (optional)\n\n"},{"title":"Da Lat to Nha Trang (Bus Transfer)","description":"Today, you will take a bus from Dalat to Nha Trang. After arriving, please make your own way to your hotel.\n"},{"title":"Free Day","description":"Day free for Leisure"},{"title":"Nha Trang to Hoi An (Sleeper Bus)","description":"Today, you will take a bus from Nha Trang to Hoi An. After arriving, please make your own way to your hotel"},{"title":"Free Day","description":"Day free for Leisure"},{"title":"Hoi An to Hue (Bus Transfer)","description":"Today, you will take a bus from Hoi An to Hue. After arriving, please make your own way to your hotel"},{"title":"Imperial City Tour (Hue)","description":"At 7.45 am, our guide and driver pick up you at your hotel and then take a full day to discover Hue: visit Emperor Minh Mang's Mausoleum, Emperor Khai Dinh's Mausoleum, Performing Programs Of VO KINH VAN AN - Vietnam Traditional Kungfu and Emperor Tu Duc‟s Mausoleums. Stop on the way to see how conical hats and incense sticks are made. Lunch at a local restaurant.  In the afternoon, visit Imperial capital during Nguyen Dynasty and the seven – storey Thien Mu Pagoda on the riverbank. Return by boat on the gentle Perfume River and do not miss the sunset on the river. You will come back your hotel. End of Tour.  The tour included:  - All entrance fees to destination - Lunch in a restaurant with local Vietnamese food - English speaking tourguide - Car transfer & boat trip  The tour excludes: - Tips - Drinks - Personal expenses - Tipping/ Gratuities (optional)"},{"title":"Hue to Hanoi (Sleeper Bus)","description":"Today, you will take a bus from Hue to Hanoi. After arriving, please make your own way to your hotel"},{"title":"Free Day","description":"Day free for leisure"},{"title":"Halong Bay 3 Days / 2 Nights Trip - Party Cruise","description":"Departure: Your Hotel in Hanoi Pick up Time: 8:00 - 9:00 am  Today you will be picked up from your hotel in the Hanoi Old Quarter between 8:00 - 8:30 am depending on the location of your hotel. Please be ready and waiting in the lobby from 8:00 am. Take a scenic 3.5-hour bus ride through rural Vietnam en route to Halong Bay arriving at the marina at around noon.  You will board your Party Cruise, get settled into your cabin and then have a traditional Vietnamese lunch on board as you set sail into the calm waters and stunning scenery of Halong Bay. Pass by several unique islets in the form of different animals and objects; Duck Islet, Swan Islet, Fighting Cocks Islet, Incense Burner Islet and Stone Dog Islet.  At about 3:00 pm visit an incredible and giant cave called the “Heavenly Palace” where you can take a guided walk through the caverns to see ancient stalagmites and stalactites. Then continue your cruise around the bay between the hundreds of uniquely formed limestone islands and rock formations. Go for an hour-long kayaking trip through a tunnel to explore the floating village of Ba Hang and experience the unique way of life here.  Board your cruise ship again around 5:30 pm for a refreshing snack of tropical fruit accompanied by a happy hour glass of wine and some relaxing music. Dare your new friends to take a refreshing dive into the tranquil waters of Halong Bay from the top deck of your cruise boat. Enjoy the scenery and take a shower before dinner is served at 7:30 pm. Enjoy and take part in the fun and games of the evening with the multi-cultural music program with lively dancing and singing!"},{"title":"Halong Bay 3 Days / 2 Night Trip - Party Cruise","description":"Halong Bay - Cat Ba Island (B/L/D)  Wake up this morning to the peaceful atmosphere on the bay with the gentle waves and cheerful seabirds singing their morning songs as the sun rises over the horizon. Have breakfast at 7:30 am and enjoy the breathtaking scenery of Halong Bay at dawn.  Today you will transfer to Cat Ba island by bus at around 9:30 am and have the chance to explore Lan Ha Lagoon where you can go swimming, snorkelling or rock climbing and enjoy the private beach of Freedom Island. Have lunch at 12:00 pm and then spend the afternoon enjoying games and activities like kayaking, beach volleyball, football, foosball, billiards or simply relaxing and enjoying the day with friends.  Have dinner this evening and enjoy the fun of dancing and singing karaoke in the restaurant bar or walking on beach. The party continues into the wee hours tonight! Overnight at a bungalow."},{"title":"Return to Hanoi","description":"You will be dropped off at the hotel in Hanoi. End of trip :)"}]}]