[{"name":"Vietnam excursion 14 days - North, central to South","duration":14,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":855,"summary":"Vietnam excursion 14 days 13 nights package tour will take you to visit the famous destination from the north, central to south.  You have chance to put footprints in Hanoi, Ha Long, Ninh Binh, Hue, Hoi An, Da Nang, Sai Gon, enjoy the cuisine, meet local people, find the cuture. So lovely !","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/184995_599f1cad.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/184995_599f1cad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_c13bbe67.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_e11e772d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_3067831e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_27173c99.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_b3085ff8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_3009f6ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_819c2481.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_9c8bf458.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_80cf1bf5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_70409160.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_ed4a6ae9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_de7f4c6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_19ded895.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_6c2febec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_3b89e7e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/184995_77b2a030.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh","Hue","Hoi An","Ho Chi Minh City","Mekong Delta","Ben Tre","Can Tho"],"timeline":[{"title":"Day 1: Ha Noi Arrival (no meal)","description":"Welcome to Ha Noi, our driver will meet and transfer you to downtown Hanoi, a city of lakes, shaded boulevards and verdant public parks – the capital of Vietnam. The rest of day will be free at your own leisure.\nOvernight in Ha Noi.\n"},{"title":"Day 2: Ha Long Bay 1 day (B/L/X)","description":"07:30 - 08:30 Meet our tour guide and bus then take a 3.5-hour bus drive through fertile rice fields to Halong Bay. Have a break en-route in Hai Duong City to free your legs.\n12:30 Board our Dragon Cruise and start cruising among limestone islands and photograph of stunning landscapes of Halong.\n13:00 Savor your lunch on board while passing by beautiful Stone Dog, Incense Burner Islet.\n14:00 Stop at a fishing village to see local fish-men community and know more about their life. Cruising further to take photos of Halong Bay symbol, a “Fighting cock” rock.\n 15:00 Visit ThienCung “Heavenly Palace” cave, the most beautiful in Halong Bay. Get back and cruise more around emerald water.\n 16:15 Stop at the harbor again to catch the bus to Hanoi.\n 20:00 Arrive back in Hanoi. Tour ends.\n"},{"title":"Day 3: Hanoi – Ninh Binh – Bai Dinh – Trang An (B/L/X)","description":"07:40 - 08:30 Your tour guide will pick you up at your requested location and then depart for Bai Dinh pagoda and Trang An eco-tourism site . Have a short break on the road to relax your muscle.\n- Arrive in Buddha Sanctuary of Bai Dinh Pagoda, considered the largest complex of Buddhist temples in Vietnam and has become a popular site for Buddhist pilgrimages from across the country.\n12:30 Have lunch in a restaurant with special local dishes, including goat meat.\n- Leave for Trang An eco-tourism attraction. You will be amazed by the raw beauty of the neglected area while having a boat trip through cave chains: Sang cave, Toi cave, Ba Giot cave, Sinh cave…experiencing mysterious views of the so-called “Ha Long Bay in land”\n18:30 Back in Hanoi\nFree time at night. Overnight in Hanoi.\n"},{"title":"Day 4: Hanoi city tour – night train to Hue (B/L/X)","description":"Have breakfast at your hotel\n7:30 -8:00am Pick up at your hotel then start the trip by visiting Tran Quoc pagoda, a Buddhist relic and national heritage, lying on the WestLake. Visit Ho Chi Minh’s Mausoleum, the final resting place of Viet Nam’s greatest father; his house-on-stilt and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi. Relax and have lunch at a local restaurant in Hanoi Old Quarter.\nIn the afternoon you have 2 options:\n \nOption 1: on Tue, Thu, Sat and Sun\nVisit the Temple of Literature, constructed in 1070 dedicating to Confucius, sages and scholars. It is also the first university of Viet Nam.\nArrive at the legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander, for his victory against Mongolians.\n \nOption 2:  On Mon, Wed and Fri\nExplore daily life of the traditional ceramics village of Bat Trang. Visit showrooms and see how experts model the products. Witness the legendary Hoan Kiem lake. Visit Ngoc Son Temple dedicated to Tran Hung Dao - General Commander, for his victory against Mongolians.\n \nThe driver transfer to the train station for night train to Hue. Overnight on the train.\n"},{"title":"Day 5: Arrive Hue - Hue culinary tour half day (D)","description":"Hue arrival, the driver transfer to hotel for check in, relax at the hotel.\n06:00 pm: Cyclo pick up you at hotels in focus at your hotel.\n06:20 pm: The tour guide will take you to “HANG ME restaurant”, located on Vo Thi Sau street to enjoy there specical cakes of Hue (Beo, Nam, Loc cakes...).\n07:15 pm: Cyclo take you to “HEN ISLAND” to enjoy clam dishes such as clam rice, clam noodles.\n08:00 pm: After enjoy Hen island’s foods, you will continue the culinary trip to Dinh Tien Hoang street to enjoy favorite cakes “BANH KHOAI - NEM LUI” (Hue specialities spring rolls). You will have chance to enjoy sweet soup of Hue and also purchase special products souvenir such as: sesame candies, conical hats, sour shrimps, long dress (Ao Dai), Minh Mang wines.\nAt the end, cyclo take you around streets to admire some romantic places at night such as Imperial Citadel, Truong Tien bridge, Perfume River…\n09:30 pm: Ending tour. Cyclo take you back to the hotel.\nOvernight in Hue.\n"},{"title":"Day 6 : Hue City 1 day (B/L/X)","description":"MORNING: Pick up guests at the hotel at 07:30 am by bus. \nBegin the day with The Royal Tombs: Minh Mang – Khai Dinh, stop on the way to visit The Traditional Martial Art Van An, The Conical Hat Village & The Incense Making Village. Buffet lunch with over 50 traditional and international foods. \nAFTERNOON: \nContinue by bus to visit The Citadel and Thien Mu pagoda. Then get on the boat for a sight -seeing along the river to see fishing village and sampan on the way back. Do not miss the Sunset on the Perfume River! \n05:00 pm: End of tour at the boat station.\nOvernight in Hue.\n"},{"title":"Day 7: Bus Hue to Hoi An – Free and easy (B)","description":"Have breakfast at the hotel. The bus pick up at the hotel and transfer to Hoi An. On the way, the bus will stop at some destinations. If you would like to visit it, please buy entrance fee by yourself.\n\nArrive Hoi An, you check in the hotel. The rest of day is your own at leisure. \nVisit Japanese Bridge, PhucKien Pagoda, Phung Hung Old House and Quang Dong Assembly. Enjoy a walking tour through the narrow lanes of the town lined with century-old building and illuminated by hundreds of colorful lantern by yourself. \nOvernight in Hoian.\n"},{"title":"Day 8: My Son sanctuary 1 day by boat (B/L)","description":"Depart: 07:30 am | End of tour: 02:00 pm \nPick up guests at the hotel. Depart to My Son Sanctuary by bus. Once there, visit the Tra Kieu capital which was the the former administrative centre of champa kingdom. Discover the majestic ancient ruins at My Son including ancient towers which were built from 4th C. Then go to the dock and board on boat cruise along Thu Bon river.\n12:15 am: Enjoy Local food on Boat (My Quang)\n02:00 pm: Back to your hotel. End the tour.\nOvernight in Hoian.\n"},{"title":"Day 9: Ba Na Hill 1 day (B/L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills.\n09:00 am: Arrive to Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch).\nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. Then, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. Back to Danang by car around 04:00 pm. Drop-off at hotel. End of tour.\nOvernight in Hoi An.\n"},{"title":"Day 10: Hoi An – Da Nang –fly to Ho Chi Minh City (B)","description":"Breakfast at your hotel. You are free until the driver transfer to Da Nang airport, take flight to Ho Chi Minh City\nArrive Ho Chi Minh city, the car pick you up at your hotel. Relax and free. \nOvernight in Saigon.\n"},{"title":"Day 11: Ho Chi Minh City & Cu Chi Tunnels (B/L)","description":"AM: HCM City\nWe start the trip by visiting Notre Dame Cathedral, the historic Central Post Office, followed by exploring the Reunification Palace, and the remarkable site of the War Remnants Museum, (optional Ben Thanh Market - only drop off).\nPM: Cu Chi Tunnels\nLocated 60km from HCMC, Cu Chi is now a popular spot for both Vietnamese & foreign tourists - the network of over 200km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nToday, ducks and water buffalos happily co-exist in the rivers along the side of the road. However, the peaceful rural rice paddy scenery belies the area’s violent history. Visitors will find it hard to imagine the destruction, damage & defoliation over this whole area, caused by bombing and mines. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\".\nStart our tour in the morning, before entering the tunnels visitors can watch a short introductory video showing how the tunnels were constructed. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla’s food during the war). Return to Sai Gon. Discovery Saigon at night by yourself. Overnight in Saigon.\n"},{"title":"Day 12: Ho Chi Minh -My Tho – Ben Tre – Can Tho (B/L/X)","description":"Leaving Ho Chi Minh city, enjoy the scenic journey along the National Highway bordered by green rice fields. On arrival at My Tho, visit Vinh Trang pagoda, take a leisurely boat ride along the river, view stilt houses, fruit plantations and fishing villages along the river bank. Proceed to Tortoise islet, have lunch in the orchard garden. Then a boat ride to An Khanh – a less touristy attraction in Ben Tre, enjoy cruising on a hand-rowed sampan under the shade of the water coconut trees along natural canals, then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by the locals. Visit a family business which epitomizes the idyllic rural lifestyle, taste delicious coconut candy & observe the pastoral life as you roam through fruit plantations and villages.  Proceed to Can Tho. Overnight in the hotel. "},{"title":"Day 13: Cai Rang Floating market – Ho Chi Minh City (B/L)","description":"Take a leisurely boat trip to explore the picturesque tributaries of the Lower Mekong river ( Bassac River), then proceed to visit Cai Răng floating market (& Phong Dien is optional), which are the liveliest in the whole religion.\nHave you ever tasted Vietnamese vermicelli soup? Well, now go and see how it is made. Then wander around the village and meet the friendly local people and experience how to cross a \"Monkey bridge\" which is built by only o¬ne stem of bamboo. Visit the orchard garden. Stop for lunch. Back to HCM city. Overnight in Sai Gon.\n"},{"title":"Day 14: Ho Chi Minh City (B)–Departure","description":"Breakfast at your hotel. You have free time to shopping. Then check out and transfer to the airport. \n----------- End of service ----------\n"}]},{"name":"Best of Vietnam, Max 6 People","duration":7,"travelStyle":["Discovery","Group","Partially Guided"],"oldPrice":0,"price":1299,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\n\nHighlights:\nThis 7-day trip includes the two most significant cities in Vietnam: the capital city Hanoi and the largest city Ho Chi Minh City. To know Vietnam’s ancient history and current development, these two cities are the 'must' destinations. In addition, the Mekong Delta Day Trip and the Halong Bay cruise tour also add extra values to this vacation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158230_a3c8c1eb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158230_a3c8c1eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_e8ebda44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_5124011f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_19597f75.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_dc52eb9e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_4c2d51a3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_9780797e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_18e85aac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_873b2d6d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_b7ec4da6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_c89aaaf1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_67527e8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_fe6ee4d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_cd0a95ac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_49cffe74.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_b1ee6db5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_cce22577.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_69c4afcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_7652bff7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158230_29428457.jpg"],"destinations":["Hanoi","Halong Bay","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Welcome to our beautiful country Vietnam. Before your flight lands in Hanoi, our guide will wait for you at the airport exit. After you get off the plane, clear the custom and get back your luggage, you will see the guide at the exit holding a sign with your name. We drive you to the hotel and help you with the check-in procedure. For the rest of the time, you are free to explore the city on your own, or you may rest at the hotel, expecting the following Vietnam 7 days itinerary. \nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 2: Hanoi","description":"Today you will have a full day guided tour to the must-see places in Hanoi. We first come to the city center, Ba Dinh square, the most important place for Vietnam people to hold rallies and celebrate festivals. On the west side of the square stands Ho Chi Minh's Mausoleum Complex. Ho Chi Minh who brought freedom and liberation to the nation is the father of Vietnam's independence. In memory of this great leader, now his body has been kept in the mausoleum and people may pay respects to him when it opens to the public. Later, let's visit Ho Chi Minh's Stilt House and get to know this great leader further. At the backside of mausoleum you can see a grand three-story yellow villa in French style. While Ho Chi Minh lived in a simple wooden stilt house besides the villa. This is the place where he lived and worked. After that, we continue to visit the One Pillar Pagoda and the Temple of Literature near Ba Dinh square.  After Lunch, let's continue our Vietnam itinerary 1 week in Hanoi to the Museum of Ethnology. The rich collections here give you more information about Vietnam's history, custom, culture and development. Later we take you to explore the Old Quarter of Hanoi, which is the most popular destination for tourists. The staggered narrow alleys are always full of crowds and motorcycles, bustling and lively. Take your time for shopping and you may also taste some local food at a restaurant here on your own. In the evening, we take you to enjoy a short traditional Water Puppet Show and then transfer you back to the hotel. \nMeals: Breakfast, Lunch \nAccommodation: Hanoi La Siesta Hotel & Spa (4 stars) or similar"},{"title":"Day 3: Halong Bay","description":"You must have learned something about Halong Bay, one of the UNESCO World Heritage Site, when you plan a Hanoi Halong Bay tour in Vietnam. Today, we will go and see the beauty of this site with our own eyes. In the morning, pack your luggage and check out the hotel with the help of your tour guide. After 3 to 4 hours' driving, you will reach Halong Bay at around 12:30. Board Signature Cruise upon arrival and then your exciting cruise journey begins. Lunch is arranged at 13:00 in the dining room. Before that, you will receive a brief introduction about the boat facilities, safety instructions and itinerary arrangements. In the afternoon, you will firstly sail to Bai Tu Long Bay. A shore excursion to Cua Van Fishing Village will be arranged and there are some optional activities you may join, such as kayaking or taking a small bamboo boat to visit the village. Then return to the cruise ship and have a short rest freely. Later, you may join in the cooking class which is held on board and learn how to cook traditional Vietnamese food. That would be interesting to try something different. The buffet dinner is arranged at around 19:30. After that, you may enjoy your own time to relax or attend some on board activities. Stay overnight on the cruise ship. \nMeals: Breakfast, Lunch, Dinner \nAccommodation: Signature Cruise (4 stars) or similar"},{"title":"Day 4: Ho Chi Minh City","description":"Tai Chi class will be held on the sundeck this morning. If you wake up early, you are welcomed to join it. At about 07:45, the ship will stop at a nearby island and clients are invited to have a walking tour excursion here. You may either enjoy the beach or swim as you like. After that, return to the ship and have a big brunch as the ship sails back to Halong pier. Check out the cruise at about 11:00 and meet our guide on board. We will then transfer you to the airport for your flight to Ho Chi Minh City, which used to be called Saigon. Upon arrival, our guide in Saigon will meet you at the airport and escort you to the hotel for a good stay. \nMeal: Brunch \nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 5: Ho Chi Minh City","description":"Today we will have a full day trip to explore the prosperous Saigon, which is considered the largest city in Vietnam. Firstly, we take you to visit Thien Hau Temple, a Chinese style Temple and mostly welcomed by overseas Chinese. Next we go to famous Binh Tay Market, a big local market always look busy and lively. You will get a real experience of the local life when shuttling between stalls that sale various goods like flowers, fresh fruit, food, clothes and daily supplies. Take your time to search for some souvenirs and then have lunch at a local restaurant. In the afternoon, we come to the War Remnants Museum. It mainly introduces the history of Vietnam War with many relative photos, documents and articles on display. After visiting, we finish the day trip at the central area to explore the Reunification Palace, the former Presidential Palace, the Notre Dame Cathedral, the Central Post Office, the Opera House and Ho Chi Minh City Hall. Then we transfer you back to the hotel and you will have a good rest tonight. \nMeals: Breakfast, Lunch  \nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 6: Ho Chi Minh City","description":"The highlight of your Vietnam 7 days in Saigon must be the floating market at Mekong Delta. Today, you will get up early and have breakfast before we set off to Ben Tre, where you will take a boat to start your day journey. Sailing along the Ham Luong River, you will pass by many local boats which sale fruits, fresh vegetables and maybe some handmade articles. We will also pay a visit to the local orchards and workshops along the way. Then we stop at a village for a visit to a farmer's house to see how local people live their life and then explore further for more countryside view by \"Xe Loi\" or bicycle. Have lunch at a nice local restaurant. Afterwards, we will return to the dock by sampan and transfer back to Ben Tre. Our driver will wait for you at the pier and escort you to your hotel in Ho Chi Minh.\nMeals: Breakfast, Lunch  \nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Day 7: Ho Chi Minh City","description":"Time flies and now it comes to the last day of your Vietnam itinerary 1 week. Before we set off to the airport, you are free on your own to explore the city for a last minute visit or shopping. We will meet you at the hotel based on your departure flight schedule and then transfer you to the airport. We wish you have a safe journey home.\n\nMeal: breakfast"}]},{"name":"Halong Flamingo Cruise Package Tour from Hanoi for 5 Days","duration":5,"travelStyle":["Ocean Cruise","Group","Partially Guided","Holiday"],"oldPrice":0,"price":420,"summary":"This inclusive package tour is a great combination in between Hanoi & Halong bay. You'll not only have a chance to get picked up from the airport, tour around the city, stay at nice 3-star centrally located hotels in the old quarters but also a great journey in Halong Bay with our Luxury Flamingo Cruise - 4-star luxury one to explore the magnificent beauties of Halong bay with islets, caves ...","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/130515_83cb18e1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/130515_83cb18e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_fa85cb9a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_36fd6d42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_0bfadf44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_c44c33bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_4ef5377a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_1a5c8b8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_f886e616.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_93b5d218.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_6265ad65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_25f92ad0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_32c55712.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_9dde8f10.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_bbc81884.jpg","https://cdn.tourradar.com/s3/tour/1500x800/130515_e8bc85d8.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"DAY 1: HANOI – ARRIVAL","description":"Arrival Hanoi, you will be picked up by our guide and driver to hotel. The capital of Vietnam, Hanoi is a stylish and gracious city that retains an unique old world charm and some Asia’s most striking colonial architecture. The many lakes and parks make for relaxing atmosphere.\nO/N in Ha Noi."},{"title":"DAY 2: HANOI CITY GROUP TOUR (B/L/-)","description":"8.00: We pick you up from your hotel and take you to visit the Ho Chi Minh Complex which includes Ho Chi Minh’s Mausoleum – the final resting place of the beloved national hero, Uncle Ho. Then we visit the President Ho Chi Minh’s stilt house where he lived off and on from 1958 to 1969. You’ll also go to the Ho Chi Minh Museum where you can learn about this remarkable man and what he did for Vietnam and the region.\n\nNext, you’ll visit the One Pillar Pagoda which is actually a group of structures that collectively make up a pagoda built over the water in the middle of a square lake.\n\nAfter that you’ll have a chance to explore the Tran Quoc Pagoda on the Shore of West Lake. From there you’ll go to the Temple of Literature which was Vietnam’s first university and is dedicated to Confucius.\nAlternatively you can choose to have lunch at a restaurant in the Old Quarter. Afterwards you’ll walk through the Old Quarter where you’ll get a sense of the daily life of this busy city on your way to Hoan Kiem Lake – the heart and soul of Hanoi.\n\nThis is the part of town where the commercial streets of modern Hanoi meet the ancient 36 streets and numerous alleys amongst temples, pagodas and lakes.\n\nFinally you’ll stop at Museum of Ethnology. This superb museum showcases the depth of Vietnamese cultural diversity with an astounding collection of 15,000 artifacts gathered from throughout Vietnam. Maps, displays and dioramas are labeled in Vietnamese, French and English. Displays portray a typical village market, the making of comical hats and a Tay shamanic ceremony, videos show the real thing. You can also check out a traditional Black Thai house reconstructed in the museum. There’s also a centre for research and conservation where scientists from all over the world study traditional Vietnamese cultures.\n\nO/N in Ha Noi."},{"title":"DAY 3: HANOI – HALONG BAY TOUR WITH LUXURY FLAMINGO CRUISE – KAYAKING (B/L/D)","description":"07:30     Our shuttle bus with tour guide will pick you up at your hotels\n(Note: This pick-up is just applied for those who use our shuttle bus service)\n10:30    Stopover in Hai Duong City where you can experience our hand-made Vietnamese handicraft products.\n12:30    Arrive in Tuan Chau Marina Pier (Tuan Chau Island). Followed by activities such as:  boarding Luxury Flamingo Cruise for departure, Welcome drink will be served and cruise briefing, safety instructions, check-in cabins by Cruise Manager\n13:30    Great lunch is served while cruising passing by islets\n15:00    Kayaking around Pearl Farm Village, visit Titop Island. Free choice of activities such as sunbathing, swimming and conquering the peak of the biggest island in Halong and taking panoramic photos of Halong bay in the afternoon.\n17:30    Happy Hour. Buy 2 beverage get 1 for free\n18.00    Cooking Class. Our Chef will demonstrate the preparation of a particular Vietnamese cuisine in the dining room. Our guide will let you know what item will be prepared and will explain the process during the demonstration. Duration about 20 – 30 minutes\n18:30    Enjoy Sunset Party with fruits and tea\n19:30    Under the magnificent night sky, our luxury set menu dinner is served with variety of Vietnamese and Asian foods\n21:00    Joining the squid fishing on boat with our crews and can enjoy the squid cooked with assistance from our chef or laze yourself with our happy-hour drinks at the bar\nOvernight on Luxury Flamingo Cruises"},{"title":"DAY 4: HALONG BAY – SURPRISING CAVE – HANOI (B/L/-)","description":"06:30: Tai Chi class on the Sun-deck.\n07:30: Have breakfast with Coffee, tea and Bakeries on board.\n08:30: Visit the Surprising Cave (Hang Sung Sot) discovered by the French in 1901. Opened for tourists since 1936, now it is a must-to-see and a symbol for geology value of Halong.\n09:30 – 10:30: Check out time. Relax on the sun-deck or inside the restaurant to enjoy the bay scenery during the trip back the pier.\n10:00: Farewell brunch’ll be served on board and saying goodbye to the screws.\n12:00: Disembarkation at Tuan Chau Harbour. Our car will be at your disposal to pick you up then drive back to Hanoi.\n16:00: Arrive in Hanoi.\n\nOvernight in Hanoi."},{"title":"DAY 5: HANOI – DEPARTURE (B)","description":"Breakfast at your hotel, you will be free by your own to have more discoveries Hanoi then picked up to the airport for a flight back home!"}]},{"name":"North Vietnam Family Explorer","duration":5,"travelStyle":["Family","Adventure","Bicycle","Group","Partially Guided"],"oldPrice":0,"price":980,"summary":"Want to experience Vietnam's village life in a remote setting? Learn how to cook sticky rice in bamboo? Get your hands dirty planting rice? Forget the babysitter and bring the kids along for 5 days of exploring and learning on this family friendly bike tour in Vietnam!","highlights":["Experience Vietnam's village life in a remote setting","Learn how to cook sticky rice in bamboo with the locals","Embark on this family-friendly biking adventure in Vietnam"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/97979_64e15a90.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/97979_64e15a90.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_5e6e91a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_3837b775.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_1dd3b7ab.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_d2b95478.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_9d8897cd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_59728990.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_a9296706.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_f3459b1d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/97979_14d10064.jpg"],"destinations":["Hanoi","Mai Chau","Ninh Binh"],"timeline":[{"title":"Day 1","description":"From your Hanoi hotel drive 4 hours to Mai Chau, a rural town in Hoa Binh province, southeast of Hanoi. The scenery is dotted with limestone karsts and ethnic highlanders of White Thai, Hmong, and Zao living in the small villages that we pass along the way. We stop at the top of a pass for a panoramic view of stunning Mai Chau Valley so you can get an overview of where we will be cycling. We start pedaling on small paths, past green rice paddies and local stilt houses, and of course meeting friendly local villagers. Taking a break at Hoa Ban Plus, a weaving centre and living complex for disabled women, gives us a chance to see the traditional handicraft of weaving in action, and we can even give it a try. We continue cycling on to our homestay overnight at Pom Coong village. We sleep in stilt bamboo house in an open dormitory-style room with shared facilities."},{"title":"Day 2","description":"After breakfast, we ride up to the hills along a dirt road frequently used by local villagers. As we climb, the valley views open up to boundless, spectacular scenery. A steep 2 km climb is rewarded with a 10 km downhill through rustic villages and lush terrain. A quiet paved road and a small trail leads us to the White Thai village of Buoc. We can take a short walk around and learn about local village life, visit a few households, and see where families cook and sleep. We help with preparing lunch by making “Com Lam”, traditional sticky rice in bamboo. With a belly full of local delights, we cycle back to Mai Chau and have the rest of the afternoon free."},{"title":"Day 3","description":"We drive one hour drive to Cho Lo where we then get on the bikes. A flat ride on country roads follows where we'll have to watch out for chickens crossing the road and give right of way to water buffaloes. A bowl of Pho, noodle soup, will hydrate and fill us. Be sure to add in the greens, herbs, spicy pastes, and a squeeze of lime to make the soup taste to your liking. A short transfer takes us uphill to Cuc Phuong National Park in Ninh Binh Province, the oldest national park in Vietnam and its most significant biodiversity site. Time to get wild! A guided tour of a rescue centre where monkeys and gibbons are being rehabilitated to return to the jungle will show you how many species there are in the jungle. After seeing the antics of the monkeys it's a short walk to the Carnivore and Pangolin Education Centre, where we'll learn about and see civets and the unusual pangolin with their protective armour of scales and long tongues for capturing ants and termites. The rescued animals are in well-designed, spacious enclosures, and the centre offers interactive displays to understand the threats to wildlife and learn about conservation. A fun and educational afternoon with wildlife!"},{"title":"Day 4","description":"A feast for the senses today, from the sight of the towering karsts to the sound of the river to the taste of our self-cooked dinner. Cycling from our guesthouse, we go downhill before riding along a dyke that provides a flat and safe ride, to the town of Hoa Lu. An ancient capital of the Dinh and Le Dynasties, we step back in time and visit a 17th century temple built in the shape of a Chinese character. After lunch, we change from bikes to boats and relax and enjoy the amazing mountains that dominate most of the region. We are rowed through a cave by local sampan rowers who use their feet to oar and enter a green and fertile land. Back on land, we head to our resort amidst rice fields.  Another hands on meal as we assist in the preparation, learning the best technique to roll fresh spring rolls, and then feast on our creations."},{"title":"Day 5","description":"A change of pace as we get our hands dirty. Cycling away from the karsts, we follow numerous rivers as they reach toward the coast. The scenery changes to flat plains as we cycle into the delta, a guaranteed flat ride. We take a break at Phat Diem Stone Cathedral, which has a unique blend of eastern and western architecture illustrated by its pagoda-styled roofs. We transfer to Bat Trang, a ceramic producing village that makes giant vases. Make your own souvenir tea cup or bowl using local techniques. Then it's time to head back to Hanoi for your onward travel."}]},{"name":"7 Days Mekong Delta Cruise & Phu Quoc Island Relaxtion , Max 6 Guests","duration":7,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":1019,"summary":"Features:\n•Mini Group size of 2-6 travelers \n•Guaranteed departure tour\nHighlights:\nLanding on Ho Chi Minh City, you will then board on a cruise along the Ham Luong river and visit a local family to explore the lifestyle of the Mekong Delta. The interesting motorboat ride in Cai Rang floating market and the visit to cottage industries will lead you to indulge in the exotic  atmosphere. At last, an over two days of beach relaxation in the Phu Quoc Island will round off  your cozy holiday. ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b5733.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b5733.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b5738.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b5739.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b573c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/199016_5eba4ca0b573b.jpg"],"destinations":["Ho Chi Minh City","Ben Tre","Can Tho","Phu Quoc Island"],"timeline":[{"title":"Arrival in Ho Chi Minh City","description":"Welcome to Vietnam’s financial hub: Saigon (Ho Chi Minh City). Upon arrival, our guide and driver will pick you up from the airport and transfer you to the hotel. You will enjoy the rest of the day at leisure to recover from jet lag and explore the city on your own.\n\nMeals: No meals, advice freely available\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Ho Chi Minh City - Ben Tre - Can Tho","description":"Today you will spend a day away from the busy city and drive 90km (2hrs) to Ben Tre. Board on your private boat to enjoy the delta scenery along the Ham Luong River. Experience the unique lifestyle of the Mekong Delta as you visit fruit orchards, coconut groves, brick workshops, etc. The boat will then stop at a quiet village, you can have a short walk to visit a local family to learn how they make sedge mat and enjoy tea, tropical fruits, take “Xe Loi”, a kind of motorized rickshaw or you can hop onto your bicycle and peddle through picturesque villages. Stop at a riverside restaurant for a delicious and filling lunch. Then board a sampan for a relaxing trip along narrow canals. The boat will be waiting for you at the pier nearby to bring you back to Ben Tre where we will head to Can Tho city - the heart of Mekong Delta.\n\nMeals: Breakfast, Lunch\nAccommodation: Victoria Can Tho Resort (4 stars) or similar\n"},{"title":"Can Tho – Rach Gia – Phu Quoc","description":"Today you will wake up early and leave the hotel to visit the famous Cai Rang floating market by motorboat. You will experience the daily life of the Mekong River Delta as vendors from around the region gather to sell fresh fruits, local delicacies, and handmade goods. Then you will proceed with your discovery of the region with a tour of the cottage industries to see people making coconut candies and rice paper. After that, we continue to Rach Gia with 2 hours driving to take the speed boat to Phu Quoc Island and transfer to your hotel. You will spend the rest of the day at leisure.\n\nMeals: Breakfast, Lunch\nAccommodation: Eden Resort (4 stars) or similar\n"},{"title":"Phu Quoc","description":"Phu Quoc Island boasts lush tropical forest and mountain zones. The island is perfect for travelers with its unspoiled beaches. There are many activities including swimming, snorkeling, and fishing, etc. Today is free to relax on the sandy beach.\n\nMeal: Breakfast\nAccommodation: Eden Resort (4 stars) or similar\n"},{"title":"Phu Quoc","description":"You will enjoy a full day at leisure in the resort or on the beach.\n\nMeals: Breakfast\nAccommodation: Eden Resort (4 stars) or similar"},{"title":"Phu Quoc - Ho Chi Minh City","description":"You will enjoy a free morning in Phu Quoc. In the afternoon, our driver will transfer you to the airport for flight to Ho Chi Minh City. Upon arrival, our driver will pick you up from the airport and help you check into the hotel. \n\nMeals: Breakfast\nAccommodation: Liberty Central Saigon Riverside Hotel (4 stars) or similar"},{"title":"Departure from Ho Chi Minh City","description":"Today our driver will escort you to the airport for your homeward flight. Have a nice journey home!\n\nMeals: Breakfast\n"}]}]