[{"name":"Ha Noi - Da Nang - Ho Chi Minh 8 Days 7 Nights","duration":8,"travelStyle":["Discovery","Group","Partially Guided","Holiday"],"oldPrice":0,"price":550,"summary":"Viet Nam 8 days 7 nights from North to South to explore the best Vietnam, from Northern to Southern. This combination will offer you vision of this beautiful country. On our program, we will bring you to the most highlighted destinations as Ha Noi, Ha Long, Da Nang, Hoi An, Ho Chi Minh, Mekong Delta River.\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/133103_9e329ac9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/133103_9e329ac9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_d193006c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_56390157.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_e2f4a001.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_35eb301c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_a1911c62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_1cc44a39.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_ffc4f571.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_222011d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_912eae8a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_ebdb5100.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_f63a6ef0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/133103_983d6147.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Ha Noi arrive (No meal)","description":"Hanoi welcome: after long time on airplane, you will reach Vietnam – the S-shaped land, where 54 different ethnic minorities inhabited. You will be warmly welcomed by our driver at the airport and transferred to your hotel in the city center of Hanoi. \nFree time and easy.\nOvernight in Ha Noi"},{"title":"Day 2: Ha Noi- Ha Long Bay, overnight on cruise (meals incl: B/ L/ D)","description":"8:00- 8:30 Pick-up at hotel and start the scenic, 3 and ½ hour drive to Halong Bay.\n12:00- 12:30 Embark on the Cruise followed by a short cruise briefing.\n13:00 Savor a delectable lunch as Ha Long cruises among the limestone islands.\n14:00- 16:00 Explore the amazing Sung Sot Cave – the most beautiful cave in Halong Bay\n16:00- 17:00 Cruising to Titov island. Go swimming and relaxing at the beach of Titov or climb up to the top of the island for a panorama view of Halong Bay.\n17:00- 17:30 Return to the main boat and continue cruising to the quiet area while enjoy beautiful seascape on the way\n17:30- 19:00 Enjoy Sunset Party on sundeck and admire the best moments of the day when the sun starts to set.\n19:00 Dinner is served. Socialize with other guests, take part in board games, fish for squid, or just laze around.\nOvernight on Ha Long Cruise in the middle of Ha Long Bay\n"},{"title":"Day 3: Ha Long Bay- Ha Noi- flight to Da Nang (meals incl: B/ L)","description":"6:30 Start your morning with the fitness class up in sundeck \n7:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n7:45 Join the kayak excursion \n9:00 Stop by Pearl Farm to study the culture pearl making process. \n9:30: Check out your cabin. Time for brunch while the cruise heads back to harbor. \n12:00 Disembark harbor. Say goodbye to Halong Bay and get on the car to come back Ha Noi\n17:00 Arrive Ha Noi and the driver transfers to the airport for your flight to Da Nang.\nArrive Da Nang, the driver takes you to Hoi An. Check in hotel.\nOvernight in Hoi An.\n"},{"title":"Day 4: My Son Holyland tour- Da Nang (meals incl: B/ L)","description":"7:30 am: Our minivan picks you up at your hotel. Spend 2 hours to enjoy and discover the beauty of Ancient buildings of the Champa Kingdom. Those relics were made by red bricks which still surprises those who are curious about architectural art.\nHave chance to enjoy traditional music performed by Champa girls in their colorful uniforms.\nLeave My Son for Cao Lau boat station. Take a boat trip on Thu Bon River. Experience the lifestyle of local people and enjoy fresh air.\nHave lunch on the boat before stopping at Kim Bong Carpentry Village – The traditional country village.\n2:30 pm: The boat trip finishes at Bach Dang Boat station.\nFinish tour, the driver transfers to Da Nang, you spend 40 minutes on the car. \nCheck in hotel Da Nang.\nOvernight in Da Nang\n"},{"title":"Day 5: Ba Na Hills- flight to Ho Chi Minh (meals incl: B/ L)","description":"MORNING (07:30 – 08:00 am): Pick up guests at the hotel and transfer to Ba Na Hills. \n08:45 am: Arrive Ba Na Hills station and start the journey to mountain by cable car which is recognized as the World longest cable car and the biggest difference about the height between station 1 and station 2 by Guiness. \nStart to visit some beautiful places: Debay wine-cellar, Linh Ung pagoda with the 27 metres Buddha statue, Loc Uyen garden and Quan Am Pavilion. \n11:45 am: Have lunch in restaurant (buffet lunch). \nAFTERNOON: Tour guide will take you to natural Monkey garden and tourists will have chance to conquer The God Mountain at 1487 metres of altitude over sea level. This is the highest peak in central of Vietnam. \nThen, free time to enjoy games in Fantasy Park – The “Entertainment Paradise”, discover ghost house and watch 4D films. \nBack to Danang by car around 04:00 pm. Drop-off at hotel. \nThe driver transfers to the airport for your flight to Ho Chi Minh \nOvernight in Ho Chi Minh.\n"},{"title":"Day 6: My Tho- Ben Tre the Upper Mekong River (meals incl: B/ L)","description":"A smooth one-and-half-hour bus ride through rice field scenery along National Highway 1 brings you to the beautiful rural district of Trung Luong.\nOn arrival at My Tho, after visiting Vinh Trang pagoda, take a motor boat to enter My Tho city through Bao Dinh natural canal. Take a leisurely cruise on the Tien River to view the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands.\nEnjoy lunch at the local restaurant, then visit the coconut candy mill and take an amazing rowing boat trip along the small canal on a hand-rowed sampan under the shadow of the water coconut trees along natural canals. Then enjoy seasonal fruit & honey tea to the sound of \"Southern Vietnamese folk music\", performed by locals.\nMeet at the bus and return to Ho Chi Minh City. This trip provides a fascinating insight into daily life in the Mekong Delta and you are guaranteed to take home your own private collection of beautiful memories.\nFree time in the evening.\nOvernight in Ho Chi Minh.\n"},{"title":"Day 7: Cao Dai temple & Cu Chi tunnels (meals incl: B/ L)","description":"The Great Holy Sight Temple, built in 1926, is considered one of the striking structures of South-East Asia. It is the headquarters of the unique Cao Dai sect, a religion with a hybrid of Buddhism, Christianity & Confucianism. Above the entrance is the all-seeing holy eye – symbol of the sect. Visitors will attend the midday ceremony’s extravaganza to witness the daily mass held by the Cao Dai followers, which is a fantastic experience.\nAfter lunch at the local restaurant, proceed to the Cu Chi to explore the amazing site where Viet Cong hid during the War. It is now a popular spot for both Vietnamese & foreign tourists - the network of over 200 km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities including numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens. There is plenty of evidence of the fierce battle that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. Spend the next hour exploring the tunnels. Afterwards, enjoy tea, cassava (guerrilla-warriors’ food in war time). \nEnd of services. Return Sai Gon and finish your Cao Dai Temple Cu Chi Tunnels tour\nFree time in the evening.\nOvernight in Ho Chi Minh.\n"},{"title":"Day 8: Ho Chi Minh departure(meals incl: B)","description":"Have a breakfast at your hotel.\nFree time and easy until departure time, the driver takes you to the airport for your flight.\nEnd of services!\n"}]},{"name":"Discovery Vietnam Golf Course","duration":14,"travelStyle":["Adventure","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":2250,"summary":"In and around Da NangMeal: NA- Accommodation: Hotel in Saigon\nWelcome to the biggest city in Vietnam – Ho Chi Minh City ( Saigon). On arrival, our car and guide will pick up and transfer you to your hotel in city central. Enjoy the rest of the day at your leisure.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/146555_d0304fb8.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/146555_d0304fb8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_1a9005a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_4e1af147.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_460b4926.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_cee6ca3a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_a588987f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_4e072ab1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_652929f9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_a321b351.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_3186d3c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_2735c057.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_f4362019.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_44d1fa64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_4164eda1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_266b6edf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_89f23c8b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_bcf144c3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_20b2f0d0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_b4065282.jpg","https://cdn.tourradar.com/s3/tour/1500x800/146555_5592470a.jpg"],"destinations":["Ho Chi Minh City","Hoi An","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 ( Sun): Saigon Arrival.","description":"Meal: NA- Accommodation: Hotel in Saigon\nWelcome to the biggest city in Vietnam – Ho Chi Minh City ( Saigon). On arrival, our car and guide will pick up and transfer you to your hotel in city central. Enjoy the rest of the day at your leisure."},{"title":"Day 2 (Mon): Ho Chi Minh Golf Tours at Vietnam Golf & Country Club","description":"Meal: Breakfast- Accommodation: Hotel in Saigon\nSet amongst 300 hectares of land, two great golf courses have been carved out of the existing woodland with minimal land movement, leaving you to feel that the land was always destined to be a golf course, so natural is the layout and design.\nAfter having breakfast at the hotel, we drive to Vietnam Golf and Country Club for golfing. Vietnam Golf & Country Club is the first International 36-holes golf club in Vietnam and is widely regarded as Vietnam’s Premier Golf and Country Club. Play a round of 18 holes and we drive you back to Saigon. Stay overnight in Ho Chi Minh."},{"title":"Day 3 (Tue) Long Thanh Golf – Vung Tau","description":"Meal: Breakfast- Accommodation: Hotel in Vung Tau\nThe Long Thanh Golf Club offers 36 holes of golf in the former rice paddies and scenic countryside surrounding Saigon. The Ho Chi Minh City golf course is located 30 kilometers north of the city on a hill with unobstructed views back towards the Vietnamese capital. Both the Hill and Lake course are well maintained throughout the year and the golf courses are a longtime favorite among locals. Many expatriates and Vietnam golf visitors prefer Long Thanh Golf Club over its more famous neighbor Vietnam Golf & Country Club.\nBreakfast at hotel and driver will take you to Long Thanh Golf Resort. The course was built in 2001, this beautiful golf course is set on a hill in the scenic\ncountryside and is just one hour away from Ho Chi Minh City with an amazing view of the city itself from the links. The golf course itself is spread across 7,011 yards with 36 holes that each have their own character and shape. With such a wide variety of holes, this course will satisfy both serious amateur and professional golfers. Tee off at either Lake or Mountain Course. After the game, we will drive you to Vung Tau (1 hour). Check-in hotel and enjoy your leisure time at the hotel or make your own exploration of the city’s nightlife. Overnight at hotel in Vung Tau (Ho Tram)."},{"title":"Day 4 (Thu) The Bluffs Ho Tram Golf Course","description":"Meal: Breakfast- Accommodation: Hotel in Vung Tau\nThe Greg Norman designed Bluffs Ho Tram Strip golf course is located 80 kilometers southeast of Ho Chi Minh City in Ba Ria-Vung Tau Province on the southern Vietnamese coastline. It takes around 2 hours to reach by a mix of highway and local roads from Ho Chi Minh City. The Bluffs Ho Tram is a unique links-style par-71 golf course on a rugged site often accompanied by strong onshore breezes.\nBreakfast at hotel and you will be brought to The Bluffs Ho Tram Strip Golf Course – The Bluffs Ho Tram Strip was designed by Greg Norman to capture the true essence of links-style golf. Set on the coastline — as almost all great links courses are — The Bluffs is routed over and around towering sand dunes, which have been shaped over thousands of years by the elements. Enjoy the ultimate experience of playing true links golf among the dunes of southern Vietnam and having dramatic ocean views."},{"title":"Day 5 (Fri) Vung Tau – Danang via Saigon","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An.\nMorning transfer back to Ho Chi Minh City by vehicle or by hydrofoil. Direct private transfer from the jetty to Tan Son Nhat Intl airport to catch a 1-hour flight to Danang. Meet a local tour guide and drive to hotel for check-in. Rest of time will be at your own leisure. Tonight you will stay overnight in Hoi An."},{"title":"Day 6 (Sat) Danang Golf Club","description":"Meal: Breakfast- Accommodation: Hotel in  Hoi An\nBRG Da Nang Golf Resort (Danang Golf Club) opened in 2010 and immediately leaped to fame being recognized as one of the 15 best new courses in the world by USA GOLF magazine. Da Nang Golf Resort has been awarded a number of awards, amongst them 2011, 2012, 2013 best golf course in Asia by the readers of Asian Golf Monthly as well as the 2012 Best Golf Course in Vietnam by USA Golf Digest and the 2014 IAGTO Diamond Award.\nBreakfast at the hotel and this morning are spent with a round of golf at the Dunes Course which designed by Australian golf legend and former world No. 1 Greg Norman. Danang Golf Club offers breathtaking views of the Marble Mountains, East Sea, and Cham Islands. After a round of incredible golf game, you will be transferred back to your hotel and rest of time will be at leisure. Free to enjoy the Peaceful Hoi An Town."},{"title":"Day 7(Sun) Montgomerie Links Vietnam","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An\nThe Montgomerie Links, located just off historical Danang Beach and minutes from the Danang City, is a stunning 7090 yard, par-72 golf course. The course has been rated as one of Asia’s ten most elite courses by the 2012 Forbes Travel Guide as well as most recently has been voted as “Vietnam’s Best Championship Course 2013” by the Vietnam Golf Magazine.\nA morning round of golf is spent at the Montgomerie Links – Rated as one of “Asia’s 10 Most Elite Golf Courses” by Forbes in 2012. The course routing is an exciting mixture of heathland and links-style holes which cater to players of all abilities. Overnight at the hotel in Hoi An."},{"title":"Day 8 (Mon) Laguna Lang Co Golf Resort","description":"Meal: Breakfast- Accommodation: Hotel in Hoi An\nLaguna Lang Co Golf Club in central Vietnam near Lang Co Bay and a 3-kilometer beach in the Chan May region of Central Vietnam, an area renowned for its pristine coastline, natural scenery and proximity to UNESCO World Heritage sites. The site is located between the ancient city of Hue 30 kilometers to the North and Danang 35 kilometers to the South.\nBreakfast at the hotel and then we will drive you to Laguna Lang Co Golf Resort which is located between Hue and Danang City (1 hour and 20 minutes by car) The 18-hole, par-71 championship course designed by Sir Nick Faldo. The Lang Co Golf Club delivers a golfing experience that can be enjoyed by the most experienced players and beginners alike."},{"title":"Day 9 (Tue) Danang – Hanoi","description":"Meal: Breakfast- Accommodation: Hotel in Hanoi\nToday you will be free at leisure until the time transfer to the airport for flight to Hanoi. On arrival, our tour guide will pick up at the airport and transfer to Hanoi central. 1-hour cyclo tours around Hanoi old quarters and enjoy the traditional water puppetry show. Overnight in Hanoi."},{"title":"Day 10 (Wed) King’s Island Golf Resort","description":"Meal: Breakfast- Accommodation: Hotel in Hanoi\nBRG Kings Island Golf Resort is a 36 hole golf resort in the outskirts of Hanoi and arguably the most scenic course in North Vietnam. The golf resort lies on the shores of the Dong Mo reservoir 36 kilometers from Hanoi.\nBreakfast at hotel and then today you will play around at King’s Island Golf Resort which is located 40 km from the city and take you 1 hour by driving. The first golf course in North Vietnam, King’s Island Golf Club has again excelled in another first for this region by completing the second eighteen hole course on their magnificent property which now boasts of a 36 hole golf facility. The new PCD designed course named Mountain View is by far more visually spectacular and challenging to play over the existing Lakeside Course which gives members a variety of options on which course they wish to play. Mountain View is a championship layout Par 72 – 6416 meters (7016 yards) which offers multiple tee systems and a range shot-making options for golfers at any handicap. Back to Hanoi. Overnight at hotel."},{"title":"Day 11 (Thu): Chi Linh Golf & CC – Halong Bay","description":"Meal: Breakfast- Accommodation: Hotel in Ha Long Bay\nThe Chi Linh Star Golf & Country Club features 27 holes of challenging international standard golfing. The golf club, one of the newest in Vietnam, opening in late 2003, and is located about half way between Hanoi and the popular Halong Bay.\nBreakfast at hotel and our driver will bring you to Chi Linh Star Golf & Country Club which is located more than 1 hour from the city. Tee off and enjoy a round of 18 hole at this 27-hole course, which  opened in 2003, hosted the 2004 Carlsberg Masters which  was the first professional golf tournament in Vietnam’s north. The course lies in a splendid  valley surrounded by rolling forested hills and a number of lakes, creeks, and natural water hazards which come into play on many of theholes. Playing conditions are maintained at a high standard year round as Tiff Eagle grass greens ensure smooth and fast putting surfaces. After the game, we will continue driving to Halong City. Check-in hotel and tonight you will be staying in Halong."},{"title":"Day 12 (Fri) Hanoi – Halong Bay","description":"Meal: Breakfast- Accommodation: On Cruise\nThe morning will be free. At the noontime, you will transfer to Tuan Chau Harbor to embark on a boat for an exploration of the legendary Halong Bay. This exciting five-hour cruise will provide us with a fantastic view of the picturesque scenery blending with the sky and some 3,000 limestone islands rising amazingly from the clear and emerald water. The limestone karsts formations are littered with beaches, grottoes and beautiful caves. Along the way, we will anchor for a leisurely swim in a secluded cove and an enjoyable visit to one of the many hidden grottoes beneath towering cliffs. Stay overnight on the Junk Cruise."},{"title":"Day 13 ( Sat): Halong Bay – Hanoi","description":"Meal: Breakfast- Accommodation: Hotel in  Hanoi\nWaking up and having breakfast served onboard. Continue cruising around the bay. Take sampan to visit Luon Cave and come back to the boat. Having brunch before disembarking and van will pick you up at the pier and transfer back to Hanoi. Visit Dong Trieu ceramic and pottery village on the way. Arrive in Hanoi at 04:00 pm. Free at leisure. Overnight in Hanoi."},{"title":"Day 14 (Sun): Hanoi Departure","description":"Meal: Breakfast- Accommodation:  NA.\nFree at leisure until transferring to the airport for departure flight. End of service."}]},{"name":"Ho Chi Minh and Hanoi city in Vietnam 10 Days 9 Nights","duration":10,"travelStyle":["Discovery","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":659,"summary":"Mother Nature offered Vietnam thousands of beautiful and lovely destination with busy and modern Sai Gon city with lovely Mekong Delta. Exploring local daily life at floating village on Mekong River. Discovering the unbelievable Cu Chi tunnels underground, panorama Halong Bay landscape, breathtaking Sapa mountain, historical and cultural Ninh Binh - ancient capital of Vietnam in 10th century.\nLet’s participating with us to get the unforgettable holiday including the internal flight within Vietnam.\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/153911_b3364b6f.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/153911_b3364b6f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_a50fa77b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_36f93c2b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_2a4b6570.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_f33ac13e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_4bfc2342.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_988a7769.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_b004eb4b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_576d82cc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_f1fc3a5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_79579d62.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_76155724.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_a9adbf54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_39b8e85c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_73f29d48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_959b79ae.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_80293f04.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_14710a69.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_9349a233.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_56fad2b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_d1d93750.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_7221a19e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_80936a0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/153911_5220f818.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta","Hanoi","Sapa","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Ho Chi Minh city arrival - Aiport pick-up - Hotel check in ( No meal)","description":"Welcome to Ho Chi Minh city. Driver will pick you up after you getting the visa and transfer you to the hotel. Check in the hotel and have your free time.\nOvernight at hotel in Ho Chi Minh city.\n"},{"title":"Day 2: Ho Chi Minh - Cu Chi tunnels half day (Meal: B,L)","description":"07:45-08:15 am: Tour guide and driver will pick you up at your hotel in District 1 in Ho Chi Minh city and depart for Cu Chi tunnels trip. The trip to Cu Chi will take approximately one and a half hours bus driving. \nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \n14:00: Return to your hotel in Sai Gon. \nOvernight at hotel in Ho Chi Minh city\n"},{"title":"Day 3: Mekong Delta Discovery My Tho - Ben Tre Full Day (Meal: B,L)","description":"07:30-08:15: Tour guide and bus will pick you up at your hotel and leaving the hustle and bustle of Ho Chi Minh City and start your trip to depart for My Tho, the town lies on the left side of the Mekong River. Boarding the sampan and cruising down the river around the four beautiful islands known as Dragon, Unicorn, Phoenix and Tortoise islands. \nStop over at Unicorn Island, go walking around country lane and seeing orchards, enjoy tropical fruits, folk song music which performed by the local people. Visit the fruit plantation. \nRiding a hand-rowed sampan through Thoi Son canal and treat yourself in the beauty of the countryside, visit the family business, visit honey-bee farm, enjoy honey tea and coconut candy workshop. \nHave lunch at local restaurant. Break time.\nIn the afternoon, time for cycling around the Tan Thach village, meet the local villagers to experience the local daily life in the Mekong delta. Hammock relaxing and enjoy cool breeze for those can’t join the cycling trip. \n17:30: Return to Ho Chi Minh City.\nOvernight at hotel in Ho Chi Minh city\n"},{"title":"Day 4: Ho Chi Minh airport transfer - Flight to Hanoi city (Meal: B )","description":"Today, you have free time to exploring Sai Gon by your own until driver comes to pick you up and transfer to the airport for flight to Hanoi city.\nUpon arrival Hanoi airport, driver will pick you up and transfer you to the hotel in Hanoi old quarter for check in. Free day to explore Hanoi city - most interesting area of Hanoi city.\nOvernight at hotel in Hanoi\n"},{"title":"Day 5: Sapa – Ylinh Ho – Lao Chai – Ta Van village ( Meals: B, L, D )","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n( 12km trekking through the terrace fields to homestay )\n06:30 - 07:00 am: Guide will pick you up at your hotel in Hanoi old quarter and transfer to sleeper bus. Departing to Sapa with short break-time on the way.\n12:30 - 13:00: Our local tour guide would love to welcome you to Sapa. Pick you up when you arrive Sapa and start enjoy Real Sapa Experience trip.\nFrom Sapa town, you have the chance trekking through the town to see the background of the daily life and architecture. Chill out the town, you will step on the terrace rice, corn and potato fields. Not only trekking to see the natural landscape, fresh air, but also host will love to share with you about their local culture, custom and habit. You will get the feeling that you are a member of her family, non-touristy.\nTrekking through the villages to see and understand much more the life of minority in Sapa. With the simple house, life and people, you get the light feeling and want to stay there for longer time.\nOn trekking route, terrace by terrace fields will appear in front of you, with the lovely waterfall where you will have a nice time for relaxing, taking photo.\nArrive guide’s house, her family will welcome you as a member back home for long time no see. You will prepare the dinner with her family if you like it. Pick the vegetable from the garden, cooking the local foods in the kitchen while sharing a lot of stories with each other.\nEvening time, it is the nicest time to experience the local family’s atmosphere. Sharing and learning their culture with the stories host is so happy to share with you.\nOvernight at guide’s house.\n"},{"title":"Day 6: Ta Van – Giang Ta Chai village – Sapa – Hanoi ( Meals: B, L )","description":"You can wake up a little early to see how about host starting a new day. Cooking breakfast and join altogether.\nYou have the options:\n+ Trekking to see the further village and sceneries, through the Bamboo forest, terrace fields.\n+Or, you can tell your guide to go to their family’s fields to work, such as harvesting, or planting, or taking care their fields. \nGet back to Sapa town by shuttle bus. \nYou still have the free time to visit local market in Sapa town, and discover Sapa town by your own before come back to Hanoi.\n15:30: Get on the sleeper bus and come back Hanoi city.\n21:30: Arrive Hanoi Old Quarter.\nOvernight at hotel in Hanoi\n"},{"title":"Day 7: Ninh Binh - Hoa Lu – Tam Coc – Cycling 1 Day Tour (Meal: B,L)","description":"8:00 – 8:30: Driver and tour guide will meet you at your hotel and depart the Hoa Lu – Tam Coc tour.\nBus will stop on the half way to get the break time after 1 hour and half in the bus. At this moment, you can stretch your legs and take some photos of countryside.\nKeep heading to Hoa Lu – the ancient capital of Vietnam in 10th century under 2  Dynasties: Dinh and Le Empire. You will understand much more about Vietnam with King Dinh and King Le’s temple. Through this trip, you have the chance to find out about the history, culture, architecture, and development of Vietnam what is still maybe strange of you.\nThen, bus will transfer you to the local restaurant where you have the buffet Lunch with a lot of local food. And one of most special and famous in Ninh Binh is goat meat.\nAfter Lunch time, tour guide will help you understanding about Tam Coc before enjoy the rowing boat time on Ngo Dong river. Ngo Dong river meanders among the mountains and you will have the feeling that we are living in the most peaceful  and beautiful place in the world. Boat takes you through the 3 caves ( Hang Ca, Hang Hai, Hang Ba ). You see not only the “ Halong Bay on land”, but also you have the chance to meet the local farmers who is working in the rice field. Lovely time to understand more the local countryside’s life in Vietnam.\nAfter rowing boat time in Tam Coc, you are riding bicycle to the paddy field and through the local villages to discover the simple daily life of local people, you will have the awesome experience in the country.\n16:00: Get back the bus and heading back to Hanoi. Saying goodbye the lovely point.\n18:30: Arrive the hotel in Hanoi old quarter.\nOvernight at hotel in Hanoi\n"},{"title":"Day 8: Hanoi – Halong Bay – Overnight on Cruise ( Meals: B, L, D )","description":"Please check out the room and you can leave your luggage at the hotel. You can only bring hand bag with something for the trip: passport, clothes, camera, walking shoes, sandals, and any thing you need for trip.\n\n7:45 – 8:30am: Tour guide and bus pick you up at the hotel. Heading to Halong Bay with short break time on the haft way.\n12:45: Arrive Halong harbor. Crews welcome you on boat with Welcome Drink. Check in the cabin and enjoy the traditional Vietnamese Lunch. Lunch will be served while cruising among the islands to the center of Halong Bay.\nAfter lunch time, free time to sunbathing on the sundeck, photo hunting time of peaceful view, local fisherman’s daily life.\n15:00: Cruise anchors in the center of Halong Bay. Visiting the Amazing cave – one of the biggest and most beautiful grottos in Halong Bay.\n16:00: Heading to Ti-Tov island where you can hike up to the top to view whole bay. From the top of this island, you can see a stunning seascape and sightseeing. Also you can do sunbathing on the sandy beach, swimming in the pure water.\n17:15: Back to the boat. Enjoy the Sunset time with fruit and local Wine.\n19:00: Dinner will be served with a lot of delicious Vietnamese foods.\nAfter dinner, free time to watch movie, playing the card, or attend the Squid fishing game. Or simply, sharing the story with other people in your group.\nOvernight on cruise \n"},{"title":"Day 9: Halong Bay – Kayaking – Hanoi ( Meals: B, L )","description":"You should wake up a little early to enjoy the Sunrise in Halong Bay – the nice moment during the trip.\n7:00: Enjoy the breakfast with Tea & Coffee.\n8:15: Going to do Kayaking among mountains, exploring the beauty of Halong Bay by your own.\n9:30: Get back to cruise, check out the cabin.\nOur chef on board will share with you how to make Vietnamese spring roll during the Cooking Demonstration, and you can make Spring Roll by yourself.\nThen, take the leisurely time to rest on sundeck to view the bay.\n11:00: Lunch will be served. Enjoy the meal while cruising back to Halong harbor \n12:30: Get on the bus back to Hanoi with short break time on half way.\n16:30 – 17:00: Arrive your hotel in Hanoi city.\nOvernight at hotel in Hanoi\n"},{"title":"Day 10: Hanoi Departure (Meal: B)","description":"According to your flying time, driver will pick you up at the hotel and transfer to Hanoi airport for your flight out. Have a good flight and see you again!\nNote: This tour is organized by individual trips with group joining. There is a different group each trip during your holiday. \nWho should participate? - This tour is suited for all, including children as well. \nPrice structure: - Price quoted is based on per person basis.  \nIf you are solo traveller booking Share Room Option, you will stay at Share Dorm Room at the hotel in each city.\nThis is 3 star package, please advise if you want to upgrade to 4 or 5 star package! If you want to extend the trip, or add any more night in any city, or start from the Hanoi city, please advise!"}]},{"name":"Hanoi 5 Days 4 Nights ( Hanoi, Ha Long, Ninh Binh)","duration":5,"travelStyle":["Sightseeing","Adventure","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":250,"summary":"Asia Pacific Travel provide for package 5 days 4 nights visit Ha Long bay one night on cruise and Ninh Binh with 1 day to visit Bai Dinh and Trang An ","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140637_306cdc9b.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140637_306cdc9b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140637_70a93b46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140637_061d4191.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140637_356deaff.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140637_b3fa6f5c.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight in Hanoi.\nStart point\n Noi Bai international airport, Noi Bai International Terminal 2, Sân Bay Quốc Tế Nội Bài, Huyện Sóc Sơn, Hanoi 140800, Vietnam "},{"title":"Day 2: Hanoi - Ha Long Bay (Breakfast, Lunch, Dinner)","description":"07:45 - 08:30 Meet your tour guide then go for Ha Long Bay. Have a break 20 minutes en-route to free your legs. Embark BaiChay harbor, board  Cruise by a tender. Enjoy a welcome drink, receive cruise briefing.  \n- Savor lunch on board and visit Sung Sot amazing cave with millions of surprising stalactites and stalagmites. \nStop at SoiSim island or Titop island one hour for swimming, sun-bathing… Do kayaking among hidden parts.  Drop anchor in a calm water are, relax on the sundeck at sunset. Join in a cooking session on board with our chef making some special dishes with suggested recipe. \n19:00 Have dinner on board.Have fun with karaoke singing, or try your luckwith squid-fishing.Overnight on Cruise"},{"title":"Day 3: Halong Bay - Hanoi (Breakfast, Lunch)","description":"07:00 Enjoy a new day with complimentary tea and coffee served. Have breakfast on board Check out your cabin. Photograph wonderful views of Ha Long while sailing back to harbor. \n11:00: Savor lunch on board and leave  Cruise. \n12: 30:  Say goodbye to Ha Long Bay then return to Hanoi. Have a rest en-route again to free your legs. 17:30 Drop you off at your hotel. Tour ends. Overnight in Ha Noi"},{"title":"Day 4: Hanoii - Hoa Lu - Tam Coc - Ninh Binh (Breakfast, Lunch)","description":"08:30 Meet your tour guide at suggested places around Hanoi Old Quarter. - Depart for Ninh Binh province (90 km south of Hanoi). Have a break 20 minutes en-route to free your legs. - Arrive at Hoa Lu, which was once depicted the ancient capital of Viet Nam, settling up in the 10th century.   - Visit temples of two dynasties of Dinh and Le with a very unique architectures in the old time.  - Learn about ancient culture through an excavation of vestiges of Royal Palaces ground dated 10th century.  12:30 Arrive Tam Coc. Relax and enjoy lunch in a nice restaurant nearby. - Board the sampan boats in Tam Coc going along river among the villages, mountains and rice fields. Passing through 3 caves \"Hang Ca - First cave, Hang Hai - Second cave, Hang Ba - Third cave\" to get a wonderful feeling. Boat returns to the dock for bus drive back to Hanoi.  18:00 Arrive in Hanoi. Have a dinner at Dinner restaurant  Overnight in Ha Noi"},{"title":"Day 5: Hanoi Departure (Breakfast)","description":"Breakfast at hotel, Free time for shopping until  tour guide  and driver will pick you up at your hotel  to have a lunch before take you to the airport for your flight back home."}]},{"name":"Classic Vietnam: Hanoi to Ho Chi Minh City — Plus","duration":10,"travelStyle":["In-depth Cultural","Boat","Adventure","Group","Fully Guided","Holiday"],"oldPrice":1169,"price":994,"summary":"Part of our new Travel with Confidence Plus Collection, this trip features a smaller group size, private transportation, en-suite bathrooms, and a discounted rate for My Own Room. Sail through limestone karsts aboard a traditional junk boat and walk the streets of imperial capitals. From vibrant Hanoi, the natural beauty of Halong Bay, the atmospheric imperial capital of Huế, and the charms of Hoi An to the modern day life of Saigon, experience the energy of Vietnam in 10 jam-packed days. An experienced Chief Experience Officer will lead you to must-see highlights with time in between to do your own thing.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/200704_6b6a90d5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/200704_6b6a90d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2bff60e465.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2bff60e467.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2bff60e468.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2bff60e46a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2c0d6119e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_5ef2c0d6119e2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/200704_44b61fba.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"There are no planned activities today until an evening welcome meeting. After the meeting, opt for dinner out with the group.\n\nAccommodation:\n- Bonne Nuit Hotel (or similar).\n\nIncluded Activities:\n- Meet Your CEO and Group\n\n\n"},{"title":"Day 2: Hanoi/Ha Long (1B, 1L, 1D)","description":"Drive to Bai Chay harbour, the jumping off point for Ha Long Bay. Thousands of islands with intricate cave systems rise dramatically from the waters. Sail past limestone karst mountains in the junk boat and stop to visit some of the islands and caves.\n\nIn the evening, devour a seafood dinner, then opt to enjoy a drink on deck under the stars.\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Shared Van 03:00 Hr(s)\n- Junk: Ha Long\n\nIncluded Activities:\n- Halong Bay Overnight Cruise\n\n\n"},{"title":"Day 3: Ha Long/Huế (1B, 1L)","description":"Enjoy breakfast on board before a morning sail back to the port and return to Hanoi. Hop on a short flight to Hue.\n\nAccommodation:\n- Asia Hotel (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Airport Transfer\n- Plane 01:00 Hr(s)\n\nOptional Extras to chose from:\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 4: Huế (1B)","description":"Start the day with a visit to the Tien Mu Pagoda followed by a visit to the tomb of one of Vietnam’s former emperors. After, opt for a vegetarian lunch at a local nunnery.\n\nWhile in the city, try some local Hue specialties such as banh khoai (Hue savoury pancakes), and banh bot loc boc tom thit (thin rice paper filled with meat and shrimp). Wash it all down with a Hue beer.\n\nOpt to pre-book the \"Hue Motorbike Tour\" activity on the checkout page ahead of time, to include this optional on your tour.\n\nAccommodation:\n- Asia Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Tien Mu Pagoda Visit\n- Imperial Citadel Tour\n- Royal Tombs Visit\n\nOptional Extras to chose from:\n- Hue Motorbike Tour\n\n\n"},{"title":"Day 5: Huế/Hoi An (1B)","description":"Cross the Hai Van Pass (weather permitting), with fantastic views in all directions, before arriving to Hoi An in the afternoon. \n\nWith three nights here, there's plenty of time to explore all this charming town has to offer.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Private Vehicle 04:00 Hr(s)\n\n\n"},{"title":"Day 6: Hoi An (1B, 1L)","description":"Explore all Hoi An has to offer. Dive into the culture, hang out on the beach or get clothes tailor-made in one of the many shops around town. Enjoy a noodle making demonstration and lunch at Oodles of Noodles, a G Adventures-supported project.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n\nIncluded Activities:\n- Oodles of Noodles Demonstration and Lunch\n\n\n"},{"title":"Day 7: Hoi An (1B)","description":"Spend a free day exploring all Hoi An has to offer.\n\nAccommodation:\n- Vinh Hung 2 Resort (or similar).\n\nMeals Included:\n- Breakfast\n\n\n"},{"title":"Day 8: Hoi An/Ho Chi Minh City (1B)","description":"Drive to Da Nang for the flight to Ho Chi Minh City, once the capital of South Vietnam and the country’s commercial centre. Start exploring the small alleys and busy streets, keeping an eye out for laquerware shops and delicious local food stalls.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nTransport:\n- Plane: Hoi An to Ho Chi Minh City 01:00 Hr(s)\n\n\n"},{"title":"Day 9: Ho Chi Minh City (1B)","description":"With some free time in the city, opt to visit the Thien Hau and Giac Vien pagodas and stroll through the immense Ben Thanh Market. Also well worth a visit are the Reunification Palace (the residence of South Vietnam presidents before 1975), the city's Chinese quarter of Cholon, and the War Remnants Museum.\n\nAccommodation:\n- Lotus Boutique Hotel (or similar).\n\nMeals Included:\n- Breakfast\n\nIncluded Activities:\n- Cu Chi Tunnels Guided Tour\n\n\n"},{"title":"Day 10: Ho Chi Minh City (1B)","description":"Not ready to leave? Your CEO can help with travel arrangements to extend your adventure.\n\nMeals Included:\n- Breakfast\n\n\n"}]},{"name":"Vietnam the Marvellous Hyphen","duration":5,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":390,"summary":"Exploring the UNESCO heritage sites in Hue - the deeply evocative capital of the Nguyen emperors still resonates with the glories of imperial Vietnam. \nStrolling along the narrow street at Hoi An ancient town - an exceptionally well-preserved example of a South-East Asian trading port dating from the 15th to the 19th century \nDiscovering Bana Hill with the impressive structure  Golden Bridge which a pair of giant stone hands emerging from mountain to cradle a golden thread ","highlights":["Indulge yourself along the ancient lantern-lit streets of Hoi An town","Get mesmerized by the charm of the old capital of Vietnam, Hue","Have ample time to admire the lush rice paddies along the road"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/158819_299d25e5.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/158819_299d25e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_89a9a67e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_cecba3c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_4f7e649b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_4bfe5d5b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_028f2180.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_c91ee331.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_6577c5fa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_2ee44512.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_ea49f8f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_e316186d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_c7f2acb9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_539d796c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_f1aff5ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/158819_c1602f04.jpg"],"destinations":["Hue","Hoi An"],"timeline":[{"title":"DAY 1: DA NANG ARRIVAL – HUE (-/-/-)","description":"Welcome to Danang – Vietnam!\nPicked up by our driver from Danang International airport and transfer your hotel in Hue to check in. Overnight in Hue. \nPlease note: Hotel check in time is from 14.00\nMeal: Nil\n"},{"title":"DAY 2: HUE CITY TOUR (B/L/-) – Group tour","description":"Breakfast at hotel. \nPick up you at your hotel at around 7:30 - 8:00 AM. Our full day visit in Hue included: Emperor Minh Mang's Mausoleum, Emperor Khai Dinh's Mausoleum, Performing Programs of VO KINH VAN AN - Vietnam Traditional Kungfu and Emperor Tu Duc’s Mausoleums. Stop on the way to see how conical hats and incense sticks are made. \nLunch at a local restaurant.\nIn the afternoon, visit Imperial capital during Nguyen Dynasty, Hue museum of Royal Fine Arts and the seven – storey Thien Mu Pagoda on the riverbank. Return by boat on the gentle Perfume River and do not miss the sunset on the river. Overnight in Hue.\nMeal: Breakfast and Lunch"},{"title":"DAY 3: HUE – DA NANG - HOI AN ANCIENT TOWN TOUR (B/-/-)","description":"Breakfast at hotel and check-out, depart from Hue to Hoian by express bus and passing by Lang Co beach, Hai Van Pass, Marble mountains on the way. \nArrive at your hotel in Hoian around noon and check in. \nIn the afternoon, together with our guide in Hoian, we’ll walk over the tile-roofed Japanese Bridge, visit taciturn Chinese Assembly Halls, visit ancient houses and Trading Houses, pagodas and stroll into the market located by Thu Bon river, where we may find out the same feelings of the artists, who see the rooftops of Hoi An a magical old world of Oriental feel and source of inspiration. This is also a wonderful town to shop for lanterns, soft silk, raw silk, or get your clothes tailored within a day. Overnight in Hoian.\nMeal: Breakfast\nHue – Hoian bus time table: Hue (09:00AM) - Da Nang (12:30) - Hoi An (14:30)"},{"title":"DAY 4: HOI AN – BANA HILL – HOI AN (B/L/-) – Group tour","description":"Breakfast at hotel. \nPick up at Hoian hotel at around 8.00 then transfer to Bana Hills Station. Let’s ride on a modern system of cable cars for a bird's-eye view over the area while enjoying a feeling of flying in the blue sky amidst the clouds and wind. We will visit some old French villas en route, as well as the Golden bridge, Nui Chua & the Mountain Peak (at the height of 1,487m). \nLunch at local restaurant. \nIn the afternoon, Visit Vong Nguyet villa where we will visit the wine cellar, Linh Ung Pagoda, Sakyamuni Buddha's monument. Drive back to Hoian around 16:00 PM. Overnight in Hoian. \nMeal: Breakfast and Lunch"},{"title":"DAY 5: HOI AN – DA NANG DEPARTURE (B/-/-)","description":"Breakfast at hotel. \nIf your flight is in the afternoon, you will have a half day more for the sightseeing and shopping before the departure. There will be nothing better than leisure time in the ancient town of Hoian to refresh yourself and chill out your recent impression of your visits in Vietnam \nCheck out time and transfer to the Danang airport for the departure flight back to your sweet home.  End of services!\nMeal: Breakfast \nPlease note: Standard check out time is around 12.00.\n"}]},{"name":"7 days Experience The Beauty of Northern Vietnam","duration":7,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":423,"summary":"Only 7 days is enough time for you to discover and experience the beauty of culture, people, local food, enjoy the majestic landscape through the famous tourist attractions in North Vietnam as Ha Long Bay, Pu Luong, Hoa Lu, Tam Coc, Mua Cave... A great trip awaits you to explore.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/119713_90866448.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/119713_90866448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_ec0ac93e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_b6f6ca0a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_509bfe0c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_eda4d685.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_7963d4b1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_178268ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_ccc60f31.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_5e702f54.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_bcebaabd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_3d24b3d5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_e1020eed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_7120b71d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_53c11d65.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_77ee5dfe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_8ed66a7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_4cd86a6a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_cecf0190.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_9753f302.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_f4a243a7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_74c6b7f5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_cb261d36.jpg","https://cdn.tourradar.com/s3/tour/1500x800/119713_55551477.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi","description":"Xin Chao! Welcome to Hanoi, Vietnam. Hanoi, one of Asia’s most enchanting cities, full of culture, history and the engaging contradictions of a rapidly developing and deeply traditional society. You are greeted in Noi Bai airport by guide and driver at Noi Bai International Airport for your transfer to the hotel.\nIn the evening, a culinary adventure takes you to taste sampling street food in the Old Quarter. It’s a great opportunity to try all those weird and wonderful foods you see but just aren’t sure what they are! The local brew is a plus point for this short trip. Find an open seat, do as the locals do: pull up a stool and enjoy a drink while watching the world go by at Bia Hoi Corner.\nContinue to wander in the old quarter’s narrow streets as your guide points out a range of tasty noodles, bread and snacks. Don't forget to bring the camera to take some beautiful shot about local nightlife. The pavement Vietnam is really street food haven, not only for walking. End the night with dessert from Hanoi’s best-known ice-cream parlour before heading back to your hotel."},{"title":"Day 2: Hanoi - Halong Bay","description":"In the morning, the tour guide will pick you up at the hotel in Hanoi Old Quater. transfer to Halong Bay in Quang Ninh province. On the way, our guide will introduce to you about the culture, history, people, of the places that you will pass by. Then you will have a short break in a middle way for 15-20 minutes. On arrival at Tuan Chau Port, get on the boat, you are warmly welcomed by professional and friendly crews. Lunch will be served in the dining room while the boat’s cruising through the thousands of islands and islets. You will have private time on the upper deck to enjoy the beauty of Halong Bay. After that do kayaking in floating village area for an hour, swimming if the weather permitted. Then back the boat for sunset party on the sundeck. Enjoy the special dinner cooked by our professional chef. In the evening, free time for relaxing, singing, squid fishing… (Meals Included: Breakfast, Lunch, Dinner)"},{"title":"Day 3: Halong Bay – Hanoi","description":"In the morning, after Tai Chi lesson, breakfast will be served with egg, toast, coffee, tea… Tourists start to visit cave named \"surprising cave\", one of the most beautiful caves on Halong Bay. After that, the boat continues cruising further, go through many islands and islets to discover the hidden charm of the bay. 10.00 tourist join a cooking class opened right on the cruise, you will have chances to learn how to make deep fried spring roll \"Nem Vietnam\". Cruise back to the harbor after finish lunch. Say goodbye to the crew and disembark. Get on the bus to go back to Hanoi. (Meals Included: Breakfast, Lunch)"},{"title":"Day 4: Hanoi - Pu Luong Nature Reserve","description":"Departing from your hotel around 8 am, head towards Pu Luong. There are 30 minutes for short break in Luong Son. \nVisit the local market of the Muong Ethnic Minority to learn about their daily life and customs; enjoy the beautiful scenery of Thung Khe Pass (One of the 10 most beautiful passes in Vietnam). The Pass is also known for its striking weather changes throughout the day, which the locals compare to a day of changing seasons.\nArriving at Pu Luong around noon, enjoy a freshly prepared lunch before starting your journey to trek the gorgeous surroundings and ethnic minority tribes. A short walk to visit Black Thai Minorities following the small roads through the terraced rice fields and cross the stream. The lovely little bungalows, the local people dressed in unique outfits, they always smile and waving tourists. Simple life here is the highlight of this short trekking.\nRelax at the lodge, a rustic-but-comfortable retreat. You have dinner at the lodge, enjoy some local rice wine with the family. (Meals Included: Breakfast, Lunch, Dinner)\n"},{"title":"Day 5: Pu Luong - Hanoi","description":"Wake up as early as you wish to witness the daily life of the locals before having breakfast. After breakfast at the lodge, go on to explore the other interesting areas of Lu Luong. You trek to follow the small road through the paddy field and sugar cane fields, cross the Hanging Bridges to visit other remote rural villages of Thai Ethnic. Pay a visit to some of the neighbors, learn more about their life and society. Stop at the giant waterwheels, ducks farm to learn about the agriculture before getting on the Bamboo Raft for a relaxing cruise on Cham stream. After heading back to the lodge, refresh yourself check out and have lunch. before heading back to Hanoi in the late afternoon. (Meals included: Breakfast, lunch)"},{"title":"Day 6: Hoa Lu Tam Coc - Mua Cave","description":"After collection from the Hanoi hotel, enjoy a scenic drive to an area of natural beauty, often referred to as ‘Ha Long Bay on land’. First stop at Hoa Lu, you will have quick visit two temples built in honour of the emperors Dinh and Le. Having been eroded over the millennia, the dilapidated ruins have nearly been absorbed by the spectacular scenery creating a mystical atmosphere that will be sure to titillate your imagination. Keep going to the Mua cave. The place attracts visitors with its many interesting stories. Climb 500 stone steps staircase leading up the peak.  From on the top, you can see all the way to Tam Coc, enjoy a stunning panoramic view of the countryside and the Ngo Dong river.\nAfter lunch, you get a small boat. Ferryman will take you to visit the scenic landscape of the majestic mountains, the fields in the triangle cups when the sampan go along the Ngo Dong river. It is an outstanding natural beauty and the scenic karst formations which contribute to its reputation as being the “Halong Bay on land”. The last activity is cycling. Cycle for half an hour on quiet roads through villages, rice fields, rivers and rocky outcrops inside the village. The most common friends you’ll be making are the friendly cows and water buffalo on the roadside or you may have to stop as a family of ducks cross ahead of you. Finally, return to the bus, where your vehicle will be waiting for you, and arrive back in Hanoi in the late afternoon. (Meals included: Breakfast, Buffet lunch)"},{"title":"Day 7: Hanoi Departure","description":"Have a breakfast at hotel. Check out your hotel (unless you choose to stay a little longer). A private transfer to the airport for departure flight home or travelling on to more adventures, we will help you with the planning.\n(Meals included: Breakfast)"}]}]