[{"name":"Hanoi And Red River Delta 8 days 7 nights","duration":8,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1157,"summary":"The 8-day guided discovery tour in Hanoi and Red River Delta is for individuals, small groups who like adventure in North Vietnam. It includes such highlights as: trekking Sapa hilltribe villages; biking through emerald-green rice paddies and past ancient, mountaintop pagodas in Ninh Binh; kayaking on the beauty of the Halong Bay","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a078743753.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a078743753.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a078743758.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a078743760.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bd0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07874375a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07874375b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07874375d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07874375e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bd3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bd6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bdb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/194116_5e4a07e754bde.jpg"],"destinations":["Hanoi","Lao Cai","Sapa","Ninh Binh","Halong Bay"],"timeline":[{"title":"Hanoi Arrival (D)","description":"\nWelcome to Hanoi, Vietnam’s bustling colonial capital. Your driver and guide will meet you outside the baggage claim of Noi Bai Airport and take you to your hotel in the city center. In the afternoon, enjoy an orientation walk, visiting some of Hanoi’s main attractions: the Opera House, Old Quarter, Hoan Kiem Lake and Ngoc Son Temple. Rest of the day, you are free at leisure."},{"title":"Hanoi City Tour - Lao Cai (B/L/D)","description":"Today you have a full day to explore Vietnam’s charming capital. With its wide tree-lined boulevards, French colonial architecture, peaceful lakes and ancient oriental pagodas, Hanoi is an eclectic mix that offers something for everyone. Your city tour will take you to Hanoi’s key sites: the Ho Chi Minh Complex (Ho Chi Minh's Mausoleum and stilt house), the nearby One Pillar Pagoda; the Presidential Palace; the Temple of Literature; the Quan Thanh Temple, the sedate Tran Quoc Pagoda & West Lake; and one of the city's museums (a choice between the History Museum and the Ethnology Museum). Enjoy a traditional Water Puppet Performance – a unique Vietnamese Art form hailing from Southeast Asia’s wet-rice culture. In the evening, savor a welcome dinner of authentic Vietnamese food at one of Hanoi’s finest restaurants – before heading to the train station to catch your night train to Laocai."},{"title":"Lao Cai - Sapa (B/L/D)","description":"The train arrives at the Lao Cai railway station in the early morning. Your guide and driver will meet you there and take you on the 40km drive to Sapa, Northwest Vietnam’s premier travel destination, named “Tonkinese Alps” by the French.\nEnjoy breakfast in the town while breathing clean mountain air. At 10:00 A.M, leave the hotel and start trekking. Walk through the local market then follow a road going downhill to Cat Cat Village. The Black Hmong's village is famous for its brocade weaving craft as well as its gold and silver jewelry making. The walk to Cat Cat Village and its nearby hills provide an opportunity to see farms and techniques used by the people in the area. Short stop at a waterfall and a hydroelectric station. Afterward, trek up back to the town and spend rest of the day at leisure."},{"title":"Trekking In Sapa (B/L/D)","description":"\nAfter breakfast, drive south towards Muong Hoa Valley, and then descend by foot through the largest terraced rice paddy area in the Sapa region. The walk takes you through the village of Lao Chai, home to the Black Hmong minority, then onto the Ta Van village, inhabited by the Zay minority. Experience a great opportunity to observe the daily life and traditional hospitality of these local people before continuing on to the remote Topas Ecolodge in Su Pan. This unique, eco-friendly lodge is situated atop two cone formed hills, set deep in the spectacular Sapa valley of northern Vietnam."},{"title":"Sapa - Hanoi (B/L/D)","description":"\nSet by foot to the Lech Village. After a short walk on the main road you will descend towards the Thanh Kim River, stop en route to capture the most beautiful scene of the valley. Cross the river, you will head up to the village where you spend your time to experience the daily life of the local people and then follow the main road to return to the Ecolodge for lunch and check-out. Head back to Sapa for some free time and finally descend to Lao Cai and enjoy dinner at one of the local restaurants before boarding your overnight train for the return trip to Hanoi."},{"title":"Hanoi - Ninh Binh (B/L/D)","description":"\nArrive in Hanoi in the early morning then drive to Ninh Binh. Hoa Lu, situated 100 km south of Hanoi, was the capital city of Vietnam under the Dinh Dynasty between 968 and 1009 AD. Some of the sanctuaries and tombs have survived the years and can still be seen today. Start cycling on countryside roads onto Hoa Lu and the ancient 10th century citadel. Apart from the historical interest, the area is also one of astounding natural beauty with limestone peaks whose splendor is often said to surpass that of Halong Bay. Continue your ride through the limestone peaks to Tam Coc, passing rice paddies and rural villages. In Tam Coc lunch is served at a local restaurant with a view over the boat pier. The tour includes being rowed along the Ngo Dong River, which makes for a truly unforgettable experience, passing between towering limestone peaks. You conclude an excursion day with a visit to Bich Dong Pagoda."},{"title":"Ninh Binh - Halong Bay (B/L/D)","description":"\nNext After breakfast at hotel, your driver will take you on a 4-hour drive passing the countryside of the Red River Delta to Halong Bay. Spend 24 hours on a traditional Junk Cruise in the amazing bay: a natural wonderland composed of jutting limestone islands and sparkling turquoise waters. Arrive at the dock around noon and board your junk. Savor a gourmet lunch of fresh seafood onboard as you sail out into the mystical bay. In the afternoon, cruise around some of Halong’s many islands, including Dinh Huong and Ga Choi. Along the way visit one of the bay’s 3 largest caves (Thien Cung, Dau Go or Sung Sot) and kayak along the hidden parts of the bay. Go swimming (weather permitting), snap photos or just relax as the sun starts to set on the Tonkin Gulf. Pass the night on your junk, lulled to sleep by the gentle rocking of calm waters."},{"title":"Halong Bay - Hanoi Departure (B)","description":"\nAwake early and participate in Tai Chi on the top deck or simply relax and enjoy the sunrise over the bay’s towering islands. Enjoy a morning cup of coffee or tea, before setting out to explore nearby islands by rowboat. Return to the junk for breakfast then take advantage of the sundeck and admire the amazing rock formations of Bai Tu Long Bay as you navigate back to Halong City. Have brunch on board the boat before returning to Halong pier. Your driver will meet you at the dock and take you to Noi Bai Airport of Hanoi to catch your departure flight home."}]},{"name":"Hanoi City - Halong Bay Cruise 6 Days Tour","duration":6,"travelStyle":["Adventure","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1200,"summary":"Spending just a week travelling from Hanoi to Halong Bay, one of 7 wonders in the world, and Halong Bay on Land (former capital of Vietnam 1000 years ago). Relaxing tour will help refresh hard-working days and return home with full of energy!","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141560_69ec2fc9.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141560_69ec2fc9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_3bc349d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_54a3de44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_f26c0c2d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_646bd5bf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_cbcb4fe5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_7d511b40.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_42ca4eb7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_65c36a66.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_a06c0f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_72276727.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_d42cadd9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_a4cf7503.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_2564e382.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_a52871e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_bed01769.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141560_26b913da.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1 – Hanoi Arrival","description":"Upon arrival at Hanoi’s Noi Bai International airport, you will be greeted by LVP Travel guide and transferred to your booked-hotel in Hanoi City Center which is Vietnam Capital and considered as one of the Vietnam national Culture, Travel, and Policy.  After freshening up, you will have dinner at one of the old French colonial villas which have been converted into Authentic - gourmet restaurants. Then you can experience a performance or 45 minute lasting Show at the Thang Long Water Puppet Theater before overnight stay in Hanoi."},{"title":"Day 2: Hanoi full day City Tour (B/L)","description":"On the Second day, you’ll be able to explore the fascinating Old Quarter Street and its hundreds of specialty shops, selling silk clothing, lacquer ware, embroidered linens, furniture, bamboo, cooking utensils, ceremonial objects and more souvenir items, handicraft made all come from hundreds of Vietnamese Traditional Villages . You can take a stroll around Hoan Kiem Lake, enjoy people-watching at one of the numerous stylish cafes or shop for modern art in the city's myriad galleries.   You’ll also have the chance to visit Hanoi’s main cultural attractions, including the Ho Chi Minh Mausoleum, his House on Stilts, the One Pillar Pagoda, the Fine Arts Museum and the Temple of Literature. ( alter to the Confucius honor) "},{"title":"Day 3: Hanoi - Ha Long Bay with night on Deluxe 5 star rated - Junk (B/L/D)","description":"You will have a private pick up at 8:30 a.m. and be taken to the jetty where you will arrive at approximately 12:30 p.m.  You will board a Halong Bay luxury high-class junk and set sail through the bay while lunch is served.   As you cruise the magical bay, you will notice thousands of sculpted limestone islands rising from the waves like dragons' teeth.   After lunch, you’ll continue on, passing by and visiting Dinh, Ga Choi and Dog islands , Binh Phong Mountain, Sung Sot Cave  and Titov Beach.  You may want to enjoy the sunset on the mountain top, or you can choose to take a bamboo row boat to discover the tunnels and many coral reefs in a nearby scenic lagoon.  You’ll then be treated to dinner and an overnight stay aboard the junk."},{"title":"Day 4: Halong Bay - Hanoi (B)","description":"After rising to the sound of the ocean coming to life, you’ll enjoy breakfast and see the sunrise over the bay (if you choose to get up that early!)   After breakfast, you’ll be taken to Bai Tho Mountain in nearby Bai Tu Long Bay before heading back to the Halong dock in Hanoi.  Finally, you’ll enjoy dinner one of Hanoi’s finest restaurants which your guide will recommend to you.  You’ll then have a restful overnight stay and a satisfied dinner."},{"title":"Day 5: Hoa Lu & Van Long in Red River Delta Excursion (B/L)","description":"Just 100 km from Hanoi, Van Long or Thung Nang, Thung Nham, Thung Chim Valleys in options ( pick one) is an area of astounding natural beauty, whose splendor is often said to surpass that of Ha Long Bay. You will leave Hanoi at 8:30 a.m. and head south for a 2-hour drive along Highway One, also known as Road Mandarin.  You will spend one hour visiting the Dinh and Le temples of the Ancient Capital Hoa Lu and then go on to Van Long swarm restaurant for lunch. You may choose to enjoy an optional cow cart ride to Van Long Wharf for a 2-hour boat trip along the Van Long River and marvel at its limestone peaks.  Along the way, you will also see caves, green rice fields, and the rural life of the locals before returning to Hanoi.  After a 6:00 p.m. drop-off at your hotel in Hanoi, you will have free time until you settle in for a relaxing overnight stay."},{"title":"Day 6: Depart Vietnam (B)","description":"There are no activities planned for your final day, so you can unwind and plan for the next leg of your journey or opt to take in even more of the city’s offerings before being escorted to the airport for your return flight home"}]},{"name":"5 Day Hanoi to Halong Bay Cruise","duration":5,"travelStyle":["Discovery","Family","Group","Partially Guided","Ocean Cruise","Holiday"],"oldPrice":0,"price":980,"summary":"\n\tPackage Tour within 5 days from Hanoi to  Halong Bay, Hoa Lu - Tam Coc Rural Eco Tours will sastify you time to visit Vietnam in a Short week\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141557_250085de.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141557_250085de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_06fd79cb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_ac7bbdf0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_e02e7975.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_117769bc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_b3e61986.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_d021467e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_fb5a7341.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_3668a383.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_77953bad.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_58fb5b0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_d0ec5037.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141557_014d9c3b.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Arrival Hanoi - Vietnam (Dinner) - Welcome to Vietnam Country","description":"Today you’ll land tour in Hanoi. Warmly welcome by Professionally English Speaking Tour Guide & Skillful Car Driver at airport then transfer to Hanoi Downtown, a city of lakes, shaded boulevards, public parks, and the capital of Vietnam. Check into your hotel. Stay overnight in Hanoi."},{"title":"Day 2: Halong Bay Cruise full day (Breakfast, Lunch, Dinner)","description":"You will have a buffet breakfast at your hotel, then depart this morning for magnificent and peaceful Halong Bay, a dedicated UNESCO twice in 1999 and 2004 Natural World Heritage site, to enjoy a boat cruise past the islands of Trong, Mai, Am, Chen and Cong Troi (Heaven Gates). You will note as you cruise between the cliffs that many of them look like fairy-tale castles. Stop at one of the islands and visit one of the caves as Heaven Palace. Enjoy a seafood lunch onboard. Return to Hanoi with the rest of the afternoon and evening free walking. Overnight in Hanoi."},{"title":"Day 3: Hanoi Sightseeing full day (Breakfast, Lunch, Dinner)","description":"Hanoi, a city of lakes, shaded boulevards and public parks, is the capital of Vietnam. It is a very attractive city with French-style architecture. You have a full day of sightseeing ahead, including a visit to One Pillar Pagoda, which was built by Ly Thai Tong and the Temple of Literature, founded by Emperor Ly Thanh Tong. Stop in the heart of Hanoi at Hoan Kiem Lake, which contains an islet with a tiny Tortoise Pagoda. After lunch at a local restaurant, visit Ho Chi Minh Mausoleum, the Opera House and St. Joseph Cathedral. Conclude with a visit to Bao Tang Lich, once the museum of l'Ecole Francaise d'Extreme Orient, which includes artifacts from Vietnam's turbulent history. Water Puppet Show, Cyclo visiting Old Quarter. Overnight in Hanoi."},{"title":"Day 4: Hoa Lu - Tam Coc sightseeing full day (Breakfast, Lunch, Dinner)","description":"Breakfast at hotel then drive to Ninh Binh Province which was the formerly Vietnam 1000 capital. You will visit Hoa Lu – the former ancient Royal Capital of Viet Nam, Dinh Temple – where worshipped King Dinh Tien Hoang and Le Dai Hanh Temple – where worshipped King Le Dai Hanh.\nWhen finishing Hoa Lu Ancient Capital you spend 45 minutes transfer to Tam Coc which meaning of river hung on with 3 caves. The Time for lunch. After having lunch, you will take a small bamboo boat and go along the Ngo Dong river to visit Tam Coc(Three Caves) – “Halong Bay on land” for 2 hours. Then get back the whaft, and leave for Hanoi. Arrive Hanoi around 6:00pm. Check in hotel & overnight in Hanoi.\n \n"},{"title":"Day 5: Hanoi Conclude/ Departure. (B)","description":"You have the morning free to relax before your return flight home. Finish your unforgettable trip in Vietnam. Hope to welcome back again in the very near Future. Have a nice time.!\nNote: The timetable and itinerary can be flexible changed if you prefer or Natural causes such as Storms in Ha Long Bay or heavy rain, hurricane...But we will make it best by our 20 years of South Asia Pacific Travel Experience\n\n"}]},{"name":"10 Days Vietnam Tour - Hanoi - Halong Bay - Hue -Hoi an - Ho chi Minh Exploring vietnam highlight destination","duration":10,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":1350,"summary":"Exploring Vietnam from north to the south beginning at Hanoi to Halong, Sapa, Da Nang , Hoi An, Hue and Ho Chi Minh City. 10 Days for visiting all highlight historical sites in Vietnam. Packaged Tour suitable for all of Customers","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351125.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351125.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351104.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351109.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835110a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835110b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835110d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835110e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835110f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351111.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351112.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351113.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351114.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351116.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351117.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351118.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351119.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835111b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835111c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835111d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b835111e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351120.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351121.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351123.jpg","https://cdn.tourradar.com/s3/tour/1500x800/196134_5e673b8351124.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"hanoi","description":"Day 01 :  Arrive in Noi Bai Airport, A Car and Guide will pick you up at the Airport and transfer to Hotel in the center ( take 40 minutes). Enjoy Hanoi full day city or Haft day city. Depend on your time of arrival.\nVisiting Sites : Temple of Liturature ( Văn Miếu - Quốc Tử Giám) : isit this sprawling temple built to honour Confucius, sages, and scholars. Dedicated to learning, it housed the country’s first university in 1076. Explore its five courtyards, containing various gates, altars, sanctuaries, shrines, the stelae of doctors, and the Well of Heavenly Clarity\n- Ho Chi minh Mausoleum, Ho Chi Minh Stilt house, Goverment Palace: Vietnam Communist Leader in time of war 40 years ago, his house, garden, car...left here and now become one of the highlight tourist sites in Hanoi\n- One Pillar Pagoda: Old and small Temple built as Lotus on the Ho Chi Minh Museum leftside since 1049 \n- Thang Long Water puppet theater : Watch a traditional Vietnamese water puppet show with beautiful live music and intricate puppets dancing in a water stage.\n-Tran Quoc or Ngoc Son Temple located Hoan Kiem Lakeside : This is one of the oldest pagodas in Vietnam located on the eastern shore of Tay Ho. Learn about Tran Quoc's history from the 17th-century stela found on site. View it later in the day, if you can – the tall structure is striking against the setting sun.\nNote: Monday and Friday - Ho Chi Minh Mausoleum closed - replace by Vietnam 54 tribes of ethnic ( Vietnam Minority Groups)\n"},{"title":"Hanoi - Ha Long Bay Cruise: Overnight on Halong Bay Luxury Cruise","description":"Enjoy a Ha Long Bay cruise on a junk boat with visits to a cave and an island lookout. Trying a seafood lunch and dinner\nDrive to Bai Chay harbour, the jumping off point for Ha Long Bay. Thousands of islands with intricate cave systems rise dramatically from the waters. Sail past limestone karst mountains in the junk boat and stop to visit some of the islands and caves and Grotto like Wooden Grotto ( Hang Đầu Gỗ ), Heaven Cave ( Động Thiên Cung) or Supprising Cave ( Hang Sửng Sốt\nIn the evening, devour a seafood dinner, then opt to enjoy a drink on deck under the stars.\nBoard a traditional junk boat at Ha Long Bay harbour and cruise out onto serene waters. Marvel at massive limestone karst mountains jutting out of the water, creating unforgettable spectacular scenery. Swim, kayak or go cave exploring on one of the islands, if conditions are right. Indulge in fresh seafood meals with a variety of dishes to sample. Drift to sleep in a cozy cabin on board.\n"},{"title":"Ha Long Bay - Hue City by sleeping Train","description":"Cruise back to the port and take a private van to Hanoi. Enjoy some time in the city before an overnight train to Hue\nEnjoy breakfast on board before a morning sail back to the port. Drive back to Hanoi for a little more time to enjoy the city before boarding an overnight train.\n"},{"title":"Exploring Hue City ( Former Vietnam Capital)","description":"Guided tour of the Imperial Citadel, Royal Tomb and Tien Mu Pagoda. Optional countryside motorbike tour.\nArrive early to Hue, once the imperial capital of Vietnam. Start the day with a visit to the Thien Mu Pagoda followed by a visit to the tomb of one of Vietnam’s former emperors.\nAfter, opt for a vegetarian lunch at a local nunnery. With free time, take a motorbike tour of the area.\nWhile in the city, try some local Hue specialties such as banh khoai (Hue savoury pancakes), and banh bot loc boc tom thit (thin rice paper filled with meat and shrimp). Wash it all down with a Hue beer.\nThien Mu Pagoda Visit Huế\nVisit Thien Mu, one of the tallest and, perhaps, most elegant pagodas in Vietnam, at seven storeys high. Take a step back in time touring this historic temple - built more than 400 years ago along the north shore of the Perfume River, it has been the site of many political protests.\nImperial Citadel Tour Huế\nTour this one-time capital city and UNESCO World Heritage site. See the walled fortress and former palace, which has many palaces, gateways, courtyards, and gardens to explore. The Forbidden Purple City (modelled on China's Forbidden City) inside the citadel was once home to the imperial family and was significantly damaged during the Vietnam War.\nRoyal Tombs Visit Huế\nVisit the Royal Tombs along the Perfume River in Hue. Embracing the concept of Feng Shui, these tombs are extremely ornate and provide fantastic insight into the lives of the former rulers.\nHop on the back of a motorbike and let your professional driver take you out into the countryside. Explore rice paddy landscapes and see local villagers at work in the fields. Take in temples, shops, a scenic overlook or two, or, perhaps, an ancient covered bridge – routes can vary on these interesting rides\n\n"},{"title":"Huế/Hoi An","description":"Drive the Hai Van pass. Take advantage of Hoi An's many options over the 2.5 days in town. Opt for a cooking class, riverboat trip, bike ride, beach time, tailor visit or My Son Holy Land\nStart the day touring the wonderful ruins of the Imperial Citadel before heading towards Hoi An in the late morning. Cross the Hai Van Pass (Weather Permission), with fantastic views in all directions, before arriving to Hoi An in the afternoon.\nWith three nights here, there's plenty of time to explore all this charming town has to offer.\nPrivate Vehicle Huế – Hoi An\nStretch out and scan the scenery from the comfort of a private ride.\nFree Time in Hoi An Afternoon\nUse free time in this quaint town to explore any way you like.\n"},{"title":"Hoi An Ancient City","description":"Spending 02  full days exploring all Hoi An has to offer. Dive into the culture, hang out on the beach or get clothes tailor-made in one of the many shops around town. \nSee and enjoying Daily activities in Hoi An, options for choosing in Hoi An will be noted when come here\nFree Time Hoi An Half Day\nExplore this charming city.\nOptional Activities\nHoi An Cooking ClassHoi An\nTake a cooking class to learn more about Vietnamese food and its distinct flavours. Tour the local market to buy fresh ingredients before preparing some popular regional dishes. Enjoy your creations \nBike Rental\nRent a bike from a local shop and head out to explore.\nMỹ Sơn Excursion Mỹ Sơn\nTravel approximately one hour from Hoi An to arrive at My Son. Tour these Hindu temples built between the fourth and 14th centuries, the site is widely accepted as one of the most important Hindu temple complexes in Southeast Asia. Learn about the architectural style and history of a site that’s often compared to Angkor Wat in Cambodia and Bagan in Burma.\nLife start Lantern Making Hoi An\nAdd a little light to your life! Visit Lifestart Foundation and learn how to make a traditional lantern from area residents. See how this project, supported by G Adventures, helps local Vietnamese with chronic disabilities gain sustainable employment.\nTailor Shops Hoi An\nGo home with some new (handmade!) clothes from one of Hoi An’s famous tailor shops. Walk the streets lined with hundreds of local shops that turn out gorgeous suits, dresses, winter coats, shoes, purses – almost anything – in a day's time to create next season's wardrobe.\n"},{"title":"Hoi An","description":"Spend a free day exploring all Hoi An has to offer.\nFree Time Hoi An Full Day\nEnjoy free time in this Harmony town.\n"},{"title":"Hoi An/Ho Chi Minh City","description":"Guide take you to the Da Nang Airport for taking off to Ho Chi Minh City, South Commercial City of Vietnam, once the capital of South Vietnam and the country’s commercial centre. Start exploring the small alleys and busy streets keeping an eye out for laquerware shops and delicious local food stalls.\nIt spends 01 hour flight to Ho Chi Minh, Relax on Plane\n"},{"title":"Ho Chi Minh City","description":"Enjoy a guided tour of the Cu Chi Tunnels and learn more about the Vietnam War. Use free time in the afternoon to explore sprawling Ho Chi Minh City.\nWith some free time in the city, opt to visit the Thien Hau and Giac Vien pagodas and stroll through the immense Ben Thanh Market. Also well worth a visit are the Reunification Palace (the residence of South Vietnam presidents before 1975), the city's Chinese quarter of Cholon, and the War Remnants Museum.\nCu Chi Tunnels Guided Tour Củ Chi\nTake a guided tour of the Cu Chi Tunnels, a complex network of tunnels that the Viet Cong lived in to protect themselves from opposing forces during the Vietnam War. Try crawling through some of the tunnels (if you’re not claustrophobic). These tunnels stored ammunition, had underground hospitals, and served as a hidden base for attacking allied forces.\nFree Time in Ho Chi Minh City Afternoon\nOptional Activities\nThien Hau Pagoda Visit Ho Chi Minh City\nVisit the Thien Hau Pagoda, a beautiful temple in the Chinatown district of Ho Chi Minh City. Learn more about the customs associated with this 19th-century monument – it is dedicated to the goddess Thien \nHau (the 'Lady of the Sea') who is worshipped in Chinese communities throughout Asia by those who depend on the sea for their livelihoods.\nGiac Vien Pagoda VisitHo Chi Minh City\nFind this hidden pagoda behind some small alleyways – it’s a rare treat of a monument that has been spared the over-restoration that has been done to so many temples. Tour the inside of this 18th-century pagoda to see nearly 100 carvings of divine beings. Ben Thanh MarketHo Chi Minh City\nWander this bustling market for more insight into Ho Chi Minh City. Pick up souvenirs, sample local cuisine, and experience local living. Talk to your CEO to learn about the market's origins – Ben Thanh started as a cluster of street vendors selling wares by the Saigon River and formalized into a true market in 1859.\nReunification Palace Visit Ho Chi Minh City\nWander the historic halls of the Reunification Palace (Independence Palace), a landmark in Ho Chi Minh City. This former home of the South Vietnamese president during the Vietnam War became the location of the end of the war when a North Vietnamese tank pushed through the palace gates on April 30, 1975.\nChợ Lớn ( Giant commercial Market) Visit Ho Chi Minh City\nTake in the busy rhythm of daily life in Chợ Lớn, the Chinatown of Ho Chi Minh City. Tour the area full of teahouses, pagodas, and people, and learn a little more about the unique culture within the city.\nWar Remnants Museum Visit Ho Chi Minh City\nVisit the War Remnants Museum, a gut-wrenching but worthwhile experience that includes three storeys of exhibits and military hardware. Learn about the devastation that occurred in Saigon during the Vietnam War, a period that greatly contrasts the joy and liveliness of the Vietnamese people today.\n\n"},{"title":"Departure","description":"Today, Check out your hotel before 12 Am and Driver will take you to Tan Son Nhat international Airport for Departure. Tour end "}]},{"name":"Fascinating Vietnam - 10 Days North To South","duration":10,"travelStyle":["Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":569,"summary":"AS LOCAL, WE ARE CONFIDENT TO DELIVER THE AUTHENTIC LOCAL EXPERIENCE AND VALUE TO YOU. \nDiscover Uniquely  Vietnam in 10 day tour. Taste the essence of captivating Vietnam through backstreets, villages, cities and waterways.  Overnight onboard experiencing  Halong Bay - the World's Herrittage, relaxing deeply in  the ancient town of  Hoian,  feel the buzz of bustling cities and fuel yourself with banh mi and condensed milk coffee, enjoy the waterlife of fishermen on the Mekong Delta and look back the history with Cu Chi tunnels. \nThis is an adventure full of life, colour and flavour that introduces you to the highlights of this fascinating nation.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a72.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a7c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a7e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a81.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a84.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a87.jpg","https://cdn.tourradar.com/s3/tour/1500x800/193764_5e456c9c26a89.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Hanoi Arrival","description":"Xin chao! Welcome to Hanoi! Your adventure begins with a welcome meeting at Hanoi airport - Noi Bai\nInternational airport. If you arrive before your tour begins there’s plenty to see and do. Consider booking the Hanoi Street food walking tour. Or maybe take it at your own pace and wander the Old Quarter to admire the city’s French-colonial architecture. \nAccommodation: Hotel"},{"title":"Hanoi - Halong Bay","description":"In the morning, you are picked up at your hotel by Tour guide.  You are transferred by shuttle bus to World Heritage-listed Halong Bay, which is dotted with sandy coves, grottoes and 1600 limestone islands formed over millennia by wind and water erosion (approximately 4 hours). On Board a beautiful junk and cruise the bay, exploring Surprise Cave and perhaps even enjoying a swim from Ti Top Island Beach during the warmer months. \nDo kayaking yoursefl or Sailing with local fishermen on a bammbo boat.  Relaxing, sunbath, watching Sunset. To end the day, spend an evening aboard the boat beneath the night sky. \nAccommodation: Overnight boat"},{"title":"Halong Bay - bus back Hanoi","description":"06:30\nFor the early risers join us for a Tai Chi session on the sundeck. Tai chi helps focus the mind and condition the body, joining Tai Chi session to full charge your energy for the day.\n07:00 – 08:00\nLocal breakfast is served\n08:00\n– Mingling yourself in the stunning views of the Bay and it’s dramatic limestone islets as we sail through the calm emerald waters heading to Luon Cave (Hang Luồn)\n– Take your option either exploring the cave yourself on kayak or comfortably on bamboo boat rowed by the locals.\n09:00 \nCheck out the cabins, at your leisure while our cruise taking you pass by other beautiful highlights in the bay.\n10:00\nYou will join with our short class of Cooking demonstration, how to make spring rolls before an early lunch is served.\n12:00 \nReturn to the shore and disembark from the cruise as our crew say farewell.\nTransfer to minibus or private and return to Hanoi.\nReturn at hotel around 16.30 pm. Recheck in at hotel. \nOvernight in Hotel in Hanoi"},{"title":"Hanoi - Night Train","description":"Free and Easy to enjoy Hanoi in the Day time until tonight’s train voyage. Make sure that you visit theTrain Street and grab a bowl of Pho. Maybe chill by Hoan Kiem Lake until you board an overnight train to Danang (Hoi An)  this evening. \nAccommodation: Overnight sleeper train (4 berth soft sleeper)"},{"title":"Da Nang Arrival - Heading up to Hoi An","description":"After a night jouenrny, You arrival Da Nang in the morning. Be picked up by our driver then you are hesding to Hoian - the land of lantern. \nRecently declared a World Heritage site, Hoi An was a major international trading port during the 17th, 18th and 19th centuries. Today, parts of the beautifully-preserved town retain the feel of centuries past. It's also a shopping mecca, famous for its plethora of tailors. On arrival , feel free for a sightseeing walk through the Old Town to visit a handful of the city's major attractions. You’ll also be given a sightseeing pass so you can further explore select attractions at your leisure. \nAccommodation: Hotel in Hoi An"},{"title":"My Son Sanctuary","description":"Have breakfast at hotel.\n08:00 Our guide picks you up at your hotel and depart to My Son Sanctuary – The World Cultural Heritage. \n09:00 Arriving in My Son – the Holly land surrounded by the marvelous mountains, 48km west of Hoi An. My Son was chosen as a religious center, built in the late 4th century under the Cham’s King Bhadravaman. It is a huge religious complex with over 70 towers and temples of different architectures. We will have 2 hours to discover the site by walking throughout the landscape, learning histories with our local English speaking guide, enjoying the traditional performances of Champa People.\n11:00: Get back to bus and move to a local house to learn how to make rice-paper, you will enjoy your own hand-making product later on.\n11:30: Back to the bus and have lunch at another local house, relax with cold herbal tea,  nice foods and fresh air.\n12:30: Take a boat trip to Hoi An with nice and cool breeze on boarding, beautiful river scenery on the biggest river in the Central of Vietnam named as Thu Bon River.\n13:30: Arrive at Hoi An, we will drop you at your hotel.\nOvernight at hotel in Hoi An"},{"title":"Hoi An - Flight to Ho Chi Minh city (Saigon)","description":"Today take a short flight to Ho Chi Minh City (approximately 1.5 hours). \nFormerly known as Saigon, Ho Chi Minh City has a fascinating history and is arguably Vietnam’s capital of commerce and culture.  On arrival, discover the city by your leisure. Make sure you visit  the Reunification Palace, Notre Dame Cathedral and the Opera House, then stop in at the War Remnants Museum to discover some of the sobering stories of the 20-year-long Vietnam/American War. \nAccommodation: Hotel in Ho Chi Minh city"},{"title":"Mekong Delta Fullday - Ho Chi Minh city","description":"This morning head out on a day trip to explore the Mekong Delta. \nGroup tour  with a boat to Ben Tre to visit the coconut gardens and stop at a local home to sample tropical fruits and coconut jams. Afterwards, paddle in sampans (small rowing boats) past coconut trees along the Mekong Delta. Take a tuk-tuk tour around the villages and learn about rural life and the industry created around coconut products like brooms and coconut fibre mats. Eat lunch at a restaurant in the heart of the Delta, sampling regional specialties such as the famous elephant ear fish. Cruise the major waterways to Ben Tre boat pier, then return by bus to Ho Chi Minh City. This evening, perhaps head out to sample some local specialties as a final farewell with your fellow travellers and leader. Accommodation: Hotel"},{"title":"Cu Chi tunnels","description":"Today, visit Cu Chi tunnels. \n07:30 – 7.50am: Our tour guide and driver will pick you up at your hotel and then ahead to Cu Chi which located 60km from HCM city, Cu Chi is now considered a heroic district for its role in the anti-American war in Vietnam. It is legendary for Original tunnels system of over 220km and is a popular spot for both Vietnamese and foreign visitors.\nThe peacefully rural rice paddy scenery contains ducks and water buffalos swimming in the rivers alongside the road. Visitors will find it hard to imagine the destruction, damage and defoliation all over the area, caused by bombing and mines, When Cu Chi was “A Free Target Zone”.The remnants visitors will see show Cu Chi still has her evidence to prove the fierce battleground that took place there and visitors will see the remnants. After the trip, return to Hotel. Spend the rest day in leisure.\nOvernight at hotel. "},{"title":"Ho Chi Minh Departure","description":"There are no activities included and you’re free to depart your accommodation.\nIf you go to airport, our driver will take you there to catch the flight. If you would like to spend some more time in Ho Chi Minh City, we’re happy to organise additional accommodation (subject to availability). "}]},{"name":"Hightlight Vietnam 7 Days 6 Nights (Hanoi and Ho Chi Minh City)","duration":7,"travelStyle":["Holiday","Group","Partially Guided"],"oldPrice":0,"price":445,"summary":"We will arrange for you discovery from the North of Vietnam to Central and Sourth and you will visit : Hanoi, Ha Long Bay, Da Nang, Hoi An, Ho Chi Minh city and Mekong delta\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/182654_2978be80.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/182654_2978be80.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_87ade680.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_6ef5032d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_5af315bb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_81e90af7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_dd18d694.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_72ac1071.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_52dd0f5a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/182654_cb3621a9.jpg"],"destinations":["Hanoi","Halong Bay","Hoi An","Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"Day 1: Hanoi Arrivel (No Meal)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy. \nOvernight at hotel in Ha Noi.\n"},{"title":"Day 2: Hanoi - Ha Long Bay - Sung Sot Cave - Titip island (Breakfast, Lunch)","description":"08:45 – 09:15 – Our shuttle bus and guide pick you up from hotel / stay and follow the new high way to depart for Tuan Chau Island, Halong City, stop over for a rest on the way\n12:15 – Arrive Tuan Chau Harbor, welcome aboard, and safety briefing\ncruise will take you on an 5 hour journey via 2 day-sleeper boat cruise route which renowned for its striking, passages uninhabited islets and outcrops have been given imaginative names by the locals, due to their perceived shapes, including Cock Fighting and Thumb, while enjoy Vietnamese mouth-watering lunch on boat.\n13:45 – Arrive Bo Hon archipelago, you will visit Surprising Cave to see a lot of stalagmites and stalactites with different shape of sea lives. Enjoy the kayaking or bamboo boat in Luon Cave to discovery the beautiful lagoon.\nVisit Titov Island with sandy beach adjacent to the towering limestone mountain with\nexcellent backdrop of the Bay, and climb up Titov Peak for a panoramic view of the bay like paradise.\n16:30 – Return to cruise for our Traditional cup of tea and cruising back toward Tuan Chau harbor. There are a lot of time for sunbathing on upper deck with music, enjoy great fun of group touring fellows among world iconic natural scenery.\n17:45 – Disembark for going back on the new high way to Hanoi.\n20:30 – Drop off at your hotel \nOvernight in Hanoi "},{"title":"Day 3: Hanoi City Tour - Flight to Da Nang - Hoi An (Breakfast, Lunch)","description":"8:00 - 8:30 Meet your tour guide .\nStart the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake.             \nVisit Ho Chi Minh’s complex, the final resting place of Viet Nam’s greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\nArrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter.\nVisit Temples of Literature constructed in 1070 - dedicated to Confucius, sages and talented scholars. It is the most famous temple in Hanoi, also functioning as Vietnam's first university. \nLeave for a legendary Hoan Kiem lake and Ngoc Son Temple dedicated to a former general commander Tran Hung Dao for his struggle against Mongolians. Drop you off at the hotel, my driver will pick you up at your hotel transfer to the airport to take flight to Da Nang ( you can book flight departure from 19:00 to 20:000 \nArrive Da Nang, my driver will pick you up at airport transfer to Hoi An, check in hotel\nOvernight in Hoi An \n"},{"title":"Day 4: Hoi An Free and Easy (Breakfast)","description":"You spend full day free time in Hoi An to discover old town as: Japanese Covered Pagoda, Phuc Kien Assembly Hall, 100 years old ancient houses…Enjoying the ancient city’s scenery at night with colorful lanterns and admiring the folk art and culture in the old town. (especially on the 14th and 30th lunar nights will be held the night full moon)\nOvernight in Hoi An \n"},{"title":"Day 5: Hoi An - Da Nang - Flight to Ho Chi Minh City (Breakfast)","description":"Breakfast at your hote, my driver will pick you up at your hotel transfer to Da Nang airport to take flight ( you should book flight at 9:00 to 10:00\nat 12:30 to 13:00 \nPick up at your hotel and depart to Cu Chi will take approximately one and a half hours bus driving. \nUpon arrival, before exploring the tunnels, you will have some short introduction followed by introductory video about how the tunnels were constructed and how the people survived in the harsh conditions of the war time. Then, spend your time to explore the remaining area and tunnel systems which included the special constructed living areas with kitchens, bedrooms side by side with other martial facilities like storage, weapons factories, field hospitals, and command centers helping whoever lives inside the tunnels meet their basic needs. Besides, there are also many hidden trap doors and dangerous traps within the maze-like tunnels for security purpose during the war. Afterward, special tea and cassava (guerilla’s food during the war) will be served. \nBreak time for relax or time for those who want to try the real shooting gun. \nReturn to Saigon, check in hotel \nOvernight in Sai Gon \n"},{"title":"Day 7: Sai Gon - Cai Be","description":"Pick up at your hotelb a t6:15 to 6:30 at the hotel . Depart for Cai Be by car/van via Trung Luong Express Highway.  On arrival in Cai Be, set off by motor boat to visit the Cai Be floating market and watch the locals trading fruit and many other commodities on board their vessels. Visit a small family business to see how coconut candy and crispy rice popcorn are made. Then wander into the small villages and visit the orchard and fruit plantation, accompanied by traditional southern Vietnamese folk music. \nKeep cruising to experience the charms of the Upper Mekong Delta, where you can immerse yourself in nature. Enjoy your cooking experience and learn how to prepare special Vietnamese dishes. Food cooked by yourself and fresh river food served in the heart of the garden. Relax in the hammocks to get back your energy.\nCycle around the village path with fruit orchards and bonsai garden. Meet the local islanders to learn more about the local daily life in the Mekong delta. Take a boat ride back to Cai Be and meet your bus for the trip back to Ho Chi Minh City.\n"},{"title":"Day 7: Ho Chi Minh Departure (Breakfast)","description":"Free and easy until my driver pick you up at your hotel transfer to the airport back your home. Tour finish "}]},{"name":"5-Day Discover Hanoi with Mua Cave Tour & Cruising in Halong Bay","duration":5,"travelStyle":["Sightseeing","Family","Group","Partially Guided","Holiday"],"oldPrice":0,"price":364,"summary":"Day 1: Arrival Hanoi Vietnam - Hanoi food tour ( L or D)\nDay 2 : Hoa Lu - Tam Coc- Mua Cave Full Day - Small Group Tour\nDay 3 : Excursion to Halong Bay and Stay overnight on Board. (B, L, D)\nDay 4: Halong Bay Cruise – Hanoi. (Brunch)\nDay 5 : Hanoi Departure \n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/141000_3ec9b5ea.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/141000_3ec9b5ea.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_0c3fffbe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_fdfcbf00.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_5a048d8e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_96f5c847.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_3b387feb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_8a1ad8ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_664096b3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_15dbfb82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_8cd28c48.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_5a316ab4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_2423c4da.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_cb5d4410.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_2c05b604.jpg","https://cdn.tourradar.com/s3/tour/1500x800/141000_921d3740.jpg"],"destinations":["Hanoi","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: Hanoi Arrival - Hanoi walking Food tour","description":"Experiences with local foods\nHanoi is one of the world’s greatest street food cities and there’s no better way to unlock the hidden secrets of the Old Quarter and its cuisines than through this unique walking tour. \nIt will be great when you have a local guide to help you explore local foods in Hanoi.\nAccommodation : 3 star hotels in Hanoi likely Vietview Hotel, Angle Palace or Similiar"},{"title":"Day2: Hoa Lu - Tam Coc - Mua Cave Full Day - Small Group Tour ( B,L)","description":"7.45 AM - 8.00 AM : You will head out onto the Ninh Binh province from Hanoi and arrive at Tam Coc. You'll get a quick break at the restaurant before preparing your bicycle for a bike ride to Hang Mua and the Mua Caves.\nThen, you'll climb 486 steps at Hang Mua for panoramic views and photo opportunities before biking back to the restaurant for lunch.\nNext, you'll take a 1.5-hour Sampan boat trip through the caves and countryside landscape of Tam Coc where you can explore and take a short break, before visiting the temples of King Dinh and King Le. You'll then be transported back to Hanoi city at 18h00\nAccommodation : 3 star hotels in Hanoi likely Vietview Hotel, Angle Palace or Similiar"},{"title":"Day 3: Excursion to Halong Bay and Stay overnight on Board (B, L, D)","description":"Pick you up from your hotel, departure to Halong Bay.\nArrive at Tuan Chau .Transfer by tender to Aclass Opera Cruise , enjoy welcome drink.Visit Ha Long Bay and check in cabins.Have lunch – Vietnamese Set Menu. Dragon Heart Cruise will take you to cruise through the most beautiful place of the bay with the famous islets Visit Surprising Cave.Enjoy kayaking and swimming on Titop Beach or relaxing on cruise . Enjoy the cooking class on sundeck.\nDinner – enjoy Vietnamese food. Evening activities: sing karaoke or join squid fishing with our crew .\nMeals: Breakfast, Lunch, Dinner\nAccommodation: Cruise in Halong Bay\nActivities: Leave the city behind, drive through fascinating countryside to the dock where this Halong Bay adventure truly starts. Climb aboard a traditional junk boat – with its beautiful woodwork and beaming crew – and venture out into emerald waters of the bay."},{"title":"Day 4: Ha Long Bay - Hanoi (B, L)","description":"At 6:30 AM, early risers can enjoy a Tai Chi Le session on the sundeck. Take in the morning view of the bay’s landscape with a cup of tea or coffee, and breakfast. At around 8:00 AM, transfer to Sung Sot Cave. Head back to the cruise to check out of your room and settle bills at reception. Have lunch, and head back to the harbor, arriving at 11:30 AM. At around 4:30 PM, arrive in Hanoi to complete your trip"},{"title":"Day 5: Hanoi Departure (B)","description":"After breakfast you have free time until our driver pick up and transfer to Airport.Tour End"}]},{"name":"Highlight Ha Noi 7 Days 6 nights (Hanoi - Sapa - Halong - Ninh Binh )","duration":7,"travelStyle":["Sightseeing","Adventure","Family","Group","Partially Guided","Discovery","Holiday"],"oldPrice":0,"price":395,"summary":"Discover the beauty of Northern Vietnam around Hanoi, Sapa, Halong and Mai Chau in 7 days. The trip will take visitors to most of popular tourist destinations in Vietnam such as the spectacular Halong Bay, foggy Sapa, tranquil Mai Chau and millennial cultural Hanoi.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/140634_d8121010.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/140634_d8121010.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140634_da2f230e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140634_b0731488.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140634_978e88e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140634_1458595b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/140634_150ed732.jpg"],"destinations":["Hanoi","Sapa","Halong Bay","Ninh Binh"],"timeline":[{"title":"Day 1: HA NOI ARRIVAL (NO MEAL)","description":"Welcome to Hanoi! You will be met at the airport and transferred to hotel in Hanoi. Renowned as the “Paris of the East”, Hanoi is one of Asia’s most delightful cities. Rich in culture and history this diverse city draws its influences from both French and Chinese culture. The rest of day is yours to enjoy.  Overnight in Hanoi."},{"title":"Day 2: Hanoi - Sapa - Lao Chai and Ta Van Village (Breakfast, Lunch, Dinner)","description":"6:30 – 7:00 Tour guide pick you up at your hotel, departure to Lao Cai city.Travelling on new Highway Noi Bai, It will take around 5 hours. \n12:30. Arrival in Sapa town, enjoy lunch in a local restaurant. \n13:00: Bus will take you to the gate of Lao chai village start trekking to Ta Van and Giang Ta Chai village, exploring the local ethnic minorities life, admire the spectacular natural scenery with the terraced rice fields. \n17:00 Come back to Sapa Town, having dinner and Overnight Hotel in Sapa."},{"title":"DAY 3: SAPA - CAT CAT – HA NOI (Breakfast, Lunch)","description":"7:00 Have breakfast at hotel. \n9:00 Trekking from hotel to Exploring Cat Cat village of H'mong – a colonial French discovered area and a renowned resort to officials from the early twentieth century, learning about the culture, customs and unique people here with traditional crafts such as weaving, carved silver, hand forged agricultural tools. \n12:30 Enjoy a meal at a local restaurant in Sapa Town. \n15:00 Driver take you back to Hanoi. Have light dinner on the way back to Ha Noi \n21:00 End of tour at Hotel. Overnight Hotel in Hanoi."},{"title":"DAY 4 : HANOI - HA LONG BAY. (Breakfast, Lunch, Dinner)","description":"7:45 - 8:30 Meet your tour guide at suggested places around Old Quarter for Ha Long Bay. \n12:30 Embark at Tuan Chau habor, Ha Long city. Transferred by tender to the Cruise. Greeted by crew members followed by welcome drinks, get cruise briefing and check in cabin. \n13:00 Savor lunch on board while cruise heads to center of Halong Bay. \n15:00 Explore Sung Sot Cave, the biggest cave in Halong Bay which famous for its wonderful stalactites and stalagmites.\n 16:00 Visit Titop Island for swimming or take a short walk to the top for some overview photos of Halong Bay \n18:00 Enjoy sunset while local wine and fruit is served \n18:30 Attending cooking lesson to make some spring rolls by yourself.\n19:00Having dinner on board, then free relax with other choices: Squid fishing, singing karaoke, relax on sundeck....Stay Overnight on Cruise in the middle of Halong Bay."},{"title":"DAY 5 : HA LONG BAY – HANOI.(Breakfast, Lunch)","description":"07:00 Enjoy a new day with complimentary tea and coffee served for light breakfast on board \n07:45 Join the kayak excursion \n09:00 Stop by Pearl Farm to study the culture pearl making process. \n09:30 Check out your cabin. \n10:30 Time for brunch while  Cruise heads back to habor. \n12:00 Disembark habor. Say goodbye to Halong Bay, back to Hanoi \n17:00 Tour guide drops you back at your hotel. Overnight Hotel in Hanoi."},{"title":"DAY 6 : HA NOI – BAI DINH – TRANG AN (Breakfast, Lunch)","description":"07:45 – 08:30 : Tour guide picks you up at suggested places around Hanoi Old Quarter \n10:30 : Depart for BaiDinh pagoda and Trang An eco-tourism site. Have short break en-route to free your legs. Arrive in Buddha Sanctuary place of BaiDinh pagoda, the biggest one in Vietnam. \n12:30 : Have lunch in a restaurant with local special dishes including goat meat. \n13:30 : Leave for Trang An eco-tourism attraction. You will be amazed by neglected area while having a boat trip through cave chains: Sang Cave, Toi Cave, Ba Giot Cave, Sinh Cave...experiencing mysterious views of the so-called \"Ha Long Bay in land\" \n16:30 : Back in Hanoi\n18:30 : Arriva Ha Noi, dropped off at your morning address. Overnight Hotel in Hanoi."},{"title":"DAY 7 : HA NOI ½ CITY TOUR – DEPART (Breakfast, Lunch)","description":"Option1: Tuesday, Thursday, Saturday, Sunday – (Ha Noi City Tour - Ethnology Museum)\nConsidered charming colonial city, tourists would find Hanoi very typical feature of oriental city alive with its tree-lined boulevards and lakes and its blend of French, Chinese and Vietnamese architecture. Hanoi is the jewel of Asia. A cyclo trip will bring you to charming \"36 streets and 36 wares\" of the fascinating Old Quarter. \n07:45 - 8:30 Meet your tour guide .\n- Start the trip with Tran Quoc pagoda, a Buddhist relic and national heritage lying on the West Lake. \n- Visit Ho Chi Minh's complex, the final resting place of Viet Nam's greatest father; his house-on-stil and One pillar pagoda – modeled after a lotus flower, a symbol of Hanoi.\n- Arrive Ethnology museum to learn about cultures of 54 ethnic groups living in Vietnam.\n13:00 Have a rest and enjoy lunch in a local restaurant in Hanoi Old Quarter. Transfer to the airport for departure flight."}]}]