[{"name":"4 Days Hanoi City Tour and Halong Bay Overnight Cruise","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided","Holiday"],"oldPrice":0,"price":319,"summary":"In and around HanoiMeet your guide upon hotel pickup or arrival at Noi Bai Airport(VJ902 @ 15.55), and transfer to your Hanoi hotel for check-in.\nThe rest of your day is free for you to spend at your leisure. Perhaps head to the city center or explore Hanoi Old Quarter on foot, or simply relax in your fully equipped superior room. Overnight in Hanoi at 3-4 stars hotel\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/108357_83320a35.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/108357_83320a35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108357_1db40448.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108357_08411add.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108357_673dec86.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108357_89fe5d4f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/108357_c955e1cf.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Meet your guide upon hotel pickup or arrival at Noi Bai Airport(VJ902 @ 15.55), and transfer to your Hanoi hotel for check-in.\nThe rest of your day is free for you to spend at your leisure. Perhaps head to the city center or explore Hanoi Old Quarter on foot, or simply relax in your fully equipped superior room. Overnight in Hanoi at 3-4 stars hotel\n"},{"title":"Day 2: Halong Bay","description":"Hanoi – Halong Bay (B, L, D)\nFollowing breakfast at your hotel, you’re driven to the Gulf of Tonkin and Halong Bay, located approx. 112 miles (180 km) east of Hanoi. By midday you’ll board a traditional junk for check-in.\nEnjoy a seafood lunch on board and a delightful cruise that delivers you to some of the islands and caves in picturesque Halong Bay, listed as a UNESCO World Heritage site for its outstanding natural beauty.\n“Dragon descending to the sea,“ as the bay is known in Vietnamese, features more than 3,000 limestone islets rising from the clear emerald water, many of them containing beautiful grottoes — a mesmerizing sight.\nYou’ll visit a cave with your guide and have the opportunity to swim alongside the golden sands of Titov beach (depending on weather conditions and water temperature) before dinner and an overnight stay in your superior cabin.\nOvernight in Halong Cruise"},{"title":"Day 3: Halong Bay - Hanoi","description":"Enjoy breakfast on board and continue cruising the bay until it’s time to disembark and drive back to Hanoi. Overnight in Hanoi at 3-4 stars hotel"},{"title":"Day 4: Hanoi","description":"After breakfast at the hotel, embark on a city sightseeing tour of Hanoi with your guide. Start with a visit to Ho Chi Minh’s Mausoleum, located in the center of Ba Dinh Square, where the former leader's embalmed body is on display in a glass sarcophagus. Afterward, learn more about Ho Chi Minh's life and career on a tour of his former residence.\nNext, head to the historical One Pillar Pagoda, originally constructed in 1049. Your guide can point out the architectural elements that make this one of Vietnam's most iconic temples.\nAfter a Vietnamese lunch at a local restaurant, continue on to the Temple of Literature, the country’s first university that dates back to 1070. Stroll different paths among five courtyards to find treasures such as a statue of Confucius guarded by two bronze storks standing on turtles.\nThen hop in a cyclo for a panoramic tour of the Old Quarter in the afternoon, followed by a visit to Hoan Kiem Lake (Sword Lake). Stop to admire Ngoc Son Temple (Temple of the Jade Mountain), located on a small islet, and take in the natural surroundings while enjoying a hot brew of fresh coffee (own expense) from one of the many cafés near the beautiful lake.\nEnd your day at the Thang Long Theater to watch a Vietnamese water puppet show. This unique, traditional art form originates from rural festivals. Both men and women stand waist-deep in the water to manipulate the puppets, making them move about, talk, laugh and even dance on the surface as the story takes place. Transfer to airport for flight\n"}]},{"name":"Best of Vietnam for Teenagers - 9 Days","duration":9,"travelStyle":["Family","Adventure","Group","Fully Guided","Holiday"],"oldPrice":0,"price":1895,"summary":"FAMILY TOUR TO VIETNAM (for children aged 12 years and above): Travel with all the family from Hanoi to Ho Chi Minh City taking in stunning Halong Bay, charming Hoi An and ancient Hue along the way.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/166866_bf926dd1.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/166866_bf926dd1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_34ec3ce8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_4b733c8f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_16f91c1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_bb8d61b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_44fb43d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_ec3ed188.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_a9a0b696.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_68a50f72.jpg","https://cdn.tourradar.com/s3/tour/1500x800/166866_44d9efdf.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Hanoi","description":"Saturday. Welcome to Hanoi and the start of your holiday! Transfer from airport to hotel for check-in is included. The rest of the day is free for you and your family to explore the city, which is easily accessible by foot. "},{"title":"Day 2: Junk boat cruising, Halong Bay","description":"Hanoi – Halong Bay. This morning drive to beautiful Halong Bay. Boarding junk boat we cruise the emerald waters. Later we visit spectacular Tien Ong Cave. Tonight, there's a Vietnamese cooking demonstration and seafood dinner."},{"title":"Day 3: Floating villages and cyclo rides","description":"Halong Bay - Hanoi - Hue. Start the day with a Tai Chi class on the sundeck before exploring the Floating village of Cua Van. On arrival to Hanoi embark on a guided cyclo tour of the French Quarter, followed by a walking tour of the Old Quarter. Later, board overnight sleeper train to Hue. "},{"title":"Day 4: Imperial Hue","description":"Breakfast onboard the train. After arrival and hotel check in at Hue, we tour the city's Thien Mu Pagoda, Imperial Purple Palace, and the countryside Royal Tombs. As the sun sets, opt for a peaceful cruise along the Perfume River."},{"title":"Day 5: Delightful Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. We take the scenic Hai Van Pass (Road of the Ocean Clouds), to the port of Hoi An, stopping for a stroll along China Beach. Enjoy a short afternoon walking tour of the historic old town, a UNESCO World Heritage Site."},{"title":"Day 6: Village Life","description":"For a taste of provincial life, today we take a bicycle ride out of Hoi An to Tra Que village, famed for its traditional farming practises and rural atmosphere. Enjoy a hands-on day family day, tending to the fields and gardens, before a lesson in preparing traditional Vietnamese cuisine. Enjoy your culinary masterpiece while soaking up the clean air and country views."},{"title":"Day 7: Hoi An - at leisure","description":"Today is free for you to spend as you choose - relax or sightsee further."},{"title":"Day 8: Ho Chi Minh City","description":"Hoi An - Ho Chi Minh City. Early morning flight to Ho Chi Minh City, once called the 'Pearl of the Orient'. Enjoy a walking tour of the city, including visits to the Notre Dame Cathedral, Old Post Office and the sobering War Remnants Museum. Spend the remainder of the evening at your own leisure – Ho Chi Minh City has plenty of fun to offer all ages!"},{"title":"Day 9: Ho Chi Minh City","description":"Sunday. This morning is free for you to do some last minute shopping or sightseeing before your included departure transfer to the airport in the afternoon. Why not opt for a relaxing foot massage, bargain for goods at Ben Thanh Market or visit the grand Independence Palace."}]},{"name":"Hanoi to Hoi An For Teens - 8 days","duration":8,"travelStyle":["In-depth Cultural","Group","Fully Guided","Discovery","Historical","Holiday"],"oldPrice":0,"price":1145,"summary":"FAMILY TOUR TO VIETNAM (for children aged 12 years and above): Travel with your teens on this fun-filled 8 day family adventure in Vietnam. Travelling from Hanoi to Hoi An, cruise around the islets of Halong Bay in a Junk and cyclo ride around Hanoi, farm the land in Tra Que, explore Hue's ancient citadel and relax by the pool in Hoi An.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/139156_16648dac.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/139156_16648dac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_2368aa92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_fd4c7a60.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_60cfabb5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_f20bb392.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_92318631.jpg","https://cdn.tourradar.com/s3/tour/1500x800/139156_300ad9eb.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An"],"timeline":[{"title":"Day 1: Hanoi","description":"Saturday. Welcome to Hanoi and the start of your holiday! Upon arrival you will be met at the airport and transferred to your hotel for check-in. The rest of the day is free for you and your family to explore the city, with its picturesque tree-lined avenues, scenic lakes, ancient pagodas and bustling old town, all which are easily accessible by foot. "},{"title":"Day 2: Junk boat cruising, Halong Bay","description":"Hanoi – Halong Bay. Take a moment to picture in your mind some two thousand rugged karst islands dappled with lush vegetation seeming to float on top of pristine emerald coloured waters and you have the natural wonder that is Halong Bay. This morning a scenic drive will take us to this beautiful UNESCO World Heritage Site where we will enjoy a junk boat cruise. Based on traditional designs, these wonderful vessels combine oriental style with modern luxury. Soak up the panoramic views from the sundeck as the boat gently plies its course, then this afternoon we will visit the spectacular Tien Ong Cave which was recently opened to the public in 2010, with its stunning stalagmites and stalactites. Later this evening back on board, watch a Vietnamese cooking demonstration held on the sundeck before settling down for a sumptuous seafood dinner."},{"title":"Day 3: Floating villages and cyclo rides","description":"Halong Bay - Hanoi - Hue. Early birds can start the day with a relaxing Tai Chi class on the sundeck or a traditional massage - the perfect way to start the day. Before heading back to port we'll explore by kayak the Floating Village of Cua Van, which is home to generations of fishing families. Here we’ll see the traditional and colourful floating wooden houses and the locals going about their daily lives. On our arrival back into Hanoi mid-afternoon we'll explore the maze of streets known as the ‘36 streets of the old quarter’, named after the numerous guilds that once set up shop on a particular street from silk tailors to silversmiths. Travelling by cyclo (rickshaw), the quintessential mode of transport in Hanoi, we'll see traditional narrow-front tube houses with the chance to sample some of the local delicacies sold on street stalls from ripe fruits to steaming noodle dishes. Later this evening there's a chance to freshen up before boarding the train (4 berth sleeper cabin, basic standard) on the ‘Reunification Express’ railway line to Hue. An option to fly from Hanoi to Hue is also available. "},{"title":"Day 4: Imperial Hue","description":"Upon arrival in Hue we will set out on a guided sightseeing tour of this fascinating imperial city. Once the capital of the Nguyen emperors, the last ruling family of Vietnam, UNESCO-listed Hue is full of palaces, pagodas and temples. Two of the main highlights here are the Thien Mu Pagoda, home to the oldest monastery in the city, and the Citadel. Within the walls of the latter is the Imperial Purple Palace – an exact replica of the famed Forbidden City in Beijing, with impressive ramparts, formal moats and imperial palaces, some of which lay in ruin. Outside of the city we will visit the Royal Tombs of the erstwhile Nguyen kings, including the extravagant mausoleums of the two emperors Tu Duc and Khai Dinh. In the evening there will be the chance to opt for a peaceful long boat cruise along the Perfume River as the sun sets and the river banks become illuminated by the dark of nightfall. "},{"title":"Day 5: Delightful Hoi An","description":"Hue - Road of the Ocean Clouds - Hoi An. Today we will travel on to the laidback riverside town of Hoi An, travelling through the picturesque Hai Van Pass – nicknamed the Road of the Ocean Clouds, with beaches on one side and verdant hills on the other. We will break up our journey with a stop at China Beach, an expansive sandy beach made famous by the film ‘Apocalypse Now’. Here there will be the chance to opt for a swim in its warm waters before continuing our journey south along the coast. Radiating age-old charm with grand colonial architecture, Hoi An is one of Vietnam's most delightful destinations. The Old Town, recognised as an UNESCO World Heritage Site, is an immaculately preserved example of an Asian trading port with covered bridges, pagodas, temples and merchant houses. The town's beguiling riverside setting adds to the overall picturesque appeal of Hoi An with women in conical hats rowing their wooden vessels downstream and the glow of red lanterns in the evenings reflected on the water's iridescent surface. A short walking tour will take us to a bygone era, with a visit to the Chua Ong Pagoda, Chinese Assembly Hall, a 200-year-old Tam Ky house, former merchants’ homes and the 400 year-old Japanese Covered Bridge. "},{"title":"Day 6: Village Life","description":"For a taste of provincial life, today we will take a bicycle ride out of Hoi An to Tra Que village, famed for its traditional farming practises and rural atmosphere. Here enjoy a hands-on day for all the family, tending to the fields and gardens, before taking a lesson in preparation of traditional Vietnamese cuisine. Later enjoy your culinary masterpiece while soaking up the clean air and country views."},{"title":"Day 7: Hoi An - at leisure","description":"Today is free for you to spend as you choose. You may wish to head to the beach for a day of relaxation or hit the town for some serious shopping - the streets of Hoi An are overflowing with tailor shops where you can get your own silk suit made exclusively! Hoi An is also something of a culinary mecca with classy restaurants for those who prefer their food served to them and local cooking schools for those who enjoy getting their hands dirty. Alternatively, those seeking a little more culture or history can opt to visit My Son – one of Vietnam’s holiest and most evocative Cham sites, or Quang Ngai – the site of the My Lai massacre memorial. "},{"title":"Day 8: Hoi An","description":"Saturday. Today marks the end of your time in Vietnam. A departure transfer will be provided to take you to Danang airport in time for your onward departure flight. "}]},{"name":"Halong Bay Independent Adventure","duration":3,"travelStyle":["Discovery","Adventure","Independent","Fully Guided","Holiday"],"oldPrice":0,"price":339,"summary":"A city of Parisian charm and grace with an Asian edge, Hanoi is an enthralling blend of east and west and a rising star in Southeast Asia. Check out the local cuisine on a street food tour and visit the Hanoi Food Culture restaurant, a G Values Fund Project. Next, visit stunning Halong Bay and overnight on a junk boat (a traditional Asian vessel) while cruising among the bay's 3,000 islands that rise dramatically from the emerald waters. Get a closer look by cruising the waters in a kayak or dive right in for a refreshing swim.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/5710_4592daed.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/5710_4592daed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_01466c35.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_6fda70e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_dce625d7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_dc35f631.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_43d13172.jpg","https://cdn.tourradar.com/s3/tour/1500x800/5710_5687b73a.jpg"],"destinations":["Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Hanoi","description":"Feel free to start exploring! Make sure to be back at the hotel at 5:00pm for your welcome meeting.\n\nAccommodation:\n- Bonne Nuit Hotel (or similar).\n\nIncluded Activities:\n- Meet and Greet Hotel Welcome Meeting\n- Hanoi Foodie Culture Tour\n\n\n"},{"title":"Day 2: Hanoi/Ha Long Bay (1B, 1L, 1D)","description":"After breakfast, get picked up at the hotel for a bus journey through the countryside and industrial towns of the north. Head to the coast to board the live-aboard junk for an overnight cruise on stunning Ha Long Bay.\n\nFeast on local seafood specialties and visit the cave systems. Opt to swim or kayak around the dramatic limestone karsts.\n\nAccommodation:\n- Halong Bay Excursion (or similar).\n\nMeals Included:\n- Breakfast\n- Lunch\n- Dinner\n\nTransport:\n- Minibus: Hanoi to Hạ Long Bay 04:00 Hr(s)\n\nIncluded Activities:\n- Hạ Long Bay Overnight Junk Boat Trip\n\n\n"},{"title":"Day 3: Ha Long Bay/Hanoi (1B, 1L)","description":"After spending the morning aboard the boat, head back to Hanoi. Tour ends on arrival at the start hotel in Hanoi at approximately 5:00pm.\n\nMeals Included:\n- Breakfast\n- Lunch\n\nTransport:\n- Minibus: Hạ Long Bay to Hanoi 04:00 Hr(s)\n\nIncluded Activities:\n- Hạ Long Bay Overnight Junk Boat Trip\n\nAdditional Notes: Tour ends upon arrival at the start hotel. Luggage can be stored at hotel reception during Day 3 if needed.\n\n"}]},{"name":"Hanoi Short Stay 4 Days","duration":4,"travelStyle":["Sightseeing","Group","Partially Guided"],"oldPrice":0,"price":295,"summary":"With 4 days in Hanoi, you still cover the highlight of Northern Vietnam as Temple of Literature - the first university in Vietnam, Hoan Kiem Lake - the heart of Hanoi, Tran Quoc Pagoda - the oldest pagoda in Hanoi captial. You have opportunity to visit Trang An Scenic Complex -just been inscribed in the UNESCO’s World Heritage List, proudly being the Viet Nam’s first site to be acknowledged as a mixed natural and cultural heritage.Spending full day for visiting Halong bay, as one of the world's most stunning panoramic landscapes.","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/150873_1d5632ec.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/150873_1d5632ec.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_b7376c7b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_ec5bbd44.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_fe4b5429.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_afb242aa.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_f014cf0d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/150873_bfde6623.jpg"],"destinations":["Hanoi","Ninh Binh","Halong Bay"],"timeline":[{"title":"HANOI ARRIVAL - CITY TOUR","description":"Arrive in Noi Bai airport  ( Hanoi ) , warmly welcomed by our guide & driver then transfer to the city. Hanoi or “River-bound City” as its name literally means is Vietnam’s capital with a thousand-year-old history dating back to 1010. The city’s fascinating beauty which is characterized by unique cultural relics, ancient streets of antique houses, elegant French colonial buildings, tree-lined boulevards and romantic lakes has made it one of the most charming cities of Asia. Check in hotel and leave luggage then visit Hanoi capital. \nIn the afternoon, Visit Tran Quoc Pagoda – is the oldest one which located in the eastern shore of West Lake, just off Thanh Nien road, which is like a bridge between Truc Bach lake and West Lake. With its history of more than 1500 years. Keep going to  Temple of Literature , known as the first university of Vietnam built in 1070 by the Ly Dynasty to honor Confucius, sages and outstanding Vietnamese scholars.  Visit Hoan Kiem Lake and Ngoc Son Temple located on an islet in the lake. Hoan Kiem Lake is the center point of Hanoi and home to a rare endangered giant turtle species. Its name “Returned Sword” comes from a legend of a sacred sword being lent to an ancient Vietnamese King by a holy turtle from the lake and later returned to the turtle. Enjoy Egg Coffee in the end of tour, you will have unforgetable experiece with special taste. Drop you at hotel, you are free at your leisure in the evening. "},{"title":"HANOI - TRANG AN - BAI DINH PAGODA - HANOI","description":"8.00, our guide and driver meet you at hotel and depart to Ninh Binh far from Hanoi 100km southeast with 2 hour driving. \n10.30 : we take a boat trip to explore the cave complex in Trang An . Enjoy peaceful moments with clear water, fresh air and spectacular views of mountainous areas. Trang An Landscape Complex is a spectacular landscape of limestone karst peaks permeated with valleys, many of them partly submerged and surrounded by steep, almost vertical cliffs. This area was inscribed as a UNESCO World Heritage Site. Have lunch at restaurant. \nIn the afternoon, We spend time to visit the Buddha Prayer place in Bai Dinh Pagoda, the biggest pagoda in Vietnam with 500 La Han statues, biggest bronze Buddha statue in Vietnam with 10 meters height, 100 tons weight. Drive back Hanoi, drop you at hotel and you are free at leisure in the evening. \n\n"},{"title":"HANOI - HALONG BAY - HANOI","description":"8.00 AM our guide and driver meet you at hotel  and  pick you up at hotel’s lobby and then depart to go Halong city. It is an about 3.5-hour drive to Halong bay. We will have a quick stop en-route in a kind of tourism center where passengers and driver can use restrooms without having to consume any drink or buy anything from their shop.\nUpon arrival at Tuan Chau island, you’ll board a wooden junk at noon time and get off to the famous limestone marine landscape. A nice  lunch will be served, vegetarian or non-seafood eaters can be catered for if a prior notice is given at booking time.\nWe have about 4. hours in Halong bay to see the most popular sights of it. We won’t have time to cruise farther to the less travelled area. However, you’ll be able to soak up the natural splendor of Halong, relax on the sundeck and admire the different islets and their fantasy shapes.  \nWe get off the boat to explore Thien Cung cave, and then start cruising back to the pier. About 4.30pm, we get back on land and start our trip back to Hanoi, where we should arrive about 7.30pm. \n"},{"title":"HANOI DEPARTURE","description":"Have breakfast at hotel. Free at leisure for shopping until transfer to airport for departure flight. End trips.  "}]},{"name":"Mai Chau Trails","duration":3,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Holiday"],"oldPrice":0,"price":600,"summary":"Mai Chau valley is a perfect place to experience Vietnam's village life in a remote setting. Mountain bikers will love this multi day bike tour from Hanoi for the variety of trails - from good single track paths to undulating rough jeep trails to some climbs that are rewarded with ultimate descents.","highlights":["Delve into culture and embrace village life in a remote setting.","Cycle good single track paths and undulating rough jeep trails","Challenge yourself with climbs that are rewarded with scenic views"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/19384_4e3b29c4.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/19384_4e3b29c4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_b2b2b9fe.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_429562dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_6e5d0b7d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_c94058b0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_f5ea455f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19384_dae5169f.jpg"],"destinations":["Hanoi","Mai Chau"],"timeline":[{"title":"Day 1","description":"From the hotel we drive to Poom Coong Village for a short ride through White Tai villages. After lunch at a traditional house, we continue on single track and undulating jeep trails around terraced rice fields to overnight at Buoc village."},{"title":"Day 2","description":"Today's ride is remote and challenging. We cycle above the valley and look down on small hamlets before cruising back down to Mai Chau for the night at Mai Chau Valley View."},{"title":"Day 3","description":"We cycle on single track through the valley to ethnic villages, crossing wooden bridges and rolling through rice paddies before a transfer to Hanoi, where we gather one last time for a farewell dinner."}]},{"name":"Ho Chi Minh - Cu Chi Tunnel - Mekong Delta 4 Days 3 Nights Package Tour.","duration":4,"travelStyle":["Family","Group","Partially Guided"],"oldPrice":0,"price":180,"summary":"\nHighlights :\n\n\n      Visit Cu Chi Tunnel.\n      Visit Saigon River.\n      Visit former US Embassy.\n      Discover Saigon by night on scooter ( on request )\n      Shopping at Ben Thanh or wholesale market.\n      Dinner on Sai Gon Cruise, along Sai Gon river at night.\n      Visit Mekong River Delta : My Tho, Ben Tre, 4 Island.\n      Visit : Independence Palace, Notre Dame, Post Office, War Museum.\n\n\n\n","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2ca.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2ca.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d4.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2d9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2db.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2dc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2de.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e3.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e5.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2e9.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2eb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2ed.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2ee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2f0.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2f1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/197395_5e804c529f2f3.jpg"],"destinations":["Ho Chi Minh City","Mekong Delta"],"timeline":[{"title":"HO CHI MINH ARRIVAL (-/-/-)","description":"You will be met by Luco Travel’s tour guide and driver at Tan Son Nhat International airport and transfer to your hotel for check-in hotel. Free and easy or you may like this option as below:\n                     Option 1: Water Puppet Show & Dinner On Saigon Cruise\n18:00 Pick up at the hotel. We will watch the Water Puppet Show. Traditional content of water puppet performance contains daily life of Vietnamese farmers (cultivating, tending buffalo, catching fishes…), communal entertainment (swimming contest, dragon dancing…), and/or historical legends (Le Loi returns precious sword…), with a performance that has appealed to audiences for centuries.\n19:30. Have a dinner on Sai Gon Cruise. Enjoy your meal while cruing along the Sai Gon river and sightseeing a part of Sai Gon by night.\n                           Option 2:  Saigon Street Food Tour On Scooter At Night.\nAt 18:00, our tour guide will meet and greet you at hotel. You then receive safety instructions on how to ride on the back of a bike properly in order to ensure the safest experience.\nYou will participate in the rush hour of Saigon the way we, the local, do: all from the back of the bike. We ride through the beautiful lit boulevards, the back alleys and the busy streets, which is undoubtedly more awesome of an experience than looking through pictures in your handbook!\nFirst, let’s enjoy Vietnamese pancake (Bánh xèo), spring rolls,… and you will learn about the customs and background knowledge of the food you eat from our guide and you also will try how to make it. We also would sit on small plastic chairs in the alleys, enjoy our food and drink like Vietnamese.\nLater on, our guide takes you around Saigon and explore \"Chung cư\" - a Vietnamese residential building which was built very long time ago. We will sit down to taste coffee in the hidden coffee shop and learn how to make a glass of coffee without machine. It is so good and that is why it has its place in everyone's bucket list when coming to Vietnam.\nOn our way, you will see local activities and discover small alleys where Vietnamese always enjoy their spare time in the evening and of course, getting some snacks (Vietnamese pizza) with which almost every Vietnamese falls in love, is a must.\nYour last stop is the famous Vietnamese dessert, the sweet soup. You will have a chance to let us rock your senses until your jaw drop with 3 – 5 kinds of sweet soup desserts.\nAt around 10:00 pm, we will take you back to your hotel.\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator."},{"title":"CU CHI TUNNEL & HO CHI MINH CITY TOUR. (B/L/-)","description":"The morning, Luco Travel’s  tour guide will pick you up at the hotel, proceed to Cu Chi tunnel to explore the amazing site where Viet Cong hid during the War. It is now a popular spot for both Vietnamese & foreign tourists - the network of over 250km of tunnels became legendary when they played a vital role in the War. In their heyday, the tunnels were functioning underground cities that included numerous trap doors, specially constructed living areas, storage facilities, weapons factories, field hospitals, command centers & kitchens.\nThere is plenty of evidence of the fierce battles that took place here during the 1960s when Cu Chi was a \"Free Target Zone\". Visitors can watch a short introductory video showing how the tunnels were constructed before entering the tunnels. You will spend the next hour exploring the tunnels. Afterwards, enjoy tea with cassava ( the guerrillas food in war time).\nAfter lunch at a local restaurant, We will visit the War Remnants Museum: Formerly known as the Museum of Vietnam War, this is a poignant display of the futility of war. Some of the black and white photography in the ‘Requiem’ exhibit is particularly touching, dedicated to both foreign and Vietnamese journalists and photographers who perished during the conflict. The courtyard outside contains the spoils of war, namely rusting jets, tanks and cannons captured from the American military reginme.\nAfter that visitors can visit The Reunification Palace: This is one of the most important buildings in the city. Here on April 30th 1975 the ‘American War’ officially ended when tank number 843 of the North Vietnamese Army crashed through the gates of what was, at the time the residence of the President of the Republic of Vietnam.\nThen you can go sight-seeing at the Notre Dame Cathedral and Old Post Office: built between 1877 and 1883. this is one of the best examples of classical French colonial architecture. Remarkably every stone used in its creation was shipped from France to Vietnam. Her two 40m towers, topped with iron spires dominate the city’s skyline. The Old Post Office is another example of French colonial architecture and is also the country’s largest post office. Visit former US Embassy.\nStop at Saigon Square or Ben Thanh Market: This bustling market is very popular with tourists, primarily due to its central location. It has a wide selection of goods ranging from fake Nike shoes to beautiful silk Ao Dais.\nBack the hotel. Free & Easy\t\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator.\n"},{"title":"MEKONG RIVER DELTA - MY THO - BEN TRE ISLAND TOUR. (B/L/-)","description":"After your breakfast, Luco Travel’s tour guide will pick up you at the lobby, to depart toward Mekong Delta. It takes 1,5 hours driving to get to My Tho Town in Mekong Delta. On the way, travellers will have chance to see the beautiful landscapes along the road such as the green rice fields, the peaceful Vam Co Dong river and the busy Long An town. To end the route, our bus will stop at Mekong rest stop where you can take a rest and see a beautiful bonsai garden.\nYou will arrive at My Tho Town and visit Vinh Trang pagoda, an old ancient pagoda in Southern Vietnam. Known as the largest pagoda and the most special architecture in Mekong Delta, its architecture was influenced by both Vietnamese and Khmer’s culture as well as European architecture.\nAfter visiting Vinh Trang pagoda, the bus will take tourists to the pier boat for getting on a motor boat. Take a leisurely boat ride in Tien river to enjoy the fresh air, to see the peaceful life of the local people, and also to pass by the stilt house, the fishing floating farm, and the four islands: Dragon, Phoenix, Tortoise and Unicorn.\nYou will take a half hour by boat to arrive at Thoi Son Island, the biggest island of four islands. Take a leisurely walk on the village paths, visit local people’s homes and an orchard garden, enjoy seasonal fruits while listening to traditional Southern folk music. \nWe will take a hand- rowing boat through the creeks for sightseeing the natural water coconut trees a symbol of the Delta areas. The local people will give you the “ nón lá” the Vietnamese traditional hat. After that you can try to row the boat by yourself. \nAfter 20 minutes we will arrive at the bee keeping farm, then visit the honey bee farm and taste delicious honey tea with lemon that is really good for health. The local people also have a python farm, for those tourists , who like adventure you can take a photo with the  pythons.\nAfter lunch at a local restaurant, you will ride through the village paths to enjoy the fresh air and observe the pastoral life, concluding with a short walk through the narrow village.\nYou will return  to the motor boat to cruise to Ben Tre Province, known as coconut country in Mekong Delta. There you will visit the coconut candy workshop to know how to make delicious candies by hand. The highlight of the trip is to take a sightsee through the peaceful villages by horse cart. You also can visit the crocodile farm on the island.\nYou will return to the boat and back to the car. Our car will take you back to Ho Chi Minh city, where you will have.\nFree & Easy.\nOvernight in Ho Chi Minh City arranged by Luco Travel – Vietnam Tour Operator. \n"},{"title":"HO CHI MINH DEPARTURE. (B/-/-)","description":"Today is departure day. Enjoy some free time for last minute purchases or simply relax before your transfer to the airport for your onward flight . Then, home sweet home."}]}]