[{"name":"Pho, Fun & Sun in Vietnam","duration":10,"travelStyle":["Discovery","Bicycle","Group","Fully Guided","Sailing","Historical"],"oldPrice":0,"price":2099,"summary":"Embark on an enriching ten-day journey through Vietnam. Your mind will expand \nas you learn about Vietnam’s history and crafts. Your body will be \ninvigorated by feasting on nourishing food, kayaking through a karst \nlandscape and cycling through rural Vietnam. Your soul will be soothed by tai \nchi and yoga. You’ll see the best of Vietnam’s cities and countryside and \nreturn home realigned, with a head bursting with unforgettable memories of \nthis multifaceted land.","highlights":["Cruise and kayak through the enchantingly beautiful Halong Bay","Taste wine in Hanoi, sample street food in Saigon, join a chef for dinner in Hoi An","Be enthralled and appalled by Vietnam’s complex ancient and modern history"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/186710_0adb5034.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/186710_0adb5034.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_ca94e3a8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_a04fdbee.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_c1c5873c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_b4d018e7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_3c45bdcc.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_57f6719c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_eae7524a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/186710_cb1435d8.jpg"],"destinations":["Hanoi","Halong Bay","Hue","Hoi An","Ho Chi Minh City"],"timeline":[{"title":"Day 1: Good Morning Vietnam","description":"The capital of Vietnam, Hanoi, is ready to welcome you when you arrive. Get \nacclimatised and familiarise yourself with the city by wandering the \ntree-lined avenues.\n\nThere’s a group welcome meeting then you’ll dine at KOTO (Know One, Teach \nOne), a well-established training restaurant for disadvantaged youths. \nYou’ll be served a blend of Vietnamese, South-East Asian and Western foods."},{"title":"Day 2: Start the day right with yoga and tai chi","description":"You’ll set an early alarm today, but (blissfully) there’s no commuter \nslog ahead. Instead, you’re off to Hoan Kiem Lake for a Tai Chi and \nLaughing Yoga session. Mind and body aligned, you’ll feast on /pho, /a \nVietnamese soup, for breakfast before setting off on a walk around Hanoi’s \nOld Quarter where you’ll sample egg coffee.\n\nYou’ll try /bun cha/ for lunch, a local speciality dish of noodles, broth \nand meat served alongside some greens.\n\nLater, there’s wine tasting in store, led by local expert Thang. You’ll \nhear his far-flung traveller tales where he discovered global alcohol-making \nprocesses. Then learn how he has introduced teas to enrich the taste of his \nwines. "},{"title":"Day 3: Discover the majesty of Halong Bay","description":"After breakfast, you’ll make the four-hour journey by road to Halong Bay. A \nspellbinding sight, this is where thousands of limestone pillars rise from an \nemerald-hued sea. You’ll set sail through the karst scenery with lunch \nserved on board and later enjoy sunset cocktails and dinner. You’ll sleep \nonboard tonight, sharing twin-share cabins with en-suite facilities.\n\nPlease be aware that the boat trip on Halong Bay can be subject to short \nnotice change if certain adverse weather conditions develop during your trip."},{"title":"Day 4: Hello Hue","description":"Rise with the sun for tai chi onboard before breakfast. Afterwards, you'll \nkayak past ethereal grottoes before jumping back on board to cruise back to \nthe mainland and head to the airport for a short flight to Hue (pronounced \n‘hway’) on the banks of the Perfume River. As the ancient home of the \nNguyen emperors, Hue claims to be the true cultural and historic centre of \nVietnam.  "},{"title":"Day 5: Explore ancient Hue. Visit the Peaceful Bamboo Family","description":"There’s a historic immersion lined up today. First, you’ll visit the \nImperial City of Hue, a complex of the emperor’s residence, palaces, \nshrines and state buildings. Although it’s a fraction of what was once here \n(it was badly bombed in the wars that afflicted Vietnam), it’s a \nfascinating glimpse into Vietnamese history.  \n\nIn the afternoon, you’ll visit the Peaceful Bamboo Family, an uplifting \ncommunity for children with learning disabilities. You’ll have lunch in \ntheir biodynamic garden, see their lacquer painting workshop, and have the \nchance to buy handmade incense and jams."},{"title":"Day 6: Get to know Hoi An and try your hand at lantern making","description":"After breakfast, you’ll take a private bus to Hoi An, once a major trading \nport that has retained its old-world charm. You’ll have a walking tour of \nthe Old Town, drinking in the history of the 800 centuries-old buildings. \nLater, there’s a lantern making class."},{"title":"Day 7: Cycle to Tra Que Vegetable Village for dinner","description":"After a morning that’s all yours, in the afternoon you’ll take a \nleisurely bike ride to Tra Que Vegetable Village. Observe how the locals live \nand grow their produce, then visit a chef’s home to feast on a spread of \nthe regional dishes."},{"title":"Day 8: Get swept up in Saigon","description":"Tear yourself away from Hoi An – today you’re bound for Saigon, or Ho Chi \nMinh City, as it’s now known. You’ll take a short flight to this vibrant, \nchaotic city. Prepare for an assault on your senses: the relentless racket of \nscooters and a riot of colourful markets. You’ll take a guided visit to the \nmoving and powerful War Remnants Museum. It’s a horrifying but enlightening \ninsight into the atrocities that afflicted this nation.\n\nTonight, you’ll join the throngs of scooters on a street tour by Vespa. \nYou’ll be guided to the less-explored pockets of the city to try the best \nof Saigon’s street food."},{"title":"Day 9: Visit the Cu Chi tunnels","description":"You’ll visit the Cu Chi tunnels today, an intricate system of underground \ntunnels that wind for 120 miles. Used by the Viet Cong, the network has \nliving areas, weapon factories, field hospitals and kitchens. On the tour, \nyou’ll hear about the impact the wars had on the local communities.\n\nAbove ground, your day continues with a cooking class at the Spice Garden \nrestaurant under the expert guidance of a local chef. Having devoured your \ncreations, you’ll return to HCMC. Tonight, there’s an optional dinner and \ndrinks for a fitting farewell to your group before preparing to return home \ntomorrow."},{"title":"Day 10: End Saigon","description":"After a final breakfast in Ho Chi Minh City, a transfer will take you to the \nairport for your flight home."}]},{"name":"Cycle Saigon to Hanoi","duration":14,"travelStyle":["Bicycle","Group","Fully Guided"],"oldPrice":0,"price":2090,"summary":"On this adventurous and active trip we experience Vietnam on two wheels. Along the way we discover Saigon, Hoi An, Hue, Hanoi and the majestic beauty of Halong Bay on an overnight cruise. What better way to fuel your ride than with the delicious Vietnamese cuisine.    Cycle the Central Highlands - Explore Vietnam's lush hill country and cycle over the Hon Giao Pass  Saigon - Cycle out to the Cu Chi Tunnels and explore the Mekong Delta   Hoi An - Visit the beautiful World Heritage town. ","highlights":["Cycle out to the Cu Chi Tunnels of Saigon","Explore the beautiful waters of the Mekong Delta","Visit the beautiful World Heritage town of Hoi An","Take a cruise and discover island paradises"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/124491_33c206f2.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/124491_33c206f2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_189b5509.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_16a3f613.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_2971f6cf.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_a2da382b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_2ced71c7.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_7bea2ba2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_c8170c42.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_712fbdcd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_8b02f45b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_9576cf64.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_20f5398d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_b7c5e4be.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_0282330f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_8c8b54c6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_b2479666.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_ae59750a.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_c1b39044.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_2a7a4bac.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_a2547167.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_681eb37d.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_49b76e56.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_89a935a1.jpg","https://cdn.tourradar.com/s3/tour/1500x800/124491_72c1f26f.jpg"],"destinations":["Ho Chi Minh City","Dalat","Quy Nhon","Hoi An","Hue","Hanoi","Halong Bay"],"timeline":[{"title":"Day 1: Join trip Saigon; afternoon orientation tour","description":"Arrive in Ho Chi Minh City. Still unofficially referred to as Saigon, the city is the largest in Vietnam. You will find an eclectic mix of the traditional and the new, where pagodas and markets compete alongside the trappings of Vietnam's newly discovered entrepreneurial spirit. \n \n Our Tour Leader plans to meet you in the hotel reception at 4pm for the welcome meeting followed by a walking tour. The tour will take in some of the highlights including the Opera House (formerly South Vietnam National Assembly), Hotel de Ville, Notre Dame Cathedral and the impressive French style edifice that is the GPO building.\n \n If you would like to receive a complimentary airport transfer today, you'll need to arrive into Tan Son Nhat International Airport (SGN), which is 30 minutes from the hotel.\n \n Please note that if you wish to join the afternoon orientation walk today, you must arrive at the hotel by 4pm. If you are booking your own flights, we recommend giving yourself 30 minutes to an hour to clear the airport. Therefore the latest your flight can arrive is about 2pm. Should you miss the welcome meeting, your Leader will inform you of any essential information by note left at the front desk.  \n \n If arriving earlier we suggest exploring at your leisure, perhaps to visit the Presidential Palace, or the War Crimes Museum, or even just take a walk around this bustling city. In the evening you have the option to see a water puppet show.Start point\n Huong Sen Hotel, Hotel Reception, 66-70 Đồng Khởi, Bến Nghé, Quận 1, Hồ Chí Minh, Vietnam 16:00"},{"title":"Day 2: Cycle to Cu Chi Tunnels","description":"Driving for 1.5hrs away from Saigon's remarkable rush hour traffic to reach the quieter suburbs this morning, we collect our bikes near the remains of an old US military base (25th infantry division) and start our ride for about 30 km to Ben Duoc, the site of the infamous Cu Chi Tunnels. Originally started during the French occupation of the country, the tunnels went on to achieve notoriety during the Vietnam War, when they formed an amazing underground command base for 10,000 Viet Cong troops. We will explore the tunnels with a local guide this morning. Be warned though, the tunnels are low and narrow and can be claustrophobic. After lunch we continue cycling for about 20 km towards Ben Nay to further explore the area. We drive 2hrs back to Saigon arriving in the early evening. It is possible to spend a free day in Saigon if you prefer to see more of the city. For the cycle ride today, and on subsequent rides, water is provided and you can top up your water bottle from the support truck.\n \n Our total cycling distance today is approximately 50 kilometres (total accumulated ascent 50 meters, total accumulated descent 40 metres)."},{"title":"Day 3: Drive to Mekong Delta then cycle backroads to Cai Be","description":"Today gives us an opportunity to journey down into the Mekong Delta, to explore the fertile hinterland between the South China Sea and the Gulf of Thailand. Leaving Saigon, a 2 hour drive takes us into the Mekong Delta to Binh Duc (My Tho), from where we begin cycling through an interesting landscape of waterways, markets, orchards and riverside villages. The first 30km of today's ride are on roads with moderate traffic and the remaining 20km are on narrow pathways and routes that our support bus cannot follow. Here we can see local cottage industries making rice paper or coconut sweets as they have been for generations. After a tasty lunch of local produce we cycle on through Tan Phong and visit a beautifully restored traditional house in Ut Kiet, before finishing our ride at Cai Be's famous market. From here we drive for about 2 or 3 hours, depending on traffic, back into the centre of Saigon arriving in the early evening.\n \n Our total cycling distance today is approximately 51 kilometres, flat cycling."},{"title":"Day 4: Exploring Vietnam’s Central Highlands","description":"Departing Saigon this morning we head north into the southern Central Highlands towards the mountain town of Dalat (set at 1500 metres elevation). After an initial 2 hour drive we commence today's cycling with a picturesque 30 kilometre ride through the hills of the Langbiang Plateau, negotiating our way along reasonably quiet, gently undulating back roads to the town of Gia Kiem and then Bao Loc. After a relaxing lunch in Bao Loc we board our bus again for a very scenic 2 - 3 hr drive right across the mountains, giving us stunning views over the forested hills and tea and coffee plantations, to finally reach the bustling mountain town of Dalat in the late afternoon. The city has a European feel in its architecture and a cooler climate due to the higher altitude. \n \n Our total cycling distance today is approximately 30 kilometres (total accumulated ascent 210 metres, total accumulated descent 150 metres)."},{"title":"Day 5: Cycle over Hon Giao Pass then drive to Nha Trang","description":"We leave Dalat this morning by bus and drive for about half an hour to the start of today's ride. The beginning of the ride is on relatively quiet mountain roads with plenty of ascent and descent for the first 20km before we stop for a break. From here the next 30km culminates with an ascent of the Hon Giao Pass (1,700m), a challenging ride that takes us up through forests of pine and across a landscape of dramatic mountain scenery. After celebrating reaching the pass and a chance to rest at the top, the remainder of today's ride is a superb 30km of virtually uninterrupted descent towards the town of Khanh Vinh, where we plan to stop for lunch. We finish the rest of the journey to Nha Trang by bus and it should take us around 1.5 hours.\n \n Our total cycling distance today is approximately 80 kilometres (total accumulated ascent 1140 metres, total accumulated descent 2962 metres)."},{"title":"Day 6: Boat trip to tropical islands","description":"Nha Trang's beautiful bays, golden beaches and turquoise waters have seen it quickly grow into a bustling town and popular tourist destination. Weather permitting, this morning we take a cruise out to explore the surrounding seas and islands. We aim to stop near one of the islands where you have the option to have a swim from the boat (possible to hire snorkelling equipment). We move on to another tiny island where we plan to spend a few hours to relax and swim. The island is privately owned and it is possible to rent a sun lounger and parasol. There will also be the option to enjoy drinks, a seafood lunch or snack on the island (at your own expense). Returning to Nha Trang later this afternoon the rest of the day is free. \n \n No cycling today - rest day."},{"title":"Day 7: Cycle and drive from Nha Trang to Quy Nhon","description":"Using a combination of bus and bicycle this morning we continue along the coast to the city of Quy Nhon. We commence our ride from the hotel in Nha Trang, encountering heavier traffic as we leave the city which thins out as we head along the Pham Van Dong road and continue along the coastal road to Ninh An toll fee station (a journey of some 18 kilometres). From here we then take the bus for one hour to Dai Lanh, where we have a chance to swim and relax, before continuing by bus over Ca Pass to Bai Tien Song Cau. From here we resume our journey by bike with a 42 km ride to complete the final leg to Quy Nhon and our hotel for the night.\n \n Our total cycling distance today is approximately 60 kilometres (total accumulated ascent 640 metres, total accumulated descent 775 metres)."},{"title":"Day 8: Pedal over the Thi Nai sea bridge; drive to Hoi An","description":"Departing Quy Nhon this morning we cycle out across Thi Nai Bridge, the longest sea bridge in Vietnam, which connects the city with the Phuong Mai Peninsula. Once across, we continue by bike along the Quy Nyon lagoon towards Phu My some 50 kilometres away. From Phu My we then travel by bus to Quang Ngai, the scene of the My Lai massacre - one of the most infamous episodes of the Vietnam War. After visiting the site and visitor's centre, we complete the final leg to Hoi An by bus, a journey of some 2 to 3 hours.\n \n Our total cycling distance today is approximately 59 kilometres (total accumulated ascent 395 metres, total accumulated descent 390 metres)."},{"title":"Day 9: Morning walking tour of Hoi An; free afternoon","description":"The historic, merchant town and safe harbour of Hoi An had become one of the busiest international trading ports of Southeast Asia by the 17th and 18th centuries. Colonised by the Portuguese in the 16th century, it still retains its charm today, with many of its old buildings superbly preserved. This morning we take a walk through the historic heart of this World Heritage Site, taking in the city's famous Japanese Bridge and its museum, before wandering amongst its traditional wooden houses and Chinese temples. This afternoon is then free to perhaps take a gentle river cruise, try your hand at Vietnamese cooking or pay a visit to one of Hoi An's renowned tailors' shops, or maybe explore further afield by bike.  \n \n No included cycling today - rest day."},{"title":"Day 10: Cycle and drive to Hue via the Hai Van pass","description":"Leaving Hoi An after breakfast, we travel by bus up the coast to Danang followed by a twisting drive up to the lofty heights of the Hai Van (Sea Cloud) Pass. This stunningly scenic region once marked the boundary between Vietnam and the Champa Kingdom to the south and, as we reach the summit of the pass, the panoramas before us are simply spectacular. Descending by bus we head next for Lang Co where today's ride starts. We cycle along scenic back roads as we wind our way alongside the Cau Hai Lagoon to end the ride finally at Phu Bai. Meeting our bus in Thuan An, we then drive for about an hour on to Hué on the shores of the Perfume River.\n \n Our total cycling distance today is approximately 80 kilometres (total accumulated ascent 100 metres, total accumulated descent 100 metres)."},{"title":"Day 11: Cycling around Hue then overnight train to Hanoi","description":"Once the capital of Vietnam and an inspiration for poets and artists alike for centuries, Hue is still a thriving and important city. First thing this morning we drive to the impressive Old Citadel that still dominates the left bank of the river. After visiting the citadel we commence our final cycle ride. Our route follows the Perfume River and leads us to the 19th century Nguyen Tomb of Ming Mang. After visiting the mausoleum we return to our hotel to freshen up before the mid- to late-afternoon departure of the overnight train to Hanoi. We plan to stay in 'soft-sleeper' four berth cabins, bunk bed style and bedding is provided. Both Western and Asian style toilets are at the end of each carriage as well as a basin. The Leader will allocate beds keeping people together as far as possible but it may be necessary to share with other travellers.\n \n Our total cycling distance today is approximately 20 kilometres (total accumulated ascent 130 metres, total accumulated descent 115 metres)."},{"title":"Day 12: Arrive in Hanoi; Drive to Halong bay for overnight cruise","description":"Arriving in the Vietnamese capital early this morning we drive to the hotel in time for breakfast. Later this morning we then drive (2.5hrs) to the Gulf of Tonkin and the breathtaking scenery of Halong Bay, a UNESCO World Heritage Site and one of the most visually impressive landscapes in South East Asia. Boarding the boat in time for lunch we set sail and visit Sung Sot Cave, spending this evening aboard the junk in twin-share, en suite cabins. Please note - the boat is not exclusive to us and we may be sharing with other tourists. You have the option to leave the majority of your luggage in the hotel in Hanoi and take only an overnight bag. If you prefer to take your main luggage it is fine but please note that the cabins are inevitably small.\n \n No cycling, rest day."},{"title":"Day 13: Morning cruise then drive to Hanoi then city tour","description":"This morning we continue cruising through this wonderfully scenic landscape, enjoying the serenity of its limestone islands and visiting some of the caves (the optional cave visits can involve climbing some slippery steps). Returning to shore mid-morning we then drive back to Hanoi, a 2.5 hour journey that gets us into the capital in time to enjoy a short tour of the city. Our late afternoon walking tour includes a visit to the Ba Dinh Square and the Temple of Literature, as well as a chance to explore a little something of the city's fascinating Old Quarter. \n \n No cycling, rest day."},{"title":"Day 14: Trip ends Hanoi","description":"The trip ends after breakfast at our hotel in Hanoi.\n \n There are no activities planned today, so you are free to depart from Hanoi at any time. If your flight is departing later in the day, luggage storage facilities are available at our hotel. If you would like to receive a complimentary airport transfer today, you will need to depart from Noi Bai International Airport (HAN), which is around 45 minutes from the hotel.End point\n Anise Hotel Hanoi, Hotel reception, 22 Quán Thánh, Nguyễn Trung Trực, Ba Đình, Hà Nội, Vietnam 09:00"}]},{"name":"Cycle and Discover the Highlights of Central Vietnam","duration":12,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","Discovery"],"oldPrice":0,"price":2264,"summary":"CYCLE AND DISCOVER THE HIGHLIGHTS OF CENTRAL VIETNAM 12D11N","highlights":[],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/189038_5df2063023b70.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/189038_5df2063023b70.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5df2063004aeb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5df2062fcdddb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5df206303b943.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5df206302c426.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5df206301baa2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/189038_5ef4305c82830.jpg"],"destinations":["Hanoi","Phong Nha-Kẻ Bàng National Park","Hue","Hoi An"],"timeline":[{"title":"Arrival in Hanoi","description":"Upon arrival in Hanoi, you will make your own arrangements to travel to the hotel. \n\nIn the evening, the guide will meet your group in the hotel lobby, and you will then head off to a local restaurant for a welcome dinner. \n\nMeals included: Dinner\nAccommodation: Overnight at hotel\nNotes: Rooms will be at guests’ disposal from 14:00\nNote: Airport pick up can be provided as a supplement for travelers arriving on a different flight.\n"},{"title":"Hanoi - Dong Hoi (Night Train)","description":"On the second day, enjoy a sight-seeing excursion around Hanoi. In the morning, you will begin your full day of discovery of the capital at the Ho Chi Minh Mausoleum - view from outside only- a tribute to the architecture of the Lenin Mausoleum in Moscow, his traditional stilt house and the One-Pillar Pagoda, built in the 11th century. Later on, you will visit the Temple of Literature (Van Mieu in Vietnamese), situated in the place once known as the first university of Vietnam. Built in 1070 by Emperor Ly Thanh Tong, the university was first opened for princes and mandarins exclusively. With its ancient courtyards, altars and roofs, Van Mieu is a very fine example of Vietnamese architecture. \n\nAfter lunch, you will set off from Sword Lake for 2 hour strolling (4kilometers) in the Old Quarter, passing by Hang Hanh - the famous coffee street and heading towards the Catholic Church. Wandering in these peaceful alleys, your eyes will catch the daily scenes of street vendors quietly napping in the shade or a motorbike taxi-driver (or xe om in Vietnamese) sleeping precariously on his bike. Then, suddenly you will again find yourself in a noisy and busy street. Throughout the tour, your senses will be bombarded with a cascade of different sights, sounds, smells and characters that harmonize to the music of life in Hanoi. At the end of the walk, you will have time to enjoy a cup of coffee from one of the many small shops in the area.\nIn the evening, have dinner in a local restaurant before heading to the railway station for the night train to Dong Hoi. \n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight on the train\nSuggested night train Hanoi - Dong Hoi: SE1 22:20 - 07:45 (non-private 4-berth soft-sleeper cabin)\nNote: \n"},{"title":"Arrival in Dong Hoi - Phong Nha","description":"Upon arrival at Doi Hoi station, you will meet the guide and driver for transfer to your hotel in Phong Nha. The early check-in room is included – have breakfast at the hotel and refresh before starting the trip. \n\nAt 10:30, the guide will meet the group in the hotel lobby for a trip briefing. You will then travel deep into the Phong Nha-Ke Bang National Park (a UNESCO World Heritage Site) to visit the Paradise Cave. Climb uphill to the entrance, then take another easy walk following a wooden walkway about 1 kilometer underground to visit Paradise Cave - a feast for the eyes and soul. \nAfterwards you will take a drive to a local restaurant for refreshments and to taste their specialty: roasted chicken and veggies. After lunch, you will continue to Chay Village. From here, you will hike through surrounding villages, cross the Chay River and trek to the Wine Cave – here the Viet Cong made wine during the war time. It also served as a bomb shelter for local people hiding from the bomb raids during the 1960s and 1970s. Today, this cave still symbolizes love and peace.\nReturn to the hotel in the late afternoon. \n\nMeals: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel in Phong Nha\nNotes: During the rainy season (September, October and November) the caves may be inaccessible due to high levels of water. During the summer, visiting the caves should be arranged in the early morning or noon time to avoid crowds of Vietnamese visitors.\n"},{"title":"Phong Nha - Local experience","description":"On day 4 you will enjoy a cycling tour into the villages of Phong Nha to experience the local lifestyle and culture. The tour takes you along Son River to reach the villages of Bong Lai Valley. Here you will have the opportunity to join in local farming activities in the rice paddies or peanut fields or learn how Vietnamese-style popcorn is made. You will be cycling on unpaved roads and paths, crossing many rice fields. After some uphill climbing, descend into Bong Lai Valley where you will be visiting a local farm run by a Viet Cong veteran couple. Learn how they farm green peppers and other vegetables, and enjoy the seasonal fruits on their farm. \nAfter lunch, you will cycle back to the town to explore the impressive Phong Nha water cave. After 45 minutes of cycling, you will arrive at the boat landing in Phong Nha National Park. A boat ride up a scenic river leads to a gaping maw in the mountain. The motor cuts off, the roof is drawn back, and you are paddled into a surrealistic wonderland. Columns and stalactites of many colors capture the eye one after the other, remarkably resembling giant flowers and mushrooms. There are also some walks to visit Fairy Grotto.\nAfter the visit, travel back to your hotel.\n\nMeals: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel\nEasia Level: 1\nDistance and duration of cycling: Up to 30 kilometers – 3 hours \nDifference in elevation: None \nTerrain: Mix of paved road and off-road trails \nTransportation: Full-day vehicle support / 1-hour boat trip\n"},{"title":"Phong Nha - Hue","description":"After breakfast and check-out, you will depart from Phong Nha. You will travel for 1hr 30min to the starting point of the Ho Chi Minh Trail, which the Viet Cong started to construct in May 1959. The Ho Chi Minh original trail facilitated the movement of soldiers and war supplies from North Vietnam to battlefields in South Vietnam. \nNext, visit the National War Cemetery – home to over 10,000 soldiers killed during the war along the Ho Chi Minh Trail. Pedal along the country roads through the rubber plantations and stop for a break under the shade of the rubber trees. Then cycle onwards to the 17th Parallel - Ben Hai River, the demilitarized zone of Vietnam from 1954 to 1972. You will continue on more uphills and downhills on a single road, through the pepper plantations taking you to Vinh Moc tunnel complex – known as the legendary “Underground City” during the American War in Vietnam. Local people stayed underground for nearly 2,000 days without sunlight in order to remain in their homeland. 17 children were born during this time, all of them underground. Explore the historic tunnels and enjoy the beautiful sea view upon exit. \nEnjoy lunch at the seaside restaurant at Cua Tung beach, then travel to Hue in the late afternoon.\n \nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at hotel\nEasia Level: 2\nDistance and duration of cycling: 45 - 55 kilometers – 5 hours\nDifference in elevation: None\nTerrain: Paved roads\nTransportation duration: Full-day vehicle support – 3hr 45min"},{"title":"A day cycling in Hue","description":"In the morning, your guide will meet you at your hotel and give you a short briefing. The day’s journey will start with a cycle to the Imperial Citadel. Following a tour of the Citadel, start pedaling towards Phu Mong Village, a former mandarin's village distinguished by its beautiful architecture. Then, continue the ride under the cool shade of the trees towards an ancient garden house called Xuan Vien Tieu Cung. Here, you will be welcomed by a local family and share a cup of green tea and fresh fruits from their garden. After saying farewell to your hosts, your journey will take you to the towering Thien Mu Pagoda. After a one-hour visit, cross the river on a local ferry before cycling towards Thuy Bieu Village, where you can admire Hue's absolutely superb landscapes, from the rice fields to the fruit trees, and vegetable gardens. Upon arriving at a quaint local house, enjoy a well-deserved lunch and a relaxing foot bath before heading out again.\nIn the afternoon, the majestic scenes of the Perfume River will enchant you as you cruise along its banks. After the journey, you will make your way to a craft village, where you will learn more about making incense and traditional hats, until it's time to pedal onwards to Tu Duc Tomb. After visiting the tomb, continue on to a local lagoon to enjoy a tour of an authentic fishing village, where you can see a fishing farm and enjoy the sunset at a local restaurant. At the end of the day, you will be taken back to your hotel.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 2\nDistance and duration of cycling: 45 kilometers – 5 hours\nDifference in elevation: None\nTerrain: A mix between paved roads and dirt roads\nTransportation: Full-day vehicle support\nOption 1: Transport back from the Lagoon to Hue – 15 kilometers – 20 minutes\nOption 2: Possible to reduce the cycling tour to 30 kilometers with return transport from Hue to the Lagoon – 30 kilometers – 40 minutes "},{"title":"Hue - Tam Giang Lagoon - Hue","description":"In the morning, you will head to the largest lagoon in Southeast Asia, Tam Giang Lagoon. Located 25 kilometers from Hue, Tam Giang has a pristine and serene beauty that has always attracted visitors to its waters. Along your journey, you will be able to appreciate the peaceful atmosphere of the Vietnamese countryside while you stop near a beach where white sand and turquoise waters await you. Following this refreshing break, return to Tam Giang Lagoon and head to a village to meet a local family, before exploring the village itself. Next, after embarking on a boat ride, you can participate in a small net fishing session with the locals and learn about this novel fishing technique.\nFinally, you will stop for a lunch of one of the region's specialties, served in a local house. At the end of the ride, return to Hue by private vehicle and enjoy some free time to relax or set out and explore the ancient capital of Vietnam.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 2  \nDistance and duration of cycling: 35 kilometers – 2 to 3 hours\nDifference in elevation: None\nTerrain: Flat, easy to ride\nTransportation: Full-day vehicle support – transport from Tam Giang Lagoon to Hue - 35 kilometers – 1 hour \n"},{"title":"Hue - Lang Co","description":"On this day you will set out cycling directly from the hotel along the village road from Ngoc Anh to the village of Vinh Ve, where the Chuon Lagoon region of the famous Tam Giang Lagoon is located. The old village draws visitors in with its beautiful, traditional architecture and the old pavilions' sophisticated patterns and lovely carvings of dragons. Later, make a stop at the Vinh Ve Museum to gain a deeper understanding of the locals' way of life.\nAfter visiting the museum, rural paths and the river will lead you through golden paddy fields, which stretch out to the Chuon Lagoon. Take a relaxing break at a local house, before embarking on a short cruise on a local ferry. Disembark, weave through village paths and narrow roads and head to Tu Hien Beach for lunch. After lunch, you will continue cycling another 15 kilometers before reaching the support vehicle; you can ride back in the vehicle or continue cycling back to your hotel.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 3\nDistance and duration of cycling: 65 kilometers – 4 to 5 hours\nDifference in elevation: None\nTerrain: Flat, easy to ride\nTransportation: Full-day vehicle support – 13 kilometers – 30 minutes\n"},{"title":"Lang Co - Hai Van Pass - Hoi An","description":"Depending on the location of the selected hotel, you will either start the day with a short van ride or a brief bicycle ride to Lap An Lagoon. Cycling around Lap An Lagoon will be a thrilling experience as you start pedaling hard through the Hai Van Pass. This pass was praised by BBC’s Top Gear as the most beautiful coastal mountain road in the world, and justifiably so! Starting your ascent along zigzagging paths that offer stunning views of jungles, waterfalls, and beaches, you will eventually reach the summit of the Hai Van Pass. Take a well-earned break at the small coffee shop on the top of the hill and enjoy the magnificent views. Then, you will have the choice to keep cycling to Hoi An, or to take the support vehicle at any time once you start riding down the Hai Van Pass to Hoi An.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 3\nDistance and duration of cycling: 30 kilometers – 4 hours\nDifference in elevation: +496 meters – 11 kilometers with an ascent gradient between 8-10%\nTerrain: Good road, high ascent \nTransportation: Full-day vehicle support – 60-kilometer trip to Hoi An after lunch – 1 to 1hr 30min \n"},{"title":"Hoi An","description":"During the morning, take a leisurely ride along Hoi An's main road. After a while, you will arrive at Hoi An's Old Town, where cars are now prohibited, so you can enjoy the seemingly timeless atmosphere of the district. Riding your bicycle through the Old Town's tiny alleys, you will be able to explore both the culture and lifestyle of Hoi An that escapes many tourists. Continue riding ahead to a small village that is surrounded by areca trees. Take a break here and try some delicious, grilled seafood and coconut rice paper at a welcoming, local house. After some tasty delights, head over the bridge to the other side of the Thu Bon River, where you will visit Dong Binh, a mat weaving village, where you can truly immerse yourself in the region's pastoral tranquility. From there, you will continue on to the carpenter's village to have a look at their beautiful wooden furniture, before boarding a local ferry to head back towards the old town and to reach Tra Que Village. This charming little village is famous for its diversity of fresh herbs and vegetables, all of which grow in picturesque fields where the local coconut trees sway gently in the wind. Pay a visit to a local host in Tra Que, rest in private and relax with a foot massage while enjoying a lovely local meal full of aromatic local produce.\nFinally, return to the town after lunch, perhaps resting for a while at the hotel before sightseeing in Hoi An's Old Town.\n\nMeals included: Breakfast, lunch, dinner\nAccommodation: Overnight at the hotel\nEasia Level: 2\nDistance and duration of cycling: 35 kilometers – 3 hours \nDifference in elevation: None\nTerrain: Flat, easy to ride\nTransportation: Road transport maximum 30 minutes, depending on the selected hotel location\n"},{"title":"Hoi An - My Son - Hoi An","description":"On your second last day, set out on Hoi An's characteristically narrow streets before reaching a small pier, where you will take a local ferry to cross the river. At your first stop, you will meet a local craftsman and get a closer look at the beautiful wooden furniture he creates. After this visit and some more cycling, you will have the opportunity to stop in a local house and try your hand at rice paper making, a delightful, authentic experience that seems simple, but requires some talent! After you make and eat your delicious snack, continue on the main road for few minutes before heading off to completely immerse yourself in the rural countryside.\nAfter a lunch break, you will visit the My Son sanctuary: the most important Cham archaeological site in central Vietnam. Dating back to the 4th and up to the 13th centuries, the 70-building complex demonstrates that the Cham civilization was contemporary and in line with the Khmer civilization. This makes My Son comparable to sites like Angkor in Cambodia, Borobudur in Indonesia, and Bagan in Myanmar.\nAfter exploring the sanctuary, ride back in the van to Hoi An and your hotel.\n\nMeals included: Breakfast, lunch, dinner\nEasia Level: 2\nDistance and duration of cycling: 40 kilometers - 4 hours \nDifference in elevation: 0 to +30 meters\nTerrain: Mainly paved roads, with some off-road paths through local villages\nTransportation: Full-day vehicle support\nTransport back to the hotel at the end of the visit (40 kilometers – 1 hour)\nNote: Possible to cycle back to the hotel for another 40 kilometers, but via the same road\n"},{"title":"Departure Hoi An - Danang International Airport","description":"On your last day you will have breakfast at the hotel, check out and transfer to Danang airport at your own arrangement for onward flight.\n\nMeals: Breakfast\nHotel standard check-out: 12:00\n"}]},{"name":"Saigon to Hanoi","duration":17,"travelStyle":["Bicycle","Adventure","Beach","Food & Culinary","Group","Partially Guided","Holiday"],"oldPrice":0,"price":3700,"summary":"Join us on a 17-day adventure in Vietnam bicycle touring from the bustling city of Ho Chi Minh City, otherwise known as Saigon, up to Hanoi. This epic southeast Asian bicycle tour tour showcases all aspects of Vietnam; from the poignant aspects of its war-torn history to its fragrant and unforgettable cuisine! Cycle through beautiful wetlands, backed by jagged peaks. Travel vast stretches of stunning beaches and sample the freshest seafood available, straight from ocean-to-table.","highlights":["Marvel at the hustle and bustle of vibrant Ho Chi Minh City","Learn Vietnam's war-torn history and try unforgettable cuisine","Cycle through beautiful wetlands past towering jagged peaks"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/19285_bc2f6e79.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/19285_bc2f6e79.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_9ba30dbd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_1c01526f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_6e4878b6.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_03879b46.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_dd992b41.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_7456d5c8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_f37d7676.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_12a532bd.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_8f644f82.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_a7b0c7d8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_b1f03ab8.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_9dd3bc0e.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_0739cc2c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_9040de92.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_20b68b93.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_49e89f1f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_a8ffd3d2.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19285_cbbecba4.jpg"],"destinations":["Ho Chi Minh City","Dalat","Quy Nhon","Hoi An","Hue","Ninh Binh","Cat Ba Island","Halong Bay","Hanoi"],"timeline":[{"title":"Day 1","description":"Meet in Saigon (Ho Chi Minh City) for dinner at one of the best restaurants in town!"},{"title":"Day 2","description":"Transfer a short distance out of town and ride to the famous Cu Chi Tunnels."},{"title":"Day 3","description":"Rise early to catch a plane for a short flight to Dalat, once a favorite summer retreat among  the French. Upon arrival, we'll test our bikes and cycle along lovely country lanes and back roads in the shadow of Mount Langbian."},{"title":"Day 4","description":"From the hotel we tackle some big hills, including a 2,000-m pass, as we ride through dramatic mountains towards the beach resort town of Nha Trang."},{"title":"Day 5","description":"For a rest day off the bikes we offer a boat trip to coral islands for swimming and snorkeling."},{"title":"Day 6","description":"Riding from Nha Trang we stick to the coast, pass fishing villages and have time for a swim. The afternoon ride is flat and on quiet countryside lanes."},{"title":"Day 7","description":"Riding along a remote road through a mix of tribal and Viet villages, we cover some gentle hills before reaching Quy Nhon."},{"title":"Day 8","description":"We follow the coastal road to Tra O lagoon past many fishing villages. After lunch we cruise along the coast to Highway One before transferring to Quang Ngai for the night."},{"title":"Day 9","description":"We’ll visit the Thien An pagoda on our way to see My Lai, the site of one of the worst massacres of the American/Vietnam War. Our cycle route loops to Ha Lam and we end our day in Hoi An."},{"title":"Day 10","description":"We ride to visit My Son, the ancient centre of Cham civilization. Although many of the temples were destroyed during the Vietnam War, the existing sites are still sure to impress most visitors. We transfer by bus back to Hoi An."},{"title":"Day 11","description":"This is the toughest but also the most rewarding day of riding. We start with a climb up Hai Van Pass with breathtaking views of the coast. We then take a coastal side road all the way to Hue, the old capital of the Nguyen Dynasty."},{"title":"Day 12","description":"After cruising on the Perfume River to Thien Mu Pagoda we get back on bicycle to visit Ming Mang Mausoleum. Then we transfer to the railway station for an overnight train to Ninh Binh."},{"title":"Day 13","description":"We cycle from our hotel through spectacular karst scenery with limestone mountains soaring in the middle of rice paddies. At Cuc Phuong National Park we visit the primate rescue centre before checking into our accommodation."},{"title":"Day 14","description":"After exploring more of the park by bike we head east, riding some interesting back roads through many pineapple plantations. We then transfer to Haipong, one of Vietnam’s major ports."},{"title":"Day 15","description":"After the morning transfer we catch a ferry to Fulong on Cat Ba Island.  Once off the boat we roll 27 km on the island’s only road and In the afternoon you are free to explore the area before spending the night on the this heavenly island."},{"title":"Day 16","description":"We have a short ride in the morning and head for a memorable cruise through majestic Halong Bay. Then we transfer to Hanoi and meet again in the evening for our farewell dinner."},{"title":"Day 17","description":"Onward travel from Hanoi."}]},{"name":"Meandering the Mekong Delta","duration":4,"travelStyle":["Bicycle","Adventure","Group","Partially Guided","In-depth Cultural"],"oldPrice":0,"price":850,"summary":"The mighty Mekong spreads into tentacles and tributaries in southern Vietnam, making the delta fertile and the region one of Vietnam's highest producers of rice, vegetables, and fruits. Cycling through rice paddies, orchards, along and over a myriad of small irrigation canals will let you see this unique area of Vietnam.","highlights":["Cycle through luscious rice paddies and colourful orchards","Ride along and over a myriad of small irrigation canals","Delve into culture at riverside villages along the way"],"imageCover":"https://cdn.tourradar.com/s3/tour/1500x800/19374_ae0406fb.jpg","images":["https://cdn.tourradar.com/s3/tour/1500x800/19374_ae0406fb.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19374_552a219f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19374_872dff6b.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19374_e1f4243c.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19374_51d6931f.jpg","https://cdn.tourradar.com/s3/tour/1500x800/19374_57e4bc72.jpg"],"destinations":["Ho Chi Minh City","Vinh Long","Can Tho"],"timeline":[{"title":"Day 1","description":"Transfer out of bustling Saigon to Cai Lay, where we begin our ride to Cai Be, the gateway to the Mekong Delta. We cycle down narrow lanes, over canals and past banana plantations to our overnight at a homestay."},{"title":"Day 2","description":"Catch a boat to one of the Mekong islands and bike along narrow dirt tracks and trails. Witness colorful riverside life while pedaling past picturesque delta homes, and clack across innumerable wooden bridges to the Khmer town of Tra Vinh."},{"title":"Day 3","description":"There is plenty to observe today - fishermen, village life, temples - as we cycle scenic roads, crossing many small bridges, to Can Tho. There are many Khmer temples to visit en route as well as Ba Om Pond with its magnificent lotus flowers."},{"title":"Day 4","description":"Spend the morning riding to Phong Dien Floating Market and weave through this bustling place along the banks of an active riverfront. Absorb the sights of endless cottage industries before we lunch and transfer back to Saigon."}]}]