[{"name":"Amazing Vietnam Family Vacation - 14 Days","reviews":[{"rating":"5.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.0","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"4.0","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]},{"name":"The best of Vietnam tour 12 days","reviews":[{"rating":"4.0","review":"Fantastic! We just finished 8 day tour Hanoi - Pu Luong - Ninh Binh - Halong and Cat Ba. It was very beautiful nature, Friendly people and great adventure Thank you Go Vietnam Travel Team"},{"rating":"5.0","review":"Great time going back to Sapa trekking."}]},{"name":"Inspiring Vietnam in 14 Days","reviews":[{"rating":"5.0","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]},{"name":"Essence Vietnam tour from North to South 12 days","reviews":[{"rating":"5.0","review":"Fantastic! We just finished 8 day tour Hanoi - Pu Luong - Ninh Binh - Halong and Cat Ba. It was very beautiful nature, Friendly people and great adventure Thank you Go Vietnam Travel Team"},{"rating":"4.0","review":"Great time going back to Sapa trekking."}]},{"name":"From North To South With SAPA - HALONG BAY- HOI AN 14 days","reviews":[{"rating":"3.5","review":"An excellent tour (19 days with Sim card Hanoi to HoChi Minh) Very busy. Perhaps a day for testing is a good idea as someone has already suggested. Enjoyed Sapa 2days excursion. Our guide Lee was excellent. Very good English (best of every guide) and very informative about district and Vietnamese culture. Good train journeys. The day from Hue to Quang Bihn Paradise cave was too long and we would have preferred to visit DMZ Zone and Vihn Moc Tunnels instead. Bit disappointed at 4 Isand trip from NhaTrang. Only 1 beach with good sand. Most things went to plan. Left a couple of times wondering if pick up would arrive but a quick message to Ms Lan and everything was sorted. Highly recommended."},{"rating":"4.0","review":"Most 10 day tour was good. The train journey shocked us. The train being dirty and very very uncomfortable for...\nShow more"},{"rating":"3.5","review":"Tour Radar was with us every step of the way. Hotels were clean and centrally located. Day tours were interesting...\nShow more"}]},{"name":"Stunning 13-Day Tour of Vietnam from North to South","reviews":[{"rating":"5.0","review":"I am very impressed with the guides and tour itinerary. They are all well organized and timely. Me and my friends really enjoyed the tour."}]}]