[{"name":"Getaway Vietnam Tour from Hanoi via Phong Nha cave, Khe Sanh, Hue, Hoi An to Saigon & Mekong Delta","reviews":[{"rating":"5.0","review":"Great tour with Dnq Travel team. I cannot praise Dnq travel highly enough, they were fantastic in every respect.The hotels chosen were always in the best location, clean and met all our needs."}]},{"name":"16 Days Best of Vietnam","reviews":[{"rating":"5.0","review":"Swallow Travel gets top star rating from us for organising an amazing tour from the north to the south of the country. Every pick-up and tours were on time and extremely well organised. The tour guides were excellent and made the tours fun."},{"rating":"5.0","review":"We purchased 14 day tour North to South Vietnam with Swallow Travel and were look after by Jenny. The tour was well organized, with on time pick up's, excellent tour guides & small groups. When we had an issue with our hotel in Hanoi due to building noise from across the street, we were transferred to another hotel with fuss or cost. I would highly recommend Swallow Travel if planning a trip to Vietnam."},{"rating":"5.0","review":"FANTASTIC is how I will describe this tour by Swallow Travel. Right from our first communications after booking this tour, during and after our trip, they were always available to answer any queries from us. \nJenny, who was our contact was amazing, she deserves a 10☆ rating all by her self. \nThe tour was incredibly well organised, all pick-ups were on time and each tour was so well organised with fantastic guides. None of the groups were big, which suited us and on one of our tours there were only the two of us and the guide. All of the guides were excellent. \nEach day is a new adventure in Vietnam and we're aware it's a well trodden route but it's so well done and we felt so thrilled to be part of it for a while. Yes, it has very busy towns and cities with scooters coming towards you from every angle but you soon  learn how to manage.  \nThe only mistake we made was that we booked separately, a guided food tour one evening. It really is not value for money ($25 each) and the food was not good at all. You can get much better food for a fraction of the price. (That's our only gripe)\nThanks again to TourRadar (who we will use again) and Swallow tours for giving us this amazing experience."},{"rating":"4.5","review":"It was my first experience buying tailored trip. It's very pleasant to be taken care of, when you go through airport gates and somebody is waiting for you already. Check in made, boarding passes printed, nothing much to stress about, just weather :).\nThe only change I'd make in trip itinerary now - I'd spend 4 nights in Ho Chi Min and 3 in Hoi An. But that's my personal preference - big cities. And I think you could make such arrangements prior a trip, because representatives of Swallow Travel (in my case it was Ms. Thuong Nguyen) communicate willingly and answer all your questions. \nAll transportation was easy and flawless, tours which I joined during trip interesting and well organised, small groups. Some of hotels chosen for this trip I liked better than the others, but all of them met standard requirements and were located conveniently.\nSo overall I'm really happy with my first experience with Tourradar platform, Swallow Travel company and my agent Thuong Nguyen especially, thank you! Can honestly recommend their services to every traveler."},{"rating":"5.0","review":"We have travelled twice to Vietnam; the first time to Hoi Ann and Nha Trang where we experienced two very different cities. Our second visit in August this year  took in Ho chi minh, Hue and Hanoi.\nOnce again Swallow Travel and in particular Thuong excelled. Her arranging of our internal flights, accommodation  and private tours was beyond expectations and made our stay in Vietnam most enjoyable and memorable. Her regular contact via email ensured all went smoothly and nothing was too much bother.\nMy partner and I have no hesitation in recommending Swallow Travels  to anyone wanting to visit Vietnam"},{"rating":"5.0","review":"Thanks Swallow Travel for an unforgettable 16-day trip in Vietnam. Every aspect of the communication excelled from the outset. The itinerary was customized to fit our requirements and every detail was taken care of. It was a VIP experience from start to finish. The tours were top class with lots of interesting activities while each hotel had character and all were most welcoming. The meals were exciting with an emphasis on local cuisine. The tour represented outstanding value for money!"},{"rating":"5.0","review":"Holiday of a lifetime - AMAZING!\nWe organised our tour with Jenny from Swallow Travel - from our very first contact, the service we received was first class. Replies to any of our questions or requests were answered promptly. We were very at ease even before we travelled based on any contact I had with Jenny while organising our trip. Without a doubt this was the best holiday myself and my husband ever had. Hotels were great, excursions were excellent and all our pick ups to and from the airports and our hotels went without a hitch. I would highly recommend this company to anyone thinking of booking with them or thinking of touring Vietnam and Cambodia. EXCELLENT!!!\nAlison & Kenneth Byrne\nDundalk, Co Louth, Ireland"},{"rating":"5.0","review":"We had a wonderful trip and were incredibly impressed by Swallow Tour's excellent service and assistance. The quality of the hotels we stayed in were great and the places covered in the tour really did cover the best aspects of Vietnam. Everything Swallow had control over was completely on time and perfectly organised - no hiccups at all!\nThank you for all your excellent information and emails throughout the planning process. As I said to you before if everyone was as thorough as you , it would be a great trip. Well they were and it was. We will recommend Swallow to anyone and when we travel back again it will certainly be through Swallow!\nThank you so much again"},{"rating":"5.0","review":"Although only 10 days and restricted to the North we were treated to a wonderful experience by attentive and pleasant guides who showed us the many faces of Vietnam."},{"rating":"5.0","review":"We three elderly ladies have just completed an amazingly organised 10 day holiday in Vietnam. Thuong Nguyen of Swallow Travel created our itinerary and was most accommodating to our many requests. The Itinerary was diverse, drop offs and pick ups were punctual and reliable. Nguyen was in communication 24/7. Nothing was ever too much trouble One of our party lost her phone when canoeing Nguyen organised a driver and met us at a reputable mall to purchase a replacement and she came to translate.\nWe have never experienced such reasonably priced,streamlined, no hiccups holiday. We could not recommend Thuong more highly”"},{"rating":"5.0","review":"We bought the 16 day tour from North to South Vietnam on Pigsback. Having never bought anything of this type nor experienced a tour with a company before, Swallow Travel exceeded all of our expectations. We upgraded to a flight to de nang but otherwise left everything as it was. All of our hotel transfers were on time and friendly. We were checked in online before every flight and picked up our boarding passes at the hotel reception. Our hotels were fantastic, well above the 3 star standard expected. Our trips were well organised with pick up and drop off at our hotel. We had lots of activities included in our itinerary and yet lots of time to do our own thing and explore ourselves as well. Customer service was top class, even meeting Thuong on our first night. We had a fantastic time around Vietnam with no hassle and no stress and all of the fun. I'd be hard pushed to organise a trip myself after this experience and it was fantastic value for money"},{"rating":"5.0","review":"We had an amazing trip from north to south Vietnam including Phu Quoc island with Swallow Travel. We had a carefree holiday thanks to the orgnisation skills of Minh Thuong who arranged everything for us and it all went without a hitch.It was such an interesting trip with lots to do and see would certainly recommend it."},{"rating":"5.0","review":"We have done a Tour with them and Thuong is such a lovely and friendly person and went out of her way to make our trip a memorable one. Thanks Thuong"},{"rating":"5.0","review":"We have done a Tour with them and Thuong is such a lovely and friendly person and went out of her way to make our trip a memorable one. Thanks Thuong"},{"rating":"5.0","review":"we arrived back home safe and sound!! Back with beautiful memories of wonderful holiday!! I really enjoyed my holiday in Vietnam and knowing your were there on whatsapp made me feel at ease. You were so quick to text back if we had any problems . I can’t thank you enough for looking after us and making our holiday a great experience. I will be recommending swallow travel to all my friends/ family and especially you Thuong for any trips to Vietnam! Take good cate ! we appreciate all your hard work"}]},{"name":"Vietnam from Mountains to the Seas - 17 Days","reviews":[{"rating":"5.0","review":"It was very interesting for me! Everything was clearly planned and organized. \nMr. Danny has always been in touch and answered to all of my questions at WhatsApp. \nThey even made upgrade and instead of the train they sent me by plane becouse of chinese New Year -I really appreciate it.\nI did not understand how it is possible to do everything so that everywhere - in different places and with different people, they would meet me everywhere, take me away and bring me with almost no delay. But that actually worked.\nAll guides tried very hard to be helpful and shared information with pleasure. Especially if I asked them questions.\nSomewhere I was alone with my guide, and somewhere along with the group, and always it was interesting and informative."},{"rating":"5.0","review":"Just want to thank you very much for fulfilling all of our expectations. Your professionalism to details has made this a truly memorable vacation. This\nwas our first experience using a tour, but I know realize, we found the best, and it's the only way to see the world, with this company.  My wife and I look forward to doing business again with touradar."},{"rating":"5.0","review":"Vietnam\n\n\n\nWe had a lovely trip to Vietnam. he hotels were nice, the guides very nice persons and the drivers on the trips were good. All went well and I hereby recommend Legend Travel Group to others."},{"rating":"5.0","review":"Good\n\n\n\nAll went smoothly, no issue with any pick up. All hotels were good. Different travel group each day, which I didn't mind but some may prefer to stay with the same group. From Brazil"},{"rating":"4.5","review":"a nice trip....\n\n\n\nwe spend an exellent journey in your country and i well tell it to everyone in my country !!!!!!!!thanks for this nice trip and nice time we spend together !!\nSherpa"},{"rating":"5.0","review":"Bucketlist Vietnam. From Hanoi to Saigon\n\n\n\nWe were very satisfied with the journey, except for a couple of things.It was unpleasant to travel with the lying/sitting busses and not necessary as we were traveling in the day times to Sapa.They are not made for big Europeans.And to Mui Ne it was the same kind of buss. Perhaps charming one way, but that’s that.Great praise to the pick ups. They were functioning so well.Great tour."},{"rating":"4.0","review":"Great as advertised, but could have more\n\n\n\nThis is a very good tour group, they are on time, take you right where you are supposed to go. Friendly people!! It's a nice little quick package to Vietnam. The only thing is that they dropped you around 4:00 everyday and you were on your own for the evening. Which is fine for a little on your adventure, but I would have preferred a little more guided activities before the end, maybe leave us at 5:30 and pack one more tourist attraction in. But the itinerary is clear and they did exactly what they said they would do, and it was awesome!! Thanks!\nDanel L"},{"rating":"4.5","review":"What an excellent experience!\nI am on a trip with Legend Travel Group and I can't say enough about the team and the experiences they provide. The schedule is set but if you want to make other arrangements they do, without a bother. Chu Minh Thang has been fabulous as she has been with me from the beginning of the booking process! I had an unfortunate situation occur at my first hotel, and Minh worked out alternate arrangements no problem for me. The drivers and guides have all turned out to be fabulous and extremely knowledgeable of the areas they are in. The bonus to having local, English speaking guides! Before I left Canada I was curious how the transition was going to work with pick ups and groups etc. But so far it has been excellent, very well executed! If you like group travel with independence, this tour company is perfect for you!!\n\nPuslinch, Canada"},{"rating":"4.5","review":"Vietnam Tour with Levend Travel\nWe toured Vietnam with Legend travel in September 2019 it was one of our most memorable vacations it was very well organised from start to finish the hotels we stayed in were all excellent as were the guides and drivers a particular thankyou to the guide we had for the first part of the trip in Hanoi the Halom bay cruise was excellent as was the rest of the trip to Que and Danang my only regret is that iwe never got as far as Ho Chi Min another time hopefully"}]},{"name":"Glimpse of Vietnam","reviews":[{"rating":"4.0","review":"Our trip was amazing. It provided us with a fantastic sample of what Vietnam has to offer."},{"rating":"5.0","review":"Amazing tour! Great for if you only have a short time to see Mynamar - it definitely packs in all the best sites. The guides were all incredible, really made the travelling every day easy and enjoyable. Accommodation is good too, especially in bagan and inle lake. Would recommend!"}]},{"name":"The Heart of Mekong Delta - 3 Days","reviews":[{"rating":"3.5","review":"I was disappointed that day 3 was virtually spent all day on a bus. I would have liked to have seen more of the delta south of Can Tho, may be Soc Trang, Bac Lieru. I didn't realise the tour was headed towards Cambodia."},{"rating":"3.5","review":"The trip was ok, but just all seemed to be a bit random, and not very well put together. Also, Some parts were so crowded that three or four groups were running  in to each other\n\nThe tour company itself it actually called TNK travel, and for some reason I was moved around over the three days into 2 different tour groups, with no explanation given\n\nIt’s was interesting and I saw some great things, but I think 1 or max 2 days is good - 3 days is clutching at straws as to things to see - I.e bird sanctuary, where you don’t really see many birds"},{"rating":"4.0","review":"Jack was very helpful with great attention to details. He really looked after us well. The bird sanctuary and sampan boat ride in the unicorn island were the highlights."},{"rating":"5.0","review":"We enjoyed this trip and due to a cancelled flight the company were able to swap around our itinerary so that we could still visit the places we wanted to"}]},{"name":"Sapa trekking: Muong Hum Market and Sapa Tribal Villages Explore 4 days","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Sapa Authentic experiences : Untouched Region and Coc Ly Market 3 days","reviews":[{"rating":"3.5","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Vietnam For Teens - 9 days","reviews":[{"rating":"4.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"5.0","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"4.5","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Ho Chi Minh City - Mekong Delta - Cu Chi Tunnels 4 Days 3 Nights","reviews":[{"rating":"4.5","review":"We did 3 day tour of Ho Chi Minh City, Mekong Delta, CuChi Tunnels.  Accomodation was great, guides were excellent especially Long on the Mekong Delta Tour.  The only disappointment was the itinerary indicated the first day included a tour of Ho Chi Minh City but when we contacted the Tour Operator they told us we needed to book this ourselves.  I have reviewed the brochure and it definitely indicates this is included even down to describing in detail the itinerary for the tour of the city on Cyclo.  In the end we organised a tour through the hotel and felt like we were ripped off by that tour operator.  We think you need to discuss this with Vietnam Adventure Tours and amend your brochure to make it clear it is not an inclusion."},{"rating":"5.0","review":"The hotel was in a great location, and the tour was everything we hoped for. The day trips to the Mekong Delta, War Museum and Cu Chi Tunnels were insightful and enjoyable. What really made our days great was the vibrant and friendly personalities of our two tour guides - Mr. Handsome and Ms. Bunny. They really made our stay in Saigon a memorable experience."},{"rating":"5.0","review":"While the tour was for 3 consecutive days The guide and group were different each day. The company arranged for an extra night accommodation and airport pick up and drop off. Extremely easy to work with. Punctual, flexible and approachable. Totally reliable. The first tour was the cyclo around the city. This also included art centre and souvenir shops which, like alot of Vietnam especially the markets there is a lot of pressure to buy something. It was fun I don't remember the guides name but she was kind and knowledgeable. The next day was the highlight of the tour. The Mekong Delta the guide was Vu and she was awesome. Her English was perfect.,her style easy friendly fun with an excellent sense of humour approachable, organised related to everyone in the group even with diversity in cultures. Loved it. Would recommend this tour. Day 3 was CuChi tunnels with Ken, again a well organised, run informative tour, another great day and guide."},{"rating":"5.0","review":"Well organised, informative.friendly."}]}]