[{"name":"A Short Trek of Sapa and Fansipan","reviews":[{"rating":"4.5","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"3.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Impression of Vietnam with Sapa","reviews":[{"rating":"4.0","review":"I can represent the place as \"The Best of Vietnam\". The Golden bridge of Vietnam which is located at Ba Na Hills. The huge bridge placed in giant arms. Truly, the Best place to visit in Vietnam!"},{"rating":"4.0","review":"We had booked first time with Threeland Travel. They were very friendly and gave us all the facilities related to journey. We planned trip for Vietnam and Cambodia and it was awesome!"},{"rating":"4.0","review":"I had booked the tour with Threeland Travel in the back of May-2019. They gave me luxurious facilities with comfort. Thank you!"}]},{"name":"Hanoi - Oasis Bay Classic 5Days/4Nights","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Sapa and Ba Be lake 5 days 4 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.5","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]},{"name":"COMBO: “ Mt. Fansipan – Lan Ha Bay Tour” 5Day","reviews":[{"rating":"5.0","review":"I had an absolutely wonderful photography and motorbike tour with Zonitrip in October this year! You will be extremely lucky to have a guide like Nghia, her professionalism, flexibility, patience and dedication to my needs were beyond my expectations. This was my second tour with Zonitrip and will definitely my prefer tour operator when I plan for my next trip to Sapa and Hoang Su Phi. Highly recommended!!!"},{"rating":"5.0","review":"The cost was not proportionate to the tour. Many others paid a fraction of the price charged by tourradar."},{"rating":"3.5","review":"We had an excellent guide who made sure we did all the trekking we could do and made sure we had very good accommodation and vegetarian food that was amazing. The hosts at the homestay were very warm and accommodating. Awesome experience overall."}]},{"name":"Vietnam Family Holiday Comfort","reviews":[{"rating":"4.5","review":"Excellent Guide.We still were able to do most everything in the itinerary despite rainy weather during much of the trip."},{"rating":"5.0","review":"Great holiday well organised with great people"},{"rating":"4.2","review":"Family holiday concept is great. Very good service and good tours"},{"rating":"4.8","review":"Excellent, attentive guide - Tuan. Good itinerary that was family oriented and got to see a lot of the country."},{"rating":"5.0","review":"This holiday was well paced, some days of early starts and lots of travelinterlaced with slower days and more opportunity to take in the surroundings. We got a good taste of vietnam - past and present - Hoi An was a surprising treat with all the lanterns for New Years' Eve - though a shame we missed out on An Ban beach due to weather. A lovely way to spend Christmas eve with the water puppet show in Ha Noi and Christmas Day on a boat in Halong Bay was very special."},{"rating":"5.0","review":"Tham Ta! Tham was absolutely wonderful, nothing was too much trouble and she really made the trip. We had tears all round when we had to leave. Tham went over and above in her role to support us and she was incredible with the children. My child has a severe allergy to peanuts which made travel in Vietnam very scary for him, but Tham put him at ease and checked everything, ordered ahead, made sure he was safe and that he didn’t feel like the odd one out. Whether it was explaining the sights or the plans for the next few days, helping with lost luggage, teaching us Vietnamese, watching the kids so we could have an hour off, looking after the man flu, making sure everyone was feeling included and happy - Tham was constantly in the job. Not only that but her beautiful manner,naturally lovely personality and fun nature made such a difference to us all."},{"rating":"5.0","review":"Our exceptional tour guide-Tham Ta! Traveling as a family, we were put at ease every step of the way by Tham. She was very accomodating and picked up on things that other's would have missed (such as when kids were tired, hungry, or needed more to do). She was not only amazing with the kids, her knowledge, passion, energy, and genuine kindness, made the trip so enjoyable for all of us. And I am sure that I speak on behalf of the other families when I say these things. She is without a doubt the best tour guide that I have ever come across, and I would imagine an asset to the profession."},{"rating":"4.8","review":"Great mix of culture, history, nature.Tham was a fantastic guide."},{"rating":"5.0","review":"It was a great trip & all went well. Tham Ta was very good and always went the extra mile to help us have a great time, such as finding restaurants etc etc and helping out in every way."},{"rating":"4.8","review":"Great leader, well organised, made the most of a fairly short trip."}]},{"name":"Vietnam at a glance: Hanoi - Ninh Binh - Halong Bay - Mekong Delta - Ho Chi Minh City.","reviews":[{"rating":"5.0","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]}]