[{"name":"10 Days Heritage Vietnam Holiday: Halong Bay - Hue - Hoi An - Cu Chi tunnels.","reviews":[{"rating":"3.5","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Quick Look Vietnam from Ho Chi Minh City to Hanoi - 7 Days","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Vietnam Escape 12 Days","reviews":[{"rating":"4.5","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Hanoi-Athena Elegance Cruise 6 Days/5 Nights","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Authenic Experiences in Hanoi & Sapa with Cooking Class, Market, Ethnic Group People, Trekking,...","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Best of Vietnam 10 Days","reviews":[{"rating":"4.5","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Family Relaxing Package","reviews":[{"rating":"5.0","review":"From the moment I booked the tour I had a contact name and number via WhatsApp. The tour itself was very well organised, each day a local guide was waiting to take me on walks through the villages. The hotel was very comfortable and food was good. Would recommend this tour."},{"rating":"5.0","review":"The trip went very well. Everything was organised so well and we did not have any problems. It was so easy to book with Tour Radar. I was reluctant to book directly with a Vietnamese tour agents since communication might be delayed and also I might be cheated. Tour Radar had a 24 hours contact number which is based in Australia and that was so helpful. I also like how you can communicate with the Tour Radar's Vietnamese tour agent directly from Tour Radar's email. My overall rating is 5/5. Looking forward to booking my next trip with Tour Radar."}]},{"name":"Vietnam Paradise For Honeymoon/ Halong Bay - Phu Quoc Island","reviews":[{"rating":"4.0","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]}]