[{"name":"Mekong Delta explorer on bike","reviews":[{"rating":"5.0","review":"Had a great 3 day bike trip. The guide, Dat, spoke English really well and was so informative, just perfect for an intellectually curious couple. The bikes were good for the terrain and were well cared for. The company were flexible and adjusted their plan to accommodate our desire to cycle longer distances. The reception at the HOMESTAY was genuinely warm and we felt very much welcomed by Mr Tang and his wife. Dinner was a delight and I even got his recipe for the prawns! Absolutely memorable time - thank you"},{"rating":"5.0","review":"So we’ll organized!  Loved our tour guide, Yen!  She accommodated our riding capabilities, was very professional, made wise choices and was super fun!  This is a great way to see the Delta!"},{"rating":"4.5","review":"Bravo Indochina tours's service was very good. Not only the accommodations were the best, we had an excellent time with our tour guide's services (Ms Yen). The guide was superb who made sure that everyone of us were having a great time in Mekong.This cyclong tour that allows you to experience the daily life of locals along Mekong Village"},{"rating":"5.0","review":"This was a fantastic tour .. everything went exactly as planned .. Ms. Yen, my Tour Guide had wonderful local knowledge .. she was great company as well ... every aspect of the tour was great ... accomodations and provided meals were fantastic .. van pick up and boat scheduling was perfect ... there is no way I could have done this on my own, we cycled through many wonderful and interesting areas. Ms. Yen is a fantastic guide who knows the area well, with great local knowledge. She is also very friendly and personable. Thank you Yen for a great tour."}]},{"name":"Inside Vietnam","reviews":[{"rating":"5.0","review":"The tour promised to be what they advertised - (less the whole world closing down due to the corona virus of course!) hotels were great, breakfast buffets , food was delicious, sightseeing and tour guide Doan was amazing ! \nshame it was cut short due by a week, but Doan our tour guide gratefully organised our remainder of the weeks travelling and accommodation in Vietnam which was much appreciated so we managed to get another week of Vietnam in, but not Cambodia unfortunately. Tour radar were brilliant in that I got the pro rata refund for the tour in no time so overall very impressed !"},{"rating":"4.0","review":"I went during the Coronavirus outbreak and I have to say Vietnam was on top of it. Mandatory temperature checks, hand sanitizer everywhere you went, masks. The country was beautiful and the people very friendly. Unfortunately due to the virus outbreak the tour was cancelled halfway through and the government was shutting things off to tourists (such as the Mekong Delta and Halong Bay). I'm sure I would have given it an \"Excellent\" rating if this didn't happen. The week we did get to do was an amazing experience though!"},{"rating":"4.8","review":"Binh was an 5 tour leader, patient & thoughtful and always smiling and positive."},{"rating":"4.5","review":"I thoroughly enjoyed this tour - it gave a wonderful overview of Vietnam - helped considerably by our tour guide, Lan.\nI returned with a greatly enhanced knowledge of the country.    I was young when the Vietnam war took place and am a little ashamed of not knowing enough about it prior to my visit.    The damage to the country must have been heartbreaking at the time but the Vietnamese appear to have put it behind them with a determination to only look to the future and continue to improve their relationship with the Americans.     The people are friendly and welcoming and the food was great - the best noodles and spring rolls I have tasted!"},{"rating":"5.0","review":"A fantastic couple of weeks - Consider the time of year you go on the trip though - August was very hot in parts of the country and not all of the group coped with the heat and humidity."},{"rating":"5.0","review":"Long is a very great guide he made the trip fantastic"},{"rating":"4.3","review":"Thoroughly enjoyable trip"},{"rating":"4.7","review":"Bee are tour guide was excellent....very happy with his attitude and pleased he promoted local cafes and restaurants to us where we ate with local people ...fantastic value entertaining good all round experience.\nThis man was non intrusive . Nice sense of humour. "},{"rating":"4.7","review":"Its the first time Ive used Explore and was very impressed with ease of booking and the followup leading to departure. the Vietnamese tuor operator was brilliant. The individuals in Vietnam who made our holiday work were spot on. Ky our guide was marvellous and Ive been using local guides over the last 20 years ,I have to say he's probably the best guide who has worked for me"},{"rating":"4.3","review":"Thank you\nanother wondrful trip"},{"rating":"4.0","review":"This is the first time I have been on a tour. I found the time at each venue/site quite restrictive, not really allowing sufficient time to explore and digest but I appreciate there is a schedule to follow and this, I suppose, is to be expected."},{"rating":"4.7","review":"Thoroughly enjoyed the trip. Would have liked 2 nights on the Mekong. We were anxious about this before hand but ended up in a sparate private cubiclle, which although very basic was an amazing experience. Another Explore success!!"},{"rating":"4.7","review":"I had an amazing time. The group of people on the trip were lovely and I really enjoyed spending time in the different places we went to in Vietnam. Tien really made this a wonderful holiday - such amazing memories!"},{"rating":"4.0","review":"Good initiative of our leader concerning the room sharing system (rotation system which meant we shared rooms with different room mates at each hotel)"},{"rating":"5.0","review":"We really enjoyed our first Explore Trip, it was a nice small group and Mr Long made us feel very welcome. We we would book again!"},{"rating":"4.3","review":"An excellent trip, well organised with plenty of helpful information"}]},{"name":"VNA008 - 15days Vietnam Beach Holiday","reviews":[{"rating":"3.0","review":"Very disappointed in the train trip between Danang and Nha Trang.\nVery uncomfortable and too long. Would never go on the train again.\nToilets discussing, sleepers smelly."}]},{"name":"Trails of Vietnam","reviews":[{"rating":"5.0","review":"Loads of different activities, experiences, sights and sounds are packed into this holiday, which really shows you the whole of Vietnam.What was the most inspirational moment of your trip?Waking up on the boat in the middle of Halong Bay. Kayaking round islands and seeing the monkeys leap from tree to tree. Learning to cook by imitation and gestures in the Mekong Delta. Walking through emerald green paddy fields, up steep hills. Sleeping on a bamboo floor in a traditional Thai longhouse. Handling a python in the snake farm. Being entertained by local dancers, and being dragged up to dance the finale. Cycling through villages on windy canal paths, with little children rushing out to shout &quot;hello!&quot;.Â What did you think of your group leader?A wonderful story teller, full of interesting anecdotes and insights into Vietnam history and culture. He even got out his guitar on occasion and entertained us with some of his songs!Do you have any advice for potential travellers?Be prepared for lots of travel, by coach, rail, road, boat, kayak, and air. Bring earplugs and a jumper, as Vietnam can dip below 20 degrees in the evenings. Be ready for all sorts of extras not necessarily on the itinerary. Don't worry about the Cu Chi tunnels: the bit you walk through is only right at the end and easily omitted if you're claustrophobic - the rest of it is fascinating.Â Is there anything else you would like to add?Just remember it's a communist country and you won't necessarily get the same picture as at home in the more political, government-run places of interest that you visit, though they are very interesting. Be ready to supplement your visit with extra research online!"},{"rating":"5.0","review":"Truly amazing place and well thought out trip, which really does make it feel like you have seen so much of the country. Some truly stunning sights (Halong bay is the second wonder of the world). Hanoi is a complete culture shock and impressive to see how many people can fit onto one moped. Food is very good and for very little you can get some very impressive street food. Only slight complaint not as physical as the itinerary makes it sound.What was the most inspirational moment of your trip?Halong bay was my favourite part of the trip, kayaking from the boat to a lagoon then watching a monkey sitting the rocks eating. Hoi an was a close second with cycling at six in the morning to watch the sunrise over the spice fields (helped by the fact it was snowing in England at the time).What did you think of your group leader?Pheong was a brilliant fella, informative with a deep love of his country, always cheerful and amazingly patient, one morning even giving a meditation lesson for those who were interested and not only all that also a fantastic pool player.Do you have any advice for potential travellers?Be warned Hanoi and northern Vietnam can be colder than expected, although my trip was in January so maybe I should have been better prepared. Don't overpack you can get your laundry done at lots of different places on the trip. Also shopping is very good out there I bought a north face jacket for 45 dollars which is'nt too bad.Is there anything else you would like to add?Don't bother changing your money into Dong, stick with dollars it's easier to keep track of what your spending and they are accepted everywhere."},{"rating":"5.0","review":"This tour is not for the faint at heart. There is a lot of travelling and a lot of action so be prepared. Fascinating country with wonderful people, not least of all Giang the tour leader. Fasten your seatbelts!What was the most inspirational moment of your trip?The people were so friendly and relaxed.What did you think of your group leader?Great. Giang,s calm and ever willingness to help make him a strong candidate for leader of the year.Do you have any advice for potential travellers?Pack light as it is hot in the south. the north can be cool in the winter but the payback is the dry season. Saigon is the best local beer!"},{"rating":"4.0","review":"An excellent and varied trip with a great group of people who gelled together instantly.What was the most inspirational moment of your trip?The overnight stays in the stilthouses were great fun,and a great way for us all to get to know eachother.Also the cycling in the Mekong Delta was pretty special.What did you think of your group leader?Mao was the best group leader I've had when doing many of these trips.He started as our leader and left as our friend! He made a great trip brilliant,a true asset to Exodus which I hope will be recognised.Do you have any advice for potential travellers?Be prepared to be flexible with the itinary,as the weather can be very unpredictable,unfortunatly.Is there anything else you would like to add?Try hard to &quot;go with the flow&quot;! Vietnam is like nothing you've experienced before!"},{"rating":"4.0","review":"A really enjoyable trip. Fascinating cultural experiences in the tribes, spectacular and relaxing Halong Bay, the madness of Hanoi, and the sights of the rest of Vietnam. A couple of days of trekking, but more walking after that. Still tiring due to the heat/humidity, early starts and some long bus rides. Well worth the experience.What was the most inspirational moment of your trip?The hiking through the hills out from Mai Chau was great even though it was incredibly hot. Very interesting visiting the tribes and hearing their stories.\nAlso the boat trip in Halong Bay - the seafood dinner, the kayaking, the swimming, the relaxing on the ship's deck, the scenery. Awesome.\nCu Chi tunnels. Really interesting while also a little freaky experience.What did you think of your group leader?Linh was great. Organised us really well, and looked after us well with pointing out good restaurants etc when going to be on our own, and taking us to really good restaurants when with him. We ate REALLY well!\n\nWas really informative, explained a lot about how the hill tribe people live and their past etc. Ended up telling the same things a couple of times, and sometimes would go off on a tangent, turning a piece on the pagoda etc we were at into a long winded story of his childhood. But mostly told good stuff.\n\nIs a little quirky, which made it entertaining with some of his songs. Has a lot of character, which has left us with a great memories to retell amongst group members.\n\nOverall, Linh was really great value.Do you have any advice for potential travellers?Take a light weight jacket with you in case it rains at any moment (even though it'll likely only be brief).\nSay so at the beginning if you don't like fish (or anything for that matter), you'll get well catered for with other food for you. A few people on our trip didn't say so until halfway through, after a number of entrees and meals with fish, so didn't eat as much those times.Is there anything else you would like to add?Only thing might have liked different, was a little more time in Hoi An. We essentially only had less than a couple of hours after dark the day we arrived to do any shopping.  This was the only time we had to order stuff to be tailor made, and it was quite a rush to do in that time, and after dark so it was tricky to see. We had plenty of free time the next afternoon, but as we were leaving too early the next day we couldn't order anything then as there wasn't enough time to get it made.\n\nWhen that is what Hoi An is so well known for, we were very rushed to achieve it, and definitely would have done more with the chance. \n\nThat would be only real gripe about the trip.\n\nOh and the overnight train wasn't exactly comfortable!\n\nI come from a country/culture where we don't tip, so having the group tipping kitty and Linh taking care of it was great, and quite a relief."},{"rating":"3.0","review":"Vietnam is a fascinating place, and this trip really covers it, from north to south, taking in all the sights and all the places you would expect.  All very slick, very smooth, good locations, and a fascinating tour guide. The only downside – this was not the trip book, in the sense that the trip dossier detailed much more cycling and trekking than we actually did, so disappointing from that perspective, and either the brochure or the trip needs to changeWhat did you think of your group leader?Brilliant, totally brilliant!Do you have any advice for potential travellers?You don’t need malaria tablets – the trip dossier is wrong!"},{"rating":"3.0","review":"Vietnam is a fascinating place, and this trip really covers it, from north to south, taking in all the sights and all the places you would expect.  All very slick, very smooth, good locations, and a fascinating tour guide. The only downside "},{"rating":"4.0","review":"An intensive introduction to a wonderful country. Hikes and bikes took us off the beaten tracks. Very well organised and we were well looked after. Thoroughly recommended.What was the most inspirational moment of your trip?Cycling through back paths on the Mekong delta, where kids rushed out to see us, (as they don't see tourists there), showed us the contrasts of the country, but also how naturally friendly the people are, even those not trying to make a living out of tourists.What did you think of your group leader?Never without a smile, efficient and solicitous, he gave us confidence, and his knowledge of the whole country and its history made the necesary long distances interesting.Do you have any advice for potential travellers?Cold in the North, very hot in the South. Tell the guide if you get a dicky tummy, ancient ginger will fix it better than our drugs.Is there anything else you would like to add?Vietnam is a strange country when you first arrive, especially if you start in Hanoi. Relax and you will quickly find your feet.  Walking was not arduous, cycling stepped up the gears later, but the bus was always around if it got too strenuous. Most of us were mere leisure cyclists, and coped admirably."},{"rating":"4.0","review":"An intensive introduction to a wonderful country. Hikes and bikes took us off the beaten tracks. Very well organised and we were well looked after. Thoroughly recommended.What was the most inspirational moment of your trip?Cycling through back paths on the Mekong delta, where kids rushed out to see us, (as they don't see tourists there), showed us the contrasts of the country, but also how naturally friendly the people are, even those not trying to make a living out of tourists.What did you think of your group leader?Never without a smile, efficient and solicitous, he gave us confidence, and his knowledge of the whole country and its history made the necesary long distances interesting.Do you have any advice for potential travellers?Cold in the North, very hot in the South. Tell the guide if you get a dicky tummy, ancient ginger will fix it better than our drugs.Is there anything else you would like to add?Vietnam is a strange country when you first arrive, especially if you start in Hanoi. Relax and you will quickly find your feet.Â  Walking was not arduous, cycling stepped up the gears later, but the bus was always around if it got too strenuous. Most of us were mere leisure cyclists, and coped admirably."},{"rating":"4.0","review":"An excellent trip, a great way to see the highlights of the country.  A pleasing mix of activity and sight seeing.What was the most inspirational moment of your trip?Halong Bay has to be one of the highlights; fabulous views and a fantastic lunch on board on the first day.  However. Hue was also a beautiful place with wonderful shopping!What did you think of your group leader?He was really well organised, full of interesting information although sometimes a little too much for my taste.   It was sometimes difficult to understand the plan for the day and therefore what we needed to have in our day packs.Do you have any advice for potential travellers?Pack your clothes in bags in your main bag, helps to keep thigs organised as you do not spend many nights in the same place!  Have your insect repellant to hand at the Cu Chi Tunnels - we didn't!Is there anything else you would like to add?Some of the walks and cycling were less than the itinary sugested - this was an issue to some on the trip."},{"rating":"4.0","review":"An excellent trip, a great way to see the highlights of the country.  A pleasing mix of activity and sight seeing.   What was the most inspirational moment of your trip?  Halong Bay&#xC2;&#xA0;has to be one of the highlights; fabulous&#xC2;&#xA0;views&#xC2;&#xA0;and a fantastic lunch on board on the first day.&#xC2;&#xA0; However. Hue was also a beautiful place with wonderful shopping!   What did you think of your group leader?  He was really well organised, full of interesting information&#xC2;&#xA0;although sometimes a little too much for my taste.&#xC2;&#xA0;&#xC2;&#xA0;&#xC2;&#xA0;It was sometimes difficult to understand the plan for the day and therefore what we needed to have in our day packs.   Do you have any advice for potential travellers?  Pack your clothes&#xC2;&#xA0;in bags in your main bag,&#xC2;&#xA0;helps to keep thigs organised as&#xC2;&#xA0;you do not spend many nights in the same place!&#xC2;&#xA0; Have your insect repellant to hand at the Cu Chi Tunnels - we didn't!   Is there anything else you would like to add?  Some of the walks and cycling were less than the itinary sugested - this was an issue to some on the trip."},{"rating":"4.0","review":"A good way of getting a taste of a lot of the country.  Note: this means a lot of travel time.   What was the most inspirational moment of your trip?  The friendliness of the locals.   What did you think of your group leader?  Excellent   Do you have any advice for potential travellers?  The moderate/challenging rating applies more to the amount of travelling and number of excursions undertaken than the strenuousness of the activities."},{"rating":"4.0","review":"A great way to see Vietnam, with a little activity thrown in.  Vietnam had it all with history, culture, friendly people and amazing food too!   What was the most inspirational moment of your trip?  Kayaking in Halong bay was amazing - tranquil waters with incredible island scenery and the sun setting, and seeign the moneys on the cliff above   What did you think of your group leader?  Thuy was great.  He was attentive to the needs of the individual group members sorting out little issues when they arose.  He was passionate about the history of his country and this showed.  He made sure we had fun on new year's eve and it was agreat night out, and the group stuck together til 2am.  He also got us singing karaoke on our halong bay cruise.   Do you have any advice for potential travellers?  leave space in your suitcase to bring stuff home.  I had a suit had in hoi-an which is lovely and i'm pleased with - for £200, also lots of opportunity to buy paintings and embroidery, and with all the amazing foods we tried most people wanted to take home something, even if it was coconut toffee or banana chips or fish sauce.The internal flights officially limit to 20kg but in reality don't really get too stressed if you are at 23 or 24kg   Is there anything else you would like to add?  The trip notes sound like there will be more walking and cycling than there actually was.  There was nothing that was wrong on the notes but one needs to understand there is a lot of travelling on the bus on this trip which then limits the amount of time doing activities like the walking and cycling.Of all the things we did, I was least inspired by the stay in mai chau, as we all had to share one room sleeping on mattresses on the floor, and there wasn't much to do (we paid some local teenagers to put on a show and drank lots of rice wine which made for a good night in the end).  I think a tour of the same length but without mai chau might be better as then could spend more time in halong bay or hue, for example."},{"rating":"4.0","review":"A great way to see Vietnam, with a little activity thrown in.  Vietnam had it all with history, culture, friendly people and amazing food too!   What was the most inspirational moment of your trip?  Kayaking in Halong bay was amazing - tranquil waters with incredible island scenery and the sun setting, and seeign the moneys on the cliff above   What did you think of your group leader?  Thuy was great.&#xC2;&#xA0; He was attentive to the needs of the individual group members sorting out little issues when they arose.&#xC2;&#xA0; He was passionate about the history of his country and this showed.&#xC2;&#xA0; He made sure we had fun on new year's eve and it was agreat night out, and the group stuck together til 2am.&#xC2;&#xA0; He also got us singing karaoke on our halong bay cruise.   Do you have any advice for potential travellers?  leave space in your suitcase to bring stuff home.&#xC2;&#xA0; I had a suit had in hoi-an which is lovely and i'm pleased with - for &#xC2;&#xA3;200, also lots of opportunity to buy paintings and embroidery, and with all the amazing foods we tried most people wanted to take home something, even if it was coconut toffee or banana chips or fish sauce.The internal flights officially limit to 20kg but in reality don't really get too stressed if you are at 23 or 24kg   Is there anything else you would like to add?  The trip notes sound like there will be more walking and cycling than there actually was.&#xC2;&#xA0; There was nothing that was wrong on the notes but one needs to understand there is a lot of travelling on the bus on this trip which then limits the amount of time doing activities like the walking and cycling.Of all the things we did, I was least inspired by the stay in mai chau, as we all had to share one room sleeping on mattresses on the floor, and there wasn't much to do (we paid some local teenagers to put on a show and drank lots of rice wine which made for a good night in the end).&#xC2;&#xA0; I think a tour of the same length but without mai chau might be better as then could spend more time in halong bay or hue, for example."},{"rating":"3.0","review":"A rapidly modernising country with a wealth of culture, history and architecture. Wonderful food, friendly people and a scenic country, but sadly not much wildlife - it's all been eaten or caged.   What was the most inspirational moment of your trip?  The boat trip and kayaking in Malong Bay, a World Heritage Site.   What did you think of your group leader?  Our group leader was organised, supportive and wore his heart on his sleeve. He was conscripted by the communists to fight in the army and was made to fight in the jungle, where he saw dreadful atrocities and lost some dear friends. Thankfully, he's now happily married with two daughters. He demonstrated that despite the dreadful times he'd suffered, the human spirit shines though.   Do you have any advice for potential travellers?  Make sure you bring a spare bag, or some room in your main bag. I'm not a shopper, but the quality and price of made-to-measure clothes in Hoi An is something one can't pass up. I got two beautiful suits made for work, and some of the ladies on the trip got some great leather boots made for them.   Is there anything else you would like to add?  Don't be scared about eating in corner street restaurants, or even on the street. If the Vietnamese are eating there, you can bet it's good (just stay clear of the dog, rats and snake ;-)). The cuisine is excellent, fresh ingredients and prepared safely - none of our group suffered any upset stomachs. You should definitely try the Pho (noodle soup). The seafood is also wonderful. Not so sure about the blended wine though, better sticking to beer!"},{"rating":"3.0","review":"A rapidly modernising country with a wealth of culture, history and architecture. Wonderful food, friendly people and a scenic country, but sadly not much wildlife - it's all been eaten or caged.   What was the most inspirational moment of your trip?  The boat trip and kayaking in Malong Bay, a World Heritage Site.   What did you think of your group leader?  Our group leader was organised, supportive and wore his heart on his sleeve. He was conscripted by the communists to fight in the army and was made to fight in the jungle, where he saw dreadful atrocities and lost some dear friends. Thankfully, he's now happily married with two daughters. He demonstrated that despite the dreadful times he'd suffered, the human spirit shines though.   Do you have any advice for potential travellers?  Make sure you bring a spare bag, or some room in your main bag. I'm not a shopper, but the quality and price of made-to-measure clothes in Hoi An is something one can't pass up. I got two beautiful suits made for work, and some of the ladies on the trip got some great leather boots made for them.   Is there anything else you would like to add?  Don't be scared about eating in corner street restaurants, or even on the street. If the Vietnamese are eating there, you can bet it's good (just stay clear of the dog, rats and snake ;-)).&#xC2;&#xA0;The cuisine is excellent, fresh ingredients and prepared safely - none of our group suffered any&#xC2;&#xA0;upset stomachs. You should definitely try the Pho (noodle soup). The seafood is also wonderful. Not so sure about the blended wine though, better sticking to beer!"},{"rating":"4.0","review":"Well organised. Our guide was fantastic through out. The trip never flagged even though we had some long bus trips. The diversity of scenery and weather made every day interesting. Would go back.   What was the most inspirational moment of your trip?  Halong Bay was a place apart. Would happily have spent another day or so there. Loved the faded granduer oh Hoi An and ofcourse it is a shoppers paradise. Also thought Hanoi and HCM City were buzzing.   What did you think of your group leader?  Best guide I have had in 30 odd years of travelling. Never met a guy so hell bent on making sure every one was happy. As I am over 60, the trek up the mountain(hill to younger mortals)was hard and exacerbated by the heat and humidity but I did it and that night as I happily lay on my mattress in the long house, Phong came over and gave me a resuscitating back massage! How is that for looking after your brood ?   Do you have any advice for potential travellers?  Drink more water than you think has satisfied you and don't overpack your suit case when you leave London other wise you will be ditching stuff to accomodate what you cannot resist buying in Vietnam.   Is there anything else you would like to add?  I hope every one who undertakes this trip enjoys it as much as my daughter and I did."},{"rating":"5.0","review":"Well what can I say????Brilliant - not as hard work as expected, but think the rating is due to weather Hot and Humid and teh amount of travel that you do.   What was the most inspirational moment of your trip?  Not sure if it was Halong bay that certainly had the WoW factor, cycling through the Paddy fields, Climbing the muddy slope in the rain (warm mind), the Mekong Delta or the Tunnels. It was one mind boggleing adventure after another. never a dull moment, but definatley planes, trains and automobiles, Oh with a few bikes and boats thrown in for good measure. Oh yeah and the highjack of a local boat to take us across the river as we were on the wrong side, classic...Spontinaity at it's highest   What did you think of your group leader?  Bonkers but great, especially as at one point it must have been like hearding cats. very good local knowledge. would stop and show you anything, although that did mean we tried a few wierd and wonderful things including snails and fish eyeballs; Beer corner with the loacls, sugar cane drinks and much more.   Do you have any advice for potential travellers?  Be prepared for lots of travel and sleeping on buses - grab the kip while you can, as you may not actually get it at night especially if the rice wine comes out.   Is there anything else you would like to add?  Fab trip - if you look in the loney planet as to what you should see whilst in Vietnam be preparded to see most of it... and moreGreat - helps when you get a good group of like minded people. accomodation ranges from beautiful with pools to basic and communal but clean and nice. Have an open mind about the toilets, but the guide does do a good job in finding western style or local but clean where ever possible.Food was fabuolous go with the guide recomendations we did and were not disappointed at all"},{"rating":"5.0","review":"An interesting and actvie tour of vietnam. The guide was informative and funny, and the vietnamese people warm and friendly. A great country, and a great way to see it!   What was the most inspirational moment of your trip?  There were many inspirational moments, from visiting Ho Chi Min in his mauselium, to drinking Granny's \"special\" rice wine. From a visit to a buddist orphanage to scrambling along the cu chi tunnels to cycling in the Mekong delta. Lots of great memories!   What did you think of your group leader?  A highly amusing and knowledgable group leader, who kept us all in check!   Do you have any advice for potential travellers?  Expect to come back a few pounds heavier, as vietnamese food is fresh, tasty, cheap and plentiful!"},{"rating":"5.0","review":"An interesting and actvie tour of vietnam. The guide was informative and funny, and the vietnamese people warm and friendly. A great country, and a great way to see it!   What was the most inspirational moment of your trip?  There were many inspirational moments, from visiting Ho Chi Min in his mauselium, to drinking Granny's &amp;quot;special&amp;quot; rice wine. From a visit to a buddist orphanage to scrambling along the cu chi tunnels to cycling in the Mekong delta. Lots of great memories!   What did you think of your group leader?  A highly amusing and knowledgable group leader, who kept us all in check!   Do you have any advice for potential travellers?  Expect to come back a few pounds heavier, as vietnamese food is fresh, tasty, cheap and plentiful!&amp;nbsp;   Is there anything else you would like to add?  Expect to get wet, as the rain can get heavy, but also to have the sun cream ready for when the suns out. And it can be very, very humid, so keep drinking water, local beer or rice wine!"},{"rating":"3.0","review":"Loved Vietnam, beautiful food, stunning scenery, fascinating history. The trip was hectic, perhaps too hectic at times and does not allow enough time in each place to really soak in the local atmosphere or to explore on your own. Felt like we were on a strict schedule which could not be altered – too 'organised' and too much 'tour guide chat' for my liking.   What was the most inspirational moment of your trip?  Despite appalling weather and the cold, Halong Bay was spectacular and the boat we were on was excellent as was the food provided. Trekking in the hills north of Hanoi was tough but brilliant – the flora was amazing and witnessing the incredible hard work needed to grow rice was quite humbling – I'll never complain at the price in the supermarket ever again!The mopeds. Sheer entertainment, you never knew what you were going to see next transported on one the thousands on the road – could be dozens of eggs, chickens or even someone with his leg in plaster and crutches! The food everywhere was terrific and I am definitely converted to this style of cooking – bring on the fish sauce! Cycling was fun but quite intensive in the Mekong Delta, especially if you're not so young or fit!    What did you think of your group leader?  Our guide was full of information and history which was good but it was a case of information overload at times. Added to this, being a local (which is good) however, his English was not always understandable which did not help. His instructions about the next day's schedule and arrangements was often lost in translation leaving some members of the group confused as to what was needed or happening. This all sounds a bit negative but he was a very nice person who was trying to please and show off his country. I feel the culture difference e.g. his and our expectations, was a bit of a barrier. "},{"rating":"3.0","review":"Loved Vietnam, beautiful food, stunning scenery, fascinating history. The trip was hectic, perhaps too hectic at times and does not allow enough time in each place to really soak in the local atmosphere or to explore on your own. Felt like we were on a strict schedule which could not be altered "},{"rating":"4.0","review":"A very nice tour that sometimes might seem too much for certain people. There is a lot crammed in so an extra two days would have been perfect. A few things here and there could be improved on but overall it was a fantastic holiday.   What was the most inspirational moment of your trip?  It would have to be the drive through the mountains on our way to Danang/Hue/Hoi An as well as Trekking in Hoa Binh. There are many others but those two stand out for me personally. I also loved cycling in Hoi An and then ending the day on the beach.. couldn't have asked for anything better.   What did you think of your group leader?  He could improve his organisation skills a bit more but he is a very nice guy and we had a great time with him, he was sad when we left and so were we. Shared a few beers and laughs, very down to earth.   Do you have any advice for potential travellers?  This is not an easy tour, don't be selfish and think about it before going and slowing the whole group down. We had that happen with us and it makes everyone feel frustrated especially with cycling when it is so so so hot out there. You will be up as early as 6am every day so it is not a relaxing holiday, it's on the go every day.   Is there anything else you would like to add?  I would definitely ask Exodus to review this and maybe add 2 more days. I'd also recommend an easy last day because the cycling in Mekong Delta was painful and everyone was tired by the last evening. Maybe a beach day? That would be the perfect ending to a brilliant tour."},{"rating":"4.0","review":"Excelllent holiday, well run tour with lots of different experiances. Quite a lot of travelling but worth it to see the wonderful sights.   What was the most inspirational moment of your trip?  I can't narrow it down to one so ...Halong Bay is magical, and cycling in the Mekong delta in monsoon rain was fun and  the hospitality of the homestay's was wonderful.   What did you think of your group leader?  Knowledgable and keen to meet the needs of all the group.   Do you have any advice for potential travellers?  The travel notes really cover all advice needed, medical advice supported not taking anti-malerial tablets and I was fine just used plenty of mosquito repellent.   Is there anything else you would like to add?  The holiday was B/C grade however it did not meet my previous experiances of a challenging rating. the weather rather than the acitvities may have made it nearer a C , but I believe the grading needs reviewing. "},{"rating":"5.0","review":"Action packed introduction to an amazing country. A really full programme, loads of variety,stunning scenery,fabulous food, tranquil beauty and mad city life. Worth it just  to learn how to cross over a Saigon road ! Will go again !    What was the most inspirational moment of your trip?  Well mad as it sounds learning how to trust other road users to avoid you when you are crossing the road opened up an almost buddhist sense of the interelationship of everybody to each other and the need to trust other people.   What did you think of your group leader?  Group leader was great-hap[py to organise and be flexible as well-history is taken very seriously here though-be warned the talks are intended to be listened to!   Do you have any advice for potential travellers?    Anti-midge cream!  Dont be afraid of getting wet-its like having an outdoor shower!    Is there anything else you would like to add?  Would be great to take longer-could easily be a 3 week tour."},{"rating":"4.0","review":"Excelllent holiday, well run tour with lots of different experiances. Quite a lot of travelling but worth it to see the wonderful sights.   What was the most inspirational moment of your trip?  I&#xC2;&#xA0;can't narrow it down to one so ...Halong Bay is magical, and cycling in the Mekong delta in monsoon rain was fun and&#xC2;&#xA0; the hospitality of the homestay's was wonderful.   What did you think of your group leader?  Knowledgable and keen to meet the needs of all the group.   Do you have any advice for potential travellers?  The travel notes really cover all advice needed, medical advice supported not taking anti-malerial tablets and I was fine just used plenty of mosquito repellent.   Is there anything else you would like to add?  The holiday was B/C grade however it did not meet my&#xC2;&#xA0;previous experiances of a challenging rating. the weather rather than the acitvities may have made it nearer a C ,&#xC2;&#xA0;but I believe&#xC2;&#xA0;the grading needs reviewing.&#xC2;&#xA0;"},{"rating":"5.0","review":"Action packed introduction to an amazing country. A really full programme, loads of variety,stunning scenery,fabulous food, tranquil beauty and mad city life. Worth it just  to learn how to cross over a Saigon road ! Will go again !    What was the most inspirational moment of your trip?  Well mad as it sounds learning how to trust other road users to avoid you when you are crossing the road opened up an almost buddhist sense of the interelationship of everybody to each other and the need to trust other people.   What did you think of your group leader?  Group leader was great-hap[py to organise and be flexible as well-history is taken very seriously here though-be warned the talks are intended to be listened to!   Do you have any advice for potential travellers?  &#xC2;&#xA0; Anti-midge cream!&#xC2;&#xA0; Dont be afraid of getting wet-its like having an outdoor shower!&#xC2;&#xA0;   Is there anything else you would like to add?  Would be great to take longer-could easily be a 3 week tour."},{"rating":"4.0","review":"Had a wonderful holiday.  The tour group was a really great bunch of people, the tour guide was great and Vietnam was a fantastic place to be.   What was the most inspirational moment of your trip?  Cycling around the Mekong delta, watching the scooters fly by in Ho Chi Minh, special nights in homestays, chilling out in Hoi Ann.   What did you think of your group leader?  Excellent, he really made it a special trip.   Do you have any advice for potential travellers?  Enjoy!   Is there anything else you would like to add?  It sometimes felt like we were trying to cram in a lot, so could have been more time to follow our own pace.  But, on the whole, I loved it."},{"rating":"4.0","review":"Had a wonderful holiday.  The tour group was a really great bunch of people, the tour guide was great and Vietnam was a fantastic place to be.   What was the most inspirational moment of your trip?  Cycling around the Mekong delta, watching the scooters fly by in Ho Chi Minh, special nights in homestays, chilling out in Hoi Ann.   What did you think of your group leader?  Excellent, he really made it a special trip.   Do you have any advice for potential travellers?  Enjoy!   Is there anything else you would like to add?  It sometimes felt like we were trying to cram in a lot, so could have been more time to follow our own pace.&#xC2;&#xA0; But, on the whole, I loved it."},{"rating":"4.0","review":"A very enjoyable and varied trip - you get to see real vietnam, especially the people and culture. The extension to Angkor Wat is a must take.   What was the most inspirational moment of your trip?  The 2 days cycling in the mekong were very enjoyable and involved cycling on all sorts of roads / paths and surfaces. The day cycling in Hue was totally different, making progress through the manic moped riders is somewhat interesting (and even a bit scary !)Angkor wat and the surrounding temples are stunning, its as good as all the photos  you will have seen - and you can even take your own.   What did you think of your group leader?  Our leader was good humoured and mixed with the group well. He was a little bit to laid back and was very good at losing group members !His knowledge of the local flora and fauna was a bit lacking, and no attempt was made to find out answers to questions.On a positive all the bits of the holiday were well organised, one example being when we wished to hire bikes in Hoi An, a phone call was made and hey presto a bunch of school children arrived with bikes !The leader in Angkor Wat was very knowledgeable.   Do you have any advice for potential travellers?  If you wish to have clothes made in Hoi An then do your homework upfront and take photos etc.On the Angkor extension the last day spent in Phnom Penh will be very hot and is not the ideal time to visit the killing fields, you may wish to just do your own thing. Visiting the Royal Palace was the only place we were required to cover up shoulders and knees.We had a 10 hour lay over in Kuala Lumpur on  the way home - time enough to go into KL, but DO NOT do the city tour bus, the traffic means you willl just spend 3 or 4 hours in a traffic jam - use the metro.   Is there anything else you would like to add?  Halong bay does not have crystal clear waters its a bit dirty and not really suitable for swimming, but the kayaking can be very enjoyable. The food on the boat was of a very high standard.Food at the two homestays was of a high standard, the accomadation was also of agood standard. Both homestays have good facilities (showers and toilets).Be prepared for longer than expected journeys, 140 km can easily take 3-4 hours due to traffic and road conditions. This resulted in some activities specified in the trip notes not being possible due to time constraints.Food and beer are very cheap, a beer is about 80p. Don't get caught out by the price of wine on the halong bay - its about 5000000 Dong (~£20) for a bottle that is £4 from Tesco !Overall a very good trip."},{"rating":"4.0","review":"A very enjoyable and varied trip - you get to see real vietnam, especially the people and culture. The extension to Angkor Wat is a must take.   What was the most inspirational moment of your trip?  The 2 days cycling in the mekong were very enjoyable and involved cycling on all sorts of roads / paths and surfaces. The day cycling in Hue was totally different, making progress through the manic moped riders is somewhat interesting (and even a bit scary !)Angkor wat and the surrounding temples are stunning, its as good as all the photos&#xC2;&#xA0; you will have seen - and you can even take your own.   What did you think of your group leader?  Our leader was good humoured and mixed with the group well. He was a little bit to laid back and was very good at losing group members !His knowledge of the local flora and fauna was a bit lacking, and no attempt was made to find out answers to questions.On a positive all the bits of the holiday were well organised, one example being when we wished to hire bikes in Hoi An, a phone call was made and hey presto a bunch of school children arrived with bikes !The leader in Angkor Wat was very knowledgeable.   Do you have any advice for potential travellers?  If you wish to have clothes made in Hoi An then do your homework upfront and take photos etc.On the Angkor extension the last day spent in Phnom Penh will be very hot and is not the ideal time to visit the killing fields, you may wish to just do your own thing. Visiting the Royal Palace was the only place we were required to cover up shoulders and knees.We had a 10 hour lay over in Kuala Lumpur on&#xC2;&#xA0; the way home - time enough to go into KL, but DO NOT do the city tour bus, the traffic means you willl just spend 3 or 4 hours in a traffic jam - use the metro.   Is there anything else you would like to add?  Halong bay does not have crystal clear waters its a bit dirty and not really suitable for swimming, but the kayaking can be very enjoyable. The food on the boat was of a very high standard.Food at the two homestays was of a high standard, the accomadation was also of agood standard. Both homestays have good facilities (showers and toilets).Be prepared for longer than expected journeys, 140 km can easily take 3-4 hours due to traffic and road conditions. This resulted in some activities specified in the trip notes not being possible due to time constraints.Food and beer are very cheap, a beer is about 80p. Don't get caught out by the price of wine on the halong bay - its about 5000000 Dong (~&#xC2;&#xA3;20) for a bottle that is &#xC2;&#xA3;4 from Tesco !Overall a very good trip."},{"rating":"5.0","review":"Brilliant trip despite the weather (lots of rain).  Well organised trekking, kayaking and cycling, a bit of history, opportunities to shop and eat exotic foods.  Vietnam is beautiful.   What did you think of your group leader?  Chi was excellent.    Do you have any advice for potential travellers?  Have a look through your wardrobe and collect any pictures of clothes you may want tailor-made.  Take three bags, your main bag, a day bag and an overnight bag for the homestays and the train.  A sleeping bag may be useful for the homestays and the train.  The bikes are good, but either padded shorts or a gel saddle cover may save a few aches."},{"rating":"5.0","review":"Brilliant trip despite the weather (lots of rain).  Well organised trekking, kayaking and cycling, a bit of history, opportunities to shop and eat exotic foods.  Vietnam is beautiful.   What did you think of your group leader?  Chi was excellent.&#xC2;&#xA0;   Do you have any advice for potential travellers?  Have a look through your wardrobe and collect any pictures of clothes you may want tailor-made.&#xC2;&#xA0; Take three bags, your main bag, a day bag and an overnight bag for the homestays and the train.&#xC2;&#xA0; A sleeping bag may be useful for the homestays and the train.&#xC2;&#xA0; The bikes are good, but either padded shorts or a gel saddle cover may save a few aches."},{"rating":"5.0","review":"An excellently organised trip by a terrific tour guide. Pace was right, it was varied with culture, history, scenery and political interest.   What was the most inspirational moment of your trip?  Halong Bay was magic, Hanoi exciting, Hue great, Cu Chi tunnels and all to do with the recent history of Vietnam really interesting.The walking, kayaking and cycling welcome excercise after all the good food.   What did you think of your group leader?  The group leader was briliant. He was friendly, reliable, well organised and very well informed   Do you have any advice for potential travellers?  Don't cycle n Hanoi. Don't take too much luggage, save room for the purchases. Take a cape for the rain.   Is there anything else you would like to add?  The hotels were undersold, they were very good. I did the Cambodia extension. I think that 1 full day in Pnomh Pen is enough, catch an early flight in and a late one out. Also, maybe do that before Siem Reap (if flight scedules allow)"},{"rating":"4.0","review":"An excellent  trip, exceeding  our expectations in many ways. The quality of the hotels and homestays were better than expected and perhaps Exodus undersold this in the Trip notes.   Our only concern was the cycling which for the most part was not on quiet backroads. These do not exist in Vietnam.Finally, the four day extension to Angkor Wat can only be described as fantastic. One could easily spend a week or more taking in the magnificent temples.       What was the most inspirational moment of your trip?  Walking in the hill tribe villages in Northern Vietnam  was  the highlight  of the Vietnam segment. People leading simple lives the way they have for hundreds of years, apart from now having the almost universal motorcycle. The scenery is stunning with paddy fields as far as the eye can see set against a backdrop of the northern hills.   What did you think of your group leader?  Our group leader, Hai, was knowledgeable and enthusiastic  about  his country.  From the moment  he  met  us off the flight in Hanoi until he said goodbye in Saigon there was never a dull moment. Only once did he lose his cool as did most of the group, when a very large millipede decided to visit us at our homestay. A truly hilarious episode.   Do you have any advice for potential travellers?  Although there is not a huge amount of physical activity on this trip the heat and humidity makes the walking and cycling moderately challenging. Unless you are a regular cyclist, cycling in Vietnam can be daunting:  there is no such thing as a quiet road, even on narrow paths and bridges you will encounter motobikes, scooters, tuk tuks and other various improvised means of transport.  Whilst this adds to the enchantment of vietnamese roads, the levels of polution, even in the countryside are high, the constant sound of blaring horns deafening; drivers do not give way they just sound their horn and keep going. Most of the cycling was during the hotest part of the day so take the advice of the tour leader and have frequent stops for water and go at your own pace as it easy to think the ride is a race. The trip notes definitely undersell the quality of the accommodation in the hotels and homestays. Having travelled to Cuba with Exodus where some of the hotels are adequate but basic all the hotels on this trip were  far superior. The advice in the trip notes to travel light is well founded and a backpack or holdall is all that is needed. A daypack is useful. Eating rat, crocodile and water buffalo may sound awful but they are not that bad. Seriously though, the food was excellent throughout but vegetarians may struggle at times to find many dishes.   Is there anything else you would like to add?  The Angkor Wat etension really is well worth doing and I suspect not publicised well enough in the brochure.  A few folk in our group were unaware of the possibility of this visit, so missed out"},{"rating":"4.0","review":"The holiday gave us a well rounded view of the country, just what we were after.   What was the most inspirational moment of your trip?  Getting to the top of the hill during the mountain trek only to be passed by  a 12 year old girl carrying a heavy basket on a head band, very humbling.Halong bay on the kayak, going down the tunnels, .... to many to list just one!   What did you think of your group leader?  The group leader was always avaliable to help whatever the situation, without feeling that we where being mothered.   Do you have any advice for potential travellers?  Take an additional small rucksack for those nights you are separated from your main luggage.   Is there anything else you would like to add?  It is a wonderful country, but the people are what make it special."},{"rating":"4.0","review":"The holiday gave us a well rounded view of the country, just what we were after.   What was the most inspirational moment of your trip?  Getting to the top of the hill during the mountain trek only to be passed by&#xC2;&#xA0; a 12 year old girl carrying a heavy basket on a head band, very humbling.Halong bay on the kayak, going down the tunnels, .... to many to list just one!   What did you think of your group leader?  The group leader was always avaliable to help whatever the situation, without feeling that we where being mothered.   Do you have any advice for potential travellers?  Take an additional small rucksack for those nights you are separated from your main luggage.   Is there anything else you would like to add?  It is a wonderful country, but the people are what make it special."},{"rating":"5.0","review":"   What was the most inspirational moment of your trip?  freedom to travel anywhere w&#305;thout fearthe guide was truly inspirational, his love of his country really shone   What did you think of your group leader?  10 out of 10, superb   Do you have any advice for potential travellers?  travel light and don't put your t-shirts in the hotel laundry or they'll never fit when you get them back!   Is there anything else you would like to add?  a fabulous trip, well organised tours, would recommend it to anyone and everyone."},{"rating":"1.0","review":"   What was the most inspirational moment of your trip?  Hanoi is an amazing bustling city and definitely worth a visit."},{"rating":"5.0","review":"   What was the most inspirational moment of your trip?  freedom to travel anywhere w&amp;#305;thout fearthe guide was truly inspirational, his love of his country really shone   What did you think of your group leader?  10 out of 10, superb   Do you have any advice for potential travellers?  travel light and don't put your t-shirts in the hotel laundry or they'll never fit when you get them back!   Is there anything else you would like to add?  a fabulous trip, well organised tours, would recommend it to anyone and everyone.&amp;nbsp; You need to be reasonably fit for the cycling and walking, some people did not realise this."}]},{"name":"Hanoi Backroad Motorbike Tour to Mai Chau and Ta Xua peak","reviews":[{"rating":"5.0","review":"Perfect organization! This tour is short but really sweet. We cannot fault any services provided. Dirt bikes, Food, guide, homestay are awesome. We love twisted turns, beautiful valleys, We will book another trip this year."},{"rating":"5.0","review":"Start in Hanoi with the dirt bikes tour by DNQ Travel to Mai Chau and Ta Xua peak, \"Incredible\", \"awesome\", \"stunning\",... these words bore in my mind when I stood there, watching sunset and sunrise. Each moment was priceless as it never came back. we had a heart stopping beauty here while enjoying the lovely unique moment. So lucky am I when having this chance!"}]},{"name":"4 Days Da Nang, Hue City and Hoi An Ancient Town","reviews":[{"rating":"5.0","review":"Good tourist guide, really friendly and helpful Willing to tell me the history of Vietnam You can try this plan if you have plenty of time in Vietnam"},{"rating":"5.0","review":"Just returned from an excellent trip in Central Vietnam a couple of weeks ago. Bravo Indochina Tours was very helpfull in coordinate and setting up a 4 day sightseeing Hue and Hoi An. The team were very friendly and willing to go above and extra to make sure the trip was exactly what I wanted\nThe guide Ling very helpful knowledgeable can highly recommend this company"},{"rating":"4.0","review":"I've given an overall rating, but this tour was a mixed bag so I've broken it down. \n\nDay one was 5 stars, the tour guide, meal and hotel were all really good and my only complaint was how little sleep I'd had traveling over from Thailand. I was picked up straight from the airport by two very friendly tour operators, taken to my hotel, given time to shower and reset before heading out into Da Nang.\n\nIt was just me and the guide, a young woman from Da Nang, which at first I thought would be awkward, but she was so friendly and very knowledgeable, I saw the lady Buddha, marble Mountain and a museam that was very interesting. Then she took me to what turned out to be my favourite meal of the trip before bedtime. Definitely my favourite day all round. \n\nThe next day started at 8am, there was some confusion over my hotel arrangements, but that got sorted quick enough before we left for Hue. \nThis tour was packed and aside from moving a little too quick it was also very good, we had a comfy air conned bus, we were given ponchos when it rained and we had a very nice meal again. Another female tour guide was also very helpful, knowledgable and patient with 4 different languages on tour. Again the hotel was good, though possibly not quite as nice, still a 4 star day. \n\nThe third day and again early start with some confusion about where I would be staying next. Young male tour guide this time and he was lovely, infectious smile and 100/100 for effort. Unfortunately I saw some of the same things again, which isn't necessarily a bad thing, but I was surprised to be getting repeats. This tour finished very early too, but I did meet some people to have dinner with which was nice. \n\nThis hotel was a let down though, in such a beautiful city it felt depressing, dirty and the customer service was stretched thin. It looked like it was half closed and in desperate need of updating. Fortunately I spent my night here out with friends from the tour, so the room wasn't used as much. But day 3 for the tour was more 3 star.\n\nDay 4 was the biggest dissapointment. The arranged tour was only for the morning and it was a solo guide, no driver too. I wouldn't have minded this and was especially open after the first day's experience, but this very quickly turned awkward and then very uncomfortable. \n\n- The heat was really getting to me by this point, obviously not the tour people's fault, however there was no air conned vehicle available this day, nor was there ready access to water as there had been on the days before. \n\n- He did not provide a helmet when I first got on the back of his bike, something I felt I had to do as it was ride or walk.\n\n- He stood by and watched as I was pulled over by a market vendor and held hostage for a dollar photo I did not want.\n\n- He wouldn't stop flirting, no matter how politely I tried to dissuade him, he kept making flirty comments. It was just me and him throughout this tour and I was becoming more and more irritated by this. This is not acceptable behaviour and I did complain to the tour operator, but I got no response or apology for this.\n\n\nBy the time we'd reached the river I was almost in tears and really panicing that I might faint and be left to the mercy of this guy. So I cut the tour short and asked the operator to arrange another hotel room for me, which he did. Although the operator did not apologise for the tour guides behaviour he did also arrange for lunch to be sent to me with a spend limit of 150,000 dong.\n\nIf I had been picked up at the right time after this then that would've been the end, but sadly after managing to recover a little I was then rushed out, driven to Da Nang 4 hours earlier than needed, given a lukewarm meal which I ate alone and was then silenty dropped at the train station where I had a 2 hour 45 minute wait for the train.\n\nSo when I said mixed bag, I meant it. This tour went from being fantastic to dissapointing and then a bit scary if I'm honest. Really not sure if I would recommend or go for them again. That last day was so poor, it's a shame, but it does spoil what started so well and genuinely was worth every penny right up until that point."}]},{"name":"Terrific Hanoi Motorcycle Tour to Pu Luong and Mai Chau","reviews":[{"rating":"5.0","review":"Home stay accommodation was excellent and we saw a wide range of the cuisine that the region has to offer. The roads and the riding experience was something else altogether, from the chaos of weaving through Hanoi traffic to narrow and quiet village tracks. Every day was different and exciting."}]}]