[{"name":"Along Vietnam from Saigon - Nha Trang- Dalat - Hoi An - Hue - Halong - Sapa","reviews":[{"rating":"5.0","review":"Absolutely loved this entire trip. Being a solo traveller for the first time in Vietnam, it made the entire trip so much easier. I didn’t have to worry about trying to find ways to get from place to place, which was pretty important for me because I didn’t want to have to worry about dodgy taxi drivers. \nI was lucky enough to happen to be the only person on two of my tours and it just made the entire experience that much more memorable. \nI highly recommend this tour to anyone wanting to travel to Vietnam."}]},{"name":"Explore Ho Chi Minh City, Cu Chi Tunnels and Mekong Delta","reviews":[{"rating":"5.0","review":"Wonderful tour, highly recommended"},{"rating":"4.0","review":"Overall this 3 days tour was enjoyable. Our guide Tu in Mekong was very entertaining and even sang a song at the end! We tried lots of unusual fruits at the floating market and sampled a number of Vietnamese snacks following a demonstration of them being made. The cooking class was fun. The lunch was a little disappointing though. The quantity was good but the food could have tasted better"},{"rating":"5.0","review":"An was very funny and knowledgeable and I learnt a lot more about the history of Vietnam than studying an entire history book just by spending 3 days in Saigon, Cu Chi and Mekong with Susu. Very highly recommended for you who like history as much as I do"},{"rating":"5.0","review":"We have spent our 4 days in Hoi An and Hue and have had great tours with Bravo Indochina. New on our motobike tour they made our day funny informative thank you so much and Nhieu who made our tour of son temple and street food tour enjoyable and fun it was lovely having dinner with a local all great tours made by great tour guides thank you again what a blessing to experience life in Hoi An"},{"rating":"5.0","review":"We had a great experience right from the time we landed in Ho Chi Minh till we ended our tour. Mr Tien had helped us plan our trip, customize it to suit our needs. The tour guide was very knowledgable and was helpful"},{"rating":"5.0","review":"We had wonderful 5 days trip in Vietnam with the excellent arrangement from Bravo Indochina Tours. We have been to Ho chi minh city, Mekong river and cu chi tunnel. I found the service and response  was excellent. My emails were promptly responded. The guides and drivers are very professional and friendly, also the accommodation were simply superb.  If you are the first time and want to visit Vietnam, I will recommend Bravo Indochina Tours. We would like to say thanks company for the wonderful support and arrangements."},{"rating":"5.0","review":"All perfect since  we arrived in Ho Chi Minh airport we met Susu who really is exceptional. With Susu we went to the Cu Chi Tunnels , the Mekong and the war museum in Ho Chi Mihn and he brought each to life, with a great wit to go with it, which isn't easy to do with 3 teenage daughters and held them enthralled over a few days. Definitely the person to request if touring Ho Chi Mihn and its surrounds."},{"rating":"5.0","review":"We enjoyed this trip so much."}]},{"name":"Vietnam Timeless Charm - 11 days 10 nights","reviews":[{"rating":"5.0","review":"Tracy was great, she was very informative and helpful."},{"rating":"4.0","review":"The tour was several mini tours put together as a package, each one starting and ending in Hanoi. So each time I was with a different group of people and each mini tour had a different guide. There was quite a lot of time spent on the bus but it was worth it as the scenery was stunning. The organisation was very good and the Crossing Vietnam guide, Tracy, was excellent. She was very helpful and pleasant and did her best to make sure all the arrangements came together. When I left a bag on the overnight train, she managed to get it back for me and took it to my hotel. \nI would not advise a solo traveller to pay extra for a single room as 2 nights were spent on the train and 2 of the home stay nights were in a dormitory. In my opinion it was a waste of money."}]},{"name":"Northern Vietnam Discovery 7 Days","reviews":[{"rating":"4.0","review":"Excellent service from Tourradar, efficient, person centred and kept me well informed.\n\nWe were picked up on time from Hanoi airport by our guide,  Tang Kim Dung she took us to the hotel and made sure that everything was in order before she left. Next day she was there on time. Very knowledgable and efficient, she gave good explanation of everything. I must mention the driver, ver polite, he kept an immaculate car and always had fresh water for us, a lovely touch.\n\nWe were picked up on time for our trip to Halong Bay, all went well but I am not sure what we received for our additional $25 per person for the galla evening, not even a glass of champers at midnight, some cheap stuff that wasn't drinkable. Please don't get me wrong the crew were great but I sensed that quite rightly they were always great.\n\nGuide then picked us up for our trip to Sapa, again she ensured we were safely on board and settled before she left.\n\nSapa - well this was a bit of a disappointment. Our itinerary stated a trek, what we got was a 2 hour walk on a proper road, yes there were interesting things to see, but there were lots of people on the same road. We then stopped for lunch for a hour, we had anticipated further walking in the afternoon but our guide dropped us off at 12.50. The rest of the day was free but there is nothing to do in Sapa if your not out trekking, very disappointing. The guide was informative but also annoying as he was often on his mobile phone.\nNext morning the guide suggested leaving at 7 am, from our experience the day before I said 7.30. In reality we could have left at 9. Lovely 2 hour drive, we stopped at the market, which is like any other market in Asia , so no need to have 2 hrs there.\n\nWe couldn't do the river trip as the river was too dry due to the dam restricting the flow of water.\nSo we were back in our destination by 12 MD with 9 hours to fill in, in a City that has nothing for tourists. Here our guide was very helpful and got us a room in a hotel but it was a long wait, so we did two ten hour trips on a train for 2 hours walking, a three hour drive the next day. ( which was enjoyable) and 45 mins at a market. Please sort this out for others.\n\nI am sure that others have said this but Sapa is now very commercialised and you may want to suggest other things for the itenary.\n\nI hope you find this useful, it is intended to be.\n\nBest wishes\nJulie "}]},{"name":"Hoi An Motorcycle Tour to Saigon on Ho Chi Minh Trail via Kham Duc, Kon Tum, Buon Ma Thuot, Dak Mil, Dong Xoai","reviews":[{"rating":"5.0","review":"Done a 6 day trip from Hoian to Saigon on Ho Chi Minh Trail. Vietnam was amazing and the views were unbelievable, definitely the best way to see Vietnam and its great culture , hotels and home stays were great and unique. Highly recommend!!!"}]},{"name":"Cambodia & Vietnam: Bonfires & Banh Mi","reviews":[{"rating":"4.5","review":"Amazing tour, everything was so well organised and the itinerary was jam packed. Special thanks for Ratha for making the trip so special and memorable. He looked after us all so well and his knowledge and communication was excellent."},{"rating":"5.0","review":"I’ve had an amazing trip with G-Adventures! Our CEO, Dollar, has done an amazing job! He’s simply the best guide I’ve ever had!"},{"rating":"3.5","review":"Our tour guide on this trip WAS ABSOLUTELY WONDERFUL. The people we met in the tour group were great as well!! Prasit was kind, patient, caring and so funny! He was the best part of the tour! He always warned us if we would be uncomfortable and did such a great job at taking care of everyone. I never felt unsafe with him. He is such an incredible person and have only good things to say about him!!!! If this were only a rating on him, I would give 5 stars! \n\nThat being said, whoever handles G Adventure's operations, needs to do a much better job. For the price paid, much better accommodations could have been provided. The 2 days in Koh Rong were honestly very bad. We drove across Cambodia to stay on a remote island with no AC and gaping holes in the floor of the accommodation. You could not even walk on the sand because of sand flies and you could not swim because of sea urchins and murky water. The trip to Koh Rong was unnecessary. It could be improved by changing the the accommodations or relocating to the nice side of the island which I hear has clear water. In Vietnam, the hostel we stayed in had BED BUGS. G adventures does not have a proper procedure for dealing with such events. I ended up leaving this accommodation with 3 of my friends. G adventures should have a procedure that makes the hotel/hostel accountable, instead of making us find our own accommodations."},{"rating":"5.0","review":"Amazing experience that gave me the opportunity to visit a lot of wonderful places in a short time. The group was super fun and the guide, Sarou, was the best!"},{"rating":"4.5","review":"The tour was alot of fun and we saw alot of places. Time between places in buses was long and there is not alot included in the price of the tour."},{"rating":"4.5","review":"Kim was an incredible guide - he really helped us to gel as a group and was passionate about the countries he took us to. We’d heard from other groups on similar tours that their tour guides weren’t as interested in getting to know their group on a personal level, however this was not the same for Kim. I also got a sickness bug on one of the days, and he went out of his way to ensure I was okay and got me some food and drinks from the shop to get me on the mend so I could rejoin the group. All in all, he is amazing at his job and he made my experience the best travels of my life so far. He is a credit to the G Adventures team!"},{"rating":"4.0","review":"Kim was very knowledgeable and ensured we got the best experience of each place, sharing with us the local food and other interesting facts. Kim was very approachable and always solved any problems quickly and efficiently"},{"rating":"5.0","review":"The tour was amazing, but honestly what made the whole experience an unforgettable one was Kim! He took us to the most amazing places, let us try the most amazing things, he honestly the tour a once in a lifetime experience! Easily the best tour guide I’ve ever had!"},{"rating":"5.0","review":"This tour was incredible and made even better by Kim, he made sure we didn’t miss anything in each area and accommodated for all of needs. Kim was so generous and I couldn’t imagine having a different guide.\nThanks Kim!"},{"rating":"5.0","review":"It was good fun, although very exhausting having to travel for long periods of time. \n\nChan was great. So friendly and informative. I miss him!"},{"rating":"5.0","review":"I had a lovely experience on my trip. I made new friends from different parts of the world, had a bomb CEO, learnt a lot about a country I knew very little about, traveled way further than I would have and tasted the best food. Vietnamese food is definitely a favourite now. I feel highly blessed and grateful that I had this experience.\n\nChan was the best tour guide I have ever encountered."},{"rating":"5.0","review":"Excellent organisation and structure of the trip, you get lots of time to yourself mixed with a good level of group interaction and activities.\n\nI can't rate Chan highly enough. He made the trip for me and I would consider him one of my good mates. He was smiling and happy the entire time no matter the hour of the day and made the trip an absolute blast."},{"rating":"5.0","review":"All was good. I felt I had what I expected. I can strongly recommend Chan as a CEO to everyone who wants to travel with G-adventures."},{"rating":"5.0","review":"Chan single-handedly made the trip what it was. Beginning with his deep-rooted understanding of the area we were travelling in, along with his extremely fluent English and continually happy behaviour. I consider myself extremely lucky to have been given Chan as my guide through the whole 20-day tour, as I don't believe I would have gotten the same experience with another guide. His communication over WhatsApp with the group was incredible, whether it was organising our plans for the day or making recommendations of sights and restaurants around the town. Not only this, but he also took part in the activities - he didn't simply do just what he was told to do by G Adventures, he went well above and beyond everything that needed to be done. I've learned so much about the history and current state of these South-East Asian countries we visited because of Chan. I wish him all the best for the future and cannot find a fault in his performance during this trip. Incredible guy."},{"rating":"4.5","review":"The tour was fantastic.  Our CEO Mint was the best we could have wished for.  Very caring and professional.  A little too much bus time but that couldn't be helped.  Also, not enough time in Hanoi.  Great activities.  Great group.  i would recommend G Adventures to everyone who prefers small groups.."},{"rating":"5.0","review":"One of the best travel companies I ever did on. Great Memory with all the friends who were on the trip. Chan was the man"},{"rating":"5.0","review":"Thanks G Adventures for having Chan for us. Chan absolutely made the trip for me (I even cried a little bit when he said goodbye). He was so kind, funny, friendly, and helpful! He knew the answer to 99.9% of questions you asked him straight away, and if he didn’t know he would find it out in no time. If you needed anything at all he’d be there to help, I even commented that it surprised me that he managed to stay so happy and energetic throughout the whole trip to which he replied he loves his job.He is a fabulous asset to g adventures and such a pleasure to be around!!"},{"rating":"5.0","review":"G Adventures got very good Tour leader. Chan was way beyond my expectations of a tour guide. He was always active and friendly and had so much knowledge about everything it seemed like. He was very passionate and had many interesting and funny stories to share. He made you feel very welcomed and safe and was close with each and every one in the group. He always listened to the needs of the individual and was very good at adapting different activities, times, food etc so that everybody would be happy. I am very happy that Chan was my tour guide."},{"rating":"4.0","review":"Phyo Kyaw is an amazing guide. He always made sure his group was comfortable and offered great local recommendations. He always kept us laughing and encouraged us to try new activities/foods. I’ve been on many guided tours and he’s one of the best guides I’ve had."},{"rating":"5.0","review":"I absolutely loved my trip! I honestly couldn’t rate our tour guide Min any higher - he was so fun, knowledgeable, genuinely kind and went above and beyond for each one of us. I felt not only cared for as a tourist but as a friend."},{"rating":"4.5","review":"Me and my friend was AK's first travellers. She was the cutest, warmest and most caring guide we couldve hoped for. She helped us with what ever we needed. Always awailable."},{"rating":"4.5","review":"AK was absolutely fantastic. My first time traveling and she made me feel safe at all times and was so very helpful with all my questions and she even gave us some rehydration powder on a really hot day and reminds us to put sun cream on. She made my experience with G adventures better then I can imagine and because of her I will choose G adventure tours again and I will hope to be with AK. She is really kind and caring and very funny with fantastic English.  She is a very hardworking tour guide."},{"rating":"5.0","review":"Cheak was amazing and we couldn’t have had a better time. The tour itself was awesome but the people and the guide made it perfect! We were all well looked after and everyone was included and involved. Amazing journey!"},{"rating":"5.0","review":"The tour was an amazing experience with perfect included activities in each destination and a range of add on activities to suit everyones interests. It felt like we saw the best of both Cambodia and Vietnam and now know which places to go back to and spend more time. Our guide Chheak really made the whole experience special, he was a fantastic guide with a huge range of knowledge, he was friendly and approcable and alot of fun. The group ended the tour as sunshine family. If you never try you never know!"},{"rating":"4.5","review":"I absolutely loved my trip with G Adventure and with Cheak as my CEO ! We had the best time experiencing a lot of really beautiful and interesting places and we really got to know the different cultures. Cheak, our CEO, did an amazing job showing us the cultures and from the moment we met him, he was openminded and extremely passionated about our journey and the group - he really made us become one big family. I will definitely recommend this trip to everyone! #CheakChuom"},{"rating":"5.0","review":"Chheak is a true credit to G Adventures. His genuine passion for his job and the countries we visited was felt every minute of every day. He looked after us meticulously 24/7. This, coupled with his humour, his fun and loving personality and his contagious laugh made the trip what it was. Without him the trip would not have been the same."},{"rating":"5.0","review":"My trip was amazing loved every second off it in Asia I only wish other travels wpuld be as lucky to have a tour guide as caring and commited as cheak!\nIt was amazing!!!\nSunshine!!!!!"},{"rating":"4.5","review":"Great tour, Andy made everything very easy for us. It is good to know that it is quite fast paced (as most tours are), but in return you get to see a lot of places in a short period of time. This was my second gadventures tour and it is a very high quality on the tours. Gadventures support the local people and run projects to help the community which I think is great!! It is good to know that I give something back to the places I visit."},{"rating":"4.0","review":"I had such a great experience with G Adventures! The accomodation was much better than I expected, the vehicles were always clean and waiting for us, the range of activities were great! Jack was a fantastic tour guide, extremely knowledgeable and helpful. He was so friendly and funny and created a fun and safe atmosphere. I highly recommend this tour"},{"rating":"5.0","review":"This tour was one of the best experiences of my life and unique to any other travel I have previously done. It was such a great way to see so much and experience the best of Cambodia and Vietnam in such a short period of time. The tour was made so special thanks to our amazing guide Cheak. With a constant smile on his face and positive attitude we were able to always go with the flow and make the most of every experience. From the start of the tour to the very end Cheak went out of his was to go above and beyond to ensure everyone was having a great time and felt included and involved. His experience and knowledge enabled me to learn a lot during every adventure whilst having a great time. After this great experience I look forward to doing another g adventure tour in the future and hopefully having a guide as incredible as Cheak"},{"rating":"5.0","review":"Ratha you are such a fantastic tour guide. We love your # stickyricefamily"},{"rating":"4.5","review":"Amazing trip, amazing guide"},{"rating":"4.5","review":"I loved the tour and the guide. He was easy to talk to, and always tried his best to help us whenever we had questions or needed something."},{"rating":"4.5","review":"Cambodia and Vietnam on a shoestring with Con was absolutely amazing. He was so informative about the countries and knew exactly where the best places to go/visit/eat/ drink in every town we visited. Can't thank him enough for an amazing 20 days! Will definitely try to book another tour with him as CEO! Thank you Con!"},{"rating":"5.0","review":"Absolutely brilliant, can’t praise our CEO enough!"},{"rating":"4.5","review":"Amazing trip! Good size of group"},{"rating":"4.0","review":"Amazing trip! Good size of group!"},{"rating":"4.5","review":"Awesome tour! Very informative and helpful guide! Always there to answer all our questions and show us the best places in every city!!"},{"rating":"5.0","review":"Such a fantastic trip for the money we paid. Well worth it! I would highly recommend to anyone. If you're lucky enough to have Ratha as your tour guide you are in for one amazing fun filled trip!"},{"rating":"5.0","review":"The Tour was great and our group turned into a family... we all still in contact a lot. All of this is because of our Amazing CEO Ratha. That always knew what to do and manage to get us involved with each other, always there when needed"}]}]