[{"name":"11 Day Best Vietnam From Hanoi - Halong Bay - Sapa - Hoi An and Mekong Delta in Ho Chi Minh city","reviews":[{"rating":"3.5","review":"The tour exceeded our expectations. From start, tour manager, Mahn from Vietnam Real Tours contacted me and continued to provide excellent communication throughout the tour. We wished to update the tour to provide extra days in a couple of places along the way. As it was a busy time of Tet festival, some of the journey details were rearranged by Mahn who dealt with all bookings to accommodate our wishes so we did not miss any part of the tour. The tour was excellent, providing flexibility with dates on each component from pick up from airport to hotel to day trip and continuation of journey. All happened so seamlessly as organised by Mahn which took any stress out of bookings to fit within 15 day stay without visa. The hotels booked on the tour by Mahn were thoughtfully located to explore areas and of the best quality. I had an injury whilst in tour and Mahn arranged an upgrade for us to make me comfortable having to miss a day trip. I thank him for his care with this. The sight seeing trips arranged for us were great too. Good English speaking and variety to give us taste of Vietnam. I normally arrange all components of a journey when travelling lots in SE Asia, to save cost. However, thought for short time, first time to Vietnam, it was easy to have independence of dates but everything arranged for us. Definitely worth the price to know good research has been done by to our manager having knowledge and communication with all hotels and drivers already. Small price to pay. Thank you so much, Mahn. I felt you genuinely cared for us and our journey."},{"rating":"4.5","review":"Booking this tour took every stress away from planning a wonderful trip to Vietnam. I wanted to see as much of what the country has to offer in a short space of time, and this tour really does account for seeing the highlights, as well as giving you the opportunity to explore things you may have planned to see yourself. All for such an incredible price, if you want to see the highlights of Vietnam then this is the tour for you!"},{"rating":"3.5","review":"They were very helpful. I planned for my trip but then I had to reschedule due to Visa problems and they helped me reschedule. Very nice and very organized"}]},{"name":"HCMC & Phu Quoc Experience","reviews":[{"rating":"5.0","review":"I had a great time. The cycling tour in Vietnam was very well organized and conducted. Our guide was knowledgeable, friendly and personal. The crew were very helpful. They all made the trip enjoyable. The only comment is that Tour radar describes the experience, if I remember right, that it is appropriate for any level but it could actually be challenging for older or less fit persons. That being said, electric supported bikes were made available to a couple bikers otherwise they may have had difficulty keeping up."}]},{"name":"19 Days through Vietnam from Hanoi to Ho Chi Minh City (FREE NEW SIM CARD)","reviews":[{"rating":"4.0","review":"An excellent tour (19 days with Sim card Hanoi to HoChi Minh)\nVery busy. Perhaps a day for testing is a good idea as someone has already suggested.\nEnjoyed Sapa 2days excursion. Our guide Lee was excellent. Very good English (best of every guide) and very informative about district and Vietnamese culture. Good train journeys.\nThe day from Hue to Quang Bihn Paradise cave was too long and we would have preferred to visit DMZ Zone and Vihn Moc Tunnels instead.\nBit disappointed at 4 Isand trip from NhaTrang. Only 1 beach with good sand.\nMost things went to plan. Left a couple of times wondering if pick up would arrive but a quick message to Ms Lan and everything was sorted. \nHighly recommended."},{"rating":"4.0","review":"This tour was a FANTASTIC way to cover a lot of Vietnam!\n99% of the Guides we had take care of us were brilliant (you have a different guide/group of fellow travellers each day). Great English. There was only one Guide whose English was difficult to understand which made learning about the Farmers hard.\n95% of the time the Drivers arrived on time, or earlier (up to 30 minutes earlier in some cases so it's wise to be ready 30 minutes before the quoted pick up time).\nThere were a couple of Drivers that were late to pick us up (twice from the Train station/s & once from Dalat Airport), however, no matter the time, we were able to call Ms Lan using the local SIM provided, & Ms Lan would have it sorted within 20 minutes, max (be sure to take an 'unlocked' mobile phone with you).\nThe included activities & daily tours were AWESOME!\nThe included meals were sometimes a challenge for a Vegetarian, but were always sorted out.\nFor the overnight train/s, I would suggest upgrading to book the WHOLE cabin to yourselves (if you are a couple travelling together).\nIt is very 'cosy' for 4 adults... especially if you do not know the other 2 that you are sharing the cabin with (or your bag/s are on the larger size).\nThe only suggestion I would make for Vietnam Adventure Tours would be to break up the 19 day tour with a couple of days 'rest'.\n19 days of early starts, long days & high heat (April is the hottest month to travel in Vietnam) made it a tiring tour, BUT, it was very satisfying to see & do so much!\nIf the tour was a 21 day tour, with 2 days of rest (one of those rest days would be good in Nha Trang as the beaches are gorgeous) it would be perfect!\nWe added 3 days at the beginning, & 8 days at the end of the tour which helped us ease into Vietnam, & relax after the tour, which I highly recommend if you have the time.\nIf you are limited for time, I would suggest arriving at least the day before the tour start date, & departing at least the day after the tour ends.\nOverall, I would give this tour a 9/10.\nMs Lan was a true professional (even when I called her at 4:50am to locate our late Driver!), friendly & made our tour a wonderful experience.\nHIGHLY RECOMMENDED!"}]},{"name":"From Hanoi: 3-Day Sapa Tour with Fansipan Peak Visit","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Sapa is great with Fansipan. \n사파는 웅장하고 환상적인 곳입니다\nHighly recommend"},{"rating":"5.0","review":"My boyfriend, sister and I had a fantastic trip to Sapa. The trip was thoroughly organisesld, comfortable and good value for money. I would recommend this company for anyone wishing to visit Sapa from Hanoi."},{"rating":"4.0","review":"Overall is great . Ruby takes care us from beginning to end. Fansipan is unique and recommend."}]},{"name":"Discover Ho Chi Minh City 5 Days 4 Nights","reviews":[{"rating":"4.5","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"3.5","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Exceptional Hanoi Wandering Tour to Ninh Binh and Halong Bay","reviews":[{"rating":"5.0","review":"I and my wife only had few days in Hanoi so our friends recommended us this tour. Ninh Binh & Ha Long Bay are two featured places that you need to go when you stay in the North of Vietnam. We had great time here and saw many natural places - stay away from busy city for few days. They are both so beautiful which we cannot compare. Thanks for arranging for us such a great trip!"},{"rating":"5.0","review":"4 days in Hanoi & Halong was one of the best vacations we ever had. Our travel guide Tom and our driver Jimmy were very friendly, polite and very knowledgeable. Just a short trip, we had nice experience & enjoyed many local foods in Hanoi old quarter & joined cooking class on Halong cruise as well. We took more than 500 pictures in only 2 days.\n\nHighlights: Hanoi & Halong bay are a must when travelling to Vietnam, with typical lifestyle of Northern People here."},{"rating":"5.0","review":"I and my friends took a short vacation to Vietnam so we only spent 4 days in Hanoi - Ninh Binh - Ha Long bay. This tour did give a good impression to us. Our tour guide can speak very good English, he told us a lot about the tradtions and culture in Vietnam. This country is lovely and it's worth a deep explore. People are very friendly and we also enjoyed the scenery here. I think I am going to plan my next holiday in other regions of Vietnam."},{"rating":"5.0","review":"Highly recommend the Hanoi-Ninh Binh-Ha Long bay tour to anyone who visits Vietnam if your time is limited. Our guide - Ms. Chan was very informative about the places we went to. It made our experience in Vietnam more meaningful and memorable. Absolutely amazing and worthwhile trip. Big thanks!"},{"rating":"5.0","review":"We returned from a 4 day luxury tour arranged by Vietlong Travel was quite simply the best holiday of our life.Everything was perfectly arranged and occurred as planed to the minute..We stayed in excellent hotels inHanoi,Ninh Binh,as well as a delightful cruise on Halong Bay.Guides at all scheduled places were excellent and all drivers were skillful and considerate and we enjoyed roomy air conditioned vehicles throughout"}]},{"name":"Vietnam - 13 Days","reviews":[{"rating":"3.5","review":"The tour was full on and packed with sights. Some of the hotels were amazing for 3 stars, others terrible! Tour guide was very helpful and in contact via whatsapp often. She even brought us gifts! Two transfers to the airport were a bit of a nightmare with one car very late and one not even arriving. More info on trekking would have been useful as we didn’t really prepare! Good trip overall - just be prepared to laugh things off!"}]}]