[{"name":"Vietnam - South to North - 10 days (Free 01 local SIM Card with data + Free 2 Tickets of Water Puppet Show)","reviews":[{"rating":"4.5","review":"I would like to thank Sunny for outstanding service although we had to cancel when we were in Vietnam due to the Corona virus and return home Sunny offered so much help and support by trying to keep the tour going but unfortunately to many places were being put into lock down. So I cannot respond regarding the tour."},{"rating":"5.0","review":"Sunny was very organize, friendly, and pleasant to deal with."},{"rating":"4.0","review":"We can't say enough thanks for Chloe and her team at Vietnam Allure Travel for making our trip in South East Asia memorable. We booked the 16 days tour Vietnam and Cambodia through Tour Radar and were well taken care of from the beginning to the end. When we arrived Hanoi, Vietnam, Chloe came to our hotel and gave us every documents needed. She also provided us a local SIM that we used to contact her easily. Well, everything was very good from hotels, cruise tour to transportation daily and road tours. We highly recommend Vietnam Allure Travel"}]},{"name":"Classis Sai Gon 6 Days 5 Nights","reviews":[{"rating":"4.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"4.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"3.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"7 Days in Southern Vietnam","reviews":[{"rating":"4.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"3.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"Northern Vietnam Hanoi - Ninh Binh - Halong short group tour 5 days","reviews":[{"rating":"4.0","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"3.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Vietnam Compact Tour 6 Days 5 Nights (From Ho Chi Minh City to Hanoi)","reviews":[{"rating":"5.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"4.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]}]