[{"name":"5 day / 4 night Hanoi - Mu Cang Chai Package tour","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Hanoi - Pelican Cruises Halong Bay 5Days/4Nights","reviews":[{"rating":"4.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"3.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Hill Tribes of Sapa 7 Day Private Tour","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"3.5","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Best of Northern Vietnam","reviews":[{"rating":"5.0","review":"This was one of the best trips we did and our family really enjoyed the experience of learning about the history and culture of Vietnam. This couldn’t have been made possible without the team at Swallow Travel as they were completely fantastic and took care of everything. Even when we arrived at the airport and had problems with our visa we contacted them and they managed to help us to sort it out. Don’t know what I would have done without them. Thankyou again Swallow travel we will definitely be using your services again."},{"rating":"4.5","review":"The team at Swallow travel were fantastic when we booked our trip with them because we had to postpone our trip and...\nShow more"},{"rating":"5.0","review":"Swallow Travel gets top star rating from us for organising an amazing tour from the north to the south of the...\nShow more"}]},{"name":"9 days in the North of Vietnam - Ha Noi - Ha Giang - Ha Long Bay","reviews":[{"rating":"5.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"5.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"5.0","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"Hanoi Hilton Opera - Paradise Luxury Cruises 6Days/5Nights","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Truly Vietnam - 10 Days","reviews":[{"rating":"5.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.0","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"5.0","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]}]