[{"name":"Highlight Vietnam Tour 11 Days/10 Nights","reviews":[{"rating":"4.5","review":"10 day Vietnam tour \n\n\n\nAccommodation was OK in some stops, better in others. Pick ups and drop offs were on time. A LOT of ancient history and very little of current day recent history. Majority of Tour guides spoke poor English which made the excursions frustrating. Itinerary was changed without notice (eg swimming ban in Halong Bay was known about but we werent notified). Ho Chi Minh tour to war museum and Cu Chi tunnels was disappointing as our tour guide rushed us through (eg 2 hour drive to Cu Chi tunnels, 30 min visit to tunnels). Everyone ended up leaving the guided tour to go do our own thing. In hindsight, we would have had a far better holiday not on a tour."},{"rating":"4.5","review":"Fantastic\n\n\n\nEverything was piccobello. The food, the people on board, the cabines, everybody was vertrokken friendly.\nJan L"}]},{"name":"Vietnam 7-day Sweet Honeymoon","reviews":[{"rating":"5.0","review":"Beautiful place. Great hotels and traffics by Crossing Vietnam Tour. Highly recommend"},{"rating":"5.0","review":"This is a package tour for couples who want to have more privacy. The scenery in Vietnam was magnificent and we were thoroughly arranged good hotels in every destination. We fell in love with this country after just 7 days. Highly recommend for every couple"}]},{"name":"9 Days in Northern Vietnam","reviews":[{"rating":"4.0","review":"Mr. Manh has been very helpful since the first contact and throughout the trip. Thumbs up for the communication! All the tours/excursions in the itinerary are really a great combination! We travelled with a group of 7 people and a baby and it was great. The tour guides accommodated the needs/fitness level of different individuals. Transport arrangement was smooth. Everyone loved the street food tour and the sapa trip was simply amazing!"}]},{"name":"Sapa Wonder and Minority Market","reviews":[{"rating":"5.0","review":"Very good Tour guide. Ask for Dao as guide. He was great with my young daughter. Very good with children and also my older mother. Helped my mother with the walking and helped with daughter and had patience and was very informative the whole tour. True local Sapa family man. Would highly recommend."},{"rating":"4.5","review":"The travel agent was super helpful! Always look for Ruby (aka Life) in the Hanoi office!"},{"rating":"5.0","review":"I visited many places in Vietnam but Sapa is number one. I like this company when organizing this tour for me. Ruby is super nice and always want her to guide me again."},{"rating":"5.0","review":"Very nice tours in rice fields and minority villages, the landscapes are beautiful and interesting local guide. \n사파다녀왔습니다.\n버스를 다섯시간타고 마지막엔 산길도 무지막지하게 올라가구요.. 고생해서  간 만큼 보람있는곳 입니다\n판시판 케이블카 꼭 타봐야하고 정상에 올라서서 구름이 제 발밑에있는 기분도 느껴보구요 아, 판시판가실땐 비옷 꼭 챙겨가세요.\n라오까이 마을 트래킹 강추합니다. 한국 시골마을이랑 비슷한듯 아닌듯 특별한 매력을 가지고있는건 확실합니다."},{"rating":"5.0","review":"Had a lovely trip to Sapa! Lovely guide who answered all questions and was able to provide tribal information! Very well organised from start to finish, hotel was clean, staff friendly and food good, 3 courses given both at lunch and tea and fresh pancakes available at breakfast! Trekking was VERY hard work and VERY slippery, not suitable for anyone with any health problems in my opinion! Local women helped on the trek and wanted you to buy their products at the end, happy to do so as they were very much needed on the walk! Afternoon walking enjoyable, but long and at lot of downhill walking! Ensure suncream is applied regularly! Photos of hotel view true to life, amazing to wake up to!"}]},{"name":"Highlights of Vietnam Tour to Hanoi, Halong, Tam Hoc, Hoa Lu, Hue, Hoi An, Saigon","reviews":[{"rating":"5.0","review":"My wife and I spent our wedding anniversary  in Vietnam. We visited, Hanoi, Halong, Hoa Lu, Tam Coc, Hue, Hoi An, Ho Chi Minh and Mekong Delta. At every place we were greeted by such enthusiastic tour guides. They were not only thorough and knowledgeable, but also very attentive to our desire. We even though got some gifts from Tung and Quyen, our tour guides in Halong Bay and Hoi An for our celebration.\nThis was the first trip with  Travel Tour, and we are excited for our second one in next year."},{"rating":"5.0","review":"After searching on internet for some information about Northern Vietnam, We found Vietlong tours website and sent some enquiries and received replies immediately. We also checked on tripadvisor to ensure reliable company before deciding booked with them. Everything was so well organized like clock-work, no delays. Their staffs were very impressed and professional, which was over our expectation & made our trip lifetime. Definitely recommend them to all friends to Vietnam.\nHighlights: Our Vietnam Vacation was very significant, in which visiting many interesting places from North to South, know more about their lifestyle, culture & see different Vietnam comparing the past."},{"rating":"5.0","review":"This was our first time to visit Vietnam. It has been a fantastic holiday for me and my husband. I have been very impressed with everything. All the tour guides had good local knowledge, professional and humble. My original booking request was to stay overnight at the Flamingo Cruise. Unluckily, the rooms at Flamingo Cruise were told not available during the initial booking enquiry but then I was really glad that Ms Tran has offered me an upgrade to the Maya Cruise at no extra cost! Thank VietLong Team to offer us very romantic dinner on our anniversary. Can't wait to comeback next year to see the mountainous area in North Vietnam."}]},{"name":"10 Days Vietnam In Style","reviews":[{"rating":"4.5","review":"The accommodation choices were fantastic especially the hotel in Hanoi - LaSiesta!"},{"rating":"5.0","review":"My husband & I booked a 10days luxury tour with Friends Travel, we also stayed a few extra nights in Hanoi and Hoi An, which they organized for us. They exceeded every expectation that we had. Everything was so organized, they even gave us three 'goody' bags for the overnight train ride from Hanoi to Hue, which included fruit, water, snack bars, bread rolls and more! Our guide even made sure that we were put onto the train and brought our luggage in for us. We can't thank them enough for an exceptional experience and would recommend them highly. Sydney, Thao, all the staff and guides (especially Flower) Thank you so very much for a wonderful experience and your expert guidance and help. I will certainly recommend you to any friends visiting Vietnam."},{"rating":"5.0","review":"Everything about our 10Days Vietnam In Style tour from North to Central was outstanding. The team at FriendsTravel Vietnam offered truly personalised service. Everything from the hotels, all of our amazing tour guides, the incredible Halong Bay cruise and the history and scenery were exceptional. We absolutely loved it all and would highly recommend the group to anyone wanting to experience the best of this area. Thank you again guys!"}]},{"name":"Discovery Vietnam Central 5 Days 4 Nights","reviews":[{"rating":"3.5","review":"Good value for money except single supplement which is very high considering hotel costs in Vietnam. Most single supplements work out around one third of tour. This was over half"}]},{"name":"Budget Vietnam Family Holiday from Hanoi to Halong Bay, Da Nang, Hoi An, Saigon and Mekong Delta","reviews":[{"rating":"5.0","review":"We were a group of 5 people and we did a tour in Vietnam. We choose VietLong Travel to organize our trip and I can say in the name of the whole group that we were really satisfied with the organisation and services what we received. A tour guide welcomed us in every places, all of them were nice and well prepared. The accomodations were great. We spent a great time  in Vietnam, visited wonderul places, met nice and friendly people. We would recommend for everybody to choose  VietLong Travel to visit these regions."},{"rating":"5.0","review":"We had a very well planned tour of Hanoi Halong Bay. . . Vietlong took utmost care for hotel booking,daily tour, airport pickup & drop & organized the tour well. Ms Loan made all efforts to make our stay very comfortable. We left Vietnam with a good memory. Except for Vegetarian food , we were satisfied overall."},{"rating":"5.0","review":"Amazing tour. The guide very friendly & knowledgeable. HaLong Bay very beautiful with some caves. The meals on the cruise was good. Sai Gon is busy city but Hoi An is quite. I think if have time, i will come back then stay long time in Hoi An. Of course, i will choose VietLong Travel again for the next trip."},{"rating":"5.0","review":"All staff have been excellent (in hotels & the guides) always courteous and hospital. The Halong Cruise is excellent, the evening meal (and all the meals) were delicious and well presented however, the drinks from the bar are pricey. \nAll guides communicated very well, they were great in terms of fluent English (it is just that their pronunciation is different - inevitably)... Highly recoommended!"}]}]