[{"name":"Quick Look Vietnam from Hanoi to Ho Chi Minh City - 7 Days","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Legends Of Northern Vietnam - 9 Days","reviews":[{"rating":"4.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.0","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"4.5","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]},{"name":"7 Days in Northern Vietnam","reviews":[{"rating":"5.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"Golf Trails of Vietnam - 13 Days","reviews":[{"rating":"4.0","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"5.0","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"5.0","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Cycling along Vietnam's Red river Delta","reviews":[{"rating":"5.0","review":"Perfect balance between distance and route. The day in the national park near hnin binh is the best memory of this part of Vietnam. Top tour for mountain bikers and the local team (guide Thuoa and the logistic team)."}]},{"name":"Hanoi Stopver Tour with 1 Night on Paradise Elegance Cruises 5*","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Northern Mountains of Vietnam 7 days 7 nights","reviews":[{"rating":"4.5","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"5.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.5","review":"Do it! Great tour, very authentic."}]},{"name":"Best Treasures of Hanoi - Halong Orchid Cruises - Bakhan Village Resort 7 Days","reviews":[{"rating":"3.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]}]