[{"name":"Pure Nothern Vietnam","reviews":[{"rating":"4.0","review":"Excellent experience"},{"rating":"4.0","review":"This tour was recommended by Bac for me to take and it was exceptional.... everything went smoothly and was both extremely interesting and fun and the ship and the food and accommodations were just perfect.... later in my visit to VN Bac suggested that I visit Sa Pa which was the highlight of my trip and once again all the arrangements Bac made for me worked out perfectly. Bac and Pure Travel know what they are doing, are very knowledgeable, friendly and willing to take their time to make sure my time in Hanoi was great."}]},{"name":"Authentic Vietnam 21 days 20 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.5","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.0","review":"Do it! Great tour, very authentic."}]},{"name":"Vietnam in a week -7 days northen Vietnam","reviews":[{"rating":"3.5","review":"Excellent experience"},{"rating":"3.5","review":"This tour was recommended by Bac for me to take and it was exceptional.... everything went smoothly and was both extremely interesting and fun and the ship and the food and accommodations were just perfect.... later in my visit to VN Bac suggested that I visit Sa Pa which was the highlight of my trip and once again all the arrangements Bac made for me worked out perfectly. Bac and Pure Travel know what they are doing, are very knowledgeable, friendly and willing to take their time to make sure my time in Hanoi was great."}]},{"name":"Best of Vietnam for Teenagers - 9 days (including Cam Thanh)","reviews":[{"rating":"3.5","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"4.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"5.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Best of Vietnam for Teenagers 2020 - 9 days","reviews":[{"rating":"4.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"3.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"5.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"North - West Vietnam adventure 6 days 5 nights","reviews":[{"rating":"5.0","review":"We had a great time in Halong bay and Hanoi, I was disappointed with the hotel La Dolce Vita, the smell of raw sewer and the room heater was working very poorly. All and all we had a good time. I think the hotel needs to be upgraded to a better quality establishment. Thank you"},{"rating":"4.5","review":"Wonderfull sea and nature"},{"rating":"4.5","review":"Nguyen Khoa who was our guide during this vietnum tour.He is a cool guy- he did everything with patience as we were only two lady from Dhaka,Bangladesh.He made the tour comfortable & safe."}]}]