[{"name":"In Love with Vietnam - 7 Great Days","reviews":[{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"},{"rating":"5.0","review":"Doing this tour was a unforgettable decision. Had great time with our tour guide. He showed us amazing highlights in Vietnam as well as helped us with all the questions we had. Highly recommend"},{"rating":"5.0","review":"Alex is a very good tour guide! Speaks english well! Very kind! Highly recommended! "},{"rating":"5.0","review":"We were lucky to have Huy in the tour. He was friendly and informative. Highly recommend"},{"rating":"5.0","review":"We were in Hanoi for 4 days and we were in amazing hands of our tour guide Alex and he took us around and suggested us the best places to cover and sightseeing places. Everyone should really ask for Alex to be able to have an awesome time !!!"},{"rating":"5.0","review":"We had lovely moment in Vietnam. Recommend 10/10 for everybody."},{"rating":"5.0","review":"Mason is the best guide. recommend for everyone"},{"rating":"5.0","review":"There are an unforgettable moment in these countries. The tour cost was reasonable for the services. Hoang provided a lot of knowledge about Vietnam as well as his personal life. Should ask for this man for your trip !!"}]},{"name":"Vietnam at a Glance – 10 Days","reviews":[{"rating":"3.0","review":"Sadly the hotels were rather poor, and pickup from the airport and also collection from the airport were very poor indeed. If I hadn’t called I would just have been left stranded. Tour guides were nice people but their English was very limited and they were difficult to understand at times. Food on some occasions was  very poor, as agreed by other people on the tours, in particular a terrible buffet meal. I suggest that deluxe accommodation be requested which should make a difference but it won’t change the food! However there was one excellent meal in a restaurant in Hue which proved that Vietnamese food can be delicious, I suggest you choose your tour provider with great care, after some research."},{"rating":"5.0","review":"Had such an awesome time with our food tour guide Jenny who took us on a delicious journey in the old quarter. She is humorous and very accommodating with all her guests. The dessert portion of the trip was amazing, my favourite. 10/10!"},{"rating":"5.0","review":"Jane is very friendly,and take us to many interesting places.Thanks so much"},{"rating":"5.0","review":"We had a fabulous time touring around Hanoi and tried a lot of yummy food. Thank you very much to Jenny who took care of us."},{"rating":"5.0","review":"Great tour experience. Tour guide was friendly and cheerful. The transport provided was punctual and all attractions were covered. Have a great overview of the attractions that we went. Tour guide explained every attractions very detailed and clearly, have gained many insights from it. Highly recommended!"},{"rating":"5.0","review":"Overall, the trip was very well organised by Crossing Vietnam Tour and Lucy. From the moment I booked the trip, the agents were in regular contact with me to finalize visa and flights. I was greeted by the tour guide at the airport for each leg of the tour. All of the tour guides were very friendly and professional. Overall, a fantastic tour that I would definitely recommend!"},{"rating":"5.0","review":"We took a private tour in some countries. It was really interesting. The guides were knowledgeable and spoke excellent English. We were very pleased with all of the arrangements. (We particularly liked the hotels where we were taken for lunches and nice accommodations.) We highly recommend this company."},{"rating":"5.0","review":"We have just returned from an excellent 10 day tour of Vietnam organised by Dan of Crossing Vietnam Tours\nThe whole country is amazing with beautiful scenery, interesting places to go and see, busy cities, and friendly people.\nThe organisation of the tour was very professional, with every hotel, flight, tour and transit occurring exactly as scheduled, with no problems encountered.\nHighly recommended."}]},{"name":"Vietnam Vacation From Hanoi in 9 Days","reviews":[{"rating":"5.0","review":"Mahn the owner of Veitman Real Tour went above and beyond to make our trip totally amazing.  If you are wanting to travel to Vietnam do not go past this company. Wonderful exceptional outstanding!!"},{"rating":"4.0","review":"Trip is nice but weather is hot\nRight on time but do not send back to hotel directly otherwise it is still pleasant"}]},{"name":"Private tour: 5-day Explore Hanoi - Hoa Lu - Halong highlights","reviews":[{"rating":"5.0","review":"Alex did his great job. He guided our group to different places. Halong bay was the best destination and we were able to discover natural caves as well as kayaking. His neutral accent in english was the best level. Make sure you have Alex as the guide for your trip in Vietnam. \nKudos Crossing Vietnam Tour and Alex!"},{"rating":"5.0","review":"This was a fantastic experience with Alex who took care of everything for us. We had to modify a couples days to fit our plan and Crossing Vietnam Tour was more than happy to accommodate. Hoa lu and Halong bay are super lovely and we had a tour guide who can speak two languages. Highly recommend!"},{"rating":"5.0","review":"Crossing Vietnam Tour arranged us 5 days vacation in Vietnam. Our tour guide was Alex who looked after us the entire voyage. The company is always available online for every question we had"},{"rating":"5.0","review":"Traveling to Vietnam by ourselves will be too challenging. Therefore, we found this company via Tourradar with so many positive feedbacks. We booked this 5-day tour for our family of 6 persons with a best deal among the other applications. Crossing Vietnam Tour who was our host  has been organising tour in Vietnam for 10 years and they didn't disappoint us. \nWe would like to recommend this company for everybody"},{"rating":"5.0","review":"We found this company on Tourradar as a recommendation from a friend. The accommodations and services arranged by the company were so clean and comfortable. The landscape was magnificent from the rowing boat. \nDefinitely recommend to everybody"},{"rating":"5.0","review":"We booked a private tour in Vietnam for 5 days. All services and accommodations were thoroughly arranged by the company. We impressed Hanoi old quarter the most because of not only lifestyle but also amazing street food with the egg coffee. Hoa Lu and Halong bay were naturally magnificent and tourists can look forwarding to experiencing plenty of activities. Highly recommend"},{"rating":"5.0","review":"We were recommended this company from my friends and we chose private tour to have more privacy for our vacation. We were wonderfully looked after by Crossing vietnam tour. Hanoi city and local food tour delighted us with so many unforgettable experience, our guide Alex was informative and he brought us to 6 different hole-in-the-wall eateries to try amazing food. Halong and Ninh binh were fantastic as well. \nI would definitely recommend this private tour with Crossing Vietnam."}]},{"name":"Amazing Vietnam 10 Days 9 Nights Tour From North Central To South","reviews":[{"rating":"4.0","review":"Well organized.\nIf you are in Hanoi and you're looking for a tour to amazing place...so a tour to Halong bay is best choice for you.\nVery well organised by Vietnam Travel Top and I think we had the best guide.\nDavid, our guide, was friendly. He shared many details about where our van was passing through that made the almost 3-hour trip bearable.\nThe food on our Halong Bay trip was excellent. The tour itself was well-organized and David was a great tour guide."},{"rating":"5.0","review":"Great experience in Halong bay.\nWe booked this package with Vietnam Travel Top departure from Hanoi.\nMy bookings with Mr Daniel was well planned and organized.\nThe tour guide are very good. He was very informative and helpful as well. He helped us to solved our problem very fast as our deck in the cruise was leaking. We spent great time in knowing the history of Halong bay, tasting authentic Vietnam food in the cruise. We are appreciated and enjoying the tour. The kayaking in the sea with our tour guide was certainly an unforgettable experience for us."},{"rating":"5.0","review":"This was a great trip for my mom and I! It’s a series of individual tours set up by Vietnam Travel Top, not a 10 day tour with the same guide or group of people. We liked this format as everything from accommodations to transportation to tours to most meals were already accounted for. But it also allowed us to have our own free time and not be on a 100% scheduled trip the entire time. All of our guides at each place were wonderful! The only place we didn’t particularly care for was our hotel in Ho Chi Minh. It was fine overall, but we had A/C problems and a couple other minor issues. Otherwise, all the accommodations were great!\n\nLeon and Steven were both very communicative and easy to get a hold of when we had questions about pick-up times, etc. The only recommendation I would make is if they could give a printed itinerary at the beginning of the trip with pick-up times and names of accommodations, as it’s not exact compared to the sample itinerary posted on TourRadar. That being said, I understand that that may not be possible as each individual tour company may not confirm times until the day before. \n\nOverall we had a wonderful trip and really enjoyed meeting all the various guides and drivers."},{"rating":"5.0","review":"We had a great experience in Vietnam and can highly recommend Vietnam Travel Top for all tour needs in Vietnam. All good from the start until the end. They looked after everything, including some upgrades. Everything ran smoothly, the quality of all the day tours was fantastic. John from Vietnam Travel Top was very helpful and response very fast in answering our queries via emails. The staff are very friendly, helpful and knowledgeable. All tours are well organized and informative. All hotels we have booked in are great.\nThank you John and vietnam travel top for making our holiday so much fun and the most perfect short getaway."},{"rating":"5.0","review":"Thank you Leon for your help and prompt organizational skills, we had a fantastic time in Vietnam. We were very happy with all arrangements. He maintained almost daily contact with us while we were in Vietnam,ensuring that we were satisfied with all aspects of our holiday. All so well organized! Halong Bay tours exceeded our expectations. We do recommend flying instead of taking the train from Hanoi to Hoi An. We will definitely be using them again when I return to Vietnam."},{"rating":"5.0","review":"We traveled through North to South of Vietnam through Vietnam Travel Top, and I was very satisfied by the excellent customer service that they provided. From the moment i sent my first email to Vietnam Travel  Top to my return home this company and staff were absolutely amazing. We corresponded with Leon, and he was so attentive and friendly and lovely, such a pleasure to deal with! He was very accommodating and did the best she could to make sure we had a good holiday.\nI would absolutely recommend this company to anyone planning a Vietnam trip."}]},{"name":"Short Northern Vietnam packages 6Days/5nights","reviews":[{"rating":"5.0","review":"This was a very well organised tour which covered Sapa trekking (overnight train was quite comfortable) and overnight in Ha Long Bay on the boat. I was upgraded to a single room on the boat (having booked twin share) at no extra charge since there were enough rooms on board, which was great. \n\nAccommodation was comfortable and in a good location (Hanoi A1 Hotel in Old Quarter), and Sapa was Holiday Sapa Hotel, where pick up/drop off was. \n\nThe itinerary was organised well, with Cathy (main contact organiser of the tour) having done a wonderful job ensuring everything on the trip went smoothly. She was easily contactable via whatsapp and email, and ensured the drivers knew when and where for pick up. There was a bit of confusion with breakfast at one of the hotels with the reception staff unaware that the meal was covered by the tour already, however Cathy prompty contacted the hotel and ensured I got refund back. It was very helpful to have Cathy as the main contact person, so overall very satisfied and happy with this tour for the Northern Vietnam experience!"}]},{"name":"Hanoi, Halong & Sapa - 6 Days","reviews":[{"rating":"5.0","review":"Been back a week now from a fantastic trip to Vietnam all organised by Hanoian Travel Service. We went for Sapa and Halong Bay tour – 6 days 5 nights.\nPeter - who couldn’t have done anymore for me, he tailor made my tour for me with my input and suggestions and kept me up to speed all the way with email and whatsapp and always took my calls personally without fail. They provided us the exact tour we requested. We actually received more than we expected. The price of the tour was reasonable. Peter was always in contact prior to arrival with any questions or changes we requested. The guides were extremely knowledgeable. Sometimes there were communication issues but nothing that would cause problems with the tour. During the tour Peter was always available if there were any questions. We had a wonderful time and would definitely utilize Hanoian Travel Service for any future travel in Vietnam. If your thinking of a trip you should definitely consider using Hanoian Travel Service."}]},{"name":"Adventures from Hanoi to Hoi An 7 days 6 nights","reviews":[{"rating":"5.0","review":"We had an amazing time! Would definitely go back with this company and recommend to all my friends"}]}]