[{"name":"Hanoi - Sapa Highlight Package Tour in 7 Days","reviews":[{"rating":"5.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.5","review":"Best wishes to LVP Travel\nthanks for helps and services\nkind regards"},{"rating":"4.5","review":"Great Trip in Vietnam !\nLove all people of LVP Group and Excellent Guide for a week in North of Vn\nsincerely"}]},{"name":"Northern Vietnam Tour to Hanoi, Halong Bay and Sapa","reviews":[{"rating":"5.0","review":"Fantastic Experience!\nI just came back from a short 8-day trip from Northern Vietnam, covering Sapa and Halong Bay. Due to my short time there i contacted DNQ Travel assist in organizing tours, transportation and accommodation in advance of my arrival.\nMrs Tam Nguyen was very helpful in providing advice and options on my trip.\nFrom arrival to final departure i was met by a local guide, who ensured travel/tour/accommodation arrangements ran smoothly.\nIn Hanoi i also Tam in person who took the time to come to meet me and show me around Hanoi while I waited for my overnight train to Sapa!\nDuring the tour, when i had a query Tam was always quick to respond.\nDue to my short time there, DNQs ensured my tours covered the major highlights of Sapa and Halong Bay.\nI found DNQs price to be very reasonable and competitive.\nI was very impressed with DNQ Travel and will gladly recommend them to friends or fellow travellers."},{"rating":"5.0","review":"Just amazing sightseeing trip to Hanoi, Halong bay, Sapa & Luang Prabang!!\nWe're a group of 8 people (4 senior couples) returning home last week after spending 12 days in both Northern Vietnam. We were highly recommended to DNQ TRAVEL by some of our friends who toured with them before. Quickly Mr Dong handled our request by sending us a very well-customized trip combining highlights of Hanoi, Sapa, Halong and exactly this proposal covered up almost the places that we wanted to see. The price for the trip was quite reasonable with the category of hotel that we chose (we sorted out hotels on our own) and we all came to a final decision so promptly after 2-hour discussion. Our guide - Hoan picked us up at Noi bai airport is so good-looking and speaking great English. He presented himself as a very professional guide when showing us almost small details relating to our trip and all other things about the traffic, foods, security ... in Hanoi and he was also very patient & enthusiastic to guide us to visit some famous travel sites in Hanoi. Our guide in Sapa was also very friendly & well-trained when showing us an easy trekking track to village. We were also very impressed with the Maya cruise in Halong bay that Mr, Dong upgraded.\nCan not tell enough precious moments & sweet memories that we had but surely we'll come back those mysterious lands again."}]},{"name":"8 Days Discover North Of Vietnam","reviews":[{"rating":"5.0","review":"Great!!! Day bus trip to Hoa Lu Tam Coc was fantastic. I loved getting out of the city for a day for some activity in the countryside. The tour has a little bit of everything: a historic walk through temples from different Vietnamese dynasties, a boat ride on a river through the mountains and a bike ride through the rice paddies. We had great opportunities to see everything we wanted at both locations.\nSapa is a also very beautiful, walking to see the beautiful mountains and \nterraces. We had great experiences with this tour."},{"rating":"5.0","review":"We had a wonderful experience with Vietnam Travel Top. They organised a very pleasant and memorable tour around and provided us with well informed guides throughout the tour. The staffs were very friendly, helpful and their arrangement was very systematic. We spent our holidays happily because of them.\nWe'd definitely travel with them again."}]},{"name":"Vietnam Specifically the North","reviews":[{"rating":"5.0","review":"We tried to book a 8 days trekking tour in \"rainy season\" August. Many competitors didn't want to talk about and most of them failed by standards 2 or 3 days trekking. We put our requests and only Threeland Travel met our needs. We used to trek in Vietnam with another company but this time we challenge them and we have a good surprise with Threeland Travel.\nWe were 2 guys with a guide translating M Cuong (very good English), local guide M Viet (expert of the jungle and minority villages in this area), M Son (porter & a marvellous cook, we would die to taste again his special fish dishes) trekking in Pu Luong natural reserve (border of Hoa Binh area) for 8 days and 7 nights. One of our best trek.\nWe had a farewell dinner offered by David (Tour Consultant of Threeland) at a Westlake restaurant in Hanoi and we met his nice team (mostly ladies) and had a good time together before heading for Hué.\nWe recommend this company if you need an exclusive service and be comfortable with skilled and nice people. I'm sure they should be excellent for standard tour in Vietnam Cambodia, Laos and Myanmar.\nBut definitely I would recommend for exclusive and dedicated services.\nAnd the price regarding the quality is very good."}]},{"name":"10 Days Vietnam Natural Sites Package","reviews":[{"rating":"5.0","review":"Fantastic company. Recommended!\nWe spent 2 weeks in Vietnam and pretty much used Vietnam Travel Top for all of our day tours. They organised our entire 10 day stay in Vietnam, traveling from North to South.\nThe tours were of a uniformly high standard, the inclusions were all as advertised, the accommodation was excellent for the price.\nI would absolutely recommend this company to others. They were well organised, reliable and flexible, allowing us to make changes.\nwe would use Halong Bay tours again without hesitation."},{"rating":"5.0","review":"Highly Recommended\nWe had the delightful experience of booking my Vietnam day tours through Vietnam Travel Top.\nOur tour organiser Leon could not have been more helpful, very easy to deal with and answered all our queries prior to our arrival.\nWe were so impressed by his professionalism and he made sure every detail was perfect for what we wanted.\nI was able to telephone them directly and Email them with any questions or problems that needed attention.\nOur tours and guides were a delight, with everything going according to plan.\nWill definitely be booking with Vietnam Travel Top on our next trip to Vietnam."}]},{"name":"Vietnam Southern Tour in Focus from Saigon to Mekong Delta, Nha Trang and Da Lat","reviews":[{"rating":"5.0","review":"My wife and I have recently booked with Vietlong  travel for our 8 days tour in Southern Vietnam. We have found them on TripAdvisor at high ranking & read many positive feedbacks about them then deciding to email them just a week in advance and told them most places we would like to visit and we got a responses and confirmation the next day. We were very impressed with incredible fast and excellent customer services.\n\nOur tour was perfect and we both enjoyed it very much & all people are very helpful. We highly recommend Vietlong to all visitors. Will come back soonest!\n\nHighlights: We totally discover all sightseeing in South Vietnam & witnessed beautiful beaches there, which it’s over our expectations"},{"rating":"5.0","review":"We booked the 8 day tour of HCM city and the Mekong Delta Nha Trang and Da Lat Our guides and driver were excellent and kept the attention of my 10 and 15 year old boys throughout the tour. VietLong Travel organised our tour and responded well to a few changes I requested.All went smoothly. A very interesting experience"}]},{"name":"Low Budget Vietnam Tour from Hanoi, Halong Bay to Da Nang, Hoi An, Saigon","reviews":[{"rating":"5.0","review":"My friends and I arranged our Vietnam holiday with Vietlong travel some months ago. They were very well-organized and responded to our inquiries very fast. I can't say enough good things about All our guides, drivers & hotel staffs – very helpful. They were always on time, polite and informative. They always made sure our experience was what we wanted and the best it can be.  We highly recommend!"},{"rating":"5.0","review":"Loved every minute of the holiday. Love the foods provided. Standard throughout has been very good and all staff have been extremely helpful and attentive, always polite and cautious. A great variety of experience in each city. Well done to VietLong Team for organising everything. Special thanks to Ms Loan for her patience!"}]}]