[{"name":"Vietnam Scenic Tour from Hanoi, Halong Bay via Hoi An to Saigon, Mekong Delta","reviews":[{"rating":"5.0","review":"Really great professionality\nI would like to give our positive comment to the DNQ travel agency for the very professional way they help and feedback to us. They are really well prepared and able to manage our requests. Unfortunately, after having planned in all the details of our trip to Cambodia and Vietnam, due to coronavirus, we decided to cancel it. Anyway, DNQ Travel did their best to give us back at least a part of the money we already paid, it was not in charge to them and we really appreciated it.\nWe suggest this travel agency and we will ask for them next time we will have to plan a trip to Far East. Thanks!\nKristi and friends"}]},{"name":"Classic Vietnam 21 days 20 nights","reviews":[{"rating":"5.0","review":"Booking this tour was the best decision I could have made! From the confirmation email with Mr Linh's Adventures, to the post-tour follow up, everything went smoothly and was well-organised. The itinerary was ideal to discover the whole country over three weeks, with Halong Bay (obviously!) and terraced rice fields in the North, to the charms of Central Vietnam and its beaches, and finish with the buzzling South with the Mekong Delta and its floating markets. \nWe really had a great in-depth discovery, meeting with the local ethnic communities, and learning about the many different groups. \nOur guide Loi was great, he knew how to captivate us with the history of Vietnam, and always had a good joke! \nThank you all for everything and offering us the best trip we have ever been on! We highly recommend Mr Linh's Adventures!"}]},{"name":"Vietnam Vacation Package - 16 Days","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Mekong Delta 3 days/2 nights From Saigon","reviews":[{"rating":"4.5","review":"it is good tour but I prefer better lunch"},{"rating":"5.0","review":"Some things listed on the itinerary were incorrect. Said that entry to museum and train ride was included, but I had to pay for both. Also said hotel drop off was included but on the second day I was dropped off in the city and had to find my own way back to the hotel at my own expense! I’m sure the same thing would’ve happened on the third day too had it not been for me saying something to my guide. He then put me on a return trip with another group that dropped me at my hotel"}]},{"name":"Hanoi - Hoa Lư Tam Cốc - Halong Bay 4 Days 3 Nights","reviews":[{"rating":"4.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.0","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"4.5","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]}]