[{"name":"Full Moon Festival, Hoi An - 10 days","reviews":[{"rating":"4.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"4.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"4.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Highlights of Vietnam - Private Tour","reviews":[{"rating":"4.0","review":"The tour promised to be what they advertised - (less the whole world closing down due to the corona virus of course!) hotels were great, breakfast buffets , food was delicious, sightseeing and tour guide Doan was amazing ! shame it was cut short due by a week, but Doan our tour guide gratefully organised our remainder of the weeks travelling and accommodation in Vietnam which was much appreciated so we managed to get another week of Vietnam in, but not Cambodia unfortunately. Tour radar were brilliant in that I got the pro rata refund for the tour in no time so overall very impressed !"},{"rating":"4.5","review":"I went during the Coronavirus outbreak and I have to say Vietnam was on top of it. Mandatory temperature checks, hand...\nShow more"},{"rating":"5.0","review":"Easy (and to some moderate at times) paced walking trip that covers so many different areas of Vietnam. A good...\nShow more"}]},{"name":"6-Day Best of Northern Vietnam: Hanoi - Ninh Binh - Halong Bay","reviews":[{"rating":"4.0","review":"It was one of the best part of our trip in Vietnam. We went in Ba Be Lake for kayaking and meet Tay people. It was a magical moment. The homestay was basic and comfortable. The owner were very friendly and welcoming. And then, we went in Ban Gioc area and we again feel we were in remote areas, very authentic. Ban Gioc Waterfall was amazing. Then we headed to Ha Giang - an amazing remote area with culture, local people and spectacular landscape. I could say Ha Giang is highlight of this trip - dont miss it!. Finally, we spent time in Sapa for a short trekking tour and relax. Viet - the man who contacted and took care us during our trip - was very helpfull and profestional. He almost contacted you daily to make sure everything is ok. I would highly recommend this trip!"},{"rating":"4.5","review":"The service was really good! Viet is kind and gives service in reasonable price :) Also he takes care about the tour not only just broker [Original Text] 다른 이상한 투어업체는 말이 죠낸 많던데 여기는 말이 안 많아서 좋았고 카카오톡으로 연락도 가능해서 예약이나 질문하기에 편했음 그리고 7시까지 투어하고 그 이후로는 식당이니까 꼭 7시 전에 가세용"}]},{"name":"Vietnamese Artist Experience","reviews":[{"rating":"4.5","review":"I had a great time. The cycling tour in Vietnam was very well organized and conducted. Our guide was knowledgeable, friendly and personal. The crew were very helpful. They all made the trip enjoyable. The only comment is that Tour radar describes the experience, if I remember right, that it is appropriate for any level but it could actually be challenging for older or less fit persons. That being said, electric supported bikes were made available to a couple bikers otherwise they may have had difficulty keeping up."}]},{"name":"North Vietnam bird watching tour 6 days/ 5 nights","reviews":[{"rating":"4.5","review":"We had a great time in Halong bay and Hanoi, I was disappointed with the hotel La Dolce Vita, the smell of raw sewer and the room heater was working very poorly. All and all we had a good time. I think the hotel needs to be upgraded to a better quality establishment. Thank you"},{"rating":"4.5","review":"Wonderfull sea and nature"},{"rating":"4.5","review":"Nguyen Khoa who was our guide during this vietnum tour.He is a cool guy- he did everything with patience as we were only two lady from Dhaka,Bangladesh.He made the tour comfortable & safe."}]},{"name":"Family Discover Vietnam - Private Tour","reviews":[{"rating":"4.0","review":"The tour promised to be what they advertised - (less the whole world closing down due to the corona virus of course!) hotels were great, breakfast buffets , food was delicious, sightseeing and tour guide Doan was amazing ! shame it was cut short due by a week, but Doan our tour guide gratefully organised our remainder of the weeks travelling and accommodation in Vietnam which was much appreciated so we managed to get another week of Vietnam in, but not Cambodia unfortunately. Tour radar were brilliant in that I got the pro rata refund for the tour in no time so overall very impressed !"},{"rating":"4.5","review":"I went during the Coronavirus outbreak and I have to say Vietnam was on top of it. Mandatory temperature checks, hand...\nShow more"},{"rating":"4.0","review":"Easy (and to some moderate at times) paced walking trip that covers so many different areas of Vietnam. A good...\nShow more"}]}]