[{"name":"Best of Northern Vietnam 6 days","reviews":[{"rating":"4.5","review":"Thank you so much for everything you did to make our honeymoon great, we had an amazing 3 weeks! I left a Trip Advisor review for BestPrice and called you out, and I'm attaching the feedback form here. We enjoyed all the wonderful places and were very pleased with all the accommodations and how smoothly all the transportations went."}]},{"name":"Classic Viet Nam 10 Days 9 Nights (Ha Noi, Ha Long, Sai Gon and Mekong Delta)","reviews":[{"rating":"4.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"4.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Legends of Northern Vietnam - Sapa/Halong Bay/ CoTo Island","reviews":[{"rating":"4.5","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]},{"name":"Sapa Hard Trekking for 5 days 4 nights","reviews":[{"rating":"4.5","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.5","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Saving Amazing Moments Vietnam Trip - 15 days","reviews":[{"rating":"5.0","review":"After speaking to the fantastic Ashley i have a trip outline sorted after 2 emails and had the whole thing booked within 1 week of connection. Ashley provided inspiration and ideas where needed and also answered my never-ending list questions virtually instantly and in detail over email every single time! She made a process which is often tedious and complicated into one which was actually enjoyable!"}]},{"name":"AMAZING VIETNAM IN 5 DAYS 4 NIGHTS","reviews":[{"rating":"4.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.5","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"4.5","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]},{"name":"Vietnam At A Galance 9 Days ( Sai Gon, Hoi An, Hue City, Ha Noi, Ha Long Bay)","reviews":[{"rating":"4.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Vietnam Tour Package 10 Days 9 Nights - Hanoi and Ho Chi Minh City","reviews":[{"rating":"3.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"3.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"5.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"VNA010 - 9days Glimpse of Vietnam","reviews":[{"rating":"4.5","review":"Great tour covering all the important sights, culture and food. The guides in Ho Chi Min were excellent. There were a few glitches along the way but Lily from Your Vietnam always apologised and resolved everything quickly. I would highly recommend this tour."},{"rating":"5.0","review":"The tour exceeded our expectations! From start to finish everything was planned expertly and never missed a beat, all the tour guides and companies they chose were excellent and made the experience that much better. Hotels were also excellent and provided amazing customer service! Highly recommend."}]}]