[{"name":"Vietnam Express Southbound","reviews":[{"rating":"5.0","review":"Enjoyed the tour immensely! Was a mix of activities and free time.  Loved the authentic meal experiences."},{"rating":"5.0","review":"A great tour. Our guide Cuong (Kevin) was truly excellent - he made our tour the excellent experience it was.\nThe overnight train journey was an experience!\nThe only thing that could be improved was the boat at Halong Bay...it was a bit basic.\nOverall  good value for money."},{"rating":"5.0","review":"Great tour, excellent support. Fantastic tour leader and driver"},{"rating":"5.0","review":"Very much enjoyed. I feel that navigating Vietnam without the tour would have been next to impossible in the things we did."},{"rating":"5.0","review":"Really good. Loved the night in Hoi An with the cool shirts. Loved the coocking class"},{"rating":"5.0","review":"had a great time in vietnam, was a great experience,duc was an excellent tour guide, learnt lots about vietnam, its history, culture and his recomendations for restaurants and places to go on our freetime were first class, also good fun to be with."},{"rating":"5.0","review":"Excellent trip and Thành, our tour guide was outstanding.  He give us lots of information and was very funny."},{"rating":"4.5","review":"the whole trip was perfectly orgsnized, our guide was very careing\n we visited wonderful destinations"},{"rating":"5.0","review":"Very interesting tour, everything worked perfectly and the Toir Guide Khoa was incredible"},{"rating":"4.5","review":"Excellent tour leader. Good mixture of activities and free time."},{"rating":"4.8","review":"Excellent tour guide, great group, wonderful country"},{"rating":"4.8","review":"Trip was almost exactly as advertised, with no surprises. So we got exactly what we have shopped for. Everything was very clearly and openly communicated. That said, our guide went above and beyond to make the experience even better."},{"rating":"5.0","review":"The trip was very well organized, and we saw places and did things that we could not have found by doing it ourselves. The tour leader, Charlie, spoke English well, and was always happy cheerful and helpful. The group was a mix of people and most of us got on very well together."},{"rating":"5.0","review":"Amazing trip, amazing guide everything was perfect"},{"rating":"4.8","review":"Well thought out itinerary, excellent guide, great accommodations, good group of travelers."},{"rating":"4.8","review":"I had an amazing time, where everything ran incredibly smoothly. Our group leader NghinhNghiem was passionate about his country and job, always one step ahead, making sure we could experience the best of Vietnam."},{"rating":"5.0","review":"The layout of the tour was excellent allowing me to see an enormous amount of Vietnam, the knowledge of the tour leader and the optional tours were excellent"},{"rating":"5.0","review":"Fantastic trip from start to finish, prepare to be amazed."},{"rating":"4.5","review":"Lilly made the tour."},{"rating":"4.5","review":"10 days flew by! I loved the range of activities on the itinerary."},{"rating":"4.5","review":"The whole experience was great, the train overnight wasn't the best.  However; it did not spoil the trip for my husband & me."},{"rating":"4.5","review":"Loved the tour..last hotel was a let down. The itinerary is out of date for the last hotel .  I booked the wrong hotel and had to move for the extra night I booked..\nOverall the tour was amazing"},{"rating":"4.5","review":"One of the highlights of the trip was the rural bike ride near Hoi An.  We not only got to see rice being harvested but got to see a very different view of Vietnam than in the cities.  Especially enjoyed making and eating noodles, seeing rice wine made and reed mats being woven."},{"rating":"5.0","review":"Great tour. Relatively short but covers a lot. Would highly recommend."},{"rating":"5.0","review":"As always, a fantastic tour, perfect guide and great itinerary"},{"rating":"5.0","review":"What a fabulous trip! Our tour leader Thao was amazing; he was very accommodating and thoughtful and kind all rolled into one! The itinerary included just the right amount of organised sightseeing and free time. I would thoroughly recommend this trip to those wanting a taste of Vietnam."},{"rating":"5.0","review":"The itinerary was perfect for a 10 day tour—a good overview of the country at a good pace. We had enough free time if we wanted it, but we really enjoyed doing things with our group!  Our guide, Charlie, typically does foodie tours, so we had excellent meals, especially when we followed his recommendations. \n\nWe had a few minor disappointments.  A couple of the restaurants had slow and erratic service (meals coming out at different times so some people had to wait while others ate.) This may be an expectation that is based on what we get at home, so I don’t want to blame the tour company for that. A few times we were advised that we could use credit cards when, in fact, the business only took cash. \n\nApart from the minor things mentioned, it was a really fantastic vacation!  Charlie was quite entertaining, and it was great to experience Vietnam with him.  I recommend doing as many of the optional activities as possible.  The tour by motorcycle was so much fun—definitely a highlight.  Bicycling through the city streets and countryside was also amazing, especially when going through rice paddies. Cyclo tours, tuk tuk tours, boating in the Mekong delta, and celebrating New Year’s in Hoi An are all wonderful memories.  This was our first organized tour after many overseas trips on our own, so we were not sure if we’d like it.  After experiencing this tour, I highly recommended it!"},{"rating":"4.0","review":"Great guide Lan was fun informative & helpful - I cant remember his surname\nNorth to South was great but will go back to Hao Long bay & sail a few days longer- will return to Vietnam & intrepid"},{"rating":"4.5","review":"I had a wonderful time on the tour. Anh was an awesome guide...very knowledgeable, helpful, and fun. The only complaint I really have is I would have preferred more of the optional activities to be included in the tour price. I feel like it would make for a smoother experience to not have to constantly be paying for things throughout the trip. Other than that, I really loved the trip and highly recommend it."},{"rating":"4.0","review":"Great tour: highlights HalongBay, train to Hue, Hoi An and the Mekong Delta day.  Hotels all very well appointed:  Last hotel in HCMC unfortunately did not have a bar or restaurant (open evenings) onsite for guests to gather. Interesting aspect of Vietnamese culture, history and food. Found HCMC vibrant and bustling but also quite polluted.  Interesting optional activities via Urban Adventures (check them out....some great stuff not to be missed).  Chance to sample the food and explore off the beaten track places."},{"rating":"5.0","review":"The tour was professionally led from the first day. Truong put everyone sat ease explaining the tour in detail it pointing out all the opportunities and recommendations that people may want to try along the way."},{"rating":"4.5","review":"Truong(Mr. T) was a great tour guide.   He made sure everyone was comfortable and was knowledgeable about the culture and history of Vietnam. Enjoyed mostly Ha Long Bay and Hoi An. Great to tour from North to South and learn the culture and history of Vietnam."},{"rating":"4.5","review":"The tour was great. My guide Nhung was really informative and she helped me find a driver when I wanted to book a personal day trip to Bana Hills on our day off. My only complaint was that we didn't get to spend enough time at Hanoi and Ho Chi Minh while on the tour. I would advise arriving a day early before the start of the tour and extending your stay at the end by a day or 2, just to give yourself time to really experience these cities"},{"rating":"5.0","review":"Tuyen our tour guide was awesome, his help and knowledge beat all my expectations of this trip. Our last hotel was a big let down but over all i can't fault the rest of my time in Vietnam. The place and the people will stay with me for years to come. Tuyen and my friends in the group have made this a trip of a lifetime. Thank you Vietnam."},{"rating":"5.0","review":"Great trip. Our guide Tuyen was beyond helpful during the entire trip. Very thoughtful and made everything run seamlessly. Great itinerary too - being able to see north to south Vietnam - nothing felt too rushed. I do recommend going to Hanoi a day earlier then the trip and staying in HCMC a day after."},{"rating":"5.0","review":"Trying was so funny and informative,  he made us feel welcome in his country and his love of everthing"},{"rating":"5.0","review":"I spent a month travelling around Thailand and Vietnam but this tour was the highlight for me because I learned and did so much. We got to experience things on a local level like eating dinner with a local family and cycling in the countryside by the rice fields. We would never have known about or done these things if we didn't join this tour. Our tour guide Sonle was amazing. He knew so much and shared his knowledge with us all. He was enthusiastic and good natured and made the whole trip very memorable. I could not fault him.  I'm so glad i did the tour as now i have a keen interest in Vietnam and the culture and I hope to definitely return."}]},{"name":"Vietnam Intro - 9 Day","reviews":[{"rating":"5.0","review":"My tour of Vietnam with Intro was beyond anything I could have imagined. Everything was so well thought out and organised down to the finest details and this made the trip so much more enjoyable. The locations were all amazing.  After each day, I’d be thinking wow, it doesn’t get better than this, and then the following day would be even better again. I would do this tour again if I could and will definitely book my next tour with Intro. The guide I had, Brad, had a real connection with the culture and passion for Vietnam, which made the tour that extra bit special. He was super organised, incredibly approachable and full of energy all the time. Every question was answered and any enquiry was well assisted. I truly couldn’t rate this experience any higher. One of the highlights of my life. Made some lifelong friends and have memories I’ll cherish forever!"},{"rating":"5.0","review":"Would definitely recommend the Vietnam Intro trip for someone just starting out travelling. Very well organised and loads of fun. My tour guide, Adrian, was amazing, very enthusiastic and helpful."},{"rating":"5.0","review":"I had an amazing time here, one of the best trips of my life"},{"rating":"5.0","review":"I had the most incredible memorable time on my vietnam trip! Not just the awesome fun packed itinerary but the ease of the whole trip running so smoothly, I felt privileged having Sam as our tour guide was an absolute pleasure, he works with such a positive, energetic, calm attitude. Explaining activities, arrangements and looking after each member of the group individually.  I was lucky we had such a brilliant group of people who I can now call my friends. The activities thoughout were perfect with the jam packed days to following chill days. \nI'm super happy with my intro travel and am already planning my next adventure.\n I cannot comend Sam enough what a great group leader! \n\nThank you intro for the experience"},{"rating":"5.0","review":"The intro travel group totally exceeded our expectations! Our group leader was knowledgeable, insightful, and a blast to be around. He formed personal relationships with each of the tourists in the group and was great at uniting the group when together. There were so many bucket list type of activities that created memories for a lifetime and my husband and I met so many amazing people from around the world. I can truly say I feel like I have experienced every facet of Vietnam through intro travel!"},{"rating":"5.0","review":"Have loved everything about my trip. Ha long bay and freedom island are something special as is hoi an. A great mix of group activities and free time."},{"rating":"5.0","review":"Absolutely loved Vietnam intro! Tour leader Brad was brilliant. It had the right balance of group involvement and down time. Halong bay and the island was the best days of the trip followed by the day in Ninh bin! Would recommend and will be booking more intro tours! X"},{"rating":"5.0","review":"Had a great time on this tour, we had Sam Davey as our group leader, he was great and very knowledgeable about Vietnam, he answered any questions we had. This is my 2nd intro tour and was consistent with the Thailand tour. The boat and private island were the highlight. Could improve activities whilst as the bungalows. The tour went very quickly and wish I was doing the 12 days"},{"rating":"5.0","review":"Sam was a great tour leader and provided great knowledge of the areas whilst always keeping great energy and positive vibes. Could have some more info provided throughout the day like you get on the walking tour in Hanoi but other than that Sam did a great job."},{"rating":"5.0","review":"I had a great time on the Vietnam intro tour, we had sam davey as our leader and he was great! Funny, helpful and a good leader, made sure everyone was okay and he oraganised everything well, it was a nice chill& relaxed group."},{"rating":"4.0","review":"Good trip leader. Fun and outgoing"},{"rating":"5.0","review":"The tour was very well done! Logistics were organized and the accommodations provided an excellent cultural experience. James Greggory was absolutely fabulous! Knowledgeable and fun, he made everyone feel comfortable and be sure to have a great time, while being prepared before every event. Can’t recommend enough!"},{"rating":"4.5","review":"Simply put the trip was wonderful. Im sure there is more to Vietnam than the 9 days, but if there is a person who could do more in that time, then they must be an insomniac. The only regret, not going for the 12 days! \n\nFirstly, and most importantly, I want to say a huge thank you to Sam for making this trip the way it did. Sam went above and beyond any expectation I could have had in leading the tour. As we jokingly recalled later in the trip, my negligence had left him stray at the airport for 2 hours even before the journey began! Beneath it shows the caring side of a person willing to give up so much of their time just to make sure everything was fine. It can't have been easy to manage a group of 20+. When I left the trip, there had not been a single issue between any of us and though some things may have been a little different, ultimately, I have realised that making new friends and exploring a country well are my objectives well fulfilled here. So much of this is down to the way it was all managed. \n\nSome secondary notes to that, as a vegetarian I was a little anxious on meals out here. However I felt well catered for throughnout the trip and although a couple of days the food is repeated that's no different to how it may be in London for me. The trip does have a lot of travelling inbetween it, so if you want to drink and my word did we (this is optional) then be prepared to be have a rough journey or two. Again completely self inflicted. Vietnamese people are lovely and seem as keen on travellers having a great time and again this only tops off what was a superb holiday. \n\nIve been lucky enough to do a few of these tours and whilst they have been enjoyable, this and a previous trip to NZ were incredible. Their endeavour into making this trip not only honest in showing the country but to make sure they squeeze every bit of fun they can from the journey is why I wanted to say more than just \"thank you\". \n\nThank you,"},{"rating":"5.0","review":"This tour was amazing from start to finish. It was filled with excellent activities at every stop, but still allowed lots of free time at each place visited. Our guide Bradley was excellent in providing an enjoyable and stress free visit to Vietnam."},{"rating":"5.0","review":"We were very impressed with this tour overall. We didn't know what to expect, this was our first trip to Asia. But we felt we had a great tour of Vietnam and there was so much to do and see and completely stress free. It has a great mix of free time and group activities. We enjoyed that the tour accommodated for everyone and was so much fun. The information leading up to the event was clear and fantastic. Brad was excellent! This made us want to do more intro trips."},{"rating":"4.5","review":"Great tour guide, great pace of the tour and expectations were well over achieved"},{"rating":"5.0","review":"Sam is absolutely great! He is very knowledgeable, fun and adventurous. He was really sweet by remembering my birthday and actually celebrating it with people in the group. I would definitely love to have him as a tour guide again, the best so far! :) keep up the good work, Sam."},{"rating":"4.5","review":"This tour was an amazing. I came into the trip a bit unsure and not really knowing what to expect as I have never done anything like this before. But straight away soon as I met Sam and the rest of the group I knew it was going to be an amazing trip. Each activity has been amazing and all the different places we have been to have been surreal. I have been to places that I would of never have thought of gone to or been able to go too. I wish I had booked the 12 day one as I am genuinely gutted I am leaving. I would definitely recommend this trip to anyone that is wondering about coming over to this part of the world. Last but not least. Sam has been a great tour guide and enjoyed spending this time with him. I hope I get him to do  another tour in the future"},{"rating":"5.0","review":"Had such an amazing trip with beautiful people. Sam has been an awesome guide and he is very good to include everyone."},{"rating":"4.5","review":"Such an amazing trip. It was amazing having everything planned for us. Sam really helped glue the tour group together. It was such a relief to not have to stress over a vacation especially one that was so jam packed with activities."},{"rating":"4.5","review":"Really good tour great experience recommend for everyone cheers"},{"rating":"4.5","review":"Such an awesome experience and very informative thanks to our killer guide Ben Kelly! \nHe kept the group fun and tuned in! \nAll of the activities were super fun and the nightlife was really exciting! \nCan’t wait to travel again with IntroTravel and continue my own world travel. Thanks Intro. \nWith love,\nEl coyote"},{"rating":"5.0","review":"Was an amazing tour, highly rate Brad as a tour guide, made for an amazing tour and experience. The trip had an excellent balance of activities and free time and the itinerary was amazing. Vietnam is such an amazing country and this tour was a great way to experience it. Would 100% go with intro travel again and will recommend this tour to friends and family.\n\nThanks for the amazing life experience!"},{"rating":"5.0","review":"Absolutely loved this tour and the group! Brad was a fantastic tour guide, always happy and joyful. :)"},{"rating":"5.0","review":"Fantastic tour! We were able to see the main sights as well as some off the beaten track experiences. Ninh Bình was beautiful and the homestay is brilliant. Bradd was organised, helpful and a lot of fun. Would book again!"},{"rating":"4.5","review":"Great fun! Brad was very friendly and went above and beyond to help us with any questions we had. Would recommend!"},{"rating":"5.0","review":"What an amazing tour!!! Ben was a great group leader that brought the group together and enhanced experience in so many ways.  The itinerary is amazing and it’s really hard to say what section of the trip was best given each one stood out.  From the strong cultural experience in Hanoi, to the crazy times on the Ha Long cruise/island excursion.  On top of all of this, I met some great new friends from different backgrounds that I hope to further connect with.  Pro tip, try to pack efficiently, use mosquito spray (especially in Ninh B), use free time to explore.  After this trip, I have already put down a deposit for the next trip."},{"rating":"5.0","review":"Ben was a great tour leader and would 100% recommend this tour for any solo traveler"},{"rating":"4.5","review":"Amazing tour and what a country Vietnam is. Brad has been a fantastic group leader, showing great enthusiasm and knowledge on pretty much everything. Totally recommended for someone who wants to have a quick adventure in Vietnam!"},{"rating":"4.5","review":"The overall tour was excellent and I enjoyed it thoroughly. The mix of organised activities and free time was great. Our tour guide Brad was amazing and made the tour super fun and relaxed."},{"rating":"5.0","review":"Great introduction to Vietnam. Extremely convenient and easy way to see the major cities and sights of the country. Brad was an excellent guide who made the tour a great mix of free time and planned activities. Highly recommended"},{"rating":"4.5","review":"Tour was great had a good mixture between  free time and structured activities. Brad was really knowledgeable, friendly and made the trip super easy and a lot of fun."},{"rating":"4.5","review":"This tour was absolutely amazing! It well and truely exceeded my expectations. The itinerary was fantastic, included activities were great and I enjoyed them all. Our tour leader Ben was awesome too, his experience and personality really made the trip a 10/10 experience and I couldn’t fault a single thing about him. \nThe only thing I feel I was disappointed by (only in the first 4 days of the tour) was the authenticity of the food. I would have like more authentic Vietnamese - but this could be because I simply ordered the wrong things! \nOverall anyone wanting to travel Vietnam quickly should definitely consider this tour, you won’t regret it."},{"rating":"4.5","review":"It’s a really great trip. The company did a great job planning lots of different activities. You’ll also have some free time."}]},{"name":"South to North Vietnam - 10 Days","reviews":[{"rating":"5.0","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was  BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED  June and John Riggall"},{"rating":"5.0","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly exceptional. I would recommend changing the hotel accommodation in Hanoi though as it was quite dirty and old. The Ha Long Bay cruise was also great, but we could have done with more free time. All in all I would highly recommend this tour!"},{"rating":"3.0","review":"The tour guides had very poor English - unable to understand more than basics, unable to gain true info about Vietnam and it's culture. Also, the tour is organised as a private tour rather than group tour, so the info on-line is misleading. Now and then we were meeting couple of other tourist for a day but most of the time there was just us and the tour guide we could hardly understand.\nHave I known it is a private tour with the guides I am unable to understand I would definitely choose different company.\nAll other aspects, and particularly the organisation, were excellent.\nCould you please forward the comment to Hanoi Express so they can, possibly, improve?"},{"rating":"5.0","review":"We had a fantastic time in Vietnam! Hoi An Express has prepared a very organized and enjoyable itinerary and they were very quick to reply before and during the tour. The guides were great - local and very professional. Can recommend this tour to anyone that wants a great and short experience of Vietnam. If you can try to plan a couple of nights before in HCMC and after the tour ends in Hanoi - Hoi An Express can add these extra nights to your booking on the same hotels used for the tour after you book."},{"rating":"5.0","review":"Amazing Tour and very helpful staff ! We were impressed by the kindness of Vietnamese people and also \nHoi An express staff replied immediately to our emails and hotline ..they provided a mobile hotline which was very helpful...Touristic guides were very professional and we had a wonderful time and experience ..\nWe would definetely use again and suggest and advice other people to choose this Tour operator .\nThank you again Hoi An Express."},{"rating":"4.0","review":"The travel agency, payed attention to all the logistics, that is the good thing, but some things advertised were not delivered (i.e. Floating Market in Ho Chi Ming does not exists, the cruise at Ha Long Bay hay no massage facilities or Jacuzzi, .... )"},{"rating":"3.0","review":"South to North Vietnam tour was good overall however for a few misconceptions. It was rather a private tour and we were rarely with any other travellers as it was made out to be on the tour description. Unfortunately due to the Lunar New Year holiday a lot of what we were meant to see did not happen. This was unfortunately not advised and most of the days were cut short as the guide didn't have enough to show us. The guides individually were amazing and full of knowledge! But, the circumstances with running this tour during the holiday season was poor. Accommodation at the Titan Hotel and Le Vintage hotel were below standard and should be reconsidered for future tours. This tour gave a good overview to the country but unfortunately I wouldn't recommend it again."},{"rating":"5.0","review":"The seeming chaos of traffic in HCM becomes commonplace once you experience crossing the street a couple of times.  Really enjoyed the Mekong Delta experience. Danang and Hoi and Hoi An were fun to explore food and the people. Hanoi was fun but the highlight of the trip was HaLong bay. We spent one night but wished we had stayed longer."},{"rating":"5.0","review":"HoiAn Express thought of EVERYTHING! BEST experience with a travel company EVER!"},{"rating":"4.0","review":"Service was excellent. They always picked us up on time and communicated with us the agenda. Most of the hotels were also nice. The hotel in Hanoi and Da Nang could be better. Overall would very much recommend this tour."},{"rating":"3.5","review":"Me and my husband had a 10days trip to Vietnam Hoi Ann Express and we really enjoyed it.   All the guides speak good English and they are very professional. For accommodations/transfers and tours are organised perfectly."},{"rating":"5.0","review":"We took the South to North Express tour with Hoian Express on the 26 October 2019. We upgraded to 4* Star hotels which were very comfortable, so pleased we did. \n\nAll our pickup's were punctual, & our guides were knowledgeable & friendly. \n\nWe thought the tour was value for money. The administration by agent & broker was excellent. \n\nI would recommend both companies, and wouldn't hesitate to use again."},{"rating":"3.0","review":"The tour overall was good but the communication from Hoi An Express was lacking.  It should have been made clear that there was no tour director with us and we were on our own to meet the local guides.  The hotels in Saigon and Hanoi were changed and not good to share with another person.  We had to pay for separate rooms on these occasions."},{"rating":"5.0","review":"everything went well especially thanks to the perfect assistance of Nguyen Thi Bich Nhan (Anna) who was close to us from beginning to end for everything. tour organized really well. all respected as planned. the guides were exhaustive, especially Tin, who in Da Nang gave us a lot of interesting information and was really very kind and professional. thanks to hoi han tour for this trip. really recommended!"},{"rating":"2.5","review":"This was “tour” was more like individual day tours combined to make an extended tour.\nThere was not 1 guide for the whole trip, people came and left, a mixture of different standard of hotels made people feel disjointed.\nEach individual tour was good but as an extended tour is misleading."},{"rating":"5.0","review":"Our South to North tour of Vietnam was a great experience and exceeded our expectations.\nWe thought that it represented great value for money and would recommend Hoi An Express to anyone thinking of taking a tour in Vietnam.\nThe guides were all helpful and knowledgable and watching the drivers negotiate their way through the traffic was an experience in it itself"},{"rating":"4.5","review":"Great food, great response, great transportation, great hotel at Hoi An, great Ha Long bay cruise tour. But hotels at Da Nang and Hanoi needs to be better. Double bed room to be given in cruise for couple. Itinerary at Da Nang to include marble mountain and Son Tra on day 4 and my son sanctuary on day 5 enroute to Hoi An. There is no point to come back to Da Nang on day 4 after visiting my son sanctuary. However excellent tour in totality. Professional Hoi An Express, no complaints."},{"rating":"5.0","review":"could not fault tourradar trip.we will be booking another soon thank you sharon and kelly"},{"rating":"4.5","review":"Well organised tour with committed representatives. Lots of details covered like mineral water availability, toilet stops and local knowledge and cultural differences explained. Not overly sure about the stops at places which lead to pressure to purchase wares. Felt slightly uncomfortable by the third time"},{"rating":"5.0","review":"The tour 10 days South to North Vietnam with Hoi An Express completely fullfilled our expectations - we have seen a lot (in part because we had prepared ourselves to get the most out of the free time as well) and enjoyed every single day of the tour. In addition, we made a little modification of the itinerary to include a day-trip to Hue instead of a foodie tour in Hoi An and it appeared to be the best day of the tour - Hue is a beautiful place and the guide (Viet) with her modest but strong personality made it exceptionally pleasant. Nevertheless, our co-travellers in the group (who did not join us for a Hue trip) said they enjoyed the foodie tour as well.\nRegarding the organization of the tour, everything worked well, in spite of the fact that the tour was organized as a sequence of individual services with different guides in different cities. Personally, I like that concept since it makes the tour more interesting - each guide added her/his personal touch to the kaleidoscope of overall experience (not to mention that it is much cheaper that way than the classic tour with one guide). \nAll in all, I would recommend Hoi An Express for travelling in South East Asia and we have already started to think about travelling to Mianmar with them."},{"rating":"4.5","review":"An excellent tour with good guides and trips.  Accommodation was of a good standard if not necessarily in the best location."},{"rating":"5.0","review":"This tour was excellent! Couldn’t fault it! Guides and transportation were always on time and full of interesting and useful information! Loved our time in Vietnam!!"},{"rating":"4.5","review":"It was great, I would like more beach time"},{"rating":"5.0","review":"We saw big cities and ancient ruins, explored the hectic streets of Saigon and Hanoi, and relaxed in peaceful Hoi An. The only problem was the pollution in Hanoi."},{"rating":"5.0","review":"Our guide Bau was amazing. We learnt so much about Vietnam from him. The people the culture the history. An absolutely mind blowing experience. Thank you for making our first holiday such an amazing, magical experience"},{"rating":"4.5","review":"It was really a great tour. We were very happy from A to Z. All the guides were very good and helpful. It's highly recommended. Thanks Tourradar and Hoi An Express and all the guides during our Tour.\nRegis (Australia)"},{"rating":"5.0","review":"Marc was an extremely smart guy, and with nice and very  polite manner, and goo sense of humour! I also appreciated our first guide too( the lady in Ho Chi Min), very professional too.\nThe trip was perfectly organized to my opinion, and most of all I loved the trip to Ha Long Bay!!!!!every thing was so well organized, and you took care of all details! thank you so much, you did a great job!"},{"rating":"4.5","review":"Great trip! A lot to see without rushing. Food was good, hotels were good and guides were very friendly and knowledgeable.  Would definitely recommend to friends and family."},{"rating":"4.5","review":"Fantastic tour, and very well organised. Very friendly guides which were English spoken, and very helpful. Plenty of free time for your own exploration of the beautiful cities of Vietnam. Would definitely recommend to anyone."},{"rating":"5.0","review":"Did a lot and saw a lot. Some of the guides very good."},{"rating":"4.0","review":"All the tour guides were great and friendly. Had a really great experience and getting to know a little bit of Vietnam. Really enjoyed Ha Long Bay, however we got moved to a different boat called Majestic at the last minute and got separated from the Tour group. The accommodation is usually a bit away from the city center so you would need to travel out to the city center. Would prefer if it was closer. Overall it was really good and interesting. Thank you Hoi An Express."},{"rating":"4.0","review":"Overall a fantastic experience - if somewhat exhausting. We’d suggest that staying at Hoi An for four nights rather than splitting between Da Nang and Hoi An would provide for a little more rest breaks. And less packing ;). The My Son Trip can surely be made from Hoi An....\nOtherwise - we’ll organised and great tour guides."},{"rating":"4.0","review":"Perfect balance of organised tours and free time to explore the cities."},{"rating":"5.0","review":"Well organised tour. We loved every minute."},{"rating":"4.5","review":"Great time , great food (too much) friendly guides with good knowledge"},{"rating":"4.0","review":"Hoi An Express gave us the best trip and tour I ever had. They are truly amazing. All the guides were wonderful but Nguyen Sang was outstanding.  Thank you tourradar and please let Hoi An Express know how grateful we are. I have passed on your contact info to many, many of my friends"},{"rating":"4.5","review":"Sang was tour guide in Saigon and he was great. Loved the energy of the city and the scooter divers were like watching a ballet. Our driver was excellent"},{"rating":"5.0","review":"We had a variety of guides - bud it would only let me select one.  We had Hau, Bang, Mickey , \nExcellent  trip, well organised , everyone very accomodating"},{"rating":"4.0","review":"Overall the tour was well organised and enjoyable, the only let down was the Ha Long Bay Cruise with Lavender Cruises, the area was beautiful and well worth the visit.  The Lavender Cruise company hurried us all the time and we even arrived back at the port 1 hour earlier than scheduled and had to wait the hour for the transfer back to Hanoi.  This Cruise was not by Hoi Ann but was with a different provider however, its part of Hoi Ann's tour so it brings down the tour rating."},{"rating":"5.0","review":"My cousin and I went on this tour and were so happy with the whole tour itinerary we couldn’t fault it hotels were great value the tour guides were informative I’d highly recommend this tour to everyone"},{"rating":"5.0","review":"Very helpful and accomodatung"},{"rating":"4.0","review":"The tour was good and most of the arrangements were done quite well. However, we had paid extra to upgrade the accommodation from 3 star to 4 star and still in couple of places we were given 3 star accommodations. Despite complaints, they didn’t care. My strong recommendation is that you should either accept the included 3 star accommodations or get in writing from them about 4 star if you are paying extra."},{"rating":"4.5","review":"We actually had four guides but this review only let me select one of them.  In Ho Chi Minh we had Bau who was 5/5.  His knowledge was interesting and his manner was friendly and helpful.  We had Hung in Da Nang and Hoi An who was again excellent.  He really looked after our group and his positive personality was appreciated.  His knowledge was informative and he went to extra mile to help us.  Then we had Young in for one day in Hanoi.  He was very friendly but I found him difficult to understand.  Lastly on the Halong Bay tour we had Peter and he was friendly and his knowledge of the area was excellent, especially in the caves we visited. \nOverall I was very satisfied with the Tour and found the organisation to be excellent.  I think more could have been done in Ho Chi Minh - a simple 1 hour city tour would have been good.  I will certainly be recommending Tour Radar and Hoi An express to others.  Thank you.  Jess Ward"}]},{"name":"Vietnam Intro - 12 Day","reviews":[{"rating":"5.0","review":"Had the most amazing time on this tour, was so much fun and enjoyed every single activity we did, can’t fault it. Our tour was effected by Corona sadly but neither Intro nor our tour leader let that affect us, by changing our activities and even sometimes accommodation and location to make sure we still had something to experience when our itinerary could no longer be done- the best time, couldn’t recommend more"},{"rating":"5.0","review":"Vietnam was never on my list of places to visit, however, after speaking to people who had previously done this tour with Intro and spoke extremely highly of it. I am so glad I took their advice and booked! A great itinerary with all of the key places you would want to visit. Ha Long Bay was an amazing experience and met some great people along the way. Kayla and Kelly were great leaders and kept us informed and entertained the entire way."},{"rating":"5.0","review":"Really well planned tour, everything went smoothly and I really enjoyed myself. Kelly and her seemingly always happy attitude towards everything, made the tour that much more enjoyable. Kayla added her Ozzie flare to the trip and showed off her iconic dance moves on a number of occasions throughout and overall did a great job and co-leading the group. Would definitely recommend this tour to anyone who just wants to experience Vietnam for the first time!"},{"rating":"5.0","review":"I have literally had such an amazing time I did not want it to end! I was greeted by Anna from Intro Travel who is so friendly, chatty and helpful! This tour has had such a great balance of country side, travelling between and city’s. Another great balance was the accommodation in hostels, homestay’s and hotels. My favourite part of the trip is definitely staying in Hoi An and luckily we were staying there two days! I couldn’t say a bad thing about this tour as I enjoyed every minute of it with a fun group of people! Intro organised so many fun activities to fill our days with and had excellent suggestions for places to go and places to see in our free time! The suggestion to take a lantern making class in Hoi An was a great tip and now I have an amazing souvenir that will remind me of Vietnam at home! I have already put a deposit down for another Intro Travel Tour and will be recommending this company to anyone looking to go for a fun filled trip! Thank you so much Anna and Intro Travel!"},{"rating":"5.0","review":"I did the 12 day Vietnam intro tour and I can honestly say it was worth every penny! There was a great mix of activities and chill time, I found the balance really good.\nI was lucky to have Anna as my group leader who was amazing, she is a genuinely lovely person who wants you to enjoy your holiday! She gave great tips for each place we had a free time in, the nights out were fantastically organised and balanced.\nMy favourite part of the trip was Hoi An, it's such a beautiful city, but the Mekong Delta, Halong Bay and Ninh Binh are places that a photo will never do justice.\nI would highly recommend "},{"rating":"5.0","review":"The trip was excellently organised both before and during the trip. It was a nice mix of city, beach, culture and history with a balance of activities and time to relax. The group was lovely and we have become great friends. Our leader Anna was great fun and very good at answering all of my questions! I can't wait to book my next trip with Intro!"},{"rating":"5.0","review":"Had an amazing time on this tour with Morgan! Such a brilliant variety of activities and you see so much of Vietnam. Brilliant accommodation, absolutely loved Freedom Island, Hoi An & Ninh Bình. Highly recommend this tour!! Great value for money too. Perfect intro to Vietnam."},{"rating":"5.0","review":"I had such a lovely time!! \nMorgan our tour leader was so friendly and made the whole experience 10x more fun!! \nI loved freedom island "},{"rating":"5.0","review":"Had the best 12 days in Vietnam. Our guide Morgan Georg made it amazing for us. She took us to all the best restaurants and tasted some amazing food. Met some amazing people on the trip and we all loved it and got along so well. Morgan made everything so easy and stress free and there’s not one thing I didn’t enjoy! I recommend this trip to anyone who wants to have a good time, meet some amazing new people and experience new things. There was something different to do in every city, including getting custom clothes made in Hoi An! My favourite part was cycling around nimh bin and climbing up to the dragon point, the views were amazing! The only thing I would change is having a longer time in Hanoi as that city was beautiful."},{"rating":"5.0","review":"Had the most amazing time! Enjoyed every destination, the amazing food and lovely people along the way. Especially thankful for our tour guide, Morgan, who helped us when needed, answered any questions we had and made sure everyone was enjoying the trip."},{"rating":"5.0","review":"This tour was the perfect balance of cultural and fun, and we couldn’t have had a better tour guide than Morgan! The accomodation, the food, the local guides and activities were all incredible and the whole trip ran so smoothly it was so easy to take in and enjoy every moment. One of the best tours i’ve been on! Thanks Morgan!!!"},{"rating":"5.0","review":"It was an amazing trip, wouldn’t have changed anything."},{"rating":"5.0","review":"The trip was amazing, it exceeded my expectations and way more. Our tour leader Morgan was amazing, she went above and beyond to make sure we had the best trip ever. We saw so much of Vietnam in such a short amount of time and had the most incredible and authentic experiences"},{"rating":"5.0","review":"Absolutely fantastic experience, excellent value for money. The tour leaders Anna and Will were amazing and so knowledgeable, nothing was too difficult for them. It was a good mix of local experiences and seeing the sights. Couldn’t recommend enough."},{"rating":"5.0","review":"Going into this experience I thought the tour leader would be more of a strict teacher role. Sam is like your best friend, he’s got a great sense of humour but at the same time he has a professional side which he balances perfectly. He always looks out for others and he makes sure everyone is safe. I 100% recommend him and if I join a future intro tour i’d love him to be my leader again!"},{"rating":"5.0","review":"Vietnam has been amazing. Sam is so helpful and has so much knowledge of the areas we have visited. He is always recommending places to go and is always good fun on a night out. Really informative and have had an amazing time here"},{"rating":"5.0","review":"Very happy with our guide. Fits to his role. Always in a good mood. Passionate about what he is doing and makes us all excited about the activities etc."},{"rating":"5.0","review":"Loved this trip. I felt safe and well taken care of. Got a lot of good tips along the way, and Sam brought the group together. He cares a lot for everyone, and brings only positive vibes. Always a good mood with him :)"},{"rating":"5.0","review":"This tour was the perfect insight into Vietnam. From the idilc scenes of Ha Long Bay and Freedom island to the hustle and bustle Ho Chi Minh. It’s fast paced but you get to see all aspects of the amazing country that is Vietnam. This trip wouldn’t have been the same without the amazing team of Brad and Morgan who made it an extra special experience."},{"rating":"5.0","review":"Overall a great tour. Brad and Morgan are awesome tourguides. You really get to see a lot of this country in a relaxed way. The group vibe is very nice."},{"rating":"5.0","review":"I had the best time on this tour in Vietnam with the Intro team Morgan and Brad. They packed a load in but made it feel really easy and seamless! I loved Hoi An, and the homestays in Ninh Binh and Mekong Delta in particular. Morgan was an incredible guide, so lovely and funny. She felt like another friend but with all the knowledge and Instagram bf skills :)"},{"rating":"5.0","review":"The staff was extremely fun and attentive to the clients! It was a great overview of the wonderful country of Vietnam with lots of special excursions one would never find when traveling alone. The day in Ninh Binh and our trip to the expert tailors in Hoi An were some of the very memorable experiences I had with Intro Travel. The food was also great! Thanks for everything!"},{"rating":"5.0","review":"Absolutely brilliant experience. We started in the north of the country (Hanoi) and made our way down south finishing up in Hoi Chin Minh. We had the chance to experience so many different things along the way from home stays to setting off lanterns from a boat. Our leaders (Brad and Morgen) were fantastic and constantly kept the atmosphere and mood of the group high."},{"rating":"5.0","review":"Tour of Vietnam was fantastic, covered all areas, nearly everyday had a fun and culturally significant activity for the group to enjoy. All meals, accommodation and transport was organised super well that made the tour easy to participate in. Group leaders were friendly and made the tour a lot of fun."},{"rating":"5.0","review":"I went on the Vietnam intro to travel trip and had a great time! The trip was organised well with each activity running seamlessly between each other. I believe that this was mainly down to the brilliant coordinator skills of Sam and Adrian, our two fantastic leaders! \n\nBoth of them were very welcoming, personable and kind, which put the whole group at ease. It felt like they were part of the group by activity participating in group games and joining in the tour activities, while also encouraging others to give it a go. I often forgot that this was their full-time job. \n\nOverall, I feel like both leaders made the trip, what it was: fun, inclusive and enjoyable! They are both great ambassadors/representative for the company. \n\nThank you for an amazing trip!"},{"rating":"5.0","review":"a great trip, lots of excellent experiences with nice organization and always in a good mood. Food, lodging, transportarioms and activities, all where good value for the price. the tour guides Adrien and Sam not only kept up a nice atmosphere but they tiressely worked to keep everything running smoothly so we could make the most of our tour. our first trip to Asia and it was great, feelnlike I have seen so much of Vietnam, highly recommended"},{"rating":"5.0","review":"[Original Text] Jätte kul!! Vi har verkligen haft en superbra resa med mycket skratt och glädje. Utflykterna var bra och man fick se mycket av Vietnam! Vår ledare Sam S. var väldigt rolig och höll ihop gruppen på ett bra sätt. Rekommenderar!"},{"rating":"5.0","review":"It was really good "},{"rating":"5.0","review":"The tour has been very impressive. Overall I have had a great time. The tour included lots of fun activities which allowed us to become immersed into the culture, I believe this would not have been possible traveling alone/organising the trip by myself. I felt very relaxed and comfortable with in the group, because of both the group leader and the friends I have made on the tour."},{"rating":"5.0","review":"Intro travel has always been my favourite company to travel with. You can not beat the quality that goes into their tours, the accommodation, the leaders and the overall experience. I booked Intro Vietnam last minute and I have not been disappointed. I have had the best 12 days travelling around, trying new experiences and staying incredible locations. Our group leader Sam has been absolutely brilliant. It’s so nice to have someone who is fully immersed themselves in to the group and so knowledgeable. I can’t wait for my next trip."},{"rating":"5.0","review":"Incredible experience!  This has been an amazing Vietnam trip!  Sam Smith has gone out of his way to make everyone had a good time & even booked my travel plans for Siem Reap, Cambodia (Angkor Wat) after my Vietnam trip was over.  I would recommend this trip to everyone."},{"rating":"5.0","review":"Myself, I’ve done several different tours around the world and with different companies.\nI’ve just completed the 12day Thai Intro Tour with Intro Travel. These guys were honestly the best to deal with from beginning to the end. From when I first put a deposit on the tour they helped in every way possible. Organising transfers and accommodation prior to the tour itself. The email responses were very clear and quick.\nAs for the tour its a great balance between adventure, sightseeing and partying. There’s also a lot of free time included and plenty of meals provided. You can’t get better value for money. Our tour guide Kyle was a blessing from above, from the first to last day he went through extra lengths to make sure we were having the best time possible. Very knowledgeable and would always chase up what he was unsure on. We couldn’t of had a better bloke in charge. Highly rated as a guide and good mate. Along with the group everyone mingled so well and got along. It’s rare to get that in large groups, but it’s what made the trip so special. \nIf your looking for a tour In Thailand, this is the one. I’ve also just booked my next Intro Tour to take part in Vietnam/Cambodia."},{"rating":"5.0","review":"I had an amazing time on this tour! I got to see different sides of Vietnam which was interesting and I like how the type of accomodation varied from place to place. Our tour leader Brad was easy to get along with and made the trip heaps fun!"},{"rating":"5.0","review":"So impressed. Superb value for money and I’ve already booked the next one."},{"rating":"5.0","review":"Bradley was a fantastic tour leader. Overall the itinerary, accommodation and transportation was great. This tour is a great way to see a lot of Vietnam in a short space of time."},{"rating":"5.0","review":"We had the the best leader, it was so much fun, all the activities were amazing, beautiful accommodation and I met so many wonderful people. Highly recommend!"},{"rating":"5.0","review":"One in a lifetime trip! It includes so many unique activities and experiences. Allowing you to experience Vietnam at its fullest."},{"rating":"5.0","review":"Great tour with great people and the best tour leader. The accommodations are incredible and unique, the boat vastly exceeded my expectations, and all activities were included at no extra cost which has always bugged me on other tours. If you can, book this your without hesitation. You’ll get to see the highlights of Vietnam in a good pace and have unforgettable memories."},{"rating":"5.0","review":"Amazing holiday. Great value for money. Would advise to anyone. Intro tours were professional, well organised and will definitely use again."},{"rating":"5.0","review":"Really good. Well organised tour with a wide range of activities on offer. The varied accommodation kept it very interesting and I loved the relaxed and fun atmosphere of the tour"}]},{"name":"Vietnam Express Northbound","reviews":[{"rating":"5.0","review":"We had a fantastic time on the Intrepid Northbound Vietnam tour. We did the tour as a family: my wife, myself, our 19 yo daughter and 16 yo son. There were also 11 others on the tour and we had great fun. \nOur guide was terrific, and Vietnam was outstanding. I wouldn't hesitate in recommending the tour."},{"rating":"5.0","review":"Enjoyed every moment of the tour and would recommend it to friends and family. Our tour guide Ashley was one of the main highlights of our trip. She made everyone welcome and at home in her homeland. My wife and I look forward to our next experience with Intrepid and tour radar who made this such a seamless and easy way to see another country.\nThank you"},{"rating":"4.0","review":"I was disappointed at the lack of options for daily excursions and would have preferred a more detailed itinerary and information regarding the included excursions. Overall, the guide was very helpful in helping us plan our own excursions and trying to accommodate everyone on the tour. I would not recommend this tour if you don't like being on a bus for multiple hours each day."},{"rating":"1.5","review":"This might be an ok trip for the first time traveler but if your expecting to be taken to the more interesting places that are difficult for the average tourist to find you will be disappointed.\nWe mostly ate at the more expensive tourist restaurants, not the local hard to find back street eateries like they advertise in the brochure . ( anyone can find those tourist places )\nBeware of the train trip, it’s an horrendous experience and takes days to recover from, ie you won’t get any sleep at all !!\nAlso be prepared for extra expenses for the optional activities and the tipping kitty of USD 22 per person, which I believe was used to pay the bus drivers.\nYou could plan the same trip yourself for half the price and stay in better hotels that are closer to everything you want to do."},{"rating":"4.5","review":"Ha and Yuth were great guides with knowledge and excellent skills to manage group trips. Also the choice of places is the essential of both countries.\n Also, Loch Sokneang, the local guide in Phnom Penh was very knowledgeable and managed the topic of the killing fields excellently."},{"rating":"5.0","review":"Saw a huge amount of Vietnam in a short space of time that I probably couldn't do by myself\n Ha was an excellent tour guide--really welcoming and organised"},{"rating":"4.5","review":"The trip exceeded my expectations, and with one or two exceptions, was excellent throughout. The Cambodian and Vietnamese guides, Yuth and Ha, were both very helpful with any issues or questions we had, knowledgable about the history of sights visited and finally, very friendly and easy to get on with, making for an informative and enjoyable trip.\n\n I thought there was a good balance between organised activities and free time. I also thought there was a good variety of activities."},{"rating":"3.8","review":"Trip itself was very good however the booking process prior to departure could be improved."},{"rating":"4.0","review":"Seen heaps in a short time and very informative."},{"rating":"3.5","review":"I would have liked to see more of rural Vietnam ie. the terraced rice fields"},{"rating":"4.8","review":"Incredible guide (Nam), great itinerary, amazing local experiences, guide very attentive to each person's needs and requests, good group"},{"rating":"4.0","review":"I had a great time the trip was well planned"},{"rating":"4.0","review":"Our guide, Nam, was phenomenal.He is knowledgeable, funny, positive and was so helpful with everything.The itinerary was excellent and allowed us to see a lot of the country and local culture in a short amount of time."},{"rating":"4.5","review":"As always, Intrepid gave me an experience that was unforgettable.Getting to see and experience so many things I wouldn't necessarily find on my own.\n\n The only negative I have to comment on (and feedback I have given before) is that when a trip goes over NYE I think it is important to have something planned for the evening.It was the last night of our tour and we had our traditional dinner at KOTO but there was nothing else offered beyond that. As a last minute decision we didnt want to go into the thick of the crowds but found that everything close to our hotel was either closed by 11pm or had ticketed events.Thankfully the hotel staff allowed us to bring alcohol into their closed restaurant and enjoy our BYO celebrations there."},{"rating":"4.0","review":"The tour was great. The only issue I had was the trip notes were incorrect\n\nThe joining instructions said one hotel however that was wrong and I was referred to another hotel where that was cancelled. My initial thought was that this was a scam and then I rang the emergency number and they gave me the right hotel\n\nThis meant that I missed out on the welcome dinner and information I had to get from other guests. \n\nOther than that the tour was fantastic and I will make sure I go back and spend more times in specific places"},{"rating":"5.0","review":"very good in tour guide"},{"rating":"5.0","review":"We have just returned from a 10 day tour of Vietnam. From the moment we booked this trip to saying our goodbyes on the last day everything was perfect. Our guide Thanh, a local, was superb.  He had a great sense of humour and presented himself immaculately every day.  He managed our group so well. We were exceptionally lucky as our entire group were lovely.  Everyone respected meet up times, so we didn't waste time waiting for anyone and we all got on really well and we didn't have any moaners (people who love to complain about everything). All the accommodation was comfortable and clean, the overnight train is exactly as described, an experience I wouldn't have missed for the world. The day out on the bikes was brilliant fun, led by experienced riders. We felt safe all the time. Thanh took us to some wonderful restaurants, always going through the menu giving us ideas on what he recommended. If you're looking at whether to do the North to South or South to North trip, I'd suggest South to North.  Ending the trip in Halong Bay on an over nightboat (again the accommodation on here was so comfortable) literally ended the whole trip on a high. It was excellent value for money and Intrepid's ethos of reducing plastic waste by giving us all our own bag to carry around instead of accepting goods we bought in plastic and having water available on all mini buses and in all hotel rooms so we could top up our own reusable cups was a wonderful touch. The whole experience will remain with us forever and we will definitely book another Intrepid adventure in the future."},{"rating":"5.0","review":"Apsalutely fantastic trip! So many amazing places and memories. Our tour guide (Quang) was brilliant, so helpful and always happy to go above and beyond for his tourgroup 'family'."},{"rating":"3.5","review":"The transportation and accommodations were good but the tour was not as exciting or fun as anticipated."},{"rating":"4.5","review":"Tanh is a talented and experience tour guide.  This was a tour by Intrepid Tours, I would definitely book with them again.  Their practice of hiring local tourism experts creates a sustainable environment for Vietnam Tourism.  I love this philosophy!"},{"rating":"3.5","review":"Quang was fantastic!  He was very helpful and always available to assist with anything and everything.  He made the trip, and I learned so much from him.  Very glad to have met him.\nI didn't care for the hotels on this tour.  The hotel in Hot An was very nice; the others were average at best.  And the overnight train ride was horrible!  I wish I had paid more attention before booking.  With the exception of our Guide, this was not a great tour."},{"rating":"4.5","review":"The guide and the program excelent just a few regular hotels but the program was worthed I like Ike it"},{"rating":"5.0","review":"This tour was amazing! My friend and I could not have enjoyed this tour any more than we did and we totally fell in love with Vietnam. Intrepid truly provided us with experiences that would otherwise have been very difficult to arrange on our own. The highlights of this trip included a boat tour along the Mekong River to an island where we rode around on a motorcycle trailer to unique spots, a ride around Hue on motorbikes with excellent drivers, and an overnight boat cruise in Halong Bay. Our guide was wonderful, he was knowledgeable, funny, and helpful. Even during our free days our guide recommended activities, most of our group participated and he was always there to ensure everything went smoothly. Our guide really enhanced our trip, especially since he is a local! The accommodations were nice, nothing fancy but comfortable and with good wifi. The overnight train was also quite the experience! The train has rooms with 4 beds, outlets, and reading lights. Overall, I was really impressed with my tour with Intrepid and will definitely be booking with them again for a stress-free holiday!"},{"rating":"5.0","review":"This was an excellent tour.  The guide was excellent and exceptionally helpful.  Transport and accommodation throughout the tour was very high standard and we fitted a lot into the ten days.  I highly recommend intrepid tours"},{"rating":"5.0","review":"Great trip, great guide. So many places visited in a short amount of time"},{"rating":"4.5","review":"Fantastic trip, couldn't recommend highly enough - we did so much in just over a week and the tour leader Ngoc was brilliant - very informative and helpful. One of the best intrepid trips I've done so far."},{"rating":"5.0","review":"This tour was absolutely sensational. Way beyond my expectations in every way! Our group was fabulous, 16 of us from all ages and stages of life, and our tour guide, Hungsi, was absolutely brilliant. Acccommodation in every town was top of the range, especially Hoi Ann at the Emm Hotel, and the tour inclusions were fantastic value. Food was awesome everywhere we went and the optional extras were all spot on, affordable and great fun with something for everyone. I would not hesitate to highly recommend this tour to anyone either partnered or single - as a single middle aged lady I felt included at every point and very safe and I made some fabulous new friends! Thankyou Intrepid, an absolute winner all round!"},{"rating":"5.0","review":"A fantastic experience really got shown the real Vietnam. Travelled with 13 other like-minded  travellers age ranging from 22 to 60. Our guide Tom , a local young  man was simply the best. He looked after us and took care of everything ,he was never off duty. Our group travelled from South Vietnam to the North. We travelled by coach, train, plane and boat. We are seasoned travellers and this was a trip of a lifetime. The group got on so well that some of us would have lunch and dinner together, great company. We all learned a lot about the country, the people and it's food. Most of us voted the bike ride through small villages as our favourite part. Great value for money."},{"rating":"5.0","review":"I had an amazing time. Our Leader was a lot of fun but also very knowledgeable. The tour included a mix of history, real life experiences (like the overnight train - you must do this!) and fun! Lots of good food, great company (all ages) and we did things I would never have done on my own - like bike riding through the streets and farms (I'm no spring chicken!), or paddling through the reeds in a basket boat! I'd recommend this trip to anyone!  "},{"rating":"5.0","review":"Amazing trip, really allowed me to experience the sights with the aid of a local guide who knew the area like the back of there hand! Saw so much in 10 days that I couldn't of done on my own back! Awesome trip :)"},{"rating":"5.0","review":"This is a great snap shot tour of Vietnam. Our group was 9 awesome people, lead by Bien who was amazing. Accommodations were always within walking distance to points of interest, I loved Hoi An and was happy to spend a little extra time here, and the Halong Bay Junk Cruise was a fantastic way to end a wonderful trip."}]},{"name":"Vietnam: Noodles & Nightlife","reviews":[{"rating":"1.0","review":"I write this as they refuse to refund me as per UK law for a trip they cancelled due to COVID-19."},{"rating":"5.0","review":"Pimm is amazing women’s she is so cool and helpfull. She is very attentive to your personal needs . She has exceptional knowledge of Thailand ❤️❤️She is an excellent tour leader ."},{"rating":"5.0","review":"I had the best trip with Aef! She was so attentive to us all and really allowed everyone to make the most of our time travelling. She had great knowledge of everywhere we went and was therefore able to give excellent recommendations for food and activities. Aef was extremely well organised which meant that we could just enjoy ourselves without having to worry about anything logistical. I would love to travel with Aef again!"},{"rating":"4.0","review":"This being the first organized tour i joined, wasn't sure what to expect but wanted to give it a try. I am happy I did so. The logistics were flawlessly prepared and our tour guide was great. He inspired confidence and had everything under control. Activities were diverse and the overall pace was quite intense. Accommodation was very clean with only one unfortunate exception. Transport was mainly bus and train. Although there's quite a long distance to travel it feels well balanced. Overall a good experience made great by Thang, our guide!"},{"rating":"5.0","review":"We had a fun group and an ever greater guide! Experiencing the Vietnamese culture and lifestyle was quite special. The local food and the beer were great to taste, the activities we did gave you a great insight about the country!"},{"rating":"4.0","review":"Best guide, Kim is so funny! Lovely time touring however the tours aren’t included in the price so the tour is definitely overpriced as there is not much included with what you are paying"},{"rating":"5.0","review":"The tour was amazing and Cheak was an amazing tour guide! He was so happy and enthusiastic all the time and full of great advice about the local areas and suggested loads of great places to visit or restaurants to eat at. I’ve certainly made memories I won’t forget on this tour and Cheak definitely made the tour so much more enjoyable than if I’d had a different tour guide!"},{"rating":"4.5","review":"Jack was amazing! He had so much knowledge about Vietnam to share yet also made the whole experience really fun :-)"},{"rating":"4.5","review":"Thoroughly enjoyable. I was blessed with a great group and an amazing tour guide which made an already amazing experience even better."},{"rating":"4.5","review":"A K is the best. She is great with arrogant and difficult people. She is a Rockstar."},{"rating":"5.0","review":"A Kay was the best CEO anyone could ask for. She provided lots of knowledge about Vietnam, the culture, history and knew lots of good food places to go to. A Kay has such a positive spirit, she was well organised and made sure the trip ran smoothly. We had so many laughs with our CEO A Kay, she is a ray of sunshine and I will definitley miss seeing her everyday. She took the time to get to know all her travelers which makes the travellers feel special. She is a sister for life and I hope I will get to see her in the future. G adventures is very lucky to have such a talented and beautiful person in their team."},{"rating":"4.0","review":"Saroeun was an accommodating and knowledgeable guide. He looked after everyone as well, which is a good sign of someone who cares about travelers in a foreign country. The main areas of improvement for Vietnam on a Shoestring is the accommodation and meals. Considering the cost of the tour, i was hoping for moderately comfortable hostels and at least more than one instance with double sharing. Majority of lodging was dormitory style and in at least half of them, appliances/amenities didn’t work or there was loud construction, bumping street noise, and dirty bathrooms. As a frequent traveler in Southeast Asia, it appears the company makes money on the accommodation front. Included meals also had poor offerings for vegans, and this is something i clarified before booking the trip, being promised that there would be options. More like a few pieces of fruit or bread. The company can do better at accommodating guests with special diets, especially if we’re paying for it. I was disappointed with these two things that forced me to always look after my own meals, have to plan ahead, and a few times book my own room so i can have some good sleep. Itinerary, excursions/activities not included, and guide (Saroeun) - otherwise - were ace. \nSad to think G Adventures overcharges and makes money considering what accommodations we had!"},{"rating":"3.5","review":"Min is a fantastic tour guide. Very patient, organized and enthusiastic."},{"rating":"5.0","review":"Phyo (min) was an amazing guide and went way beyond my expectations, would definitely go on another tour with him again."},{"rating":"4.5","review":"Ken was an excellent guide, saw the best of Vietnam. Would highly recommend."},{"rating":"4.0","review":"My first group tour and my first time with G Adventures. \n I had a good time. Not only because Vietnam has so much to offer, but also because of my fellow travelers.\nBun has been the best CEO to our group. He has a lot of knowledge, made the best recommodations for food or sightseeing and he has always a smile on his face. He made this trip special to us! Bun was the Heart of this Tour."},{"rating":"5.0","review":"Ratha was great! He made everything so much easier from taking night trains to showing us the best sites and also the best places to eat. He was really friendly and good fun which made the trip so much more enjoyable"},{"rating":"5.0","review":"Ratha was great! He went out of his way to make sure we did all the top sights in each place we went to. He made sure everything ran smoothly and we didn’t have to worry about anything. He knew all the best places to eat so we got to experience some amazing food as well. A very friendly tour guide who made the whole trip so much more enjoyable"},{"rating":"5.0","review":"Excellent tour guide! Very informative and helpful!"},{"rating":"4.5","review":"The tour was amazing and Buntheon made the tour even better. He was very knowledgable and made sure everyone was looked after. Great tour and great tour guide."},{"rating":"5.0","review":"The tour was amazing. The perfect amount of time to see all the places we wanted to see. Bun our tour guide was one of a kind and he made the trip so special for us ensuring that we were all happy and all of our needs were met. I honestly can’t thank him enough, a friend for life!"},{"rating":"5.0","review":"The Vietnam on a Shoestring tour was excellent. The highlight of the tour was our fantastic tour guide Buntheoun San - he was friendly, funny and knowledgable, and made the tour of Vietnam even more memorable and enjoyable."},{"rating":"4.0","review":"He's without doubt the best guide you can Imagine, and the trip itself was excellent too!"},{"rating":"4.0","review":"The trip and Ratha was just absolute Amazing. The Best ceo/guide i have ever had."},{"rating":"4.5","review":"Great trip! And Ratha was an incidible guide :)"},{"rating":"5.0","review":"This tour was amazing and made even better by our tour guide, Cheak. He was so motivational and happy and made travelling easy and enjoyable. The tour was unforgettable, we experienced things we would never experience if we travelled ourselves. Highly recommend!"},{"rating":"4.5","review":"Overall, the trip was a fantastic opportunity to visit some of Vietnam’s many highlights, however the true highlight was G-Adventures CEO Cheak. With Cheak’s combination of excellent local knowledge, unending enthusiasm, infectious positivity and eagerness to please he redefined a ‘great adventure’ into a world-class experience busting with memories for life."},{"rating":"4.5","review":"Overall, the trip was a fantastic opportunity to visit some of Vietnam’s many highlights, however the true highlight was G-Adventures CEO Cheak. With Cheak’s combination of excellent local knowledge, unending enthusiasm, infectious positivity and eagerness to please he redefined a ‘great adventure’ into a world-class experience busting with memories for life."},{"rating":"5.0","review":"Best time of my life, wouldn't have been the same without Cheak!"},{"rating":"5.0","review":"Cheak was an excellent tour guide!! He really made it a memorable trip for myself and the rest of the group!"},{"rating":"5.0","review":"Our CEO made our whole journey amazing! He was always so helpful and friendly. I had a brilliant time and can’t wait to book my next adventure!"}]},{"name":"7 Days Discovery Central of Vietnam","reviews":[{"rating":"4.0","review":"I really enjoyed my trip. Our guide was very friendly and accommodating. Everywhere we stopped to eat was good. My only complaints were with the first hotel in Da Nang, which had a lot of insects, and the restaurant bathrooms of some of the places we stopped to eat. It was during the New Year holiday so options for restaurants were a bit limited. Other than that, great trip, beautiful country, friendly people everywhere."},{"rating":"3.0","review":"This tour had a variety of interesting places to visit but a lot of motoring between sites .I suppose as I was alone with the driver and the guide . I had nobody to talk to during the travel . The guide was interesting but his level of English and his pronounciarion made it difficult , even impossible to understand him 60% of the time . That was also the opinion of the Australian couple who joined me on the day trip to My Son . The hotels were all right except the Titan Hotel in Da Nang which iwas not situated in a nice area . Far from the city centre , far from everything : decent restaurants or shops . Just massages parlours and motorbikes garages ..... I think there are enough hotels in Da.Nang to find a more interesting one . The choice of the restaurants were good : the lunch  at the Paradise Caves was good , The 2 restaurants in Hue , for dinner and lunch were excellent .The foodie tour at Hoi An was interesting but slightly disappointing and could have been a bit longer and include a trip to Ms Vy’s Market Place for example . Apart from the first morning in Da Nang the guide and driver were punctual . That day I was supposed to be picked up at 7:30 so I was ready at that time but they did not turn up before 8:20 . I was wondering what was happening as it was the first day . It turned out they picked up the other couple in Hoi An before me  but Hoi An Express forgot to let me know .The guide arrived apologising to Rrive too early !The staff at the agency were friendly but there again ,their level of English was very poor .It is incredible that when they work in the tourism industry they don’t Speak English .."},{"rating":"5.0","review":"The whole trip was great and very well organized from picking up at the airport until dropping off at the airport for departure. I was the only one on the tour but on the My Son trip there were two couples joining in. I spent the whole week with the same guide (Ricky) and driver, and I could not have been happier with them. Ricky was very knowledgeable and also very helpful, e.g. helping with hotel check-ins where they did not speak (good) English. The whole trip went very smoothly and according to the itinerary, with guide and driver picking me up every morning on time. In this one week I could visit many amazing places. My favourite ones were the impressive Paradise Cave and the ancient town (car free) of Hoi An. At lunch I was taken to restaurants with local delicious food (included in the tour) and for my free time Ricky pointed out some regions that I should explore (sightseeing and food). Da Nang was probably the least exciting part (but still not boring!), one night there would actually be enough. "},{"rating":"4.5","review":"Hoi An Express is a very professional and reliable tour company.  I would highly recommend them.\nTOUR:  Central Vietnam 6 nights, 7 days\nCorrespondence:  Candy\nDrivers:  Dung and Viet\nGuide:  Nguyen Tran Khanh or \"Key\"\nCandy was excellent in replying to my emails - very timely, and addressed any concerns, questions I had.  She was also very patient with all my questions.\nGuide Key speaks English very well, and is very knowledgeable.  I liked that he would look something up if he was unsure of my question.  He was my guide for the whole tour.\nDung was the driver for my day in Da Nang.  Viet was the driver for the rest of the trip.  Both very courteous, they and Key were always punctual, even arrived a few minutes earlier than stated.\n\nThe hotels were rated 3 stars.  All were clean with hot water.  The cleanest being Hoi An Village Villas in Hoi An, Serene Hotel in Hue, and Titan Hotel in Da Nang.  All offered amenities such as complimentary water bottles, kettle, tea, coffee, fridge, shampoos and soaps and bath gels, toothbrushes, etc.  Basic brands but they were available.  The tubs in all the hotels (except Hoi An Village Villa - no tub) were nice after a long day of walking.  All provided breakfasts - some better than others.  I think Titan and Fansipan in Da Nang had the least tasty breakfasts but good coffee.  For my last night stay in Fansipan, they had a boxed breakfast ready for me for my 4am departure, which was really a nice touch.\n\nThe lunches provided were great, especially in Hue.  More than ample food (6-7 course lunches) and all very very tasty.  The least tasty was at the Nam Long in Hoi An on Day 2.  But to give them credit, they were polite and served well, even though I was the only one in the restaurant.  Beautiful surroundings.  Lunch in Hue was my favourite for both taste and ambience.  Others on the road north were tasty, but more cafeteria like surroundings, but clean.\n\nI travelled solo on this trip, and found I was the only one on the tour.  But I felt safe.  Hoi An Express even gave me a cell phone upon arrival so they can contact me, and i them in case I needed anything.  This was my first guided tour so I don't know if this is common, but it was great to be welcomed like that.  Thank goodness they didn't cancel my tour!!\n\nThe sites visited were also just what I wanted - from walking through caves and up mountains (and down) to seeing historical tombs, war zones, temples, architecture, ruins of palaces  There was enough free time as well for me to wander on my own in each city in the late afternoon/evenings. Even the foodie bike tour was interesting - and more enjoyable if only I wasn't so nervous on the bike and biking through the traffic and people.  I did run into a little boy and I fell off my bike, bruised and scratched.  The little boy was ok.  \n\nThe only suggestions I would make:\n1.  if someone arrives in Da Nang, it would be nice to point them towards a restaurant if the hotel doesn't have a restaurant.  I stayed in Titan the first 2 nights, mid-afternoon not having eaten anything since breakfast, been awake since 4am and travelling, so was very tired.  Hotel staff at that shift didn't speak enough English, and couldn't point me towards any restaurants.  I walked 1 block in each direction and gave up.  The hotel restaurant is open only for breakfast.  Nga on the next shift was able to point me towards a restaurant just 3 -4 blocks away.\n2.  In Hoi An, perhaps the guide can inform the tourists that one can get a pass for $6 to all the houses and temples and bridge in the ancient city.  It may have been in the information given, but I didn't really read any of it.  My bad, but just a nudge from the tour guide for 'after the tour', and recommendations for restaurants, would be a nice touch.\n3.  in Hoi An, the Hoi An Village Villas are a bit out in nowhere.  It's a nice quiet spot away from the city, and might be a 45 minute walk into town.  There is a shuttle bus but it runs only 3x a day.  More service would be nice.  At least a mid-afternoon trek into town around 3 or 4pm instead of waiting until past 7pm.\n\nAll in all a great trip, and i thank Candy, Key, and Dung and Viet immensely for making it so."},{"rating":"4.5","review":"This tour was wonderful, overall. My guide, Thanh, was very knowledgeable of all the locations and all the hotels were top notch, new and clean. There were some hiccups during the tour, but it was quickly resolved and made sure the tour continue smoothly. The only issue I had was that the guide was not fully informed of my tour. He thought my tour included dinner, which was not, so he subsequently booked some dinner reservations. I then had to reimbursed the dinners, which wasn't the issue as I did eat the food, but it would have been better for me to find my own dinner. I was on a tight budget, and the additional costs on food was more than I could afford."}]},{"name":"Vietnam's Essential Sapa","reviews":[{"rating":"5.0","review":"Loved the Echo Lodge. Very relaxing after a good trek."}]},{"name":"Vietnam Legend - 10 Days","reviews":[{"rating":"5.0","review":"The best travel agency\n\nWhat a perfect agency. They where always on time. Have the best guides that there is. This organisation is wellorginaised and they have full control of your schedule. Offer you the best all time."},{"rating":"4.5","review":"Thank you for offering us a very flexible approach to our 7 night/ 8 day tour of Vietnam. Our transportation and pick ups were extremely prompt and helpful, with good quality vehicles. Although we chose to do most sightseeing ourselves, the Halong Bay cruise was excellent.\nWe would recommend using your company to our friends."},{"rating":"2.5","review":"Left stranded at airport on arrival, finally a non English speaking driver arrived but never an apology or welcome.  Guides with vehicles in such heat and unadvertised walking tours with uninterested guides who just wanted to be on iPhone instead of explaining what we were looking at.  Halong Bay was very very good except for the non air conditioning in the bus on the journey to and from and that distracted from the wonderful trip.  Would never ever travel with Legend Travel again. Thanks."},{"rating":"4.0","review":"I thought overall the tour guides had really good knowledge of everything that they showed us. The only downside was the communication barrier it seemed like they had rehearse what they were supposed to say but when you ask them questions they couldn't really answer your questions or understand what you are saying. There was a miscommunication of how we were supposed to check out of the hotel but then leave our luggage there. There was a lot of talking but the actual message was not given to us to check out. The other thing was was when we had a flight they dropped us off at the airport 5 hours early which was a total waste of a day. And then when we stayed in Hanoi and had to go to halong Bay the six hours total driving back and forth seems kind of unorganized and owais as well. Might as well have stayed 2 days and how long bay in 2 days in Hanoi. We also had a delayed flight and when we landed a tour guide said that we might have had to miss marble Mountain which would have been the coolest thing to do that day on the itinerary. It was not our fault that the flight was delayed and for the tour to schedule such a late flight when they knew marble Mountain would close at 5:30 p.m. didn't make sense and we were almost about to miss it if we didn't push back our meal. Also a little confused about why we had to pay extra for the Lunar New Year when everything was closed so the activities that we were scheduled to do were shortened or  not able to be done. But overall everybody was really nice and we did a lot of activities."},{"rating":"4.0","review":"Cool Guides and cool Hotels! "},{"rating":"4.5","review":"It was an amazing experience. Legends travel did an awesome job to make our trip memorable and we were celebrating our anniversary and they helped us make it special. Every detail was covered and their staff is great.  "},{"rating":"4.0","review":"Hi, my friend and I started our 8 day tour of Vietnam on the 11th Nov.  This was after touring Cambodia with Intrepid. The day we arrived in Ho Chi Minh, we expected to be met by a tour guide and driver, as advised in the itinerary. This was not the case. We were met by a driver, with little English, and were brought to our hotel.  By chance we met a representative from Legend Travel Group at the hotel, who was dealing with another group. She told us the time we were to meet the next day, and that was about it. There was no real structure to the tour, in that we were left to our own devices each evening, with no advice of places to go to eat etc.  This was a total change from the Intrepid trip, we had experienced the week before. We were met by different tour guides each day, and had different groups of people each day also. The tour guides were very good, and very knowledgeable of their respective areas, but as noted above, as we were meeting a new guide, and new people each day there was no real structure.  \n\nThe accomodation was very basic. Given the price of the trip, I would have expected better. One hotel was not good, in that the room was tiny, and the walls were covered in dampness.  I would like to thank Tony, in Hoi An for looking after us there, and arranging a change of hotel for our last night. The boat trip on Halong Bay was spectacular.  The boat itself was lovely (bedroom on the boat was probably the best out of all the accomodation in Vietnam).  The food was delicious, and the staff on the boat were so friendly and welcoming. The guided tours themselves were very good, we got to see alot, and I could not fault the tour guides, as they were very pleasant and knowledgeable.  The trip was an experience. :)"}]},{"name":"Vietnam Legend - 9 Days","reviews":[{"rating":"5.0","review":"Very professionel. Every thing was perfekt as Promist Always freindly and professionel. It was A pleasure to make Are family of 6 People's trip White legend travel Group"},{"rating":"5.0","review":"Vietnam\n\nWe had a lovely trip to Vetnam. he hotels were nice, the guides very nice persons and the drivers on the trips were good. All went well and I hereby recommend Legend Travel Group to others."},{"rating":"5.0","review":"We got the best in a beautiful country\n\nEverything was very well organized, nice and knowledgeable guides, good hotels. Everyone was there to make sure you were successful."}]}]