[{"name":"Northern Vietnam 6days/5nights","reviews":[{"rating":"4.5","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"4.5","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Best of North Vietnam Tour 9 Days 8 Nights (Hanoi, Sapa, Fansipan, Halong Bay and Ninh Binh)","reviews":[{"rating":"4.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"5.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Spectacular Sapa 3 Days 2 Nights","reviews":[{"rating":"3.0","review":"Overall ok/nice experience. Being a first-time visitor to Vietnam (but travelled to many other countries), the major challenge was to get the right information. Tour information is an indication: pick-up / drop-off point for bus was different from brochure (handy for hotel booking before and after), as well as programs for the days were different as described. But the groups were small and fun.\nSapa in general is quite touristic, so be prepared for many vendors anywhere (especially when business is slow due to corona virus). Weather can be (very) foggy and trails slippery, so bring good gear (clothing/shoes might not be available locally in the right sizes)."},{"rating":"5.0","review":"From the moment I booked the tour I had a contact name and number via WhatsApp. The tour itself was very well organised, each day a local guide was waiting to take me on walks through the villages. The hotel was very comfortable and food was good. Would recommend this tour."},{"rating":"4.5","review":"[Original Text] Je vend de la France. C'est la première fois que j'ai voyagé au Vietnam. C'est le beau pays, j'aime les habitants ici. Mon guide est aussi gentil est m'ai expliqué bcp à la culture et la vie ici. J'hâte de retourner ici la fois prochaine."}]},{"name":"Sapa Adventure: Medium Trekking 4 days","reviews":[{"rating":"5.0","review":"Sapa is a good choice for me and trekking through Y Linh Ho and Tavan is perfect. \n사파는 당신의 여행을 위한 정말 좋은 선택입니다.\n\"Y Linh Ho\"과 \"Tavan\"이라는 곳은 정말 완벽한 여행지 입니다."},{"rating":"5.0","review":"We did a tour in Indochina in July 2019. From the moment we booked the tour about 6 months ago everything ran like clock work. Tracy in the office was fantastic to deal with, and then from day 1 of our arrival in Vietnam the trip ran super smoothly. Everything about the trip - the itinerary, the guides, the hotels, the events, the food was top notch. I can honestly not think of anything major that was a negative. \nWe booked 4 star hotels and they were all amazing, in perfect locations for exploring the cities in our spare time. Both guides were very good, guides in Vietnam especially amazing with their good command of English and passion for their country. \nI can honestly recommend Crossing Vietnam Tour  as an excellent and reliable company to use for booking tours through SE Asia."}]},{"name":"Private Vietnam Legend 10 Days Package - Hi-end TOP 5*","reviews":[{"rating":"3.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Essence of Vietnam 18 Days","reviews":[{"rating":"5.0","review":"perfect organisation\n\nTravel group: perfect organisation. \nVoyage: big cities are to avoid: crazy and dangerous traffic, pollution, not so much to see (except War museum in Ho Chi Minh City!).\nHanoi, Halong bay, Mai Chau are great but extremely touristic.\nHoi An is perfect (only city with traffic free area)."},{"rating":"5.0","review":"Attn: Mr. Danny Nguyen.\nThank you so much for all the great services from your team. My family had a great trip in Vietnam & all relied on you, we were really taken-cared in your good's hands. We will definitely re-book with you when we travel again and will recommend your company to all our friends and relatives.\nHave a great day to all your team at Indochina Legend.\nMatt"}]},{"name":"Best Of Vietnam Tour to Sapa, Halong, Hoi An, Nha Trang, Da Lat, Saigon, Mekong Delta","reviews":[{"rating":"5.0","review":"It was quite simply the best holiday of our life.Everything was perfectly arranged and occurred as planed to the minute..We stayed in excellent hotels in Hanoi Sapa,Hoi An.Nha Trang..Guides at all scheduled places were excellent and all drivers were skillful and considerate and we enjoyed roomy air conditioned vehicles throughout"},{"rating":"5.0","review":"We definitely made the right decision to arrange all our tours with Vietlong company via Mr Minh‘s discussion. We did not have much time preparing for our Vietnam trip and looked for some tour packages online, found Vietlong to be attractive with their reasonable price and interesting sites we were going to visit. Our Vietnam package tour nearly 3 weeks was full of fun and it could be changed if we want, very flexible. Our tour guides at all places were very knowledgeable, friendly & passionate about their job. All in all, great service and really worth every dollar.\nHighlights: travelling from North to South Vietnam, you will witness a beautiful country with many World Heritages."},{"rating":"5.0","review":"Just returned early from a planned trip to Vietnam. Unfortunately due to the Coronavirus we . We would like to give our thanks to VietLong Travel our tour operator, who gave exceptional service to us at a very difficult time for all. Through the booking process to the end of our trip, we thoroughly recommend this company's way of working. We hope to return and will definitely be using them again."},{"rating":"5.0","review":"Awesome 20 Day Vietnam Tour - Hanoi, Hoi An, Hue and Ho Chi Minh"}]},{"name":"Luxury Vietnam Highlight Vacation - 17 Days","reviews":[{"rating":"5.0","review":"We used Indochina legend for our 10 day trip to Vietnam. They were outstanding and everything went as per plan without even one hitch! We used them in Ho Chi Minh city, Danang and Hanoi for various day trips. \nIn addition, our reservation process was handled very efficiently with very prompt responses by Ms.Phuong. \nWe highly recommend Indochina legend.\n\nVisited March 2016"}]}]