[{"name":"Treasure of Vietnam","reviews":[{"rating":"5.0","review":"Great sight seeing. Very friendly local guides. Well organised"},{"rating":"4.0","review":"On the whole, the supporting staff and the hotel accommodation were good. Meals were quite ok."},{"rating":"5.0","review":"These agents had been booked by our traveling coordinator and couldn't be faulted. All transfers had been on time and in vehicles that are good with courteous drivers. Trips had been nicely performed and tour guides knowledgeable.\nThis's the choice of yours just for the holiday of yours with family or friend. They are going to bring you deep to the lifestyle of Asia Lifestyle.\nRecommended use whilst in Vietnam "},{"rating":"5.0","review":"After some research and serious considerations, we realized that booking our trip through Top Vietnam Travel could save us about 50% of the overall cost compared to booking with a travel agency at home. Also we could use the money to upgrade our means of transportation and dining options, so it's a win-win situation. Also, we decided to book with them not only because of the price, but also because they had been a great help and really earned our trust.\nEven from the very first day of our tour, we were convinced that we had made the right decision. All the drivers and guides we had were always on time and professional. Not a single time were we left attended. We were even requested by the company to review our guides in order to assist them in improving their services. Of course we had our favorite ones but all of them were very good in general. The weather wasn't always in our favor and sometimes got in the way but Thanh (our booking consultant) always managed to rearrange our schedule seamlessly, like that one time when it was raining heavily and we couldn't make it on time for our Water Puppet show.\nI would totally recommend Top Vietnam Travel for their excellent support!"},{"rating":"5.0","review":"Choosing a Vietnamese travel company is either a hit or a miss for many reasons. Dodgy travel agencies and tour operators are everywhere vying for your business. We were even more skeptical especially after a fairly bad encounter with a local agent two years ago. Fortunately, we came across Ms. Lily, who was incredibly responsive and professional. She accommodated all of our requests leading up to the trip, and even went to great lengths to help us extend our stay in Hoi An and reschedule the next day's entire program in Hue simply because we wanted to add My Son Sanctuary to our schedule at the last minute.\nWe could not have asked for better support and services."}]},{"name":"Hanoi & Halong Bay- 4 Days North of Vietnam","reviews":[{"rating":"5.0","review":"Thank you so much for such a wonderful well planned holiday all my friends will be recommending you to all their family and friends"},{"rating":"4.5","review":"The tour process was awesome, just need to read itinerary as we thought it as a three day cruise, when it was 1 and the other off the boat.1 night on the boat is not enough yet others were on there 2 nights. A bit annoying that part but everything else was magical"},{"rating":"5.0","review":"It was a brilliant tour. We had a wonderful tour guide, beautiful boat, great transport, and amazing activities. Was seamless!"},{"rating":"5.0","review":"Thuong from Swallow travel was amazing, kept in touch with me offered suggestions and was very approachable, it was a great holiday and our trip to Halong Bay was amazing so glad we did it , it was the highlight to our 17 day holiday ."},{"rating":"5.0","review":"Everything went smoothly,  thanks.\n\nFree potable water would have been appreciated; it was so hot in the bay."},{"rating":"5.0","review":"This tour was fantastic! I loved every part of it. The intinery was full of fun activities for everyone and everything on it I would recommend doing. Tai Chi is definitely worth getting up at 6am for. Kayaking was fantastic and swimming in the ocean was a fun way to meet everyone and bond as a group. The tour guide was Pham and his English was really good and he was very funny also his magic tricks were fun too. They catered over and above for vegetarians and were really helpful the whole tour. The staff on the boat were all fantastic and really did their best to give us the best experience possible. In particular The bartender Mr Blue Label was excellent and he made us feel very welcome and he even stayed up late with us on the deck which was a lot of fun he is a credit to the boat. The cabin was over and above what we expected. Cannot fault this cruise at all. Definitely do it if you have th chance!"},{"rating":"5.0","review":"hi thuong. i am very happy to say that i have no negative comments at all everything was organised so professionally it all ran like clock work. i will of course put feedback on trip advisor and will be recommending your company to all friends and family"},{"rating":"5.0","review":"Thoung, the owner of swallow travel is amazing. She managed to look after four couples plus two teenagers coming from Ireland, Germany, Spain, Cambodia, Canada and the UK. Nothing was too much trouble for her. We changed plans a couple of times and she was able to assist us perfectly each time. \n\nOne of our group had a birthday while there and Thoung showed up with a beautiful bouquet of flowers and a lovely gift for her. \n\nAnother member of our group had to go to a hospital after a fall. Thoung went with her and stayed for the entire hospital visit and then escorted her back to our hotel. \n\nHer prices are very reasonable. I don't believe you could find a nicer and more helpful tour operator. \n\nYes- all of our group would highly recommend her."},{"rating":"5.0","review":"We have just come back from a truly memorable trip to Vietnam, all made possible by Thuong at Swallow Travel. From the first email, she was so efficient and nothing was too much trouble. She organized everything, we were picked up and dropped off at airports, always on time. Hotels were all lovely with friendly and efficient staff. The tours we had booked with her were all very well organized with friendly and knowledgeable guides. As we had two internal flights, we had requested evening flights which she booked for us and also checked us in online. Thuong does everything, we had nothing to worry about. We met Thuong the first evening we were in Hanoi and it was like meeting a family member, she was so lovely. She is completely dedicated to making sure you have the holiday of a lifetime. I would highly recommend Thuong and Swallow Travel."},{"rating":"5.0","review":"Fabulous Cruise i would say. The best thing i liked about the cruise was, it was not overcrowded. Just about 4 - 5 families.  Spacious upper deck to enjoy the beautiful bay. Clean and well maintained rooms. Delicious Food!"},{"rating":"5.0","review":"Swallow travel Thuong Nguyen (Ms) organised our entire stay Visas Pick ups drop offs and mostly we toured as our group of three or joined by another couple so there were no crowded buses. Private car pickups and drop offs. One special night was an Evening food tour with Jimmy.\n“Jimmy was enthusiastic Knowledgable and spoke very good English. He escorted us around the Old Section of Hanoi \nDescribing food and historical features.\nHe selected authentic Vietnamese street cafes. The first being variations of spring roll, the second dry noodle with accompanying stock with green papaya etc. followed by amazing fruit ( nestles milk base) and coconut icecream or yogurt, concluded with traditional coffee and egg \nDuring the tour Jimmy bartered for our purchases. It was a fun night with really great authentic food \nAs part of an incredibly dovetailed operation at Swallow travel he collected us from our hotel days earlier and smoothly escorted us to the sleeper train to Sapa. The station was chaotic but we were taken to the train stress free”"}]},{"name":"Wonders of Vietnam Tour from Saigon to Mekong Delta, Da Lat, Nha Trang, Hue, Hoi An, Halong Bay and Hanoi","reviews":[{"rating":"5.0","review":"We decided to go with Vietlong travel because of their excellent Tripadvisor reviews and it was reliable that we were not disappointed!\nWe contacted with them via email and Vietlong team replied us with all our queries, concerns & detailed program with very competitive price within a day.\nThe tour was well- organized and We didn't feel rushed at any point but we also got to see everything – all highlights of Vietnam we wanted.\nGuides also took us to some additional places that were not on the itinerary which made our stay in Vietnam more special.\n\nHighlights: 2 weeks discovering Vietnam with all highlights & especially, you will have opportunities to visit many World Heritage with flexible program."},{"rating":"5.0","review":"Thanks to VietLong team very much for your excellent service. My family spent 2 weeks in Vietnam and it was amazing. All the details were pleasing including guides, cars, hotels and the arrangements of attractions were most classic, which made us enjoy a very happy family holiday. Our driver and tour guide was very helpful and brought us such a steady and comfortable road trip. Thank all you guys once again for your entire care and efforts."},{"rating":"5.0","review":"We booked a 2 weeks trip to Vietnam with VietLong Travel & it was amazing. The co-ordination (airport pick-ups/ hotel transfers), what was included in the tour (food/accomodation) and variety of tours we did in  2 weeks was awesome. Big thanks to Ms Ha and all her help\nWould highly recommend  VietLong Travel when travelling in Vietnam to anyone considering. They take great of you!!"}]},{"name":"South Central Vietnam - 9 Days","reviews":[{"rating":"4.5","review":"The guide was really funny and knows perfectly Japan and this tour is educational, fun, and a great way to be introduced to Japan. I absolutely recommend this tour as a way to start your vacation in Japan!"},{"rating":"4.0","review":"The service provided by Intertrips is very professional and considerable. It was an amazing experience. Enjoy this tour so much and I will definitely come back and recommend this tour to my friends and family."},{"rating":"4.5","review":"It was very nice, I recomend it and I’ll do it again"}]},{"name":"Cycle Saigon to Hanoi (2020)","reviews":[{"rating":"5.0","review":"It was a trip we will remember with great affection as a truly memorable achievement. If anything, we were a bit rushed through the day and would have liked to have time to stop more often to take pictures and enjoy the wonderful experience but later on we explained this and it was accommodated"},{"rating":"4.7","review":"On the whole a great trip with a great tour guide who was very helpful, would recommend to anyone who cycles fairly regularly (though there was an electric bike hire option anyway) and I think the balance of cycling, van travel, hotels and cultural tours was just right."},{"rating":"4.7","review":"Very enjoyable holiday, the cycling provided a great opportunity to see the real people and their life."}]},{"name":"Vietnam - Beach to Mountain 12 days","reviews":[{"rating":"4.0","review":"All the people who led the tours, transported us or helped us were superb, we often felt like VIPs.  The tour guides were all well informed and they ensured you had everything you needed.\n\nOne for the future I normally book on tours from England and all the tours I have been on are the same group and a leader who stays with the group. It maybe worth explaining the operation more, it worked fine once we got into the swing and was great to meet different people on each trip. \n\nIt took us a bit of time to understand how things were organised and we did not have a phone unlocked to use the sim provided by Vietnam Travel. Initially we felt a little cut off from what was happening, this was resolved by day 3 and a solution found. "}]},{"name":"Sapa Tour By Night Train From Hanoi","reviews":[{"rating":"5.0","review":"Our family just came back from north of vietnam trip. Everything was very well organized. Hoan our guide was fantastic! Highly recommended"},{"rating":"4.5","review":"Due to my airplanes' mechanical problems, I arrived too late for my entire trip. I could only trek for one day, but the organizers were very accommodating. Thank you everyone."},{"rating":"4.5","review":"Loved it.. very well organized. .."},{"rating":"5.0","review":"Our family of 6 spent 5 N 6 D in Hanoi, visiting Hnaoi city, Halong Bay and Sapa.  All itinerary, hotels and transfer are arranged by Thuong. We are very pleased wih her service. She is prompt in response, good in English, pleasant, made a point to meet us at least once face to face, suggesting best itinerary in our specific circumstances, thinking for the best in our shoes as non- Vietnamese speaking tourists. As an example, we are impressed that a special guide was arranged just to take us, with private van, from our hotel to the train station for departure to SAPA...not only to the train station but help us settle in our cabins..."},{"rating":"5.0","review":"From my very first contact with Jimmy in Swallow Travel for information on our tour we were very impressed. Responses were prompt and informative. The booking process was very easy and we received a full itinerary almost immediately with a breakdown of the costs. On the evening of our overnight train journey to Sapa Jimmy met us at our hotel and ran through all the details of the trip again,the meals, the transfers our hotel and train tickets. He was extremely friendly and attentive and even waited with us at the station to escort us to our train carriage. The two berth cabin on the Chapa train are perfectly Cosy! Two single bunks a little table in between with lamp. We were provided with free water & snacks an slippers. WiFi although patchy was available and Staff kept the toilet & sinks area clean and tidy. Our driver was waiting for us at Lao Chi station an we travelled to Sapa approx 45mins uphill! After breakfast we met our guide for our two days of trekking “Tui” a very friendly local girl who had great English, we did a short trek to cat cat Village about 5km. The second day we did a longer trek about 12km through stunning hills & valleys with amazing views of the paddy fields and mountains. The interaction with the local ladies who joined us in the morning was both fun and memorable. We chose the Amazing Sapa hotel for our overnight stay. Right in the middle of town with stunning views from the balcony rooms and lovely food options. We really enjoyed our trip to Sapa,we didn’t encounter any problems and would definitely recommend Swallow Tours for your Vietnam excursions."}]},{"name":"Road Biking the Ho Chi Minh Highway","reviews":[{"rating":"4.5","review":"Shame on me!\nWe should have brought our own bikes!\nbetween us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own.\nbikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting.  We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected.  Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"4.0","review":"Go now before Vietnam changes. It was an epic tour into small towns and villages where people stopped to stare at us, ask to have photos taken with us,and  where children ran to the road to wave and shout hello. The  scenery is beyond description. The towns are changing rapidly as the Ho Chi Minh Highway brings the desired economic development to this region of Vietnam. In a few years it will be impossible to repeat this experience."}]}]