[{"name":"Very Vietnam - 10 days","reviews":[{"rating":"5.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM.  All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"5.0","review":"A total blast!!..So much to see and well organized"},{"rating":"5.0","review":"This was our first foray into group tours, so a little apprehension on our part. We had a great time!!  Hung was a fabulous guide who made sure the group interacted and were given every opportunity to join in with all activities. Hung's unending good humour, care and attention to details, organisation and wit made certain that we all had a good time. Nothing was too much trouble, and he dealt with every day wearing a big smile! We enjoyed the visits and found the commentary given informative and enjoyable. The recommendations for places to eat were good and appreciated.\n\nAll in all, a great holiday and brilliant value for money. Thank you."},{"rating":"5.0","review":"The On the Go Itinerary proved to be a great way to experience Vietnam, it’s people, culture and natural beauty. It gave us a terrific overview of it’s generous people and it’s significant history. \nOur tour guide Hung was exemplary. His experience, ability and personal style enabled him to quickly assess and choose best next steps when circumstances changed, both with people and logistics. Hung is a fabulous ambassador for Vietnam, and On the Go Tours. He is also a wonderful story teller, and walking encyclopaedia of everything Vietnam. There’s no doubt Hung was the icing on a very tasty cake!\nThank you On the Go!"},{"rating":"5.0","review":"What a fantastic time we have had and all thanks go to our wonderful tour guide Tuan. He was so helpful and kind. Nothing was to much trouble for him. He was full of wonderful interesting knowledge. He was fun to be around. He kept us all interested and we all loved his sayings. They will stay with us for ever. We had never been on a tour before and were a bit nervous. Tuan made everyone feel at ease. He went out of his way to make sure everyone was comfortable and all the many needs meet. A few of the other travellers had been on the go tours before but they rated Tuan the best tour guide they had ever had. \nThe tour itself was great. Very busy but with plenty of rest stops along the way. All the hotels meet our expectations, even the ones with the green pools. \nThank you ON the Go we hope to be able to go on another tour with you on day.  "},{"rating":"5.0","review":"Guide was excellent, friendly, knowledgeable and personable. Trip was fast paced, but then it needed to be given the time allowed. Covered all the main bases rather nicely."},{"rating":"5.0","review":"Great trip!  Our guide was absolutely the best. So knowledgeable and personable. He made every stop special and made us feel special. The hotels were top knotch, the food to die for. "},{"rating":"5.0","review":"Faultless tour with a fantastic guide.\nThe tour was well paced with a good number of activities and enough time to relax. I have seen all of the highlights of Vietnam. Hung was an insightful, friendly, knowledgeable, organised guide who made the trip as great as it was. He helped us with any problems or queries and thought of all the little things: like calling ahead to ask hotels to turn the air conditioning on, making sure we had enough water and recommending good places to eat. "},{"rating":"5.0","review":"A  most enjoyable tour. Can’t speak highly enough of our tour guide Hung. He was so friendly helpful knowledgeable and made our tour a very very memorable one. Everything went so smoothly  The hotels were very comfortable, transport  all air-conditioned which was super in the 38° heat. We were on the overnight train and enjoyed the experience something we will never forget. Thanks for your help on the bike ride Hung , you went beyond the call of duty!  I am very glad you talked me into going on that cycle ride I enjoyed it immensely. We felt that we were leaving family by the end of the tour everyone got on so well. Thank you again Hung and On the Go tours for giving us such a wonderful experience. "},{"rating":"5.0","review":"My husband and I have just returned from our Vietnam tour and we cannot praise Hung highly enough. He was super organised, informative, knowledgeable and most of all fun to tour with. The tour itself covered all the highlights of Vietnam and everything was just so easy. It allowed time for sightseeing and relaxing which is important for the 'mature age' traveller. The hotels were of a high standard and the food was delicious.\nThanks for a great tour."},{"rating":"5.0","review":"There were so many highlights on this trip, I can’t list them all! Ha Long Bay is a must as well as delightful Hoi An and the Mekong Delta is a great experience. \nHung is a very experienced guide with fantastic general knowledge of Vietnam and he shared lots of relevant history with us. He also has a great sense of humour. \nCan highly recommend this tour, particularly if you have limited time as we saw so much in 10 days. "},{"rating":"5.0","review":"Tour and guide were great!  Hung provided a great deal of history and cultural detail which really enhanced our experience.\nThe tour was well-paced and the hotels and transport throughout were better than average.  Only downside was the last overnight in Can Tho and floating market excursion which I didn't feel were worthwhile and certainly didn't justify the distance travelled. Would rather have added a night in Hanoi at the beginning or in Saigon at the end. Otherwise, a great experience and unbeatable value. I look forward to my next On The Go tour in the not too distant future."},{"rating":"5.0","review":"The tour and guide where fantastic. The tour turned out to be much better than I had expected. Huang was very knowledgeable and had very interesting stories to share with the group.  The activities were just fantastic and Huang recommended the show in Saigon which was just unbelievable. The food was amazing, great variety and the boat cruise was exceptional. Overall an excellent tour, just which I could have stayed longer. "},{"rating":"5.0","review":"Tuan was awesome! He shared lots of information and knowledge, and made everything seem seamless. He was great at communicating with everyone, and really made it such a fun experience."},{"rating":"5.0","review":"Tour was fabulous, Tuan went above and beyond! Please give him a raise! Please have them stay at our hotels please. The guides deserve it.  I would have liked to stay more days in Hanoi and Ho Chi Minh city on the tour.\n"},{"rating":"5.0","review":"We really enjoyed the tour, which exceeded our expectations. We saw so many different aspects of Vietnam, and learned so much about the country, history, culture, cuisine and it’s people. Tran Tuan, our tour guide was outstanding, very organised, great fun, and engendered a very friendly atmosphere amongst everyone on the tour. Most of the restaurants and places to shop were excellent, and we experienced a variety of places to eat. He definitely contributed to our understanding of Vietnam with the information he gave us and always answered our questions openly and honestly. All in all we left with a very positive impression of Vietnam and it’s people."},{"rating":"5.0","review":"This tour was amazing and exceeded my expectations. Hung Do was the best tour guide i've ever had."},{"rating":"5.0","review":"Hung Do was excellent, he had heaps of knowledge, was very helpful, gave all the right information needed, consistent all the way through. He made the tour better and more memorable. Highly recommend Hung Do as a guide and hope he is well rewarded. I been on heaps of tours and it is hard to get a good quality guide, it is rare and he is someone you want to hang onto.\n\nGiven the short time of trip - I think be better change the sleeper train to a flight - gives more time in places to see."},{"rating":"5.0","review":"Amazing trip.  My tour guide and tour group were absolutely amazing. I highly recommend this trip. I took the optional Streets and Eats tour and was so glad I did. The five course meal with Vespar trip between each course was incredibly fun and tasty."},{"rating":"5.0","review":"One of the most enjoyable, best organised and value for money tour. Brilliant food, great balance of sightseeing and free time."},{"rating":"5.0","review":"Very beautiful country, lovely people but Huynh really made it come alive for us. His knowledge and guide helped to made it the excellent experience that it was."},{"rating":"5.0","review":"The tour was fantastic and I enjoyed it enormously.\nIt was well organised and logistics were great. A large comfortable bus, good choice of hotels and facilities etc.\nI was very impressed.\nOur guide Huynh was excellent and should be complimented, he was great."},{"rating":"5.0","review":"The tour guide, Si was absolutely amazing, he spent plenty of time snowing the group around during free time. He was also very knowledgeable and very funny. Extremely enjoyable tour."},{"rating":"5.0","review":"the tour was amazing.  Exceeded our expectations.  Si (tour guide) is an absolute gem. He really went above and beyond.\n\nWe have both travelled with adventure companies before and rate this now as one of the best.  Inclusions of accommodation and food where surprising in a good way.  Love the included transfers.  Love the mix of bus, boat, train (we have been on India trains so coped well) and bike and rickshaw. "},{"rating":"5.0","review":"Our first group tour - On the Go made a very good impression of how to tour. Ken was an excellent guide - good knowledge, extremely pleasant in all circumstances and went out of his way many times to assist."},{"rating":"5.0","review":"Quan is an excellent guide & tour leader. My holiday was enjoyable, memorable and stress-free because of Quan's ability to keep us organised and his wealth of knowledge. Thank you for a fabulous trip. "},{"rating":"5.0","review":"Our first group tour - On the Go made a very good impression of how to tour. Ken was an excellent guide - good knowledge, extremely pleasant in all circumstances and went out of his way many times to assist."},{"rating":"5.0","review":"Just wanted to give you an email to let you know the On the go I just went on with my family was Amazing!  We had a fantastic tour guide - who just one the tour guide of the year he won the Jordan trip!  Really really took care of us - always did what was in the groups best interest.  Accommodation was different from place to place but great! Vietnam itself was great such a beautiful place.  On the go - the BEST service and such a good price too. "},{"rating":"5.0","review":"Tuan as a brilliant guide. He was able to answer all of our question ( there were many). He understood the needs of each participant and looked after everything. "},{"rating":"5.0","review":"We would like to make special mention about our guide , Hung - very professional with extensive knowledge on history of Vietnam. \nThank you On the Go tours!"},{"rating":"5.0","review":"I would definitely recommend On the Go Tours to friends, service was excellent. Tour guide was the best and made our experience an enjoyable and great holiday."}]},{"name":"North to South Vietnam (for Solos) - 11 Days","reviews":[{"rating":"4.0","review":"Generally the agent has been efficient and itinerary was been effectively carried out. If some parts of itinerary can be reviewed, it will be ideal, eg, the flight from Danang to HCM could be slightly later so the check in process would not be so rush & also able to meet the room check in time at hotel in HCM, to have a 2 nights Halong Bay cruise for better enjoyments & slightly some quiet moments on cruise, the Hanoi city tour could be on the 2nd day of the trip instead of the day to leave for Danang, and the HCM city tour in the afternoon could be done in a slower pace. Overall, I am satisfied with the trip."},{"rating":"5.0","review":"Nguyen was our guide in DaNang and Hoi an.\nHe is very professional and knowledgeable.  He speaks fluent English and managed well with the timing of activities without us feeling too rush. \nCertain places were not on the itineraries but he explained very clearly how we could visit those places such as Golden Bridge and Marble Mountain from daNang, and how much time we would spend there. \nHe was very dedicated to his job and our experience in DaNang and Hoi An would not be that enjoyable if he were not our local guide.  Job well done by Nguyen!"}]},{"name":"Highlights of Vietnam - 12 Days","reviews":[{"rating":"5.0","review":"Although we did not get to go on the tour due to Covid19 shutting everything down, I would like to congratulate TourRadar and EMH Tours and Travel Group for their prompt, polite and professional assistance given to any query made to them. I havent used an online travel agent before but they made the whole experience very simple. All emails were answered promptly and refund was completed within days of putting in the request. We still intend to go to Vietnam when everything settles down and will be booking through Tourradar and EMH Tours and Travel Group."},{"rating":"5.0","review":"This tour is exceptionally well organised and efficient. There is enough spare time to explore as you wish and exactly the right amount of trips that are very interesting. What we loved was being met by Christine at our hotel in Hanoi on the day we arrived. She set us up with a Vietnamese Sim card and kept in constant contact with us during our stay.\nChristine is truly an exceptionally dedicated lady that goes well above and beyond to make sure you are happy and that you have enjoyed each and every single day.\nWhat we were also very impressed with was the organisation - if Christine told us the bus would be there to collect us at 7:30am, the bus was there exactly on time. Amazing considering the traffic in Vietnam - just SO well organised and efficient.\nThe hotels we stayed in on the 4 star package were perfect - the Vietnamese people are all so friendly and welcoming and cannot do enough to ensure you are happy and comfortable. Amazing people."},{"rating":"5.0","review":"Very well organised tour from beginning to end. Friendly tour guides particularly Lin in Ho Chin  Min city. The food was amazing as was the traffic in the cities but once we got the hang of crossing busy intersections it was fine. All the hotels we stayed in were top class, very modern and clean."},{"rating":"4.0","review":"It was great from start to finish we enjoyed it guides were helpful we organized and we would do it again"},{"rating":"5.0","review":"Had a fabulous 12 day tour of Vietnam from North to South.\nThe included day tours and overnight in Halong Bay were all wonderful, lots to see, and our guides were very professional and knowledgeable, and made sure we were well looked after.\nThe accomodation was great, the included meals were excellent.\nAirport transfers went like clockwork, no problems at all.\nVery happy with EMH tours making my trip absolutely fantastic.\nThankyou everyone involved."},{"rating":"5.0","review":"Amazing second tour with EMH! Last November, we enjoyed our tour of Myanmar with EMH so much that we decided to take their tour of Vietnam in April. Extraordinary Vietnam experience! From Hanoi to HaLong Bay, to the ancient capital of Hue, to Hoi An and finally to Saigon.....the tour was comprehensive and fascinating. Each hotel was excellent and the tour guides and drivers superb. We learned so much about the history and culture of this amazing country. EMH is an outstanding tour company and we were thrilled with their professional and friendly services! A great value and wonderful experience!"}]},{"name":"Amazing Vietnam Tour","reviews":[{"rating":"5.0","review":"A truly excellent tour put together by Vivian and the team at Top Vietnam. We traveled as  a family with 2 approaching 60 year old adults and 2 girls aged 17 and 20. Everyone had a great time. All the tour guides were excellent and there was a seamless handover as we moved from destination to destination. Nice touches included Christmas gifts for all of us. Unlike other tours we were mostly on our own with transport sometimes being shared. The only time we were with other people was on the walks in Sapa and the trip to the Mekong Delta. Hotels were excellent in Hanoi and Hoi An and more basic but clean and functional in the other destinations."},{"rating":"4.5","review":"This was the second trip of mine and I cannot recommend this Vietnam Top Travel enough! Such fun activities and also the tour guide of mine were great. I made everyone that is sure was having a great time. I feel as I have such a great range of activities and also explored Vietnam fully. I cannot wait for future journeys!\n^_~"},{"rating":"5.0","review":"The trip was impressive. Plays up for me have been the cruise around Halong Bay and Hoi An. I enjoyed the Top Vietnam Travel & truly enjoyed each pastime which we did.\nThank you very much and highly recommend !!! ❤"},{"rating":"4.5","review":"I'd most amazing journey around Vietnam that had been made basically stress totally free due to how well structured and planned the trip was. I sensed in safe hands the entire journey along with our guide was such a fantastic guidebook to have. I felt secure knowing he was in control and truly felt as he did the job of his well. I would suggest this particular tour to anybody who wishes to find an enormous state in a brief space of time."},{"rating":"5.0","review":"Exceptionally great service with lots of flexibility! The most effective tour operator in Vietnam! The trip of ours was wonderful! I'll certainly join again the the next time I visit Hanoi."},{"rating":"5.0","review":"What an incredible experience! We saw much, learned much and received a magical time. Exquisite food and scenery! Such an excellent organization, an incredibly specific time for us. They had been extremely adaptable and accommodated most requests. Allowed us to alter plans on the fly and never ever any additional charges. We loved the guides of ours.\n"},{"rating":"5.0","review":"This year I chose Vietnam as my summer holidays destination. Searching on the Internet possible ways of travelling to and through Vietnam, I found this Amazing Vietnam Tour and I liked it immediately, because this tour offers exactly what I want and like: a comprehensive tour around the whole country, visit and sightseeing of two biggest and most important cities of Vietnam (but in some other cities as well), travelling to various parts of Vietnam with very different landscapes (cities and countryside, mountains, plains, streams and rivers and Mekong river delta, seaside and islands, beaches). This program also offers various aspects of Vietnamese life and society (traditional life and activities, modern life, reach history and fantastic heritage, traditional and modern art, religion and sacral buildings, variety of national minorities with their traditional costumes and handicrafts). Very impressive, shocking and very emotional is insight into Vietnamese recent history (struggle and victory in wars against very cruel invaders: Japan, France and especially the USA). Every visitor to Vietnam (especially those who were born after those wars) MUST visit War Remnants Museum in Ho Chi Minh City and Cu Chi tunnels. \n\nMy choice of Top Vietnam Travel and Amazing Vietnam Tour was the best I could do. The whole tour was very intensive, but also very interesting, informative and exciting. I had no constant group and a permanent tour leader. Almost every day I had other fellow - travellers and guides. It was a little strange, but the organization of the tour was fantastic. My tour organizer Rita cared about me constantly and very much. Even more than it is usual. Every evening she was sending me updated info about next day’s excursions. And my journey was passing smoothly and according to the program. I can only say one big \"Thank you, Rita\".\nAfter coming back from Vietnam, I am full of nice remembrance and only the best impressions. It was an unforgettable journey to Vietnam.\nVietnamese people are very kind and friendly and cordial to foreigners. I am delighted with two wonderful ladies from TVT: Ms. Vivian Le and Ms. Rita, who managed my trip and cared so much about me during my journey. I can say only all the best about TVT and these two ladies. They were much more than professional in managing my trip.\nMy recommendation: Go to Vietnam with Top Vietnam Travel. You will not regret."},{"rating":"5.0","review":"We went to Vietnam on a trip which was placed by Top Vietnam Travel. The first trip in Vietnam relied upon Top Vietnam Travel who were able to hold all the original bookings. What was arranged worked out perfectly "},{"rating":"5.0","review":"My partner and I decided on this 14 day trip with Top Vietnam Travel thanks to the recommendation of her aunt, who did the tour last year. We based our tour on her itinerary with some changes here and there according to her experience, as well as to fit our time frame and preferences. Our travel agent Rita was nothing but helpful during every part of my trip. The food was great and we had a lot of flexibility to make discoveries of our own."},{"rating":"5.0","review":"This was obviously a well-organized trip. The tour guide Ms. Jenny was class which is first that she's a full understanding and knowledge of the historic events also she managed to talk incredibly effectively. The museum of Vietnamese medication became a cultural gem. The tour was extensive like the former Presidents War and Palace Remnants Museum.\nI'd really recommend this tour."},{"rating":"5.0","review":"Great tour Guides Larry and Mike, a tour that is great in the South and north of Vietnam.\nWe enjoyed all organized for us. We had been looked after extremely well. Drivers have been excellent! Hotels are fantastic.\nNice comfortable A/C automobile with bottled water. A knowledgeable guide that showed us around the different sites and boat rides. \nWould suggest."},{"rating":"5.0","review":"First-Rate service and excellent company. Thank you much to Helen who aided us to manage a bus to Sapa and also a homestay and also trekking in Sapa. She was often as useful and called us to make certain we'd come ok and also aided us located the bus station returned. Great provider to utilize, very knowledgeable and friendly."}]},{"name":"Vietnam Highlights","reviews":[{"rating":"5.0","review":"Jules was incredible! So friendly from the start automatically making me feel settled in. Everything was so perfectly organised and she knew something about everything. She also ensured if we needed help with anything at all she was there for us."},{"rating":"5.0","review":"Absolutely brilliant tour manager! Made this tour a great experience and very knowledgeable about Vietnam’s history! Definitely knows how to show you a good time as well! \nGreat guy, anyone would be lucky to meet him!"},{"rating":"5.0","review":"Stef really knows his stuff and is a superb tour manager. He gave real insight into the history, culture and traditions - all while managing a variety of characters on the tour.\n\nThere were some more in depth questions about social economicals & Vietnam’s history with other countries that he answered with conviction & quality\n\nI’d be more than happy to be on any tour group that he manages. Money well spent."},{"rating":"5.0","review":"Was an excellent tour of a beautiful country. It ran smoothly, I’d highly recommend it."},{"rating":"4.5","review":"Absolutely loved Jelly! Legendary tour guide, keen to share her knowledge of the local area and happy to help so always ended up going the extra mile! Probably would have gotten lost on my last two solo days in Hanoi without Jelly’s advice and phone number!"},{"rating":"5.0","review":"Jelly made every step of the journey so so easy! From getting us to know each other straight away with a treasure hunt in Ho Chi Minh City to getting to know each of our interests and dietary needs so she could make it the best experience possible. The way she personalised each of the daily itineraries made us even more excited for what was to come. Whenever she didn't know something we asked, Jelly made it her business to find someone who did!\n\nJelly is such a nice person that even when the trip was over, our friendship continued. When Jelly herself came to Ireland, we met up in Dublin! And because of her skills in getting a big group to mingle, I am writing this review from South Africa right now as I am visiting a friend I made on Jelly's Vietnam trip!"},{"rating":"5.0","review":"Jelly was upbeat and friendly from the start. She made everyone feel comfortable! \nI enjoyed the itinerary and free time add ons! Accomodation was beyond my expectations, clean and great locations!"},{"rating":"5.0","review":"Jelly is one of the best and kind tour guides. I’d never been on a contiki before and she made the expierence so enjoyable. It was an amazing trip, I have met so many beautiful people from around the world who I’ll know for the rest of my life. The places in Vietnam we went to we’re incredbile. It is a short trip, but has given me ideas when I go back to Vietnam where I would. I went to a lot of different places, which I might not of gone to if I was just traveling solo or with friends. \nJelly is so down to earth, and always so much Fun. I would love to do another Tour with her ❤️✨"},{"rating":"5.0","review":"El was a great guide, extremely passionate about her job and very knowledgeable. Also more than happy to help with any questions or recommendations."},{"rating":"5.0","review":"Elle was the perfect guide. Her knowledge of the areas, ability to both get along with and manage the whole group, and unwavering ability to make the best of every situation made the trip an incredible experience."},{"rating":"4.0","review":"Ell was amazing. Such a friendly face and took us to some amazing spots"},{"rating":"5.0","review":"It was amazing! James went all out to make every part of the trip spectacular and memorable. Traveling became my passion."},{"rating":"5.0","review":"James made that trip. He was an incredible manager. Give him a promotion I love him\nSo much. I get anxiety traveling and made me feel comfortable the entire time and was a wealth of knowledge. Could not have asked for a better manager"},{"rating":"4.5","review":"I Would love to travel with Talia again, she made the trip a dream come true. Talia managed the group dynamics awesomely her incredible skills in people management allowed her to encourage everyone on the tour to engage, by the end of the tour it felt like we were a great big family. If you are lucky enough to travel with Talia you can guarantee that she will take the time to get to know you and play a big part in the amazing memories that you make."},{"rating":"5.0","review":"Sam was a brilliant tour guide, very knowledgeable and good fun!"},{"rating":"5.0","review":"An amazing tour with an even better guide! Eb was fantastic. The accommodation and transportation was far better than I ever thought. Such a great tour to get an overview of this amazing country."},{"rating":"5.0","review":"Great trip. Everything was organised well. Group size was ideal, not too big or too small"},{"rating":"5.0","review":"Greg, Vietnam and whiskers on kittens. These are a few of my favourite things! What an adventure to begin my year with. I couldn’t have asked for a better holiday. Vietnam accomodation was well above what I expected, I was a two star girl living in a five star world. "},{"rating":"5.0","review":"The trip surpassed all expectations!"},{"rating":"5.0","review":"Greg was able to provide an excellent review on accommodation, restaurants, bars and the history of where we stayed. He was also able to stick to achedukrs tightly, as well as making my first overseas trip the best adventure I’ve ever been on!"},{"rating":"5.0","review":"Greg was awesome, really great in depth understanding of the culture and countriy and with a knack for passing that knowledge along to the group in a fun way"},{"rating":"5.0","review":"Greg was amazing! Very informative and helped us out a lot even with what to do when we had free time. Something that I found a few contiki tour guides don't do "},{"rating":"5.0","review":"So so so so good! Greg was amazing and he exceeded my expectations "},{"rating":"5.0","review":"Absolutely amazing experience, such a friendly, charismatic and professional person! Will definitely be doing contiki again because of this! "},{"rating":"5.0","review":"The trip exceeded my expectations. I felt at home with the group and I utterly adored my Trip Manager Greg!"},{"rating":"5.0","review":"It was amazing. Greg our tour manager was absolutely fantastic. "},{"rating":"5.0","review":"Great tour manager and excellent accommodations planed and prep. Been an amazing Vietnam experience "},{"rating":"4.0","review":"Lisa guided Contiki Vietnam highlight tour pretty well. \nEnglish is not my mother tongue, so I have difficulty not catch all the verbal information correctly. She patiently repeats the information to me if I ask her, and her written itinerary does help me get the idea quickly.\nShe also could provide me some useful information when I have to spend my spare time around the city. Thanks for her information, the tour is overall over my expectation."},{"rating":"4.0","review":"A new experience for me and everythings from every aspects were perfect."},{"rating":"4.5","review":"Greg was an amazing lad, extremely well prepared and fun at the same time. Always knew the answers to your questions, purely from doing his own research and couldnt have been more pleased to have Greg as our trip leader. Greg had the perfect mix of culture, partying, history and most importantly knew where to get the best feeds!"},{"rating":"5.0","review":"The trip was fantastic! Greg was so knowledgeable and enthusiastic without pushing activities on people, he accommodated to everyone in the group and their interests and it made the whole group far more happy! "}]},{"name":"Vietnam South","reviews":[{"rating":"5.0","review":"The experience was unreal that we got to see so much in such a short space of time. Our leaders both went beyond their duties to help us with further travel when we left and throughout the tour with information on sights and recommendations. Hostel Ninhvana I felt was aimed and targeted to drink the whole time and under pressure by their staff to do so, other than the jungle trek and the kayak there were no other activities or entertainment for non-drinkers. But overall the tour leaders made it a great experience from start to finish!"},{"rating":"5.0","review":"Overall my experience has been great, I have seen and learn lots, meet great people and had fun. The way everything was organized was amazing and everyone was thought of \"Papsi\" and \"Phong\" were great leaders! and we would definitely recommend them to other people. Our group thou we shared our experience with has been a great group! to be win and made our tour so great. The only things that would have been better would be the Ninhvana part, as we were pressured by people there to drink and it would have been a lot better for us to move on and see something different as we are on a smaller trip and 3 days were spent there. Everything else was well and I would recommend this trip!\n\nA great way to travel to Vietnam,\nWe love you Papsi, See you in Thailand.\n\nPhong, you are great!"},{"rating":"5.0","review":"Phong and Papsi are the best!"},{"rating":"5.0","review":"It´s so difficult to summarize all the impressions after these adventurous days in south Vietnam. There were so many fundamentally different experiences that I have made in the last few days. It was my first trip to Vietnam, my first trip with TruTravels and even my first backpacking tour with a group of people I didn´t know before.\nThe story has begun in Hoi Chi Ming City. We stayed there the first day, until all the others arrived. Then we started as mentioned in the tour itinerary our adventures and our travel.\nThe group was really friendly and open minded and wishes from the group could be fulfilled every time. We were a really young group (age 18-29) - it was fun all the time!\nEspecially the group leader helped us every time and showed us the best places we had to see. He made a brilliant job although we were such a large group and Vietnam was abroad for him too. Competing against him in poolbillard and basketball was a hard task but big fun between the activities. Thank you Papsi for everything!! And thanks to everyone who was involved in this travel in the office!\nIt was a pleasure to travel around with trutravel and to get in touch with this country and his culture. The organization was perfect from the beginning to the end and even beyond!\nI will come back (and that´s not a threat ;) )!"},{"rating":"4.5","review":"I was not sure how 10 days with total strangers, and a tour leader, sharing the same accommodations would work out.  I was pleasantly surprised.  I am used to traveling solo and be on my own schedule, so this was a completely new experience for me.  I would first like to give credit to my team leader Edna Mendoza who was absolutely incredible and made sure we had fun, stayed safe and on track with our schedule.\nBooking the trip with a British company from the U.S. was actually pretty easy to do.  The price for the whole experience was wallet friendly and by far exceeded all my expectations.  The team was very responsive to my questions and concerns so I was confident booking with them.\nI spent one the my best vacations ever.  Edna was really incredible and started communicating with me well in advance of the tour and was always readily available to answer questions and address concerns.\nI was fortunate to be part of an incredible group of people, all with different backgrounds, which was fun.  \nI really had very unique experiences, from traveling for 5 to 10+ hours on a sleeper bus, to sharing 15-bed room in hostel in Ninhavana which was a very beautiful party location.  Walking the streets of Mui Ne, Hoi An, Nha Trang,  Saigon (to name a few) during the day and at night was quite exquisite.  Experiencing the hustle and bustle of Vietnam, from day life to nightlife was exactly what I was looking for.  Street food was the best and I always make it a point to eat as much of it as I can.  My best memory was coming back from a late outing and stopping at a street vendor's space to get some pho...I was the happiest girl in the world and ate the best pho I have ever tasted -thank you Edna for facilitating this experience and giving us the flexibility we needed to fully immerse ourselves.\nThere is so much to say, from taking an epic trip to see the \"hands\" (Golden Bridge) in Da Nang (riding cable cars forever to get there...lol..scary but thrilling experience), to eating the best Banh Mi (where Anthony Bourdain did), to having bespoke outfits made, to cycling and bamboo boat riding in Hoi An or sand surfing in Mui Ne...all throughout this amazing experience, our team leader Edna was incredibly supportive, inclusive and really the instigator of so much fun!  I don't remember ever being bored during the whole trip.  I made friends and hope everyone who books this tour has as much fun as we did.  I would use Trutravels again in the future - but ONLY if Edna is my group leader❤️"},{"rating":"4.5","review":"Overall a great experience. Had great activities and a lot of fun. Phi was very knowledgable and I learned a lot of the culture and went to some amazing restaurants! Adam was also great fun and dome everything to make sure we had as much fun as possible. I would highly recommend Tru Travels for my first Tru Travels experiences it has been amazing."},{"rating":"5.0","review":"Overall experience was very enjoyable. Third time traveling with Tru Travels and it will  not be the last. The tour leader, Adam and Phi put every effort to make sure we had the best holiday and I can’t thank them enough.\n\nAn organized and informative trip which I will not forget. Adam and Phi went above and beyond to make everyone feel welcome.\n\nThe activities were well organized. Sand dunes was an incredible experience. War museum was amazing, tour leader was able to expand on the information which just added to a great day out.culture of the trip was covered by Phi the local tour guide, stopping at various points to share the history of Vietnam, including facts and history."},{"rating":"4.5","review":"Our tour guide \"Papsi\" was so funny and heart warmings. He managed to create a very smooth journey without any complications. His knowledge of special places beside the calvary. I really enjoyed Ninhvana. It was a really cool place. I met so much new people, but my favorite thing in the tour was the quad-biking on the sand dunes in Mui Ne. It was a bit scary but so amazingly crazy. All in all, it was really an experience of a lifetime. Loved the tour and most importantly our amazing tour guide \"Papsi\"!!"},{"rating":"5.0","review":"I really liked our tour guide \"Papsi\". He was so nice to all of us and we had a lot of fun. I would love to do a third Trutravels tour next year. Ninhvana was amazing and we had so much fun there. Overall I can say I would recommend the tour to all my friends."},{"rating":"4.5","review":"A great trip! Lovely people, fantastically organized and great activities!  I would highly recommend the trip to others. \"Papsii\", the tour guide, is at the heart of the trip and it would not be the same without him! not only his hilariously funny, kind and knowledgable, but he is always to do! He was also very insightful in helping us with our plans. Thank you!"},{"rating":"4.0","review":"I thoroughly enjoyed the tour, there was a wide variety of activities and the locations included in the tour were really amazing. One critique I did have was the accommodation and how it was organized, i felt that the tour organizer took advantage of the fact that we were all girls on the Vietnam South tour which forced us to share beds for most of the trip. \nMy tour guide, Edna really ensured that the trip was a memorable one. She blended so well with each of the tour members, and she always went out of her way to ensure that we were comfortable, safe and enjoying ourself. She was insightful when it came to introducing us to the history and quirks of each city that we visited, she also introduced us to the best restaurants in each city. She was well-organized and made sure that we were well-informed on the happenings of each day. I really look forward to having her as a guide when I do the Vietnam North tour."},{"rating":"5.0","review":"Booking the tour was really easy and information about the tour was easily accessible. From the minute that we landed everything was very organized and explained well. All the hotel rooms were really nice and all of them had airconditioning. We went out as a group most nights for food that was recommended by our tour guide. All the food was cooked to a high standard as well. I really enjoyed the tour around Ho Chi Minh City and being able to explore the markets.  One of the best days on the trip was going to the fairy streams, quad biking down the sand dunes and sandboarding. The hostel that we stayed in as well as a good chance to have a bit of free time and relax. The balance between activities and free time was really good. The transport between locations all contained air conditioning and it was really well organized. On the last day, it was really good to spend time with the locals and try their home-cooked food. Overall, it was an amazing experience and I wish I could have done the whole Vietnam tour. I will definitely be using TruTravels again in the future. I couldn't have asked for a better tour guide as well. Pappsii is our tour guide. He was so funny, organized and fun of life. Thank you so much Papsii!"},{"rating":"4.0","review":"I have fallen in love with Vietnam after this tour! being able to explore with a great group of people has been the highlight of my summer. The sand dunes were my favorite part! I've also loved the 2 nights in Ninhvana! The hostel has a great vibe & the activities were so fun! \n\nPapsii was amazing! He was so fun, energetic and caring & has really made this trip for me! I will 100% be a reunion to Vietnam for the north tour and wish I'd booked it originally, I don't want to leave."},{"rating":"4.0","review":"Vietnam is such an incredible country and I wish that I had stayed for the North Vietnam tour. The activities included in the tour were limited but these were topped up by optional activities which were highly recommended by Papsii and he was not wrong. The quad bike on the sand dunes and the Ba Na Hills were uncredible and my favorite part of my time in Vietnam. Due to the chaotic nature of Vietnam, I was believed that all transport was provided for me and that Papsii always went out of the busway to keep us informed. Overall, a great start point for exploring Vietnam and gives you a real feel of what Vietnam and its culture have to offer. Papsii always had the knowledge of extra activities to do during free time and always kept us entertained."},{"rating":"4.0","review":"Papsii was a very fun, welcoming leader! overall, the experience was amazing, we met some very friendly and funny people who made the tour great. After traveling for 3 months before this tour I would say that tour itself is a little pricey but you do mane some amazing memories! The first couple of days were very rushed and was hard to get to grips with but when we stopped in Ninhvana it was worth it. It is very clear that the tour is for people who are looking for a shore insight to Vietnam as having traveled at our own pace for 3 months in was quite hard to keep up, however, we know it is hard to fit a lot of activities in, in 10 days!! I would definitely recommend this tour to anyone that wants to experience Vietnam in a short time! Loved meeting and experiencing this tour with everyone! Thank you Papsii #TRUCREW"},{"rating":"4.0","review":"We joined the tour for 10 days, after traveling by ourselves for 3 months. It was a great opportunity to meet some great people and the activities chosen were amazing. The highlight of 10 days was definitely the sand dunes and the bamboo basket ride. I also liked that we had a lot of free time to explore or choose to go on the additional activities organized by Papsii. \n\nPapsii as a great group leader was amazing, always upbeat and excited to get us ready for the day (or night). The facebook group chat was a great idea and he always kept us updated or shared the photos he had taken that day (which were so good)."}]},{"name":"Vietnam Heritage Journey","reviews":[{"rating":"5.0","review":"First of all, we had the most wonderful trip of our dreams! Top Vietnam Travel gave excellent customer service in helping us plan our vacation. They really took care of our needs and everything planned was experienced. We are very happy customers. This was our first trip to Vietnam and we were there for two weeks. Two fun-filled with amazing activities."},{"rating":"5.0","review":"Everything ran like clockwork. The trips were outstanding, the itinerary well thought out, hotels beautiful. In the event we have to modify the itinerary this was performed with effectiveness and a' can do' attitude by Mrs. Cathy. I'd don't have any hesitation in recommending this particular company for the visit of yours to Vietnam."},{"rating":"5.0","review":"We would like to thank Top Vietnam Travel for helping us make our visit to their lovely country enjoyable and memorable. Highly recommend this Indochina tour operator for wonderful Indochina trips."},{"rating":"5.0","review":"Excellent Service - Travelling through Vietnam. Couldn't fault the service and well-spoken guide had a fantastic day out with great local knowledge, wouldn't hesitate to use this company again next trip. Thank You Top Vietnam Travel."},{"rating":"5.0","review":"It could not fault the organization and services of our trip. Everything operated very very smoothly. The Tour Guides knew their subject matter and were passionate about their countries. The staff was simply fantastic.\nThanks and highly recommend this company."},{"rating":"4.0","review":"We had a great time time on this vacation. The tour guides were outstanding fabulous had a lot of information. Most of the hotels were a 10 out of 10.  One them were not.  The food was delicious "},{"rating":"5.0","review":"It is difficult to refer to how amazing the tour of ours was! We observed as well as did a great deal and I enjoyed every second of it. Cathy was the very best trip leader I could 've asked for and was extremely energetic, loving and also kind. She made everyone that is sure had whatever they required as well as was very simple to speak to and ask questions. She made the journey! Everything was extremely well organized as well as the itinerary was perfect. The tasks had been very fun and special and I won't ever forget this great trip to Vietnam. The accommodation was excellent and this kind of variety! The homestay contained Ninh Binh was my personal favorite and so gorgeous. Thank you Top Vietnam Travel for such an unforgettable journey. I highly recommend in the event that you're considering doing this trip."},{"rating":"5.0","review":"Vietnam is very beautiful. The guide of ours goes above as well as beyond to ensure things are running efficiently, and the attitude of his is comforting and positive always. It is obvious he really loves what he does and it is enthusiastic about touring &amp; sharing that passion with everybody of the team. Because of the time frame, the itinerary was truly well structured. I must come to complete seeing Vietnam. The majority of the locations where we stayed were rather good, the meals was general delicious as well as the transport was wonderfully structured."},{"rating":"5.0","review":"Outstanding journey, charismatically and professionally navigated by Top Vietnam Travel. Well balanced itinerary across an assortment of Vietnam's lovely locations. It is an enjoyable trip! If you that way then this's the ideal mix of sightseeing, culture, and local food experience "},{"rating":"5.0","review":"Well organized, great accommodation and unique and enjoyable experiences! Definitely worth the money and the team size was perfect! Will did a fantastic job in spite of the setbacks of the typhoon and also made the experience fun of ours! I'd endorse this particular tour and company!"},{"rating":"5.0","review":"This tour was anything I could 've wanted and much more! Linh's organization, as well as professionalism, were incredible and the tour was extremely well organized and planned. An amazing blend of great nights and cultural experiences out and leisure time. I'd suggest this particular trip to anyone looking to find out the primary cities and encounters of Vietnam and would certainly explore Top Vietnam Travel for my upcoming destination and tour!\n❤"},{"rating":"5.0","review":"Excellent service along the journey, great guide leader and supply all of the info. We'd suggest to others. They made the experience of ours so easy and memorable.\n<3 <3"},{"rating":"5.0","review":"We'd an exceptionally great program from Top Vietnam Travel who aided us to prepare our whole Vietnam experience. Gracie went above as well as beyond to make sure that every one of our arrangements has been met as scheduled. Additionally, they have an excellent ground staff team and extremely knowledgeable guides. I'd endorse them!"},{"rating":"5.0","review":"We're really pleased about our incredible visit to Vietnam with our two boys. We spent two weeks from North to South. The visits, driver, guide, accommodation, restaurants structured as well as selected by Top Vietnam Travel had been quite good. We highly recommend them in case you're planning a ride to Vietnam!"},{"rating":"5.0","review":"All in arrangements that are good, really professional services from the tour guide on the boat crew.\nWhen we were in Vietnam, the itinerary she builds was excellent. Just the appropriate level of time that is free and programmed time.\nWe used 3 guides. Every guide (and driver) was exceptional. They had taken excellent proper care of us; discussed everything we had been watching as well as made it happen in an extremely fun and enjoyable way."},{"rating":"5.0","review":"When I told the booking consultant that both my fiance and I have a penchant for history, culture, food, and great sights (we're not a big fan of bars and nightlife, although I would appreciate a good drink), she whipped up this itinerary and we instantly fell in love.\nOur guides (Ms. Thao in Hanoi, Mr. Ky in Hoi An, and Mr. Quy in Ho Chi Minh City) were all every accommodating and well versed in the culture, history and current affairs of the destinations. There was never a question that they were not able to answer.\nMy sister's family joined us for the second and third legs of the trip and there was no single hiccup with the arrangements."},{"rating":"5.0","review":"We booked our very first ever drive to Vietnam through Top Vietnam Travel - incredible.\nFrom the second we contacted them to organize the itinerary of ours through until the departure of ours returned home they had been extremely beneficial, accommodating & professional. Our fourteen-day journey through Vietnam gave us a sample of a selection of key locations. While all of the manuals and owners have been great would love to specifically mention and also thank two of our guides Thanh who met us in Ho Chi Minh and Larry who we'd for probably the longest period through Hoian and Hue\nThe willingness of theirs going the extra mile was truly appreciated. This tour company was great.\nLook ahead to utilizing this service again."},{"rating":"5.0","review":"Our loved ones of fourteen had the most incredible drive to Vietnam. Because of the assistance of Lan from Top Vietnam Travel. She made the preparation process seamless and delivered a drive the family of ours won't ever forget. The manuals had been outstanding, the accommodation was great, the food was delectable and there have been a lot of occasions our team felt quite special by the program we had been granted! We endorse Top Vietnam Travel and also the services of Lan."},{"rating":"5.0","review":"This's the next time we've worn Top VIETNAM Travel to arrange a trip for us. This time it was a 14 day tour of Vietnam and Cambodia for our family of four. Every element of the tour was ideal. Was very calming to have our own driver and guide. Becoming a a part of a tiny group made everything a lot more pleasant. Would highly suggest."}]},{"name":"Amazing Vietnam Super Save Package","reviews":[{"rating":"5.0","review":"Ancient Town in Hoi an was romantic. We saw some couples taking wedding photos in the morning. All corners turned out so good in frame. Yellow walls, ancient architecture and pink paper flowers were charming. Local food there were cheap and we bought many sourvernirs for my friends and families there."},{"rating":"5.0","review":"Superb! My husband booked a package with Realistic Asia. I also contacted them for payment and I wanted to clarify some details. I didn't know that they realized my birthday (in passport) and secretly check with my husband to arrange it for me. Write my nickname on a birthday cake as well! So detailed! I burst into tears after the restaurant staff surprised me. I don't know how to express my gratitude to all of you. The best agent ever!"},{"rating":"5.0","review":"The driver who picked up us from Noi Bai airport mistook the terminal. He waited for us in terminal 1, meanwhile we landed in terminal 2 for international flight. Even though it's 2 a.m. but Miniah, person in charge of our trip, was available to receive our call. We were so sorry for bothering her sleep but she immediately checked and modified. Just few minutes later, we met our driver. A bit inconvenience for waiting but still alright. She even tried to arrange a short meeting with us in the hotel lobby to say sorry even though it's not her fault. A big respect for great service of Realistic Asia. They truly cared our services day by day and made us comfortable. This trip was amazing from the start to the end. Halong and Ba Vi were outstanding than the others. The cruise staff was so professional. And local residents in Ba Vi were friendly. They didn't know much about tourism, just like a welcome to friends. Highly recommend!"},{"rating":"5.0","review":"Absolutely awesome company to deal with"},{"rating":"5.0","review":"The hotel in Ho Chi Minh was smaller than others. However, all hotel staff in all accommodation were helpful. Faifo cafe in Hoi An was fantastic. We had a leisure day in Hoi An so we chose a cafe in the morning. From the roof of the cafe, we can see overview of the town. Hoi An was peaceful and romantic but more peaceful in the morning. There were not many people gathering, some bikes only. Pink and white bougainvillea was charming."},{"rating":"5.0","review":"They ran our group's trip quite smooth. Everthing was like we were agreed in advance. The places were good, activities were diverse, the guides had good english proficiency."},{"rating":"5.0","review":"I cannot know how to explain how sincere and caring that we have received during our stay in Vietnam. Entering an unfamiliar country, I and my family were concerned so many things, however, with the help of Realistic Asia, everything was clear and we could enjoy our time together. Vietnamese peole were so friendly and humorous. We were treated well. Mekong boat trip were fantastic. It's local and simple but charming. We enjoyed a good time with local sincere people there. I will recommend this tour for others to visit with their family and will buy other tours with Realistic Asia."},{"rating":"5.0","review":"Kayaking was so much fun. Titov island was beautiful. Halong was amazing. We really enjoyed the tour, the hotel selection was great!"},{"rating":"5.0","review":"Bamboo basket boats was so interesting. I have never seen it before this trip. We loved the way they arrange this package. It's like following a theme throughout the trip. Must try their services. Not a joke at all. Great!"},{"rating":"5.0","review":"Nothing to complain about the services. Great, always supportive when we needed. It's the first time that we booked a tour with local. We will do it from now on. They were local so that the knew everything related like local sim, money exchange, etc.). And I knew that there would be a consultant following up with our trip so that we could trust and relax. White Dolphin Cruise was superb. Professional and caring."},{"rating":"5.0","review":"Even though we had a detailed itinerary before the trip to arrange our own time, we felt passive for several day tours. We didn't know exactly the time of start until the night before. Then, my consultant changed the way to inform right away. They let me know all the start time, also explained that they kept it as a daily reminder so that we didn't forget the time. So caring and sorry for my misunderstanding. They must work hard to take care each traveler and remember to remind. Thanks a lot."},{"rating":"5.0","review":"Traffic jam in Hanoi was serious. After returning from Ha Long to hotel in Hanoi, we got stuck in a heavy traffic jam. We had a flight to Hoi An so we were so much worried that we would miss the flight. I didn't like this feeling. But Realistic Asia managed to comfort and guarantee the punctuality for us then we arrived on time. After check-in, there was still a lot of time before boarding. Thus, we chose to trust their words. Will go with them to further places."},{"rating":"5.0","review":"Vietnam was awesome. Worth visiting. We hadn't expected much when we chose 3-star properties but they managed all things good. The hotel rooms were not big but clean and receptionists were helpful. We paid attention much on meals because we were pure vegetarians. My consultant, Dat, highly noted and reminded the hotels and cruise carefully. We were served the tasty food. And time under the tunnel was great. We had our own time to explore how interesting and intelligent Vietnamese people created this network to protect themselves. A lot of fun and good pictures to throw back later."},{"rating":"5.0","review":"A tour without museum or historic places. We wanted a trip with all exploration places. They did a good job to arrange a chance to taste a local life. Love the atmosphere and friendliness. Local food was yummy. We spent two days in Hoi An. One guide was quite hard to catch up his accent. But will choose them whenever I am back."},{"rating":"5.0","review":"They made the trip so easy. It's a bunch of individual tour operators stitched together, but they do it seamlessly. From getting picked up at the airport, to getting picked up and dropped off at your hotel for every activity, they have you covered end to end. Dat was very responsive through email or WhatsApp every time we had a question."},{"rating":"5.0","review":"Cannot fault the service provided by this company  - S.Viet Travel / Realistic Asia. Right from the very start of my booking all the way through to our last transfer back to the airport to return home, I was dealt with by the very helpful Dat. He helped us with all communications and made everything very stress free so we could just enjoy all the trips without the hassle of organising ourselves (apart from being in the hotel foyer at the right time to be picked up!)\nThe trips we did were amazing and gave us a great insight into Vietnam over the short 10 day trip we did from The North to the South. Our 3* hotel accommodations throughout were to a very good standard, plus the meals etc included. Our excursions were not more than 15 people each time and we met some fantastic other holidaymakers on them. The guides we had on each tour were exceptional, very good English speaking and a great knowledge of their Vietnamese history, surrounding areas and the actual trip itself.\nOur favourite excursion being the Bavi Eco tour to the Ri Village to meet with locals at their own houses, to have lunch, cookery classes, a bike ride, boat tour and meeting with an ex Vietnamese Army soldier & his wife on their tea plantation to help them pick tea and take part in the drying process. This was an amazing day and quite humbling too!\nWe will definitely be returning to Vietnam, and I would have no hesitation in using this tour operator again.\nThanks again Dat and sorry we did not manage to meet up face to face as we had tried to.\nMany Thanks\nCara & Mike."},{"rating":"4.5","review":"Amazing trip! I recommend! Good for solo travelers"},{"rating":"5.0","review":"Mrs Nga was very patient and helpful with all of our requests and we had a fabulous time. The accommodation, restaurants and our local guides were excellent. I have no hesitation in recommending this company."},{"rating":"4.5","review":"I love the countryside itinerary in this tour. It's very interactive and fun, and the villages my tour guides brought me to were beautiful."},{"rating":"4.5","review":"With the help of  S Viet Travel rep David  we had plaaned an fab trip to Vietnam. David advices were adjusted to our needs and requests. S Viet Travel is one of the best"},{"rating":"5.0","review":"Using S Viet Travel and tourradar to plan my trip is the best decision ever. Dat had been so patient with all of my questions and concerns and provided great service in helping us plan our wedding anniversary. Even the tour guides they selected for us were all super amazing people. They were all friendly and accommodating to any request we had and shared their love of their country to us, which we really appreciated. They made our experience unforgettable."},{"rating":"5.0","review":"Highly recommend S Viet Travel to anyone and everyone! Couldn’t be a wonderful tour without Sonny, he was an amazing tour guide, hope to get him again in the future"},{"rating":"4.5","review":"I found 10 is not even enough to discover this country. Been traveled from South to North Vietnam and eye-opened with everything; splendid scenery; amazing food and lovely people. Definitely will comeback next time for Sapa."},{"rating":"4.5","review":"We all had wonderful experience in Vietnam  for the first time. Much thanks to your excellent service, awesome country with varied impression."},{"rating":"4.5","review":"10 days seems not enough to explore Vietnam though you got to see Vietnam from North to South. Big appreciation for my guide hannah for always be there when I need. Highly recommend without any hesitation"},{"rating":"5.0","review":"Great friendly customer service and always there when you need them. This is our first time used a local operator through Tourradar and they are superb. We got issue with airport pick up but they sorted out immediately. Thank you Ly and Minah"},{"rating":"4.5","review":"I had a wonderful time in Vietnam, just simply wonderful and memorable. The team is professional that made sure every arrangement goes smoothly, Minah, David and Hannah were fantastic."},{"rating":"5.0","review":"We had incredible time on our tour, thanks to our guide Minah for her knowlegde, supportive and caring. Definitely recommend for friends and family"},{"rating":"5.0","review":"Fantastic! Very happy with ur service"},{"rating":"5.0","review":"I was looking for agency to help me to organize couple of tours during our trip to Vietnam and i was lucky to find S Viet. We did 10d tour with one night on Island. Kayaking, swimming in bay, night squid fishing, morning tai chi exercise on boat, pearl farm, cooking class. It was so much fun. We met amazing people which became our friends :)  Meg is very helpful and she always responded very fast. You can ask her anything and she will help you to organize tour accordingly"},{"rating":"5.0","review":"It was an 10 days tour of Vietnam starting from Hanoi and ending our trip at Ho Chi minh City. From the day we decided to start planning our trip, S Viet Travel have been of great help. They helped in customising our trip according to our needs. From airport pickup drop services to all the hotels and The Cruise were up to the mar"},{"rating":"5.0","review":"Would like to thank S Viet travel for awesome tour of Vietnam. Hannah, our agent in S Viet was always there for any query of ours, whatever time of the night or day. Also made sure we had no problems on our visit . Food was great ...☺️☺️☺️ Thank you"},{"rating":"5.0","review":"This was the best trip ever to me. Everything was organised perfectly. \nNothing was too much trouble. Hien always got back to us quickly whenever we emailed her with a query. At first I was a bit anxious about booking with S Viet travel because they were not in Australia but there was certainly nothing to worry about. \nWith all our tours we were picked up on time and all our guides were very knowledgeable and spoke great English. \nThank you S Viet travel for a trip of a lifetime."},{"rating":"5.0","review":"I would travel again with this company. They provide everything that is required"},{"rating":"4.5","review":"Would like to thank S Viet travel for awesome tour of Vietnam. Hannah, our agent in S Viet was always there for any query of ours, whatever time of the night or day. Also made sure we had no problems on our visit . Food was great ...☺️☺️☺️ Thank you"},{"rating":"5.0","review":"All the hotels were amazing and located on the main Street of the city, so I had time to explore the city at night. My itinerary was well managed not too busy and tiring. Loved every thing of my holiday. My tour guide Hannah was always available to guide me even before and during the trip. She always replied me instantly be it any hour of the day. Thank you so much An and Hannah for such a lovely vacation."},{"rating":"5.0","review":"All the hotels were amazing and located on the main Street of the city, so I had time to explore the city at night. My itenarary was well managed not too busy and tiring. Loved every thing of my holiday. My tour guide Hannah was always available to guide me even before and during the trip. She always replied me instantly be it any hour of the day. Thank you so much An and Hannah for such a lovely vacation."}]},{"name":"3-Day Ha Long Bay on Deluxe 4-star Cruise with Kayaking, Swimming, Cooking Class,...","reviews":[{"rating":"5.0","review":"This was an unbelievable experience! \nWe were so lucky to get the boat to ourselves on the second day because most of the group was only doing two day and one night. We got to experience halong bay, a fishing village as well as a school. The food was incredible on the cruise we got ten courses each meal! Everyone went above and beyond, my boyfriend left his wallet on the bus back and the coordinator went out herself and got it back for us. Absolutely recommend this trip, this was one of our favorite experiences from asia."},{"rating":"5.0","review":"Our tour was very great. We really enjoyed the food we got to try, and it was a really nice experience. Jenny explained the history of the food and taught us how to eat the food the way to best experience it. We would recommend this tour to others. Thanks!"},{"rating":"5.0","review":"Really accommodating made my experience special and staff were kind and friendly"},{"rating":"5.0","review":"Loved the cruise, staff were amazing, everything on board the boat was great except they still use plastic straws. Sorry. \nWould still recommend this cruise."},{"rating":"5.0","review":"Ταξίδεψα με την silversea 3 μέρες 2 βραδυά. Όλο το ταξίδι ήταν καταπληκτικό από την αρχή μέχρι το τέλος. Το πλοίο είχε μόνο 2 δωμάτια με μπαλκόνι και για κάποιο λόγο μου έδωσαν το ένα από τα δύο,μετά λοιπόν από μια εξαντλητική περιήγηση στο πανέμορφο μέρος είχαμε τζακούζι στο δωμάτιο και μετά κοκτέιλ στο μπαλκόνι!! Το πλήρωμα ήταν εξαιρετικό και η ασφάλεια τοπ και διακριτική,δεν σου λυπεί τίποτα απολύτως.Το φαγητό με τέλεια παρουσιαση! Το προτείνω ανεπιφύλακτα."},{"rating":"5.0","review":"Great activities, nice room & great food!"},{"rating":"5.0","review":"Do not hesitate to take this tour! We have an awesome experience with Crossing Vietnam Tours! Everything was well organised and Lucy(Hanoi office) was always available and ready to help! The boat was clean and comfortable, the group was really nice and the guide was fun and knowledgeable! Touring is the best way to discover a country you know nothing about! We also advise staying 2 nights on the boat as you'll go to the less touristic places! \nWe also did the Trekking to Sapa (2nights) which we highly recommend after this trip. "},{"rating":"3.5","review":"The trip to the fishing village and the caves were great. Halong Bay was amazing. The swimming was very refreshing. Food was great and plenty of it. The staff were attentive and polite. Cooking class was fun."}]},{"name":"SEE ALL EAT WELL: Vietnam Group Tour - 10 days","reviews":[{"rating":"4.5","review":"I used Sens when my folks came over to visit during lunar new year here. It were 6 of us and they switched us to a private group, same price. Everybody were happy and enjoy throughout; food was excellent and the guide was fun and helpful."},{"rating":"5.0","review":"Everything was great arranged and we really enjoyed a wonderful trip in Vietnam.\n\nThank you, Sens Asia Travel Team, for your great preparation.\n\n**Non-English content removed from original review**"},{"rating":"4.5","review":"I was traveled with a group of friends and we join with a few others. It was great fun, the hotels are top with great location to get around. Food is good, Tuan did took us to taste the real local food and bia hoi on the street. Siem Reap was totally different from Vietnam and it warped up the trip perfect. Highly recommenđe."}]}]