[{"name":"Pho, Fun & Sun in Vietnam","reviews":[{"rating":"5.0","review":"Excellent trip. My experience of Vietnam ticked all the boxes. Our guide was superb. He was very knowledgeable and helped group members with all sorts of issues. The itinery was very interesting. Only disappointment was when we visited the Ho Chi Minh morselium it was closed to the public (this is more of an observation rather than a criticism). Our accomadation was excellent, as was the food. Highlights for me was Halang Bay and the Cu Chi tunnels. Would definately recommend and use Exodus travel again."},{"rating":"4.5","review":"The Vietnam cycling adventure was amazing. I wasn't expecting the level of care and accomodations that Exodus Travel...\nShow more"},{"rating":"4.5","review":"My Vietnam trip exceeded my expectations, Nam our tour guide went above and beyond every day. Dealing with all the...\nShow more"}]},{"name":"Cycle Saigon to Hanoi","reviews":[{"rating":"5.0","review":"It was a trip we will remember with great affection as a truly memorable achievement. If anything, we were a bit rushed through the day and would have liked to have time to stop more often to take pictures and enjoy the wonderful experience but later on we explained this and it was accommodated"},{"rating":"4.7","review":"On the whole a great trip with a great tour guide who was very helpful, would recommend to anyone who cycles fairly regularly (though there was an electric bike hire option anyway) and I think the balance of cycling, van travel, hotels and cultural tours was just right."},{"rating":"4.7","review":"Very enjoyable holiday, the cycling provided a great opportunity to see the real people and their life."}]},{"name":"Cycle and Discover the Highlights of Central Vietnam","reviews":[{"rating":"5.0","review":"Perfect balance between distance and route. The day in the national park near hnin binh is the best memory of this part of Vietnam. Top tour for mountain bikers and the local team (guide Thuoa and the logistic team)."},{"rating":"4.0","review":"Definitely the best way to combine these 2 destinations!"}]},{"name":"Saigon to Hanoi","reviews":[{"rating":"3.5","review":"Our family of 5 enjoyed the Halong Bay 3-day bike trip. It was a nice way to see the area -- better than just viewing from a car window. Great guides!"},{"rating":"4.5","review":"Shame on me! We should have brought our own bikes! between us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own. bikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting. We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected. Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"3.5","review":"Fantastic tour, with extremely diverse sights -- from the beaches of Central Vietnam to the temples of Angkor Wat. We particularly enjoyed the hill country of Vietnam (the climbing day was excellent) as well as the temple sites in Cambodia. The accommodations were generally no-frills (due, in part, to the remote locations we were traveling through), though the hotel in Angkor Wat was excellent. The meals were fantastic -- the guides did an excellent job of selecting restaurants with great local fare. Would definitely recommend."}]},{"name":"Meandering the Mekong Delta","reviews":[{"rating":"4.5","review":"Our family of 5 enjoyed the Halong Bay 3-day bike trip. It was a nice way to see the area -- better than just viewing from a car window. Great guides!"},{"rating":"4.5","review":"Shame on me! We should have brought our own bikes! between us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own. bikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting. We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected. Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"4.5","review":"Fantastic tour, with extremely diverse sights -- from the beaches of Central Vietnam to the temples of Angkor Wat. We particularly enjoyed the hill country of Vietnam (the climbing day was excellent) as well as the temple sites in Cambodia. The accommodations were generally no-frills (due, in part, to the remote locations we were traveling through), though the hotel in Angkor Wat was excellent. The meals were fantastic -- the guides did an excellent job of selecting restaurants with great local fare. Would definitely recommend."}]}]