[{"name":"Vietnam Luxury Honeymoon in Paradise - Halong Bay / Con Dao Island","reviews":[{"rating":"5.0","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]},{"name":"Private Vietnam Classic Tour Package - 12 Days / 11 Nights","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"3.5","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Summer idyll 15 days 14 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.5","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]}]