[{"name":"Best Selling Vietnam Family Tour from Hanoi, Halong Bay to Hue by train then Hoi An, Saigon, Mekong Delta","reviews":[{"rating":"5.0","review":"Ms Trang organised everything in great detail leaving nothing to chance.  For most of the trip we had a guide as well as the driver. During the trip Ms Trang was always available if we needed assistance of any kind, and while we were organising the trip Ms Trang was very prompt with her emails.\nThis was a trip to out of the way places but with a degree of comfort plus good backup. Of all my overseas travels this one was the best organised and on arriving back in Australia I was very relaxed after 13 days on the go.\nThank you Ms Trang, a special lady."},{"rating":"5.0","review":"We only have positive remarks on Vietlong travel. From the beginning, their Email communication was efficient and prompt. We booked with them Private Guided tour with drivers. Airport pickup and drop off included; all drivers were always earlier than appointed time with clean van A/C. Guides at all destinations were good at English and made sure that we were happy with their arrangement. Even they also knew the best places to take pictures and were great photographers as well, which made our trip memorable. Friendly, professional! We would highly recommend Vietlong Team.\nHighlights: Discovering Vietnam in 2 weeks, we will have chances to see all highlights from North till Central & South Vietnam with colorful lifestyle."},{"rating":"5.0","review":"Thanks to Vietlong made an awesome 2-week tour to Hanoi, Halong Bay to Hue then Hoi An, Saigon, Mekong Delta. You were very effective and answered all questions promptly and the whole trip went smoothly. All the guides were knowledgeable and helpful. My family really enjoy the trip. Highly recommended!"},{"rating":"5.0","review":"We did a 13 Days tour of Vietnam. Tour was very well organized, good value for the money and Ms Ha in the office was great to answer our questions and get back to us quickly, even with the time change."}]},{"name":"Authentic Vietnam - 14 Days","reviews":[{"rating":"4.5","review":"We had an excellent trip with fantastic, knowledgeable, and enjoyable guides.  There were no hiccups throughout the two week vacation.  Accommodation was excellent with the exception of the hotels in Ho Chi Minh City and in Can Tho - both these hotels should have been fine, but were not as good as they should have been, for example neither had any hot water for some reason.  I would definitely recommend this tip to anyone interested in seeing Vietnam.  Just be aware that it's a large country to cover in two weeks, so there is a fair amount of (unavoidable) time spent traveling."}]},{"name":"Vietnam Beach Holiday Memories - 13 Days","reviews":[{"rating":"5.0","review":"I enjoyed every minute of my trip. On each trip, everyone is so friendly, especially our guide Minah is knowledgeable and helpful. Our trip is much more interesting thanks for her humor."},{"rating":"5.0","review":"An amazing trip! Cover almost highlight destinations in Vietnam. Hannah, the travel consultant is really helpful. She helped us to organize this memorable trip. Thank you so much! I would highly recommend this operator to others."}]},{"name":"Discover 7 Great Places Of Vietnam 14 days","reviews":[{"rating":"5.0","review":"Tour Radar was with us every step of the way.  Hotels were clean and centrally located.  Day tours were interesting and well paced. Whenever we had a query they were quick to respond. This is our second trip with Tour Radar.  Our other one through South America and this one through Asia. We will definitely look to Tour Radar fir our next trip."},{"rating":"5.0","review":"We really loved seeing and learning about all aspects of Vietnam: political, social, culinary, landscape and human. All our guides were knowledgeable and helpful in understanding such a different culture from ours. We feel we have a good understanding of who the Vietnamese people are from South to North. We recommend this particular tour and because there is not enough time to visit Saigon/HoChiMinh, we recommend coming 4 days before to take in what this city offers as well as staying longer in Hanoï to have time to visit the Sapa region, which we recommend adding to this tour. Well done to Mrs Dao and Ms LAN who had given us all the papers we needed and helped us along the way as we needed. Marie-Dominique and Robert"},{"rating":"5.0","review":"I would definitely recommend Ms Tran as the best tour manager at Vietnam Adventure Tours. I had a personalized 14 day excursion that gave me an excellent education and perspective on life in Vietnam from South to North.  The price could not be beat by any of its competitors and the quality of the arrangements and customer service was excellent. There were a few fkight delays on Vietnam air, but Ms Tran had everything under controland was a available immediately via Whatsapp whenever i needed assistance.  I would definitely recommend going with the four star hotels, because the 3 star hotels sometimes were very small and had limited amenities. Tourradar is the way to go with finding the perfect tour to meet your needs. I am already planning my next tour with them."}]},{"name":"Vietnam Classic Tour - 12 days","reviews":[{"rating":"5.0","review":"Duc was very pleasant and gave a lot of useful information! Good luck!"},{"rating":"5.0","review":"Was a great trip with lots of activities guided by. We also learned about the country throughout the tour. Would definitely recommend this tour"},{"rating":"5.0","review":"We were able to see and experience vietnamese food, culture and history. Kudos!!!"},{"rating":"5.0","review":"Mason , very good tour guide . Jiang is friendly with the whole journey . Highly recommended . English speaking fluently ."},{"rating":"5.0","review":"The company arranged this 12 day tour very well. We had unforgettable time in this lovely country. Hoang did his great job as a professional guide"},{"rating":"5.0","review":"Alex was a brilliant tour guide, he was informative, took us to the best places that we would have never found on our own. I’m glad Alex was our tour guide and I recommend him to everyone."},{"rating":"5.0","review":"This is an amazing tour. Free upgrade was introduced for our booking. Mason was so thorough and friendly. Kudos Mason !!!! It deserves every penny. \nMust have Mason in your tour."},{"rating":"5.0","review":"Hoang did his great job. He guided our group to different places. Halong bay was the best destination and we were able to discover natural caves as well as kayaking. His neutral accent in english was the best level. Make sure you have Hoang as the guide for your trip in Vietnam. \nKudos Crossing Vietnam Tour!"}]},{"name":"Vietnam Family Holiday for solo parents","reviews":[{"rating":"4.5","review":"Vietnam Solo Parent tour.. what can I say.. it was amazing.. the tour offers you enough group activities and alone time.. it is well planned and having someone else take over the travel arrangements was simply the best..  We love our guide, Quang, and he really made each tour and city special for us by sharing his love of his country with us.  We loved the optional bike tour in Hoi An... a true highlight.. as was Ha Long Bay on the junk boat.. the home lunch in Hue.. a favorite meal for all of us as it was our guides hometown and family that served us.. simply delicious.  Traveling with two vegetarians sometimes can be hard but our guide was amazing at coordinating meals for us, cooking classes, etc.. We really could go on and on.. we just had a great time.  Truly our guide took care of us in the best way from laundry to recommendations to making sure we were happy, warm, safe.. etc...  a true luxury when traveling alone with kiddos.."}]},{"name":"Vietnam Special For Solo Travelers","reviews":[{"rating":"5.0","review":"Nice trip with a small group tour, we traveling with 4 different tour guide and all of them spoke wonderful English.  Great experiences and fun time with local people."},{"rating":"5.0","review":"This was the best trip. \nEverything was organised perfectly. \nNothing was too much trouble. Hien always got back to us quickly whenever we emailed her with a query. \nAt first I was a bit anxious about booking with Sviet travel because they were not in Australia but there was certainly nothing to worry about. \nWith all our tours we were picked up on time and all our guides were very knowledgeable and spoke great English. \nThank you SViet travel for a trip of a lifetime."}]},{"name":"Lifetime Vietnam Family Holiday from Hanoi to Saigon via Hue, Hoi An, Halong Bay","reviews":[{"rating":"5.0","review":"Mr Dong helped us with tours in Hanoi and Hoi An, including site-seeing and cultural experiences as well as arranging drivers for airport transfers and flights within Vietnam. Everything was seamless, the tours were interesting"},{"rating":"5.0","review":"We had wonderful service from Mr Dong at Vietnam DNQ Travels.\nShe helped plan our family 2 week trip. It was a fantastic. Everything was sorted and organised and if there was any hiccups, they were sorted straight away.\nThanks for making sure we made the most of our time in Vietnam."},{"rating":"5.0","review":"From the moment we arrived until our departure, we were looked after and escorted by local guides who were very knowledgeable, friendly and helpful. We enjoyed the whole tour, including a magnificent overnight cruise on Halong Bay. We travelled in air-conditioned mini buses and also had two internal flights to Da Nang and Ho Chi Minh City. The whole tour was extremely well organised and we are very grateful to Mr Dong, at DNQ Travel, who personally made sure that every part of our tour went smoothly and was an unforgettable experience for us. We had the best time of our lives and would highly recommend using DNQ Travel."},{"rating":"4.5","review":"This was a well organised and very professionally delivered tour. Our tour guides were always punctual and most informative . We were particularly impressed with Hung who was with us for 4 days but that is not to underplay how much we appreciated the others. The drivers were also excellent , especially those navigating traffic in Hanoi and HoChiMinh City.\nThe DNQ managers were very attentive and ensured that we were happy with the hotels in which we stayed . The itenarary was varied and my Vietnamese wife and I learned a great deal about the country and were inspired to make another trip in the near future . We would highly recommend Tour radar and DNQ without reservation"},{"rating":"5.0","review":"Highly appreciate all services that you brought to us from the beginning till the end. All hotels are centrally located & indeed, they are highly valued on the tripadvisor. Our guides are working hard & enthusiastically, knowledgeable and speaking great English. cars + drivers are always punctual and polite. We'll come back & use DNQ TRAVEL again and recommend to our  friends"}]},{"name":"Extraordinary Vietnam Adventure Tour 13 Days ( Tu Lan Cave Camping/ Hanoi/ Mai Chau)","reviews":[{"rating":"5.0","review":"It has been a wonderful trip, exciting and well organized. The three days in Tu Lan Cave and jungles are amazing. The places, guides, everything. Give our thanks to all our team for this wonderful trip."},{"rating":"5.0","review":"Hien From S Viet travel organized our trip starting from visa approval letter to car hire/driver/accommodation/train booking for our Sapa tour, halong tour, Halong cruise, Dong Hoi caves tour, Hue & Danang tour. Everything was well organized and Hien was always available on the phone to assist with even after hours. Everyone in our group including children had good time. Thank you for well organized trip."}]}]