[{"name":"Best of North Vietnam - 7 days","reviews":[{"rating":"5.0","review":"We heard about Northern Vietnam is the most peaceful area in the country. So we decided to spend our vacation with this 8-day trip and Crossing Vietnam Tour who earned a number of positive feedbacks was our last option. We just had to pack our belongings and be taken care by the company. All of the highlights were shown in the tour. We had Alex as the guide and his english was beyond our expectations. \nHighly recommend"},{"rating":"5.0","review":"We did a seven day tour with Vietnam crossing including Hanoi, Sapa and Halong Bay!\nEverything was like clock work. All pick ups on time and all the hotels were good and we upgraded in one to get a junior suite. Alice was always available and very helpful. The street food tour with Alice was also a lot of fun. The only negative was our guide in Sapa who was not informative. Thank you Alice and Vietnam Crossing!"},{"rating":"5.0","review":"This was a great way fr us to see ad experience some wonderful parts of Vietnam in 7 days ,we had and almost no time to do our own planning, Lucy was great in working with our schedule and just overall communication It was really well planned and all our guides were very well knowledgeable. Even when there were small issues, Lucy was very quick to resolve them and give alternatives. We had a great time and the highlights for us were definitely Halong-bay Cruise, Ninh Binh, and overnight train to Sapa and the whole Sapa experience. We will talk about this trip for a while. Thanks Lucy and Thanks best price travel. If you are debating it, do it and go with the flow, be flexible and just enjoy your time."}]},{"name":"Highlight northern Vietnam Tour 7 days/6 nights","reviews":[{"rating":"5.0","review":"We had a private tour for just 2 of us. Guide was pleasant knowledgeable and prompt. All went as planned"},{"rating":"5.0","review":"It was one of the best decisions i made when coming to Vietnam. We heard about Northern Vietnam is the best destination of the country. Vietnamese cuisine was showed by a local guide (Hoang) with many family business and their stories. It deserves every penny"},{"rating":"5.0","review":"Great trio and splendor scenery. We had a fantastic guide and excellent support od customers service"},{"rating":"5.0","review":"One of the best tours I've ever joined. Free upgrades were given for our booking. Abraham was so thorough and extremely friendly. Kudos Abraham :) Transportation was also included straight from our gorgeous hotel which was included in the tour to Ha Long Bay. Another awesome part of the tour was the food tour that Abraham brought us to. The food tour was fascinating and he brought us to a local coffee shop which served the best Vietnamese Coffee I've ever had on my Vietnamese trip with a reasonable price. It's worth every single penny.  Highly recommended to everybody :)"}]},{"name":"8 Days Immersed In The Beauty Of Northern Vietnam","reviews":[{"rating":"5.0","review":"This is an amazing tour. Free upgrade was introduced for our booking. Alex was so thorough and friendly. Kudos Alex!!!! It deserves every penny. \nMust have Alex in your tour."},{"rating":"5.0","review":"This is 8 unbelievable days in Vietnam. Northern Vietnam is the best part of Asia we have seen. Halong bay is our favorite stop. Our host did great job about hotels and meals. The tour guide Alex was informative and synchronised our difficult flights.  Highly recommend"},{"rating":"5.0","review":"Our booking was upgraded to private for free. So we had more private time to enjoy the beauty and we were able to ask more activities to hộp explore this country. Good company!"},{"rating":"5.0","review":"We spent 8 unforgettable days in North of Vietnam organised by Crossing Vietnam Tour. Local food tour in many hidden gems in Hanoi was a thoughtful greeting from the company. After a great night a hotel, we were able to discover more history and visiting places in this capital with a local guide. After enjoying 1 night on the cruise in Halong bay and Pearl farm, we did sleeper train to Sapa where we were capable to learn about ethnics lifestyle and explore more pastoral scenery. I am willing to recommend this company for everybody"}]},{"name":"Scenic Saigon Motorcycle Tour to Nha Trang via Mui Ne and Da Lat, Bao Loc","reviews":[{"rating":"5.0","review":"Me and a friend went into this trip without a clue what to expect. The bikes were delivered to the door of our hotel on the first day with the guide (Vinh) and the trip was planned out for us with the locations that we picked, which included food drinks and accommodation.\nI cannot recommend this enough, I don't want to go into too much detail or I'll spoil it for you, just give it a go!!! Thanks to Mr Dong and Vinh for a very memorable trip."}]},{"name":"Vietnam in Your Eyes - 7 days Original Experiences","reviews":[{"rating":"5.0","review":"I am extremely happy with all the tours I took part in organized by Crossing Vietnam Tours (Ha Long Bay, Hanoi, Sapa). I would definitely recommend to everyone to use their services!"}]},{"name":"Best Selling Saigon Motorbike Tour to Mekong Delta, Dalat, Nha Trang, Mui Ne and Vung Tau","reviews":[{"rating":"5.0","review":"We had an amazing adventure of a lifetime riding through the Mekong Delta and Dalat Nha Trang ... Kudos to our guide Mr Cong who tailored the trip around our riding experience and DNQ Travel , it meant a member of our tour who had never ridden before also had a safe and amazing time! Thank you!"}]},{"name":"Vietnam Beach Paradise - Halong Bay/ Mui Ne","reviews":[{"rating":"5.0","review":"My trip was well planned with the support from S Viet team from the first to the end of the trip. I even forgot my bracelet on the bus when we went to Halong Bay, thank you Hannah for all your help. Much appreciation and much love."}]}]