[{"name":"Discovery South of Viet Nam 4 days","reviews":[{"rating":"4.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"4.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"5.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"The Best Vietnam Family Vacation - 19 Days","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Halong Bay 3 Days 2 Nights at BEST 4 STAR CRUISES: Transfer, Meals, Kayak, Cave, Island - CHEAPEST PRICES","reviews":[{"rating":"3.5","review":"Fantastic. This was more than we had imagined. Natural trek was amazing. Our guide Xumei was so beautiful . A great ambassador for Sapa. Recommend this tour and this homestay."},{"rating":"4.0","review":"Fantastic company. Recommended! We spent 2 weeks in Vietnam and pretty much used Vietnam Travel Top for all of our day tours. They organised our entire 10 day stay in Vietnam, traveling from North to South. The tours were of a uniformly high standard, the inclusions were all as advertised, the accommodation was excellent for the price. I would absolutely recommend this company to others. They were well organised, reliable and flexible, allowing us to make changes. we would use Halong Bay tours again without hesitation."},{"rating":"3.5","review":"Overall experience is great. Dieu Anh from Vietnam travel top was great. She tried to accommodate all my request and keep on inform daily and check on us making sure we were fine. Trip to Ninb Binh is better than expected the tour guide is so good. the optional excursions that is arrange for us by Dieu Anh was great too. Totally recommended will booked again with them in near future"}]},{"name":"Trekking and Kayaking in Cat Ba 4 days 3 nights","reviews":[{"rating":"4.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"5.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]},{"name":"Adventure in Ho Chi Minh City - Mekong Delta 3 days 2 nights","reviews":[{"rating":"4.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]},{"name":"Adventure to Cat Ba and Lan Ha Bay 3 days 2 nights","reviews":[{"rating":"4.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"3.5","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]}]