[{"name":"Mystique Vietnam in 12 Days/ Mai Chau- Mai Hich - Ha Giang - Sapa - Bac Ha","reviews":[{"rating":"4.5","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]},{"name":"Vietnam Beach Vacation 15 Days","reviews":[{"rating":"4.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"3.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"5.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Through Viet Nam 13 Days 12 Nights from Hanoi to Ho Chi Minh City","reviews":[{"rating":"4.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.5","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"3.5","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"6 Days Northern Vietnam tour with Sapa Adventure, Max 6 Guests","reviews":[{"rating":"3.5","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"4.0","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"4.5","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"Vietnam - A Heart Touching Beauty (Ho Chi Minh/ Nha Trang/Hoi An/ Halong Bay/Hanoi)","reviews":[{"rating":"5.0","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"5.0","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"10 Days Classic Vietnam trip from North to South, Max 6 Guests","reviews":[{"rating":"4.0","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"5.0","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"4.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"6 Days Mekong Delta tour from Ho Chi Minh City, Max 6 Guests","reviews":[{"rating":"5.0","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"3.5","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"5.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]}]