[{"name":"Vietnam Aqua Life - Cruising To Halong Bay/ Mekong Delta","reviews":[{"rating":"4.0","review":"The staff on the tour were all great. The tour guides spoke English very well and made the tours entertaining.  The only draw back for the entire tour was the cruises. They became repetitive after the first day for things to see. It would be better adding a day or 2 in Hanoi and Ho Chi Minh.  We enjoyed Hoi An the most and could have used another day there as well."},{"rating":"4.5","review":"We booked our tour with Dat and have had a wonderful time  in Vietnam. Vietnam is really wonderful and managed to squeeze in several cities. We loved our holiday and Dat and our guide Sony and S Viet Travel were so helpful when we had an unexpected problem. Would highly recommend."},{"rating":"4.5","review":"I am so impressed! I was in Viet Nam for 12 days and everything was absolutely perfect. Their professionalism, attention to details, organization, and their extremely knowledgeable tour guides were superb! If you're looking for Outstanding service, look no further, S Viet and David are the one you looking for"},{"rating":"4.5","review":"S Viet organized an individual tour for my husband and I. It included Hanoi, Halong Bay, Hoi An, Saigon, The Mekong Delta and Can Tho. At every stage we were picked up from the airport/hotels in air conditioned cars with teriffic guides, we stayed at fabulous hotels, had fascinating/interesting tours and all in all had a fabulous time. I couldn't recommend them highly enough. We will definitely be travelling with them again."},{"rating":"5.0","review":"Just spent 2 weeks in Vietnam and S Viet Travel for all transfers and day trips there transfers were always on time as were the day trips. Tours were good with great guide's that spoke good English"},{"rating":"5.0","review":"I’m always a smooth traveler and this is definitely an unique way to see Vietnam. The trip had run smoothly throughout and the most highlight part is Mekong Cruise, I have never slept so well."},{"rating":"5.0","review":"Found the promotion for this tour and absolutely worth the money, Halong is magnificent but pack of tourist while our time in Mekong was much better and we had a really good time mingling with local. Thanks tourradar and S viet Travel for providing this trip."}]},{"name":"Halong Bay Cruise & Cat Ba Island - 3 Days","reviews":[{"rating":"4.0","review":"Guides were very friendly and welcoming. Tour bus from Hanoi to port was relatively new, clean and comfortable. Boat like many others in the bay was fairly old and a bit run down. Had a great view from the top deck. The lock on our room broke and we needed to be moved to another room, the shower in the new room did not drain water so well. The tour packed in a lot of activities over the three days including a cave visit and hike up Ti Top island. Expect to pay for all drinks on the boat and corkage fee to bring your own drinks. Cat Ba island hotel was nice with a great view of the harbour and only a short walk to town. The hike included on Cat Ba was quite strenuous but the view from the top of the mountain fantastic.  The trip to monkey island on a small boat off Cat Ba was cool - the monkeys can get a bit agitated, and are experts at raiding back packs, zippers pose no problem for them. Overall a lot of fun was had on the tour and it was well organised and the guides kept the group busy."},{"rating":"4.0","review":"The tour guide and staff were excellent. The food was good. The rooms were great. Pick ups and drop offs smooth. I can say only good things about the staff. Their sense of humor and duty to their jobs was above board. The only problem I had was with how many other tours and tourists were doing the same thing at the exact same time."},{"rating":"5.0","review":"Everything was organised, very quick and efficient. We had no contact with the tour guides but somehow everything was organised for us and we had people picking us up from hotels, boats, bays. We had an amazing room on the cruise and in the hotel."},{"rating":"4.5","review":"The scenery in Ha Long Bay is breathtaking. It would be great if we could stay for more than one day at the sea."},{"rating":"3.0","review":"The 3D2N Tour was an incredible sight with some fun activities in between, but unfortunately it is let down by a few things. The scenery and experience is incredible, but the comfort of the accommodation was quite poor (especially the hotel on Cat Ba Island). The activities were very fun and provided an incredible experience. Bring your own water as there is very limited amount supplied and they charge you on the boat for all drinks (including water). The meals were the worst food we had on our 3 week trip of Vietnam, and gave us food poisoning. Often we would see our prepared meals just sitting in an extremely unhygienic kitchen for over 30 minutes waiting to be served. My recommendation, 1N2D would be a more enjoyable experience"},{"rating":"3.0","review":"Rebecca and I decided to take this tour as part of our introduction to Vietnam. The first day and the first night was incredible! Lots of activities and the staff were awesome! however\n\nwe were very disappointed the next day.... we were carted off at 9 am to a small day tour boat where we were mixed with other tour groups... we waited 4 hours with only swimming to do before being served lunch... after that, we were finally taken to our destination! BUT\n\nOn our way, we had to stop at 6 other resorts to drop other passengers from different tours off... what a stuff around! there was no communication from the team in regards to where we were, or who was getting off... 3 people missed their stop, and people from other tour companies got on our boat\n\nwhen we FINALLY arrived at Cat Ba Island, we were crammed into the smallest bus I have ever been on, and, after a car crash in front of us, we were taken through dodgy back alleys (I will commend the driver on his skills), only to arrive at another hotel... there we all got off the bus only to be told that it wasn't our hotel... so we all got back on the bus...\n\nOnce we FINALLY arrived at our hotel, we checked in, came up to our room, only to find a dirty room, with no amenities (even simple ones... like tissues and a clock) and the power plugs are the \"old Vietnam\" style, so our adaptor plug does not fit. at this point we were like \"we just want to sleep!!!!!!\" and so we headed for the bed... BUT\n\nwhen we got to our bed, it was about as soft as a BRICK. no sleep for us tonight. I'm dreading the idea of dinner and breakfast..."},{"rating":"4.5","review":"Highly recommended. Excellent tour - well organised, very professional. Mindy in particular was excellent - knowledgeable, friendly and funny."},{"rating":"4.0","review":"When I booked the tour I thought we'd be with the same people. Unfortunately, one three of us from the first night on the cruise continued to Cat Ba. We switched boeats at least ten times on the entire trip which made it difficult to meet and connect with people as the group was torn apart all the time. We arrived in Cat Ba at 3pm and left at 7am the next morning so it wasn' t really worth coming there. The entire third day was transportation so I wouldn't call it a three days tour. Food was great and plenty. The tour guides were great, positive and very organised. It is a bit expensive for what you get, the boat is quite worn down and there were ants in the room."},{"rating":"3.0","review":"The bus from Hanoi to Halong city was big and confortable. The bus from Halong city to Hanoi was over crowded and und comfortable. We had to change from one ship to another with the luggage several times"},{"rating":"4.5","review":"The tour was great, the activities were all fun and informative and our tour guide was really good, the hotel in cat bar was lovely."},{"rating":"5.0","review":"Everything we expected and more\nSuperb guide & truly awesome UNESCO place - Halong bay. Should be on anyone's bucket list. A really good mix of different nationalities on our trip and the activities we did we're very good indeed. Activities included kayaking, hiking, cooking classes, squid fishing, cycling and swimming. \nWith this particular tour you also get to experience Cat Ba Island, which is definitely worth a visit. Highly recommend using this tour company, the whole thing was seamless and stress- free."},{"rating":"5.0","review":"Everything we expected and more\nSuperb guide & truly awesome UNESCO place - Halong bay. Should be on anyone's bucket list. A really good mix of different nationalities on our trip and the activities we did we're very good indeed. Activities included kayaking, hiking, cooking classes, squid fishing, cycling and swimming. \nWith this particular tour you also get to experience Cat Ba Island, which is definitely worth a visit. Highly recommend using this tour company, the whole thing was seamless and stress- free."},{"rating":"5.0","review":"I love everything about our trip. It was a memorable experience visiting Vietnam, learning the culture, eating food like the locals and just enjoying the company of my friends as well as awesome tour guide, Sam and the rest of his crew. I would love to go back!"}]},{"name":"Twelve Day Highlight Vietnam from North Down To South","reviews":[{"rating":"4.5","review":"I came across Vietnam real tour through tour radar which I originally was skeptical of as none of my friends had heard of either company. I’m so glad I booked as it made the start of my travels so relaxing and hassle free. The only problem I had when going ahead to book was that being a single traveller you couldn’t book a shared room which meant an additional charge. I contacted Manh and explained I couldn’t afford to do the trip paying for private hotel rooms so he then changed the tour for me to shared hostel rooms which made it cheaper which was a bonus. I also wanted to add the golden bridge tour which he arranged into my 12 day tour. \nBy far the the best places was Halong Bay and Hoi An. \n\nThe whole tour was so well organised I highly recommend booking  Vietnam real tour. If you have any queries on the trip  you can contact Manh he’s always available to help."},{"rating":"5.0","review":"Did the 12 day Highlight Vietnam tour and it was hands down the best holiday I have ever had. Vietnam is such a beautiful and friendly country. The tour planned it so you could see all the best places throughout the country. They organized all transfers, hotels, and tours. Majority of meals included as well!! Manh, our trip manager was our point of contact for any concerns, questions, or recommendations. He responded so quickly to any of my questions. We even asked last minute if we could change one of the tours to something else at like 9pm and he responded instantaneously, cancelled the one tour, and booked us on the new one with no problem. 15/10 recommend you do this tour!!! Best travel experience ever."},{"rating":"5.0","review":"Very good tour. It is a collection of individual tours, hotel reservations and airplane tickets already pre-booked. So you end up doing an independent travel on your on, without the hassle of finding and combining all the tours with the hotel and airplane reservations. That was exactly what we were looking for. The hotels were good and well situated and the meals that were provided were of good quality.\nFinally, Manh Tatien was very supportive during all the trip, answered all our questions and went the extra mile for an uneventful trip!"},{"rating":"5.0","review":"Absolutely brilliant!! I had SUCH a good time on this tour, visiting the most beautiful places in Vietnam! Manhs was an absolute pleasure to do business with, took great care of us from start to finish of this tour! Thank you thank you thank you!! Highly recommend :)"}]},{"name":"Truly Vietnam - 14 Days","reviews":[{"rating":"5.0","review":"Outstanding organization. Fantastic itinerary, incredible guides, all way above standard. I would choose your agency again"},{"rating":"5.0","review":"Great tour from the begining. Mike came to meet us at the hotel for the briefing and keep follow us till the end of the trip. Everything so smooth just as the itinerary we want. \n\nOur guide speak well English especially Nay in Sapa. She explains to us alot about her daily life and local cultural. \n\nWe love Vietnamese food and it surprise us everyday with so many different courses.\n\nDefinitely would recommend this trip to anyone \nThank you Mike for all the spectacular arrangment."}]},{"name":"Vietnam Highlight 10 days","reviews":[{"rating":"3.5","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]},{"name":"Da Nang - Hue Imperial City - Golden Bridge - Hoi An 5 Days 4 Nights Package Tour.","reviews":[{"rating":"4.0","review":"Luco Travel is just the BEST. Louis is an attentive, thoughtful, and knowledgeable guide who is incredibly kind and takes great care to make sure you are well looked-after. He makes sure to put *your* objectives for the trip first and ensures you have a wonderful time. He has boundless energy and humour, and he helps you to learn a lot about the history and culture of Ho Chi Minh City, Cu Chi Tunnels, Mekong Delta, and Vietnam overall while also making the trip super fun! He is also keen to know more about his tourists and open up about himself, which makes it seem like he sincerely loves his job and working with people. We were a fairly big group, but we were no trouble for Louis and his staff to manage; everything ran super smoothly with no issues. For us, it truly was the trip of a lifetime. Amazing tour operators deserve our support, and we really hope you'll support our dear guide, Louis. You won't be disappointed!"},{"rating":"4.5","review":"If you are a outgoing person or novel seeking person, If you want to gain cultural experiences, If you want to meet locals, If you want to know Vietnam culture deeply, Don't Hesitate just join their tour to explore it. it's worth it for you to travel Vietnam with Luco Travel."},{"rating":"5.0","review":"the schedule was quite smooth and thanks for his caring"}]},{"name":"15 Days Highlight Vietnam from Ho Chi Minh city up to Hoi An and Hanoi","reviews":[{"rating":"4.0","review":"This was a reasonable priced tour and all went well.\nA couple of points: I don’t recommend the overnight train,-crowded, shared bathrooms, people opening your LOCKED  cabin door repeatedly through the night.\n- Be aware this is a satellite tour so each time you hop on a bus you will be with completely different people this maybe okay for you but you just need to know.\n- I paid the extra $10 us , per night to ensure we had a room WITH a window. This was classed as an upgrade and I assumed it meant upgrade to 4 star but it doesn’t it  means upgrade to a window.\n-Sadly be prepared to see lots of heartbreaking pollution. The sky’s are gray, the beautiful Mekong tragically brown with none stop garbage floating down. Do take pictures of the rubbish and post and/or send to Vietnam tourism they need to know they will loose tourists! Bottled water!! Try where you can to limit it, refill where possible. I was boiling the kettle each evening  and filling up in the morning when the kettle was cold.\n\n-Manh was very helpful, readily available to contact on watts app at any time. As we had paid in one the hotels for an upgrade (Literally no room to walk around the bed) he compensated us for that cost and ensured we had a very good room in our last hotel."},{"rating":"4.0","review":"Great tour operator. Mr Manh from Vietnam Real Tour has always been very responsive to every question I had before and during the trip. The tour is overall very well organized with free time in every place I visited, giving me the chance to discover and live in my own way rather than being constantly guided in every step. BIG thumbs up for this.\nAll the daily tours included are operated by different local companies and I shared them with different people every time.\nThey picked my up at the front door of the hostel within the time frames advised and the guides were actually born within that area so it was nice to hear their stories and points of view.\nI also had a chance to have lunch at one the guide's home as part of a tour I did, giving me the chance to breathe a bit of their daily life. Another BIG thumbs up.\n\nOverall I had the chance to be a \"backpacker\" without the stress of taking daily decisions (accomodation,tours,domestic travels...). This helped a lot in enjoying this experience in the best way possible."},{"rating":"5.0","review":"My wife and I recently returned from a month long trip visiting Cambodia, Vietnam and Hong Kong. \n  For the Vietnam portion of the trip we used the services of Vietnam Real Tours. Our trip was essentially the 15 Days Highlight Vietnam ( Tour Radar.com) with some minor modifications.\nThroughout the trip, our co-ordinator, Mr Manh Tatien, was readily available by phone or WhatsApp for any issues or questions. We were able to request some minor changes to the itinerary to suit our own interests, something not possible with most other agencies.\n All in all, we were provided with a fantastic tour covering almost everything on our wish list. There was adequate down time in most cities, allowing us the choice of relaxing or exploring on our own.\nThe hotels, for the most part were all centrally located or an easy taxi ride away from the main tourist areas. The included tours were well organized with guides who seemed well versed in their subject matter. \n   We chose the overnight sleeper train for the trip from Hue to Hanoi- an interesting way to see the country once the sun comes up. However, I would not suggest it for someone who is a light sleeper as the ride is rather bumpy compared to European trains.\n  Hanoi has lots to see so I would definitely suggest extending your trip if time permits. Again Mr Tatien had no issues with extending our stays in both Hanoi and Saigon, providing free transfers in both cities. Breakfast was supplied by all hotels and usually included a good variety of foods including Pho which is an interesting way to start your day. Very satisfying lunches were included on days when we joined local tours and on other days we had the opportunity to sample local dishes on our own.\n All in all, I would highly recommend this company for longer trips such as ours or even single day trips for those travelling on their own who are looking for a local guide service.\n  Price wise, I do not think we could have found a better option without sacrificing comfort and hotel quality. My Thanks to Manh for making our first trip to Vietnam a very memorable and enjoyable experience"}]},{"name":"14 Days Vietnam Beach Holiday","reviews":[{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We booked a North to South tour with Swallow Travel in October. What an incredible trip and only possible thanks to Thoung in Swallow Travel, Thoung arranged everything , all our pickups were bang on time , accomadation was fabulous and we got to do and see everything we wanted at a really affordable price. Thoung was brilliant and her attention to detail second to none, the tour was so flexible I was able to make any changes I wanted.Thoung kept in touch with us throughout the tour , a truly memorable holiday , thanks to Thoung in Swallow Travel. We would not hesitate to reccomend or use again.\nSiobhan \nDublin, ireland"},{"rating":"5.0","review":"I give a thumb up to the agent, Jenny who took great care and courtesy in tailoring my 2 weeks travel itinerary, from stays, tours to pick ups . Very impressed with her efficiency and genuineness in answering all my enquiries ever since the start of my trip planning.\nOur family had a great time touring Vietnam. Would recommend Swallow Travel to anyone"},{"rating":"5.0","review":"The experience I had in Viet Nam and Cambodia was made almost perfect because the the efficiency of Swallow Travels planning and having everything in place and in order at every point of our trip through out the whole region and with tours arranged at exactly the right moment.\nI wouldn't hesitate to recommend them as a means of seeing the country in a perfectly safe environmnent."},{"rating":"5.0","review":"They worked to our budget and provided good advice in the planning stage. On the tour itself they responded quickly and to our satisfaction. Highly recommend!"},{"rating":"5.0","review":"I went with two friends and Swallow travel booked all our accommodation in Hanoi, Sapa where we did a couple of treks, and on Halong Bay where we spend a night on a cruiser. They arranged meals and pick up from the airport and an evening food tour in Hanoi and a cooking class in Hoi an. I felt we were well looked after and nothing was too much trouble to arrange. I would highly recommend them."},{"rating":"5.0","review":"Thoung at Swallow Travel really looks after her customers.Her goal is to give you the best experience possible.She called regularly to make sure all was satisfactory with the tour and always fulfilled any request that we had.\nGreat personal service from a young and dedicated entrepreneur and her staff."}]},{"name":"Vietnam Honeymoon Vacation","reviews":[{"rating":"4.5","review":"First of all, we had the most wonderful trip of our dreams! Top Vietnam Travel gave excellent customer service in helping us plan our vacation. They really took care of our needs and everything planned was experienced. We are very happy customers. This was our first trip to Vietnam and we were there for two weeks. Two fun-filled with amazing activities."},{"rating":"4.0","review":"We went on a honeymoon trip To Indochina for the first time and they set everything up for us from beginning to end. They did an excellent job and was very helpful. The best vacation ever I would recommend Top Vietnam Travel and will book my vacation with them for next time"},{"rating":"4.5","review":"They made my trip around Vietnam more expectation. They were extremely knowledgable and were able to answer every question. Taking us out of the normal tourist-packed areas around the real authentic Vietnam. Thank You Top Vietnam Travel for a wonderful trip. ❤"}]},{"name":"Natural Vietnam - 10 Days","reviews":[{"rating":"4.5","review":"Wonderful!!! I had a lovely time, it was well organised. My hotels, bus, train, flights, tours, and transfers all ran smoothly. I was traveling alone and felt safe the whole time. You are not with a set group for the trip, you just join in tours every day, which was actually quiet nice as I got to meet many people throughout the time. I would highly recommend Go Asia Travel.com. The Vietnamise were wonderful and I saw many many great sites!"}]}]