[{"name":"8 Days Best Vietnam North to South Tour, Max 6 Guests","reviews":[{"rating":"5.0","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"4.5","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"5.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"Vietnam Family Holiday - 15 days","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Simply Vietnam","reviews":[{"rating":"4.3","review":"Up to the usual high standard, I look forward to my 10th trip with Explore!"}]},{"name":"Vietnamese Culinary Journey","reviews":[{"rating":"5.0","review":"I can represent the place as \"The Best of Vietnam\". The Golden bridge of Vietnam which is located at Ba Na Hills. The huge bridge placed in giant arms. Truly, the Best place to visit in Vietnam!"},{"rating":"5.0","review":"We had booked first time with Threeland Travel. They were very friendly and gave us all the facilities related to journey. We planned trip for Vietnam and Cambodia and it was awesome!"},{"rating":"4.0","review":"I had booked the tour with Threeland Travel in the back of May-2019. They gave me luxurious facilities with comfort. Thank you!"}]},{"name":"15 Days Majestic Vietnam - Heritage lines","reviews":[{"rating":"5.0","review":"I would like to thank Sunny for outstanding service although we had to cancel when we were in Vietnam due to the Corona virus and return home Sunny offered so much help and support by trying to keep the tour going but unfortunately to many places were being put into lock down. So I cannot respond regarding the tour."},{"rating":"5.0","review":"Sunny was very organize, friendly, and pleasant to deal with."},{"rating":"5.0","review":"We can't say enough thanks for Chloe and her team at Vietnam Allure Travel for making our trip in South East Asia memorable. We booked the 16 days tour Vietnam and Cambodia through Tour Radar and were well taken care of from the beginning to the end. When we arrived Hanoi, Vietnam, Chloe came to our hotel and gave us every documents needed. She also provided us a local SIM that we used to contact her easily. Well, everything was very good from hotels, cruise tour to transportation daily and road tours. We highly recommend Vietnam Allure Travel"}]}]