[{"name":"5 Days North Of Vietnam Package","reviews":[{"rating":"5.0","review":"overall , i was satisfied with this tour. all accommodation was good. for my personal , the itinerary also simple, but it still allow me to explore by myself  the city. Transportation, hotel, foods and a tour service during trip were good. I also appreciated with the guy as  tour guide who handle us during Ninh Binh tour. He was so good as tour leader. Charming, friendly and helpful for all guests. all feel comfort and enjoy the trip."},{"rating":"4.5","review":"Overall pleasant tour! Simon our tour guide had good attitude of work.\n20 people on cruise - not crowded, plenty of space. Bathroom and dining areas were clean.\nFoods are delicious. Sundeck was great for viewing Ha Long Bay.\nThanks Simon and and the cruise."},{"rating":"5.0","review":"Unforgettable Trip!\nI would strongly recommend to go on exactly this tour.\nHa Long Bay is really a beautiful island which lets me feel relax and worthy.\nOur guide David was extremely friendly and funny and spoke very good English!\nThe food and bus good and we really enjoyed the tour...\nI would highly recommend this tour."},{"rating":"5.0","review":"We had a wonderful trip to Hoa Lu-TamCoc , some 2 hours from Hanoi Capital.\nMy family definitely enjoyed the trip to this \"Ha Long Bay on land\" - more so than Ha Long Bay itself.\nThe cycling trip at the end of the trip was enjoyable too. I would recommend highly this trip to you."},{"rating":"5.0","review":"I thoroughly enjoyed this day trip with our guide Simon who is very knowledgeable about this region's history.\nThe ride along the river showed us the beautiful karsts and the rowers have incredible\nstamina rowing for about 2 hours using arms and legs! This trip also involves cycling around the countryside for about 40 minutes and before the activities, a buffet lunch was provided.\nTour highly recommended if your want to see a bit of Hanoi's countryside in a limited time to spend in Hanoi.\nThank you very much for making my trip a memorable one."},{"rating":"5.0","review":"Excellent tour to Halong Bay. We did the tour to Halong Bay from Hanoi with our guide, Kevin. He explained so many things to us. His English was quite good, extremely friendly person and very entertaining and funny.\nThe food given for lunch was very good. Titop island and Amazing cave was amazing. It was the best part of the trip. Our guide Kevin was really informative and fun."},{"rating":"5.0","review":"We didn't know any tour program, so I asked the hotel and they booked for us via Vietnam Travel Top.\nThe package include day tour to halong bay. The tour guide is good in command(David).\nWhen we was moving on the bus he let us know many things about Viet nam.\nI think Hanoi is better place to travel with tour operator like Vietnam Travel top, because it is quite hard to travel by myself(not that good transportation, such as metro, bus).\nI highly recommend this tour guide and company to everyone wishing to visit the jewel of nature, magnificent Halong Bay."},{"rating":"5.0","review":"Incredible Vacation! We went with Vietnam Traveltop and they were great.\nWe went with a big boat to Halong Bay, they sereved really good vietnames food. You take a walk on the beautiful mountains and visit a large cave!\nOur tour guide, Kevin is a very nice & helpful person.\nSurprisingly he’s able to speak good Mandarin.\nHe took good care of us and gave us a wonderful insight into Halong Bay.\nReally thankful to Kevin for the enjoyable trip. Hope to see you next time!"},{"rating":"5.0","review":"The package is so great. The bus was surprisingly comfortable, which is a must for a long drive to Hoa Lu-Tam Coc, water provided and air-con worked well.\nOnce we arrived, we had lunch which was awesome - first time we are eating something nice in Vietnam. Lunch buffet was simple but taste good.\nNice experience cycling around the beautiful paddy field. Safe trip was had by all."},{"rating":"5.0","review":"Great experience. Halong & Hoa Lu-Tam Coc are so beautiful.\nEn route to halong bay in the bus, our guide (David) gave a brief history of vietnam, about halong bay and details of life style of the people of vietnam. All along the trip he was very supportive.\nOverall,he made the trip not only entertaining but also informative. Wish Mr.David all the best in his profession."}]},{"name":"Package Tour Crossing Vietnam - 5 Days","reviews":[{"rating":"4.0","review":"I took this tour in November. Overall it was okay. Last minute changes to tour and i was on private city tour on Ho Chinh Minh which means tour finishes early. Flight booked from saigon was 8pm and tour guide drop me at 3pm. So have to wait long at airport with no many facilities. Reached Hanoi at midnight(all food shops get closed) as flight was delayed too by 1 hour. Went to hotel and slept straight away. Halong Bay was good and cruise was fantastic. Drop back at airport on time. Overall it was average. For next time if i choose then i will try to be part of making my itinerary too as they make for us. Tony incharge at legend travel was very helpful and tourist friendly. Will come back to visit sapa."},{"rating":"4.0","review":"The trip was excellent. The tours were on-time, well planned, and the tour guides were very knowledgeable. "}]},{"name":"Ho Chi Minh to Phu Quoc via Mekong Delta River 7 days","reviews":[{"rating":"4.0","review":"Good tour with a good balance of activities and free time. Food was great, as was the pretour service. The drive from Can Tho to Rach Gaia is a bit rough but was helped by the comfortable car and a nice coffee break. The tunnels are good and you get to choose between a good range of automatic rifles and heavy machine guns to shoot. I chose a m16 and an m60 but there is a carbine, ak47 and a couple of others. The ammo is very expensive though at 60,000 for 10 bullets. The war museum is one of the best parts, I learned loads and the traps and chemical weapons (agent orange) engaged my morbid curiosity. \nGreat tour, I’d definitely recommend it!"},{"rating":"3.5","review":"I can’t remember guides names but one was excellent the other was difficult to understand, but I am a bit deaf. All the connections were excellent, but it would have better if all tour members were in same hotel so you could socialise in the evening. Would be prepared to pay more for better hotel and meals."}]},{"name":"Best 7 Days North of Vietnam","reviews":[{"rating":"4.5","review":"A fabulous tour!\nWe arranged our trip with Vietnam Travel top through our hotel.\nMr Kevin was a fantastic guide. He was energetic, dialed into the mood of the group, and looked like he was really having a great time showing us around for the day.\nThe trip to Tam Coc in Ninh Binh provence was a great experience.\nOur guide gave us not only information about the places we visited, but during the trip told us much about Vietnam's history and how the people currently lived.\nVery informative, useful information. He also made sure that we were not \"hounded\" by the locals !!!\nThe trip was supposed to end at 5.30pm but the guide was very customer friendly during the trip, allowing plenty of time for photos and questions ... this extended the trip by about 2 hours but the guide was quite relaxed about this and made no attempt to hurry us through the day.\nWe met some great fellow tourists on the trip also.\nKeep up the good work Kevin and may god bless you.\nIt is highly recommended to visit Vietnam again via Vietnam Travel Top."},{"rating":"5.0","review":"This tours is really a must and it as to be done.\nThe Day tour to tam Coc and Hoa lu worth every dong you will spend. The trip to Tam Coc last about 3 hrs, but allows you to see a wonderful piece of north vietnam.  The scene really beautiful and surrounded by hills. The scenery still in mind and unforgettable. And i really enjoyed the trip.\nAnd special thanks to the tour guide - Mr Simon.\nHe  is the best guide you can find in Hanoi. Very professional, enthusiastic, proud of his job and his unique Country. I applaud his talent.\nHighly recommended!!!"},{"rating":"5.0","review":"Vietnam Travel Top offer good value for money.\nOn the Halong Bay trip, our tour guide was Kevin who spoke English well and had a lot of knowledge about Halong bay.\nThe room on cruises was very comfortable and clean.\nThe itinerary of the tour covered what we needed it to. Really enjoyed the kayaking in particular.\nFor Sapa, they booked us for nice bus. It met all our needs and the whole trip was very comfortable with excellent food in particular.\nMy fondest memory of Vietnam will always be our tours with this company."},{"rating":"5.0","review":"The itinerary for the trip was good and relaxing, with very good value for the price paid.\nFirst time ever on an organized tour and it was just really good. they provide an excellent service all the hotels were to a good standard the reps were all fantastic spoke great English. Every pick up was on time we felt like VIPs we did not have a worry they work around you. Same price as other company but MUST book this company. You will feel so comfortable."},{"rating":"5.0","review":"We had a wonderful experience with this great organisation. The guides all arrived at the arranged time and all were very knowledgeable about the history of all the venues we visited. We stayed at very nice Hotel. Had great overnight cruise on Halong Bay and Hoalu Tam Coc day tour. Took overnight bus to Sapa for enjoyable trekking.Visited Bac Ha markets. All excellent and great value. We would not hesitate to recommend Vietnam Travel Top to friends who want to visit Vietnam."},{"rating":"5.0","review":"Me and my family went on a 7 Days tour visiting Hanoi, Ninh Binh, Halong Bay and Sapa. Vietnam Travel Top are very trustworthy and we were pleased with every detail. The accommodation was just as we asked. We had no problems with all the accommodation and cruise. The meals provided were excellent and the experiences we had were memorable. We sincerely recommend Vietnam Travel Top."}]},{"name":"Vietnam Legend Beach Vacation 10 Days","reviews":[{"rating":"4.0","review":"My friends and I had a hassle free 10 days in Vietnam thanks to Ms Phuong and Mr Danny from Indochina Legend Tours. From arranging my transfer in the middle of the night from Hanoi International airport; booking last minute extra nights at the hotel in Hanoi; organising a fantastic 2 nights with Paradise Cruises in Halong Bay and transfers etc, the team from Indochina Legend are complete professionals and I highly recommend them!!\n\nVisited December 2015"},{"rating":"5.0","review":"Hello Phuong\n\nWe had a great time, organisation was good, people were good, nothing bad to say at all.\n\nI have recommended you to some friends to you and given them your contact details.\n\nIf we come back there will be no hesitation in using you again\n\nThanks for the good trip.\n\nRegards\n\n"}]},{"name":"Vietnam Northern Tour to Hanoi - Sapa - Halong Bay","reviews":[{"rating":"5.0","review":"8-Day Vietnam Excursion\nOur trip organised by Ms Loan took in Hanoi, Sapa, Halong Bay. Ms Loan was recommended to us by a friend, and the service was outstanding. She was flexible to meet our needs and gave great guidance. The tours organised were pitched well for us between being informative, and giving us time to explore. The accommodation was clean, classy, and on each occasion it was better than we expected. I could not rate Ms Loan’s help, support, and knowledge more highly - she knows her stuff and was really passionate about her job and country. Thank you!"},{"rating":"5.0","review":"We came to Hanoi for both business and pleasure; therefore we only had limited time for visiting some highlights there. It was a short visit in Hanoi, Halong bay & Sapa, but we had to thank Vietlong tours for such an excellent service, especially for great and fantastic tour guide. We booked online exchanging email with them, and very happy because of the good value for whole package, efficient and fast correspondence. We will return to Vietnam again to see some more and surely to use Vietnam travel.\nHighlights: Just short trip to Hanoi, you can visit all highlights of Northern Vietnam such as: interesting places in Hanoi, World Heritage Halong bay & Sapa with special lifestyle of minorities."},{"rating":"5.0","review":"I did Sapa Easy trek with Mr- Linh who is a really amazing and nice person. Sapa is awesome with beautiful rice terraces. The weather is so cool. Local people are friendly and rustic. The tour was well-organized. Very worth visiting!!!"},{"rating":"5.0","review":"My family have been on many tours and this is definitely the best one. Everything is well organised and well worth the price. All accomodation was nice and the activities on the tour were relevant to the location and fun. The operation team is extremely kind and helpful, they responded our message very quick. I cannot say enough how great this tour is. Highly recommend if you want to make the most of Hanoi - Sapa - Halong Bay in a short amount of time!"},{"rating":"5.0","review":"Can not recommend this whole experience enought... absolutely amazing!"}]},{"name":"VNA001 - 8days North to South of Vietnam","reviews":[{"rating":"4.0","review":"Great tour covering all the important sights, culture and food. The guides in Ho Chi Min were excellent. There were a few glitches along the way but Lily from Your Vietnam always apologised and resolved everything quickly. I would highly recommend this tour."},{"rating":"5.0","review":"The tour exceeded our expectations! From start to finish everything was planned expertly and never missed a beat, all the tour guides and companies they chose were excellent and made the experience that much better. Hotels were also excellent and provided amazing customer service! Highly recommend."}]},{"name":"Real Sapa Experience 5Days/5nights","reviews":[{"rating":"3.0","review":"Our guide was very good and the eight other travelers were great company. The Sapa Tour was good overall but I was very disappointed not to stay at a hotel that was listed in the itinerary. It was what really attracted me to the tour. We were put instead into a very substandard hotel that was in the process of being built. All nine of us on the tour demanded to be moved and after much deliberation, and some hours later, we packed up and went back to the previous hotel. There was no recompense or reasonable explanation."}]}]