[{"name":"Vietnam Family Holiday with Teenagers","reviews":[{"rating":"4.8","review":"The mix of activities was really good, and not having to worry about travel detaisl when with our teenage son was great."},{"rating":"5.0","review":"The trip was very well organised. There was a lot of variety and there was also a little flexibility included too so that if things didn't go to plan there was a simple plan b. Tony (Dung) was really accommodating and kind - and also had a great sense of humour which made it perfect."},{"rating":"4.8","review":"The trip was great value. Our guide Truong Le was fantastic. He’s very knowledgeable intelligent enthusiastic, full of energy and spirit. He really inspired the group and made our trip a delight.He is a great guide and a real asset to your company. Can you thank him again from all of us Jo Angelina Remy and myself."},{"rating":"5.0","review":"Vietnam is a very interesting destination to visit - beautiful scenery, friendly people, delicious food and a fascinating history.\n Tour guide was enthusiastic and knowledgeable.\n Very friendly group dynamic."},{"rating":"5.0","review":"The tour was well organised, the guide was friendly, well informed, energetic, patient and fun"},{"rating":"4.5","review":"We had a great time, met some great people and got to experience many different aspects of the country"},{"rating":"4.5","review":"Our guide Truong was just fabulous. He knew how to handle the teenagers on the trip, played games & was very patient with them.We loved this tour."},{"rating":"5.0","review":"Beautiful and well designed trip with activities which were fun for parents and kids, first class group leader who not only ensured everything ran smoothly but who was truly positive, fun and enthusiastic, went the extra mile and told us a lot about his country, his family, how it is to grow up there, etc, and was wonderful with the kids. And our truly cosmopolitan group of families (Australia, NZ, USA and Belgium) got together very smoothly and got on very well. In sum, we had a wonderful week."},{"rating":"4.5","review":"Toan our tour leader, made this a very memorable trip. He is an exceptional person and had complete control of the tour and kept it well organised. He has a fantastic personality, very positive, always happy and was always thinking about the welfare of the group. The group became a family which Toan promoted the value of and the farewells were emotional.\n We unfortunately encountered a very cold wet week of weather during the cycle leg of the tour around the Hanoi and surrounding area. If Intrepid could improve on anything it would be to advise of possible cold weather in this location and that appropriate clothing should be packed. None of the group was prepared for this and it was not advised in the pre-tour notes."},{"rating":"4.0","review":"Good itinerary. Great trip leader (Tuan was awesome!)."}]},{"name":"Impressive Vietnam 7 Days 6 Nights","reviews":[{"rating":"5.0","review":"Absolutely spectacular!! And our tour organizer, Ms Thu, was fantastic! Her attention to detail and flexibility ensured that we made our connections but still saw everything possible at each location. Accomodations were clean, safe, and comfortable with many extras like coffee in room and robe and slippers."}]},{"name":"North & Central Vietnam - 8 Days","reviews":[{"rating":"4.5","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"4.5","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"5.0","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Northern Vietnam with Sapa","reviews":[{"rating":"5.0","review":"I cannot recommend enough, had a awesome itinerary. I would definitely use them again and thoroughly enjoyed the whole experience. Thank you Toni for organising everything and being helpful with all my questions."},{"rating":"5.0","review":"Hai were of great help for our tour in the North Vietnam! We discovered Hanoi, Ha Long Bay and Sapa and had a great experience thanks to the wonderful arrangements of the agency. Great street food tour, punctual car pick-ups, excellent choice of hotels and always professional support when we had questions! Fabulous trip! Many thanks, Alice"}]},{"name":"Vietnam Insight","reviews":[{"rating":"4.0","review":"Phat was the perfect guide, knowledgeable, caring, approachable, responsible and entertaining."},{"rating":"4.5","review":"Our 12 day Food Tour was excellent. We visited a number of cities and sampled the regional cuisine, including a number of cooking classes where we learned about the ingredients and techniques of preparing Vietnamese specialties. Our guide (Nhi) was always informative, enthusiastic, and showed great patience as she answered our many questions."},{"rating":"4.5","review":"Great itinerary but wished it included hill tribes north of Hanoi. Rest was excellent. Especially liked Ha Long Bay and Hoi An. Saw beautiful sunset through cabin window in Ha Long Bay and had a shirt and pants tailored in Hoi An. People in the group were great and there were only seven total. Excellent, friendly, helpful tour guide - Jolie."}]},{"name":"Mu Cang Chai & Sapa - 5 Days","reviews":[{"rating":"5.0","review":"I really enjoyed both tours. Mu Cang Chai had spectacular sceenery in the rice fields and the day we hiked I was the only foreigner there. The guide eventually got me into a family home in the hill village. They were happy to show us around and demonstrate their talents in cooking weaving etc.Home stay was really great. We had dinner together with the family...grand mother to grand child and all in between. The guide spoke most of the time in Vietnamese so I could not participate much. Plentiful happy water with a very nice atmosphere.\nSapa was also great. Hicking here was much more difficult. Half day brake was at a beautiful ecolodge with a fantastic meal. Really boosted our energy for the remaining hike. Home stay was even better, staying a a rice field working family with the mother being happy to share in our discussion. Very basic accomodation but clean with a nice shower, no wifi. Food was great."}]},{"name":"Highlights of Vietnam from Ho Chi Minh","reviews":[{"rating":"4.0","review":"Great experience. We booked 10 days best of north and south Vietnam tours through Bravo Indochina Tours. Thanks to Angie for organising and assistance. Well planned and courteous guides"},{"rating":"5.0","review":"We had a wonderful experience in Vietnam with Bravo Indochina Tour. Our Travel Consultant Mr T was very helpful at all times. Our guides, Mr Hai, Mr Nguyen and Mr. Victory  were all extremely helpful and very informative. The tour had a great mix of cultural, historic, scenic and culnery experiences. We travelled by car which was very comfortable with competent drivers. We received help from the guides with our internal flights. Overall we had a a great experience"},{"rating":"5.0","review":"Got to know about Bravo Indochina Tours and their credentials when I was browsing Tripadvisor for places to visit in Vietnam and the rest was nothing but a great experience. Right from the initial contact, Angie has been very responsive in addressing our wish list while still being considerate on our budget. Her attention to details was surely reflected in our experience. Be it the choice of places of interest, assignment of personalized tour guides, choices of hotels and the value for money, our 12 day trip to Ho Chi Minh and Hanoi was truly value for money and we  felt throughout that we were in good hands. The choices of hotels were great picks in terms of quality, amenities, location and the overall experience"},{"rating":"5.0","review":"I just returned from a wonderful trip to Vietnam with Bravo Indochina Tours. I booked them via Tourradar and it went smoothy from beginning. Angie worked closely with me via email to plan the tour and my guide, Hai, was knowledgeable and fun to be with. Our driver provided safe and comfortable rides. We covered a lot of ground over the 15 days and everything was executed flawlessly"}]}]