[{"name":"Vietnam Family Holiday - 8 days","reviews":[{"rating":"5.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"4.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"5.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Highlights of Vietnam","reviews":[{"rating":"4.0","review":"Excellent trip. My experience of Vietnam ticked all the boxes. Our guide was superb. He was very knowledgeable and helped group members with all sorts of issues. The itinery was very interesting. Only disappointment was when we visited the Ho Chi Minh morselium it was closed to the public (this is more of an observation rather than a criticism). Our accomadation was excellent, as was the food. Highlights for me was Halang Bay and the Cu Chi tunnels. Would definately recommend and use Exodus travel again."},{"rating":"4.5","review":"The Vietnam cycling adventure was amazing. I wasn't expecting the level of care and accomodations that Exodus Travel...\nShow more"},{"rating":"5.0","review":"My Vietnam trip exceeded my expectations, Nam our tour guide went above and beyond every day. Dealing with all the...\nShow more"}]},{"name":"Cycle Vietnam","reviews":[{"rating":"4.5","review":"The tour promised to be what they advertised - (less the whole world closing down due to the corona virus of course!) hotels were great, breakfast buffets , food was delicious, sightseeing and tour guide Doan was amazing ! shame it was cut short due by a week, but Doan our tour guide gratefully organised our remainder of the weeks travelling and accommodation in Vietnam which was much appreciated so we managed to get another week of Vietnam in, but not Cambodia unfortunately. Tour radar were brilliant in that I got the pro rata refund for the tour in no time so overall very impressed !"},{"rating":"5.0","review":"I went during the Coronavirus outbreak and I have to say Vietnam was on top of it. Mandatory temperature checks, hand...\nShow more"},{"rating":"5.0","review":"Easy (and to some moderate at times) paced walking trip that covers so many different areas of Vietnam. A good...\nShow more"}]},{"name":"Northern Vietnam KOM Challenge: Hanoi to Sapa","reviews":[{"rating":"4.0","review":"Our family of 5 enjoyed the Halong Bay 3-day bike trip. It was a nice way to see the area -- better than just viewing from a car window. Great guides!"},{"rating":"5.0","review":"Shame on me! We should have brought our own bikes! between us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own. bikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting. We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected. Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"4.5","review":"Fantastic tour, with extremely diverse sights -- from the beaches of Central Vietnam to the temples of Angkor Wat. We particularly enjoyed the hill country of Vietnam (the climbing day was excellent) as well as the temple sites in Cambodia. The accommodations were generally no-frills (due, in part, to the remote locations we were traveling through), though the hotel in Angkor Wat was excellent. The meals were fantastic -- the guides did an excellent job of selecting restaurants with great local fare. Would definitely recommend."}]}]