[{"name":"Ride to explore 4 UNESCO World Heritage Sites","reviews":[{"rating":"5.0","review":"I would definitely use tour radar again as they have any extensive range of trips available. Vietnam backroads were excellent, good quality bikes and a professional service."},{"rating":"4.5","review":"This trip was fantastic! Dat was such a kind and wonderful guide. I miss biking through the small villages and rice paddies every day."}]},{"name":"Grand Vietnam Package Tour - 14 Days","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Vietnam Discovery - 13 day tour from Hanoi","reviews":[{"rating":"5.0","review":"I would like to thank Sunny for outstanding service although we had to cancel when we were in Vietnam due to the Corona virus and return home Sunny offered so much help and support by trying to keep the tour going but unfortunately to many places were being put into lock down. So I cannot respond regarding the tour."},{"rating":"4.0","review":"Sunny was very organize, friendly, and pleasant to deal with."},{"rating":"4.0","review":"We can't say enough thanks for Chloe and her team at Vietnam Allure Travel for making our trip in South East Asia memorable. We booked the 16 days tour Vietnam and Cambodia through Tour Radar and were well taken care of from the beginning to the end. When we arrived Hanoi, Vietnam, Chloe came to our hotel and gave us every documents needed. She also provided us a local SIM that we used to contact her easily. Well, everything was very good from hotels, cruise tour to transportation daily and road tours. We highly recommend Vietnam Allure Travel"}]},{"name":"Vietnam Homeland from South to North","reviews":[{"rating":"3.5","review":"An excellent tour (19 days with Sim card Hanoi to HoChi Minh) Very busy. Perhaps a day for testing is a good idea as someone has already suggested. Enjoyed Sapa 2days excursion. Our guide Lee was excellent. Very good English (best of every guide) and very informative about district and Vietnamese culture. Good train journeys. The day from Hue to Quang Bihn Paradise cave was too long and we would have preferred to visit DMZ Zone and Vihn Moc Tunnels instead. Bit disappointed at 4 Isand trip from NhaTrang. Only 1 beach with good sand. Most things went to plan. Left a couple of times wondering if pick up would arrive but a quick message to Ms Lan and everything was sorted. Highly recommended."},{"rating":"4.5","review":"Most 10 day tour was good. The train journey shocked us. The train being dirty and very very uncomfortable for...\nShow more"},{"rating":"5.0","review":"Tour Radar was with us every step of the way. Hotels were clean and centrally located. Day tours were interesting...\nShow more"}]},{"name":"Southern Vietnam Family tour to Mekong Delta, Da Lat, Nha Trang","reviews":[{"rating":"5.0","review":"DNQ travel team was very pleasant and easy to deal with. We had a very nice time during our visit to southern Vietnam and enjoyed the tour package we purchased through DNQ Travel. They helped plan and make our trip a memorable one. We plan to visit Vietnam again and will definitely use their services again. We highly recommend them to all."}]},{"name":"Discover Vietnam 14 Days 13 Nights","reviews":[{"rating":"4.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"4.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"3.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Vietnam Adventure 15 days 14 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"5.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.0","review":"Do it! Great tour, very authentic."}]}]