[{"name":"Vietnam Legend Family Holiday 18 Days Trip","reviews":[{"rating":"5.0","review":"We absolutely loved this trip.  Unbelievablely well planned and we honestly didn’t have to worry about a thing.  Would totally recommend this tour company to anyone.  Super awesome!"}]},{"name":"Hanoi - Hoalu -Tamcoc -Halong Bay 5days/4nights","reviews":[{"rating":"4.0","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"4.0","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Grand Vietnam Tour - 16 days/15 nights","reviews":[{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"We were able to discover the daily life of Vietnamese people as well as the culture of this lovely country. Kudos Hung"},{"rating":"5.0","review":"The tour was amazing! I love vietnam as well as the different kinds of food. Love the places i visited and our tour guide Alex was excellent! He knew a lot and I've learned a lot from him!"},{"rating":"5.0","review":"The tour guide (Hoang) explains good English. Places that he recommended is very good and interesting"},{"rating":"5.0","review":"We chose this company thanks to my friend recommendation. This company has been hosting tours in Vietnam for 10 years and they were so professional for every request of our family. Highly recommend and make sure you have Hoang in your trip"}]},{"name":"Best of North Vietnam Tour 8 Days 7 Nights","reviews":[{"rating":"4.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Hanoi - Oasis Bay Classic Cruise plus Bakhan Village Resort 6 Days","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"3.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"4 Days North Of Vietnam package","reviews":[{"rating":"5.0","review":"Overall experience is great. Dieu Anh from Vietnam travel top was great. She tried to accommodate all my request and keep on inform daily and check on us making sure we were fine. Trip to Ninb Binh is better than expected the tour guide is so good. the optional excursions that is arrange for us by Dieu Anh was great too. Totally recommended will booked again with them in near future"},{"rating":"5.0","review":"We love this package, special day tour to  Hoalu Tam Coc. it was surprisingly good. The places were beautiful. Tam coc felt more personal than halong bay. The guide, Kevin, was very good. He interacted with his \"charges\" and even gave us a rendition of a typical Vietnamese love song. He even sang at the end of the tour, in Russian and French. Lunch was provide in buffet style and of very good choice and quality.\nWould recommend Vietnam Travel Top highly."}]},{"name":"Hanoi - Glory Legend Cruises plus Mountain Retreat 7 Days","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"3.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Cycling in the Mekong Delta","reviews":[{"rating":"4.0","review":"Trong is a fantastic guide. The cycling in mekong delta is incredibly picturesque, interesting and manageable. The stops were well organised and I would recommend this tour without hesitation"}]}]