[{"name":"Vietnam Encounters","reviews":[{"rating":"4.5","review":"Great tour, some little niggles that could be improved to make this better, but overall, really glad we did this tour."},{"rating":"4.5","review":"Although the itinerary was outdated, the tour overall was great!"}]},{"name":"Best Of Vietnam","reviews":[{"rating":"5.0","review":"Outstanding tour company from the Indus personnel tour guides, accommodations and meals."}]},{"name":"Vietnam: Northwest Loop Vietnam 10 Days/9 Nights","reviews":[{"rating":"5.0","review":"Crossing Vietnam Tours has helped us to plan a wonderful trip through Vietnam visiting Hanoi, Mai Chau, Mu Cang Chai, Sapa . They advised us on activities and sites and ensured accommodation in accordance with our wishes. The trip itself was perfect: we were really able to fully enjoy Vietnam as Crossing Vietnam Tour had perfectly organised all the logistics, guides, drivers, meals, etc. A great and carefree way to travel! \nA special thanks to Ms Lucy who took great care of us before, during and after the trip!\nWe definitively recommend Crossing Travel!!!"}]},{"name":"Vietnam Motorbike Tour from Hanoi to Hoi An, Da Nang on Ho Chi Minh Trail","reviews":[{"rating":"5.0","review":"We had a small group of 3 plus a guide from Hanoi to Saigon. Mr Dong and the DNQ Travel company are very professional so have no fear of the trip not being well organised or fraud. Their communication with customers is also very prompt. Our guide was excellent, breakdowns like flat tyres or clutch cable breaks - he managed. The bikes were Honda CRF 250cc and were fantastic over any terrain. We biked through 2 typhoons and other wet weather - well one was mostly on a re8st day!"}]},{"name":"Amazing Vietnam Tours 9 Days : Full Board","reviews":[{"rating":"4.5","review":"Great experience with Andy and the driver on our 5 day trip in Jogja! Andy was reallly attentive, understanding and flexible, especially with my mom whom has a issues with climbing stairs. Enjoyed ourselves greatly, highly recommended"},{"rating":"4.5","review":"The itinerary was great and covered most of the worth doing sight seeing I would have preferred to have included the Merapi tour which we managed to do because of our guide who pointed it out to us. I didn’t enjoy the Ijen experience. I did not know what to expect and it was my worst experience of being frozen due to inadequate clothing( something the tourists need to be warned about) and also the exaggeration of the blue light. It was nothing like the photos and quite a dangerous expedition to walk up and then down into the crater in the dark. Again advice should be given to carry torches for people who are keen to go. I did take the chair which cost me quite a lot but well deserved by the people who took me up but a complete waste of time and money. The Jiwa Jawa hotel in Mount Bromo unfortunately was not the greatest. The bathroom was tiny and I could barely squeeze in (I am only a size 12 London size) so you can imagine the discomfort for someone larger. The bathroom had a bad smell and the room was very basic. The surroundings were nice and facilities adequate I would re think about accommodation in that hotel unless there are better rooms. Every thing else about the trip was great and thoroughly enjoyed. As far as including meals are concerned I would hold back as the allowance was not even enough to cover my meal and I have quite a small appetite. The fare was basic with a main meal and dessert ."}]},{"name":"Highlights of Vietnam - 11 Days","reviews":[{"rating":"5.0","review":"A very well -organised tour, led by a knowledgeable and pleasant guide.  Extremely good value for money...in addition to accommodation and some meals, we had entries into various places of interest, two flights and a small 'cruise' at Ha Long.  Although we had to buy some of our own meals, they were so cheap, that this didn't really add to the cost of the holiday.\n\nThe tour was varied, showing us probably the most interesting places in Vietnam.  What a fascinating insight into the life there!  Today I looked back at my photos and realised just how much we had seen...and learned about the culture and the history of this wonderful country."},{"rating":"5.0","review":"Tour was very good, guide was really helpful and knowledgeable and accommodation and places visited were first class"},{"rating":"5.0","review":"I had far more enjoyment from Vietnam than I expected.  Exceptional tour."},{"rating":"3.0","review":"Some hotels were okay but others were less than mediocre. The coffee was pretty bad at all of the hotels. \nWe would have appreciated more guidance from our guide for those days when we had time on our own. We had no way of contacting him during those times the first couple of days. After that we had a shared whats app group where we shared pictures. \nWe saw a lot of pagodas and temples - in every location. It would have been better to use some of that time to see different things. It would have been helpful to receive information on what there was to see when we were given free time at sightseeing locations. \nThere were a few things on the itinerary that weren't done. There was no explanation."},{"rating":"3.0","review":"The hotels were good. The guide was good for 2 days then appeared to loose interest in grp.\nHe was difficult to deal with, impatient and we had to ask repeatedly about our requests. He made little effort to engage with grp. Very robotic with things he did guide. Often sites were rushed as he talked alot at start and we then  had little time to visit. We were almost every day taken to places where sales were pushed without asking if we wanted to go. This Took time away from tour. When asked for restaurant recommendations he told us to just look - very unhelpful and again took time away. Worst guide i have had. In talking to other tourists we missed some good places to visit instead we visited less interesting places. So overall i feel i got a taste of vietnam but certainly could have been better. Luckily our group was fantastic and that was awesome. \nFinally when tipped he -the guide, complained to one of our grp members that he expected more!!!!!"},{"rating":"5.0","review":"Our local tour guide was awesome. He had so much information to give and was very helpful. Well done (he told us to call him Jackie Chan). It was a privelage"}]}]