[{"name":"Vietnam Family Fun in 9 Days","reviews":[{"rating":"5.0","review":"My husband and I arranged for a 9 day travel tour in Viet Nam  traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."},{"rating":"2.0","review":"Our first two hotels were terrible. We \"upgraded\" to four star. In Ho CHi Minh city our hotel was right behind a construction site that worked 24-7! None of us slept. The second hotel in Hoi An had a rooster next door to the hotel that \"Cocka doodle dooed\" from midnight through to 8 am each morning. Again we did not sleep. The third part of our trip in Hanoi all of our tours were changed. A 7 hour bus ride with a 7 year old is NOT FUN. I would like a reimbursement for part of our trip. PLease call me on 0415075110 to discuss this."},{"rating":"5.0","review":"Traveling with kids is never been so easy , thanks to S Viet Travel.  The itinerary was well organized,  Efficient communication."},{"rating":"5.0","review":"I cannot say enough about S Viet Travel, we lovely time in the countryside with our guide Minah; fantastic time in Hoi An with guide Huan and Mr Leo in Ho Chi Minh City.  Our travel consultant – Dat was so thorough, all transportation were on time. Any changes to our itinerary was done promptly and always responded quickly. We would use this travel agency for future Asia trip without a doubt"},{"rating":"5.0","review":"1   Having been highly recommended to S Viet Travel for assistance with planning our family trip to Vietnam, grade A for sure! We are a couple with 2 kids (24 months and 9-years-old) and enjoy the most comfortable stay. My family had a fantastic trip in Vietnam. All we have to do is tell her what we need and wait until the travel date to pack the luggage. Travel with kids never easier like this trip with Ms. Hien's assistance!  Vietnam family fun"},{"rating":"5.0","review":"Having been in Vietnam for few years ago for a business trip. Now come back again, brought my family with my on this journey and I’m glad that we picked Dat to be our consultant. He super helpful and have a copious source of knowledge about his country. We did have some slightly change to fit for our children and Dat happily to help us with no extra cost. Will recommend this tour operator for my friend when they are looking to go to Vietnam."},{"rating":"5.0","review":"I can’t say enough good things about our Vietnam trip, it was amazing. We are on our 3rd visit to Vietnam so we love the culture. The tour guide was excellent and very informative, she provided of with some excellent knowledge of Vietnamese culture and took us to some amazing places that we would never have found otherwise  We are are so glad we booked this tour and it will remain memorable. I would 100 percent recommended this tour and would not hesitate to do it again!"},{"rating":"5.0","review":"I booked this trip to our family and we had a really great time in Vietnam. I travelled with one year old kid and 4 years old daughter, the journey went really smooth and fun after all."},{"rating":"5.0","review":"I was recommended this package by my neighbor and my trip was far beyond my expectation. Our family enjoyed the trip so much. The most interesting experience is bavi eco, really fun, must join. We had chance to visit a local house, cook and eat local food... Hoian is also a very good place to see. We learned to make lantern and visit some Chinese, Japanese architecture here. Those last days we spent time relaxing on cruise in Halong bay. Everything was extremely well organized!"}]},{"name":"Vietnam Gorgeous 14 Days","reviews":[{"rating":"5.0","review":"They provided all of the airport pick-ups of ours as well as drop-offs. 3 definitely great tours with our personal English speaking guides as well as a touch for just about any queries whilst we had been in Vietnam.\nPrecisely what a brilliant business, so approachable and professional. They're truly helpful and would hesitate to work with the company of his again. I can't recommend enough."},{"rating":"5.0","review":"General the trip was fun. The itinerary allowed a great assortment of experiences that are different. Wished locations and meals we had been taken too were far more local and conventional to where locals eat. I additionally wished we were provided far more options to do during our own time. Think much more of the tour provided an excess of nightlife experience. Would like more cultural info with local guides."},{"rating":"5.0","review":"[Original Text] 최고의 베트남 여행과 가이드는 짧은 통지로도 정시에 정해진 모든 준비를 통해 베트남 여행을 완벽하게 만들었습니다."},{"rating":"5.0","review":"Our group - four parents with two teenage girls and one toddler, have just returned from a fantastic individualized discovery of Vietnam. \nThao was the most diligent booking representative we've had. She looked after not only our hotels and cruises, but also our guides, drivers, and our two internal flights. It was lovely to meet her when she visited our hotel in Hanoi. She also gave us many beautifully handcrafted lacquered decorative boxes and plates as a gift and we can't thank her enough for that. \nEveryday of our stay in Vietnam was a delight. Tour guides and drivers were awesome and would bend over backwards to help us.\nI would definitely rate 5* for the services!"},{"rating":"4.5","review":"We wanted to make the most of our 14 days in Vietnam so we decided to go with a local tour operator. After a lot of research and consultation from Top Vietnam Travel, we finally worked out a perfect itinerary.  Correspondence prior to going on tour was good and all questions and requests on our booking were tended to promptly. We have a penchant for history, culture, food, and great sights, and Ms. Lily made sure everything was thought through beforehand. \nHanoi was an excellent starting point and we're glad we chose to arrive in Hanoi then work our way down south. Just a heads up, if you're planning on visiting Ho Chi Minh's mausoleum, chances are you'll have to wait on line for hours for a 60 second view of his body. So if the weather doesn't permit or you just wanna skip the waiting time, you'd better tour the grounds and go mid-week instead of the weekends. \nThe little town of Hoi An seems to be everyone's favorite given the fact that it is quite crowded with tourists. It was magnificent at night time, though, with plenty of cheap beers and tasty nibbles.\nHo Chi Minh City is pretty much a matter of taste. It wasn't really our cup of tea. Although, If you're a fan of cityscapes, bars, and nightlife, you'd probably find the dynamic energy of Saigon infectious. And culture vultures might be interested in visiting the War Remnants Museum and Cu Chi Tunnels."}]},{"name":"Vietnam 11 Days 10 Nights North to South or Vice Versa","reviews":[{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"Thuong went out of her way to make sure we had a great time and everything ran smoothly. When we wanted to do something different to our itinerary Thuong arranged it for us. The Typhoon arrived when we were meant to go to Ha Long Bay. She kept us updated and offered us accommodation at the hotel and other day trips while we were waiting for the Typhoon to pass. She was really helpful and we were very relaxed knowing that she had everything taken care of and we didnt have to worry about anything and it allowed us to enjoy our holiday better. I cannot recommend Swallow travel enough. They have been fantastic to deal with and everything we wanted they made sure it was included in our itinerary."},{"rating":"5.0","review":"We had a such a wonderful time in Vietnam. Thuong from  Swarrow Travel was very helpful and kind. She organised our special request as well beside the original tour e.g.\nextra nights, fly instead of train etc. The tour itself was just amazing.  I highly recommend Swarrow Travel."},{"rating":"5.0","review":"I can highly recommend Swallow Travel. They are a very professional travel company. Staff are very caring.  \nMy family are going back to Vietnam in August. This is our \nthird time with Swallow Travel. We wouldn’t book with any other company. They choose the best tours for you. They are in contact with you almost daily to check if everything is ok. So professional."},{"rating":"5.0","review":"Well done Swallow Travel, very organised and it was great to have the information given to us at each hotel as to what time to be at the front of the hotel for pick up. Tours were well organised my only tip would maybe check out location of hotels and if need be upgrade to be closer to the city centre, another couple had upgraded and was very happy still a very affordable holiday with upgrades. I highly recommend Swallow Travel !!!!!"},{"rating":"5.0","review":"We did a 11 day Tour and got  back from a tour of Vietnam from Hanoi to Saigon and I was so very very impressed with how well organised it was. Everyday we were told what time we would be getting picked up the next day so all we had to do was be ready at a certain time. We changed our tour a few times adding a couple of days before we arrived in Vietnam and Swallow were very accommodating. All entrance fees were included in our tour price so we literally paid for nothing except a few meals while we were away.\n\nThuong from Swallow was extremely very helpful and kind and sincere person to deal with all we  had to do was relax and enjoy our wonderful  trip.  Vietnam can be quite a hectic place when coming from a lesser populated country so I was very glad I went through Swallow and had everything organised for me. \n\nWe stayed on \"Lavender Elegance” in Halong Bay and even though this is suppose to be the \"basic 3 star\" boat I was very impressed with the standard. I was impressed with every hotel we stayed in. All of them were 3 star in Vietnam but in comparison would probably be closer to a 4 star in Australia. This was one of my best holidays ever. I would highly recommend using Swallow Travels. I really did a lot of research before booking this and the tour through Swallow travels was  really much above the standards of all the other tour Companies that i researched. I would definitely use them again to go to Cambodia, Laos and Myanmar for sure in a few months time."}]},{"name":"Vietnam Highlight Tour 11 Days/10 Nights","reviews":[{"rating":"5.0","review":"Perfect organized round trip through Vietnam\n\n\n\nFrom our descent and back on the plane our visit to Vietnam was perfectly organized around the country. With travel guides , great hotels, etc. Very satisfied!"}]},{"name":"Vietnam - South to North 10 days","reviews":[{"rating":"1.5","review":"Please note that the trip in Vietnam (10 days from South to North) so called fully organised by your company was very unsatisfactory. \n\nThe services received during these 10 days not allow me to make any recommendation of your company (moreover I am forced to do negative recommendation) especially considering the price you charged for the trip - 1380 USD plus 80 USD for upgrade (10 days – 9 nights). \nBy deducting hotel price is 150 USD per day per two person.\n\nAfter considering the local prices, services offered and an estimation of your own company fee I am forced to ask you to pay me back 350 USD per person in total 700 USD.\n\nGeneral remarks:\n\n1. Some point of the programs were omitted or canceled with no announcement or explanation given.\n\n2. I paid for an organised trip with a guide instead every day we were served by anonymous person (no badge), with strong language limitations,  no license to go inside the touristic venues to serve as a guide.\nI paid for guide and instead you offered a group leader who is able to inform about timing, distance, taking pictures and local shops only. No license to deal with professional guiding.\n\n3. The overall trip was overestimated in terms of price I paid which was a. 100 USD per day per person. All hotels you offered to me are having prices 20-30 USD for two people. The question is what is the 150 USD used for (beside your fee).\n\nDetailed issues:\n19.02.2018\nNo pagoda was visited; no bike were offered.\nWe were taken to a shopping village and ask for additional money after listening local music. The group leader lost 2 people we spent 1 hour waiting he will find them.\n150 USD charge - for boat, for lunch (which could be maximum 5 USD value)\n\n20.02.2018\n150 USD charge for half day trip were the entrance ticket cost 120.000 dong per person (5 USD per person)\n21.02.2018\nThe private driver (not knowing where he should drive international or domestic terminal) - transfer I paid for left us at the international airport in Saigon explaining that he can't go for domestic terminal which is obviously not true (I have respective photos taken that in Saigong you can move easily from international to domestic airport).Ms Lan  tour operator was not able to deal with the driver.\n\nDomestic flight Saigon Da Nang - our booking was cancelled  as we were informed by the time of check in.\nMs. Lan was not able to help - she did know the issue and ask for time to clarify the issue.\nWe deal with the Jet Viet airlines.\nI am not going to explain the stress which appear after being along at the airport.\n\nCharge: 150 USD - only service provided was car transfer to the airport for maximum 15 USD, domestic flight 20-30 USD per person.\n\n22.02.2018\nBiking and paying 2 USD to craftsman and possibly 1 USD to vegetable village, lunch for 10 USD, car transfer for maximum 50 USD – I was charged 150 USD \n\n23.02.2018\nLunch (not eatable - cold no choice for the menu), boat included  - all maximum 50 USD\nMartyrs' Cementary not included.\nTransfer by public bus collecting people from more then 7 hotels.\nDaily charge 150 USD\n\n24.02.2018\nConical Hat and Incense Make Villages - in fact is a simple touristic shop.\nBuffet 50 dishes - in fact 7 dishes; transfer to the airport 15 USD; domestic flight 20-30 USD per person. \nDaily charge 150 USD \n\n25.02.2018\n90 minutes collecting people form several hotels in Hanoi.\nBoat very small - in fact I paid for 4 star service; rooms with two beds not space for any suitcases to be open. No space to move in the room.\nFor the upgrade  paid we received the smallest room. Even the were rooms will small balcony on the boat.\nBefore check out everyone was asked to fill in questionnaire. After some time a new person came in on the boat and asked in front of all people in the dinning room that he wants to talk with me (on his own)  at the top deck of the boat. I disagree. I felt punished by a men coming from backside and asking for talk even not introducing himself. He expected I will change my assessment of the cruise service.\nThis is the 4 star service you ask to pay additionally 80 USD. \n\nCheck out of the boat the luggage everyone need to pull up by him/her self  extremely steep.\n\nDrop off (in Hanoi) took again 90 minutes going to each and every hotel in Hanoi. 3 hours in a bus in Hanoi was never included in the program.\nDaily fee 150 USD \n\nI strongly ask you first make an assessment of the local service you are arranging so you could avoid other customers to be disappointed with your agency service.\nCharge of 150 USD per day for services as specified above is at any step not acceptable to be asking to pay.\nBased on the facts provided I am expecting to be paid back 700 USD as soon as possible.\n"},{"rating":"5.0","review":"Fantastic tour! Extremely well organized. They gave us a SIM card for our phone so anything we wanted to ask or they needed to tell us was at the touch of a button. We chose the 3 star hotels package and were very impressed with the quality of the rooms. Highly recommend this tour and Vietnam adventure tours as a tour company!"}]},{"name":"Vietnam the Charming North","reviews":[{"rating":"5.0","review":"Tom Hiddleston - Budapest, Hungary\nGreat drop-in yoga class\n\nThis Wellness Tour was one of the best classes I had during my Asia journey. It was a really relaxing atmosphere and our teacher was so calm down. I can recommend that class in Pu Luong for each level. Thank you very much for this experience."},{"rating":"5.0","review":"My boyfriend and I had a fantastic experience with Mr.Phuc as our guide. He was very helpful with local restaurants and gave us knowledge of Vietnam's history and culture. We would recommend him to anyone traveling in Vietnam!"},{"rating":"4.5","review":"Had a great time made new friends"}]},{"name":"Vietnam Highlight Tour Package 7Days/6Nights","reviews":[{"rating":"4.0","review":"IT was a good tour, really enjoyed our time, there were a couple of bumps along the road but all in all, a good time"},{"rating":"5.0","review":"Dear Danny\n\nWe want to thank you for the nice trip we had and the very adequate organization.\n \n\nWe enjoyed the 3 days with our guide Thau in Hué and Hoi An, she was very pleasant company.\n \n\nOverall we were very satisfied with the hotels of our trip (Alba was even super!) For the Lantern hotel in Hoi An we believe there are better options available in the same price range! The one your upgraded us to for the last night(Green Heaven) was excellent!\n\n\nThanks again for having taken so good care of us!\n"},{"rating":"5.0","review":"Tour and service are so good. I will come back to Vietnam again and I believe that Legend Travel Group is my best choice ever!"}]},{"name":"Highlight Vietnam Tour - 7 Days","reviews":[{"rating":"3.0","review":"This trip was terrible - very overpriced with very average tours and poor accomodation. I will be writing a formal complaint. One hotel was so dirty I had to request moving and the other was bad enough but I didn’t have time. The tour is not a group tour, it’s several individual excursions bolted together with no consistency."},{"rating":"4.5","review":"Loved the tour, accommodation was basic but okay. Loved all of the activities, especially the overnight tour along Halong Bay. All guides were funny, polite, and super informative. Would definitely recommend!!"}]},{"name":"10 Days Unforgettable Vietnam from Ho Chi Minh city up to Central and Hanoi","reviews":[{"rating":"5.0","review":"All in all the tour was very good. The hostels were okay, all in really good locations. The best in Hoi An. I was really really apprehensive about not being in a full time tour group but in my free time I was able to make new friends and hang out with friends from the day tours. It was nice having things like the drivers planned out and the day trips already booked. All in all, it was new and it was worth it"},{"rating":"5.0","review":"Amazing 10 days spent in Vietnam thanks to the organization provided by Manh and his team! I highly recommend this tour to anyone who want to discover the beauty of Vietnam "},{"rating":"4.0","review":"Amazing tour, perfect itinerary, you get to do all the musts with organized groups but also have alone time to explore.  This tour gave me a balance of alone time but also a great way to meet interesting folks from different parts of the world with one common interest - exploring.  \nManh, from the tour agency, was super helpful. He was always available and quick to answers all my questions (and I plenty! being it was my first time traveling to Vietnam alone).  When my flight was delayed and my airport pickup was scheduled for the late evening, Manh made sure I was not stranded.   I would highly recommend this tour for anyone visiting Vietnam for the first time and have only 2 wks to experience it."}]},{"name":"Mekong Delta Discovery Tour from Saigon to My Tho, Ben Tre, Can Tho & Chau Doc","reviews":[{"rating":"5.0","review":"I and my wife visited Saigon this Jun 2016. We started planning early and interacted with Vietlong - Ms Ha. She was very helpful and this being our first visit to Vietnam, we had lot of questions which she responded promptly to our satisfaction. We were also concerned about food since we are strict vegetarians but she allayed our concerns and ensured that we were provided pure vegetarian food during our tour to Mekong Delta trip in southern vietnamWe are very clear that this is not our first and last trip to vietnam. We will again use the services of Vietlong Travel during our next trip."},{"rating":"5.0","review":"This trip was really organized as we wished - Mekong Delta Discovery Tour from Saigon to My Tho, Ben Tre, Can Tho & Chau Doc. We took a boat along the river to see the typical stilt houses and fruit plantations of the area which was the most impressing to us. Thanks to Ms Trang for arranging everything perfectly for us. She ensured that the program meets our expectation and includes all the places we want to see. I highly recommend you Viet Long Travel!"},{"rating":"5.0","review":"Excellent tour with Vietlong team. All services were very well organized and seamless from our arrival. We really had our great time in Southern Vietnam. We learned many things from our guide during this tour and see typical lifestyle of main part in Vietnam. Highly recommended!\nHighlights: With short trip to Southern Vietnam, you will witness lifestyle of local people with many habits related to floating markets."},{"rating":"5.0","review":"The tour was well arranged. The tour guy speaks clear English and took good care of us. Food were amazing and the tour allow us to get up early and see the sunrise at the Delta. Everything was advertised. Will not hesitate to recommend to others going to Vietnam"},{"rating":"5.0","review":"We would recommend this agency in helping you plan your holiday in Vietnam. They responded promptly to questions via email. They are really serious in arranging our entire tour. We get so much for what we pay. Thank you so much for all your help!!!"}]}]