[{"name":"Best of Vietnam - 13 Days","reviews":[{"rating":"5.0","review":"The tour was excellent and the guide was spectacular. He was knowledgeable about the history and the culture.  He was articulate and funny and had a great way with people. He know the back streets and the best coffee places. Just superlative in every way."},{"rating":"5.0","review":"From start to finish it was beyond our expectations. The group had a wonderful dynamic, the hotels were excellent the attractions fantastic, the transport on time everytime. The food was just the right balance of experiencing local cuisine and accommodating our western tastes. "},{"rating":"5.0","review":"Tuan was a great guide. He gave heaps of information about Vietnam which you don’t get travelling on your own. The value of this Cant be underestimated in the enjoyment of the trip. Tuan worked tirelessly to ensure everything went smoothly working non stop while we enjoyed our trip and just relaxed and got to know each other. Thanks to a great guide I loved our trip to Vietnam. Thanks Tuan. Even met us for lunch after our trip was  over. "},{"rating":"5.0","review":"Mr Tuan is an exceptional guide, considerate of the slow and infirm, just had a knee operation,\nhis induction and information on the different towns was exceptional, he manages all the suppliers taxis, hotel staff and restaurant staff to our advantage. knows us all by name on the first day, builds a group, we all felt like family.\n\nKnowledgeable about the various sites. His attention to detail is exceptional. I will recommend On The Go to my friends and hope they get this superior performer Mr Tuan. Thanks again to Mr Tuan for making us feel so special."},{"rating":"5.0","review":"Excellent tour and guide, exceeded all expectations."},{"rating":"5.0","review":"TOUR: Excellent tour!!  So varied and full of interesting activities cycling, kayaking, museums and supporting local industries. Loved the pace of the tour and authentic Vietnamese experiences.\nGUIDE :Where on earth did you find him ? He's pure gold dust !! . Kien was consistently on time , efficient , engaging, well informed , cheerful , respectful and fun ! He taught us so much about Vietnam and its people and adapted to our needs and interests. From Day 1  his straight forward and authentic manner allowed us to feel safe and supported.The tour was brilliant and your guide Kien made it total magic !"},{"rating":"5.0","review":"Amazing! His attention to detail was outstanding, he would make sure we were already checked in and air con's were on in our rooms on arrival. He would adjust the itinerary to give us time to refresh as it was so hot some days. He even walked me to a chemist in Hanoi when we had free time as I was feeling unwell."},{"rating":"5.0","review":"The tour was excellent - well organised and a fantastic group of people. Hung, our tour guide was brilliant - he was very knowledge about Vietnam, and incredibly helpful and quick to respond in calling out a Dr when I was ill during the trip. We were lucky that we had a private tour of Hanoi with Hung on arrival as no one else in the group was doing our tour - it was a fun and informative day, and the trip overall was very enjoyable. "},{"rating":"5.0","review":"Our guide, Hung was fantastic and the transport and excursion were excellent. The people who travelled with us were all great. Thank you!"}]},{"name":"VNA006 - 7days Hanoi Sapa and Halong Bay","reviews":[{"rating":"5.0","review":"Great tour covering all the important sights, culture and food. The guides in Ho Chi Min were excellent. There were a few glitches along the way but Lily from Your Vietnam always apologised and resolved everything quickly. I would highly recommend this tour."},{"rating":"4.0","review":"The tour exceeded our expectations! From start to finish everything was planned expertly and never missed a beat, all the tour guides and companies they chose were excellent and made the experience that much better. Hotels were also excellent and provided amazing customer service! Highly recommend."}]},{"name":"FLAVOUR OF VIETNAM 10 DAYS","reviews":[{"rating":"5.0","review":"The tour was great, however the booking through your site was misleading. I originally tried to book a room for three but your site told me that wasn’t possible so I had to book a double and a single room for an extra fee. On arrival I was checked into a shared room with three single beds, so it was possible to do this. I told the tour manager of my situation which they were not aware but managed to find a single room for me that I’d payed a significant extra amount for. Please fix your site to reflect the room possibilities available on this cruise. Otherwise thank you for your communications and organisation this was fantastic."},{"rating":"5.0","review":"The party boat was amazing especially the second day on the freedom island. It is a peacefull and beautiful place....\nShow more"},{"rating":"4.5","review":"Highly recommend! Our trip was perfectly organised by GO TRAVEL AROUND and Abhishek, you are great!!! The customer...\nShow more"}]},{"name":"Chopsticks & Coconuts Family Holiday","reviews":[{"rating":"5.0","review":"In my daughter's words 'exodus understand kids' brilliant mix of things geared towards adults, as well as things for childrenWhat was the most inspirational moment of your trip?Realising we were kayaking in Halong Bay, and following waterways on sampans. Managing to climb over a monkey bridge ( slowly!) being watched by a 5 year old Vietnamese girl who was wondering what we were fussing over! Standing in a bus stop sheltering from the rain in Ho Chi Minh City- 10 minute rain shower, avoiding motorbikes on the pavement - unique !What did you think of your group leader?Bao was excellent he did everything he could for the group nothing was too much trouble.Do you have any advice for potential travellers?Book now! Seriously though it was well worth it. I would go back again tomorrow ( and my daughter wants to live there now...) and recommend it to anybody. The journey can be tiring at times, but you get to see all of Vietnam pretty much. Take a day pack that is big enough for overnight stays ( halong bay and mekong delta) and a waterproof camera of some sort. Western food is available practically everywhere ( bar the mekong delta) if you have fussy eater, but even some Vietnamese options on the menus suit most fussy Western palates ( pork chop with rice for example) Fixed price stalls in the tourist market in Ho Chi Minh city are not fixed price! Delve deep in and bargain for all your worth. Be cheeky! You may get a proper bargain!Is there anything else you would like to add?It is worth every penny. Vietnam must be seen to be believed. There are cultural differences obviously, but itbwas amazing. The trip offered the best, and was well organised. Go and eat pho!"},{"rating":"5.0","review":"The holiday of a lifetime, absolutely superb in every way.What was the most inspirational moment of your trip?Every single day had an inspirational moment, its impossible to single one out. The range of transport was amazing - from cyclo rickshaw to overnight train, Â to luxury cruiseship in HaLong bay with cycling and boats in between.Â What did you think of your group leader?Tom/Tho should be given an Exodus award for being the most enthusiastic, knowledgeable and endlessly patient group leader. He really went the extra mile to make sure that everything ran smoothly and that we had a great time. He was particularly good with the childrenDo you have any advice for potential travellers?make sure you get some clothes made in Hoi An - I came back wishing Id bought more.Is there anything else you would like to add?An amazing holiday for the whole family. We were lucky with the weather: Â summertime is rainy season in the North of Vietnam and a typhoon arrived just after we had left which closed Ha Long bay."},{"rating":"5.0","review":"A great introduction to a wonderful country, the Vietnamese people are a delight, the food is great and the scenery varied and beautiful from the full-on buzz of Hanoi and Saigon to the peace and tranquility of Halong Bay and the Mekong DeltaWhat was the most inspirational moment of your trip?Cruising amongst the Karst peaks in Halong Bay was amazing but the revelation for me was the Vietnamese people, so friendly and with an extrordinary capacity for forgiveness towards their former enemies.What did you think of your group leader?Zung was great, so enthusiastic, always smiling with a great sense of humour and particularly good with the teenagers.&nbsp;Do you have any advice for potential travellers?The food is great so don't worry about taking fussy children, you are bound to find something they will like. The War museum in Ho Chi Minh city contains some deeply shocking photos and accounts of atrocities - I would say it is essential that adults visit but it is tough and not suitable for younger childrenIs there anything else you would like to add?The holiday catered so well for the whole family with enough activities to keep the teenagers happy, kayaking, swimming, mud baths, snorkelling etc but also managed to fit in a few cultural and historical trips and as I've mentioned, the food is just fantastic, can't remember a meal that wasn't delicious!My only crticism was that the cooking class was very poor, we have attended cooking classes in China and Morocco and they were both great but the one in Hoi An was more of a cooking demo than a class, hardly involving the group, going so fast that you couldn't take it in and then there was such a long time between the demo and the food being served that we got the distinct impression that they were just interested in selling as many drinks to the tourists as possible! All the kids were bored stiff. I'm sure this could be easily remedied by Exodus choosing a different class as there seemed to be lots available.Â "},{"rating":"5.0","review":"Had a wonderful 2 weeks in Vietnam this summer on this trip. Our guide Zung was really excellent and the organisation was brilliant. Vietnam is beautiful, fascinating and inspirational. Truly recommend this trip, if you're considering it, just book it now.What did you think of your group leader?Zung honestly couldn't have been better. Gracious, calm, fun, informed, intelligent, organised, great company.Do you have any advice for potential travellers?Book now!"},{"rating":"5.0","review":"A fantastically enjoyable and varied holiday. Something for everyone.What was the most inspirational moment of your trip?So many ! Bustling city of Hanoi, serenity and beauty of Halong Bay, cycle ride through Hoi An to the beach, War Museum at Ho Chi Minh City, exploring the local markets and Chi Chi tunnels.Every day was something different and we did a host of different activities... boat rides, cycle rides, bus rides, kayaking, caving, sightseeing, shopping, eating out, sunbathing on a beach, swimming in the sea and even a water park !! What did you think of your group leader?Tommy was the best guide we have EVER had !! He was knowledgable & interesting , warm and approachable.He interacted well with the \"young people\" by being amusing and even setting small quizes to make it a bit more interesting !Can't praise him highly enough !! Do you have any advice for potential travellers?Just DO IT !!!!"},{"rating":"5.0","review":"A fantastically enjoyable and varied holiday. Something for everyone.What was the most inspirational moment of your trip?So many ! Bustling city of Hanoi, serenity and beauty of Halong Bay, cycle ride through Hoi An to the beach, War Museum at Ho Chi Minh City, exploring the local markets and Chi Chi tunnels.Every day was something different and we did a host of different activities... boat rides, cycle rides, bus rides, kayaking, caving, sightseeing, shopping, eating out, sunbathing on a beach, swimming in the sea and even a water park !!Â What did you think of your group leader?Tommy was the best guide we have EVER had !! He was knowledgable &amp; interesting , warm and approachable.He interacted well with the &quot;young people&quot; by being amusing and even setting small quizes to make it a bit more interesting !Can't praise him highly enough !!Â Do you have any advice for potential travellers?Just DO IT !!!!"},{"rating":"5.0","review":"The best holiday we have had in a wonderful country with something for every member of our family.  So good , we did not want to come home. What was the most inspirational moment of your trip?There are so many wonderful things on this trip that it is difficult to name just one.  In terms of peace and relaxation the Homestay visit in the Mekong Delta and the night on the Junk in Halong Bay.  The cooking lesson in Hoi An was a great experience highly sociable and enjoyed by all.  The Cyclo ride in Hanoi.  The Cu Chi Tunnels . Visiting a fishing village in Nha Trang, the mud baths and snorkelling in the sea.  The amazing markets which are a complete assault on all of the senses.  The culture and history. ..... The people  and the delicious food.   Basically the whole trip was an inspiration.What did you think of your group leader?There are not enough superlatives to describe Long our wonderful group leader. He worked so hard to make sure that everyone had a brilliant time and to teach us about his wonderful country.  I really felt we left the country with a greater understanding of the Vietnamese psyche.  Our children idolised Long and he absolutely made our holiday.  The holiday is pretty action packed but with Long in charge we moved seamlessly from one activity to another.  Anyone who has Long leading their group is very lucky indeed.Do you have any advice for potential travellers?Don't bring bullets back from the Cu Chi tunnels .  Even the spent cartidges will be confiscated at the airport when you leave. Is there anything else you would like to add?Vietnam is a wonderful country , if you are hesitating about booking this holiday... don't hesitate. You will have a wonderful time.  I would go again tomorrow!!"},{"rating":"5.0","review":"The best holiday we have had in a wonderful country with something for every member of our family.  So good , we did not want to come home. What was the most inspirational moment of your trip?There are so many wonderful things on this trip that it is difficult to name just one.Â  In terms of peace and relaxation the Homestay visit in the Mekong Delta andÂ the night on the Junk in Halong Bay.Â  The cooking lesson in Hoi An was a great experience highly sociableÂ and enjoyed by all.Â  The Cyclo ride in Hanoi.Â  The Cu Chi Tunnels . Visiting a fishing village in Nha Trang, the mud baths and snorkelling in the sea.Â  The amazing markets which are a complete assault on all of the senses.Â  The culture and history. ..... The peopleÂ  and the delicious food.Â Â  Basically the whole trip was an inspiration.What did you think of your group leader?There are not enough superlatives to describe Long our wonderful group leader. He worked so hard to make sure that everyone had a brilliant time and to teach us about his wonderful country.Â  I really felt we left the country with a greater understanding of the Vietnamese psyche.Â  Our children idolised Long and he absolutely made our holiday.Â  The holiday is pretty action packed but with Long in charge we moved seamlessly from one activity to another.Â  Anyone who has Long leading their group is very lucky indeed.Do you have any advice for potential travellers?Don't bring bullets back from the Cu Chi tunnels .Â  Even the spent cartidges will be confiscated at the airport when you leave.Â Is there anything else you would like to add?Vietnam is a wonderful country , if you are hesitating about booking this holiday... don't hesitate.Â You will have a wonderful time.Â  I would go again tomorrow!!"},{"rating":"5.0","review":"Fabulous family fortnight in Vietnam.  Everything we wanted and more.  Our guide Long was superb.  Scenery amazing, cities more vibrant that anyone could imagine, the Vietnamese people just lovely.What was the most inspirational moment of your trip?The festival in Hoi An, magical.  The cities of Hanoi and Ho Chi MinhCycling around Hoi An to the beachTam Coq boat tripSnorkelling in Nha TrangBBQ in Nha TrangWhat did you think of your group leader?Our leader Long was fantastic.  He was informative, knowledgeable, friendly and able to relate well to both the adults and the children.  The kids idolised him...  He looked after our needs exactly, amending itineries to suit our groups wishes.Do you have any advice for potential travellers?Everybody should visit the East and Vietnam is a very special country for many reasons.Is there anything else you would like to add?The perfect 10! (out of 10) for this holiday."},{"rating":"5.0","review":"Fabulous family fortnight in Vietnam.  Everything we wanted and more.  Our guide Long was superb.  Scenery amazing, cities more vibrant that anyone could imagine, the Vietnamese people just lovely.What was the most inspirational moment of your trip?The festival in Hoi An, magical.Â  The cities of Hanoi and Ho Chi MinhCycling around Hoi An to the beachTam Coq boat tripSnorkelling in Nha TrangBBQ in Nha TrangWhat did you think of your group leader?Our leader Long was fantastic.Â  He was informative, knowledgeable, friendly and able to relate well to both the adults and the children.Â  The kids idolised him...Â  He looked after our needs exactly, amending itineries to suit our groups wishes.Do you have any advice for potential travellers?Everybody should visit the East and Vietnam is a very special country for many reasons.Is there anything else you would like to add?The perfect 10! (out of 10) for this holiday."}]},{"name":"Beautiful Sapa & Northwest - 10 Days","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"North vietnam adventure tours 7 days- Mu Cang Chai - Halong - Ninh Binh","reviews":[{"rating":"4.0","review":"I had an absolutely wonderful photography and motorbike tour with Zonitrip in October this year! You will be extremely lucky to have a guide like Nghia, her professionalism, flexibility, patience and dedication to my needs were beyond my expectations. This was my second tour with Zonitrip and will definitely my prefer tour operator when I plan for my next trip to Sapa and Hoang Su Phi. Highly recommended!!!"},{"rating":"4.5","review":"The cost was not proportionate to the tour. Many others paid a fraction of the price charged by tourradar."},{"rating":"4.5","review":"We had an excellent guide who made sure we did all the trekking we could do and made sure we had very good accommodation and vegetarian food that was amazing. The hosts at the homestay were very warm and accommodating. Awesome experience overall."}]},{"name":"On Foot in Vietnam","reviews":[{"rating":"4.0","review":"Easy (and to some moderate at times) paced walking trip that covers so many different areas of Vietnam.  A good chance to see how the people live and taste the fascinating tastes of this country.  The Vietnamese have found a way to try to harmonize the past and present in order to move forward from 100s of years of conflict."},{"rating":"5.0","review":"Very enjoyable with an ideal balance between walking in the countryside and sightseeing in the cities. We felt very well looked after by our courteous and highly efficient guide. Arrangements were excellent. The structure of the two weeks seemed ideal and we felt we saw and did far more than we would have been able to if we'd tried to do this on our own."},{"rating":"4.5","review":"A mix of culture history and getting out in the countryside: a tour that sees all the main highlights. Easy walking. At times almost too much going on / we didnt have enough time in Hoi An.\nWe were so pleased we were able to the Cambodia extension this worked really well ."},{"rating":"4.3","review":"One of the best trekking trips I have done for a while"}]},{"name":"Exotic North-to-South Vietnam Motorcycle Tour on Ho Chi Minh Trail and Coast","reviews":[{"rating":"5.0","review":"16 days on the road from Hanoi to Saigon. Can’t recommend highly enough. The whole operation from initial query to riding into Saigon was handled with the best service.\n\nCông was an expert guide and always there to look after whatever we needed. I’ll be recommending to friends and family and I’ll be coming back for more."}]}]