[{"name":"Realistic Vietnam - Halong Bay/ Phu Quoc Island","reviews":[{"rating":"5.0","review":"Everything was ok. It was a nice journey. Complements to Dat, was very nice, efficient and simpathic."},{"rating":"5.0","review":"Realistic Asia was a good decision of mine and my group. No boring moment at all. But bear in mind that almost food available during this trip was Vietnamese. We used to expect our hometown cuisine. But it’s just a myth; local food was worth to taste upon arrival."},{"rating":"5.0","review":"The itinerary was almost flawless and tour guide was great. He set everything under control. Activities were diverse and the pace was quite intense. Transport was mainly sharing and the distance was considerable to travel but it seemed balanced. Overall a good experience!"},{"rating":"5.0","review":"I and my wife have been abroad for the first time. It seemed quite new with us. But everything has been put in order; we were kept in touch 24/7 for support. 11 days of adventure and so much fun. Traveling to a new foreign country is no longer a big deal to me if I was accompanied by a reliable agent like you. Thanks for your support."},{"rating":"5.0","review":"This tour was so much fun from start to finish. Even though we had received a clear and detailed itinerary to expect, we still found it astounding that all activities were so fresh and unique."},{"rating":"5.0","review":"I and my friends have thought that Halong bay was just for touristic travellers but after the trip with Realistic Asia, everything has totally changed. Not only Halong Bay but also the rest of this tour were attractive and brought us so much joy. Love all activities that you arranged during the trip. I will choose you via Tourradar again."},{"rating":"5.0","review":"I have never expected a group tour with so much fun like this experience. 11-day trip flew by so fast. Tour guide was so supportive and information. We were impressive with the activities well arranged for us. I don’t know what would have happened without choosing Realistic Asia. You are my ideal agent ever. Wish to go along with you to every corner of the world."},{"rating":"5.0","review":"The tour was a great experience for my first time in Vietnam especially for the cost. They knew how to fulfill my request in accommodation and personal interests and respected those ones. They are experts not for nothing."},{"rating":"5.0","review":"This tour is perfect way to explore the best beaches in Vietnam. Phu Quoc was so amazing with snorkerling and fishing. Highly recommend you to choose Realistic Asia for your next trip. They know how to make the pickiest travellers smile."},{"rating":"5.0","review":"Every day in this 11-day trip was so much fun. The way Realistic Asia designed their trip was intelligent and consistent. However, the way of contacting to the person in charge was quite limited. It’s much easier if I had a local sim card to connect. They have managed to contact me in a polite and timely manner. I will prepare a local sim card for next trips with Realistic Asia."},{"rating":"5.0","review":"It’s the first time I have been in Vietnam. Choosing a local agent is one of my best decisions ever. Realistic Asia knows all things in their countries. A great arrangement. They knew our taste as well. I have never heard the place named Ba Vi ever. But I must have regretted if I hadn’t been there. And Phu Quoc was truly the most beautiful and untouched beach in Vietnam. Activities there were awesome."},{"rating":"5.0","review":"I am glad that I booked my honeymoon trip thru you, this was my first experience and let me tell u it was good one. Cruise and Phu Quoc is great for honeymoon couple."},{"rating":"5.0","review":"Nice trip.. Awesome hospitality in everything"},{"rating":"5.0","review":"Visit to Vietnam has been a wonderful kit of memories. Thanks to the flawlessly smooth travel plan prepared by Realistic Asia. The choice of Hotels and their location was absolutely apt to our requirements. The cars for pick up and drop were of luxury class and drivers were very good... The day tours were all very planned and executed, the tour guides were very helpful."},{"rating":"5.0","review":"You done a good work! We had a good trip. Thank you!"},{"rating":"5.0","review":"I and my husband had a very good trip in November with Realistic Asia. It couldn’t be better without their helps. Halong is breath-taking, honestly, very beautiful!\nFor Ho Chi Minh city, Mekong River cruise is simply wonderful and is highly recommended. Our guide Han was superb there. The icing on the cake was small boat ride in a small canal, probably a rivulet of Mekong River. Our flight to Phu Quoc was delayed by 30 minutes and I was reminded carefully by your team. I highly appreciate it.  There is no enough words to describe how beautiful Phu Quoc beach is.  I definitely   had relaxing time and good memories here.\nThank you Rosie for all!"}]},{"name":"Hanoi, Sapa & Halong Bay plus Bakhan Village Resort - 9 Days","reviews":[{"rating":"4.5","review":"The trip was excellent value for money, all transport was seamless and organised. The excursion in Sapa was a big highlight and our guides all spoke very good English and were very helpful. \nThe accommodation was basic but clean, better than expected for the cost of the trip. \nWould definitely recommend to other budget travellers. "}]},{"name":"Vietnam Beach Fun Holiday - Nha Trang/ Dalat","reviews":[{"rating":"5.0","review":"The charge of extra services in Nha Trang beach was expensive. We needed to bargain with dealers there. The beach was beautiful but this stuff was uncomfortable. I also hated to wait for process in passport stamp. Too long and bad management. Rosie from Realistic Asia was sympathetic and managed to comfort us. Thank you so much for your effort."},{"rating":"5.0","review":"Hand-rowed sampan was so much fun. Fruit plantation was also new to us. Everything was well-organized. Love your support all the time we need."},{"rating":"5.0","review":"It’s worth for my honeymoon trip. I fell in love with the way you chose the accommodations and arranged the honeymoon treatment. The itinerary was reasonable and romantic."},{"rating":"5.0","review":"I and my girlfriend have returned from a trip with Realistic Asia to Vietnam. We would come back for our honeymoon. She was in love with this scenic city. Everything was great and romantic. Thank you."},{"rating":"5.0","review":"It would have been a waste without spending time in Nha Trang. Coral reefs were colorful and beautiful. Sunshine, beach and white sand. Wonderful!"},{"rating":"5.0","review":"Long strip of beach was relaxing. Great to experience and laze around. Water sports available but based on the conditions of weather. Crystal clear water. The hotel was clean, had a good view and staffs were so helpful. Da lat was quite quiet. It’s so nice. But I prefered the dynamic night life in Ho Chi Minh city."},{"rating":"5.0","review":"Nha Trang was great. Nice and friendly people. The view and paveway under coconut palm was breathtaking. Went snorkeling and ended up doing my open water certificate. Thanks for your arrangement."},{"rating":"5.0","review":"The weather in Ho Chi Minh was quite hot but everything in Da Lat was great. We had to take flight to there. At first, I felt concerned it's not worth but everything has changed. Beautiful, fresh, friendly."},{"rating":"5.0","review":"Luscious strawberry farms in Da Lat cannot be found anywhere in Vietnam. Loved it!"},{"rating":"5.0","review":"They managed to find a resort facing the beach for me in Nha Trang even it's the last minute request. Appreciate your effort and we were satisfied with your arrangement. Pick-up driver was quite late due to traffic jam, we were a bit disappointed because we were quite concerned that we cannot catch up the flight. But everything was fine after all."},{"rating":"5.0","review":"Realistic Asia satisfied my curiosity in exploring extraordinary destinations. It’s once in a blue moon to participate in gathering of a hundred of boats. Da Lat was so lovely with a thousands of abundant colorful flowers, yummy food and well-decorated cafe. Nha Trang beach was fabulous. I now got the reasons why many websites and other travelers recommended it. The view and coconut palms were breathtaking. Love watersport! So much fun to ride a bike in this clean city."},{"rating":"5.0","review":"Da Lat was called the city of thousand flowers not for nothing. Many flowers and they were so beautiful. Cafe was well-decorated. Offbeat location. Nha Trang as well. So stunning,"},{"rating":"5.0","review":"No one can resist in falling in love with Da Lat. Fresh air. The weather during one day has totally changed like during a year but still comfortable. Flowers and specialty food were wonderful. Nothing to complain about this place."},{"rating":"4.0","review":"Our main complaint is about the hotels although we paid for 4 star upgrade.\n\nThe Millennium Boutique hotel in Ho Chi Minh city was definitely not a 4 star hotel. It has good location but in a very dark and not clean street. The room has no windows and no fresh air. \n\nIn Nha Trang we stayed at An Vista hotel. The resort and the hotel are organized for Russian tourists. The 4 star An Vista Hotel has good location but the service was very poor. The tourists are treated like thieves. At check in the receptionist took our passports as a guarantee. The only other option was cash deposit. Unfortunately we didn’t have enough cash. The hotel pretends to have a private beach but the truth is that they have 8 sun beds. The hotel guests can receive vouchers for 3 hours if available. At the reception we were advise to wake up early and at 6 am to be one of the first in line for vouchers. Another problem was the lack of beach towels- some day they had and some not. If one is lucky to have voucher and towel he has to walk for 15  minutes to the “private beach” . We stayed 4 days but only 2 times the room was cleaned and the towels were changed. The breakfast was not good too."},{"rating":"5.0","review":"The overall tour was amazing and it was planned out perfectly. Got to see many like-minded people. The staff are super helpful, always there when I asked. During my trip, the hotel in Ho Chi Minh City is a bit cramped, not really up to the standard, the rest is totally fine"},{"rating":"5.0","review":"Great experience in Vietnam with my 13 year old son thanks to S Viet Travel and Hien! The trip was really fantastic. We stayed in Hanoi, SAPA, cruise in Halong Bay, Hoi Han, Saigon and cruise on Mekong. Every single thing was well organized and prepared. Our guides were really experienced and kind. Trip was easy although it was a real challenge to visit all these places in only 13 days! An unforgettable memory. Thank you very much to Hien for her special care."}]},{"name":"Vietnam Quick Look - 7 Days","reviews":[{"rating":"4.0","review":"Organisation, sights, accommodation and food excellent. Service also good but it was difficult to understand the your leader because of weak pronunciation. Otherwise all good"},{"rating":"4.0","review":"Guide in ho chi Ming City was very informative and very good. Upgraded room in Hanoi - Angels, was very nice."},{"rating":"5.0","review":"It was all so well organised.  The guides, bus drivers all knew their jobs well.  Guides were professional and gave good information. I would recommend this holiday to everyone.  Thoroughly enjoyed every bit of this holiday."},{"rating":"5.0","review":"Everything's on time. Beautiful places, nice people, the communication was good."}]},{"name":"Sai Gon Highlights 5 days 4 nights","reviews":[{"rating":"5.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."},{"rating":"5.0","review":"Tour Name;Saigon Highlights 5days 4 nights;\nDate: 19th Feb to 23rd Feb 2020.\nEntire trip was perfect. I enjoyed it every day and every minute. Driver picked me from the airport on day one and everything else followed exactly in the itinerary. \nWhen I was nervous about whether someone coming to pick me up for the  tour from hotel or  to the airport or any questions about the tour, I can always check with tour guide using WhatsApp. She was available anytime and replied my questions immediately that was very nice. The hotel I stayed was perfect location to walk around to see more places. There was one time local tour guide asked me to pay for entrance fee for the museum visit and after 1 hr he corrected the mistake and return the money. \nHotel stay was good and breakfast was awesome. \nI strongly recommend this tour to anyone who is interested in learning local culture/ life style/ American war/ region."},{"rating":"5.0","review":"Our first time in Vietnam and it went extremely well. Picked up from the airport , great hotel, on time tour pickup with knowledgeable and amusing guide. We don't normally use guided tours but are very happy we did in this case."},{"rating":"4.0","review":"The tour of HCMC sights, war museum and Cu Chi tunnels was too long of a day. I was picked up at 7:15am and dropped off at 7pm... waaaay too long for a tour day. There were many lulls and the drive to Cu Chi was far. \n\nMy Mekong delta/Can Tho trip was excellent. I had an excellent guide and was lucky to be part of a small group."},{"rating":"5.0","review":"Yen was absolutely amazing - so full of life and knowledge. Please pass on our personal thanks again. Thank you for an amazing trip!"},{"rating":"4.0","review":"Great tour. However the last day went too long from 8am to 8pm."}]},{"name":"Vietnam Highlights - 9 Days","reviews":[{"rating":"5.0","review":"Everything was on time!"},{"rating":"5.0","review":"Overall, the tour was very good.  The airport transports were always on time no matter the time of day or night.\n\nI was unhappy with one guide in Hanoi, however.  He was not a Legend guide but called himself a freelancer.  He said his name was Hung or his work name is Kim.  He provided the city tour of Hanoi.  He didn't seem to be interested in performing his job and his English language was poor.  He told us very little about the sites we were visiting and usually departed from the group to smoke his cigarettes.  He only provided us with a small bowl of pho for lunch rather than going to a restaurant.  I think any non-Legend guides you use should be thoroughly researched prior to use in the future.  The Hanoi city tour was a disappointment."},{"rating":"5.0","review":"The itinerary & the guides were excellent but I was expecting to be with the same group of people all the time.  This was not the case.  Everyday different people were on the trips.  "}]},{"name":"Hanoi - Halong bay - Sapa 7 days","reviews":[{"rating":"5.0","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]},{"name":"Simply Vietnam - Ninh Binh/ Mekong Delta","reviews":[{"rating":"5.0","review":"All guides were outstanding. They were knowledgeable and patient. The way they introduced was straightforward."},{"rating":"5.0","review":"Ninh Binh trip was great. Our guide was excellent to manage all things. There were many chill and calm activities to do like boat trips, cycling through the rice fields, visiting temples, et. The area was peaceful, quiet and relaxing. Not many cars and honking noises. Halong was the same. Outdoor activities satisfied our will to adventure. And suggest you not skip Mekong. Fruit plantation was included. I loved it the most."},{"rating":"5.0","review":"We extended two days for a private trip to Sapa. We intended to take a private car but was suggested to take a sharing bus instead to save the budget. They’re right. The bus was convenient even though the distance was quite long. About 5 hours but we were still comfortable. The first day of trekking was quite long and we had to ride a bike at the end. The weather has changed during a day like four seasons of a year (the guide said that). Our guide was helpful. He knew everything there to suggest us good restaurants and local market to buy souvenir. All hotels and cruise during the trips were situated in good locations. Staff was nice. Our cruise didn’t flow Halong bay but Lan Ha. They were similar. Outdoor activities were great. Good sundeck. Mekong was great as well."},{"rating":"5.0","review":"Overall was good. I am thankful for your effort to help me whenever I contacted."},{"rating":"5.0","review":"The first hotel was not clean. The washroom has a lot of hair on the floor. After we reported, we had a free upgrade to better room as a compensation. They remained it for call 2 as well. Good listener. We felt fine after all. Realistic Asia even upgraded the cruise cabin with balcony for us. Other things were good as their promise. I highly recommend this agent. They were supportive and reliable."},{"rating":"5.0","review":"We changed Hoa Lu into Bai Dinh day tour. We had a wonderful time visiting Bai Dinh Pagoda and a relaxing boat ride in Trang An. The guide was helpful, brought us so much info and personal insights about the places. Thank David for updating my trip daily. Everything was like his description. Before the trip, I had asked him many enquiries but he was always willing to answer."},{"rating":"5.0","review":"We took mekong trip for two days and overnight in mekong lodge. Everything was great, staff, service, view, food, etc. Highly recommend it."},{"rating":"5.0","review":"Mekong day trip is a must-visit place when you go to Hochi Minh City. A great experience you also get to see the village life and enjoy some local activities."},{"rating":"5.0","review":"We wish we had time in Hoi An. My friends said that it’s worth to visit. Everything was well- organized. Next time, I will choose Realistic Asia to arrange everything covering Hoi An as well."},{"rating":"5.0","review":"This was a short drive from Hanoi. Ninh Binh was an amazing area. We really enjoyed our boat ride. Relaxing. Cycling was so fun. The day when we went to Halong was a sunny day. Green water and sunshine was a great combination. Realistic Asia always informed and arranged in a good and timely manner."},{"rating":"5.0","review":"Ninh Binh day tour was great experience. We loved it. The shuttle bus to Ha Long was convenient. Cabin in the cruise was clean but small. Ho Chi Minh was dynamic. I loved the boat trip there the most. Everything was well-organized and neat."},{"rating":"5.0","review":"Everything went as planned. The one time a hotel had no record of our booking, they just contacted our tour Rep and it was cleared up."},{"rating":"5.0","review":"Myself and my best friend spent a week on a Tourradar tour around Vietnam and had a blast. Dat who we were co-ordinating with before and during our trip by email was amazing. He was so obliging and kept us in the loop with everything. All the tour guides were fantastic. They gave us just the right amount of information when visiting places and really took the us and what we wanted to do into consideration. We had a overnight stay on a cruise in Ha long bay which was magical. It was the most incredible place to see and we were able to explore it and just enjoying being surrounded by such an amazing view. Having one night on the cruise was just perfect as with the company we stayed with the second night would have been a repeat of the first so Tourrader made a great choice of having us there for only the one night. Food and everything was really lovely and traditional which was great to try. Would absolutely recommend and would do another tour with Tourrader again as everything was so effortless and enjoyable. Thanks for such an amazing trip."},{"rating":"5.0","review":"We were so glad to meet a guide like Kenny, he’s so informative and have wide knowledge as I asked a lot of questions. Thank you for flawless information of the tour. Wish you all the best"},{"rating":"4.5","review":"I just have finished a tour through Vietnam with S Viet Travel. I expected not much.What we got delivered was an outstanding piece of travelling, sightseeing and dining. Massive thank you to Minah, our guide and her team."}]},{"name":"Classic Vietnam - Saigon to Hanoi 8 Days","reviews":[{"rating":"4.0","review":"Great tour, enjoyed our trip very much. Guide and driver are very much recommended!!"},{"rating":"5.0","review":"Excellent service from Tourradar, efficient, person centred and kept me well informed. We were picked up on time from Hanoi airport by our guide, Tang Kim Dung she took us to the hotel and made sure that everything was in order before she left. Next day she was there on time. Very knowledgable and efficient, she gave good explanation of everything. I must mention the driver, ver polite, he kept an immaculate car and always had fresh water for us, a lovely touch. We were picked up on time for our trip to Halong Bay, all went well but I am not sure what we received for our additional $25 per person for the galla evening, not even a glass of champers at midnight, some cheap stuff that wasn't drinkable. Please don't get me wrong the crew were great but I sensed that quite rightly they were always great. Guide then picked us up for our trip to Sapa, again she ensured we were safely on board and settled before she left. Sapa - well this was a bit of a disappointment. Our itinerary stated a trek, what we got was a 2 hour walk on a proper road, yes there were interesting things to see, but there were lots of people on the same road. We then stopped for lunch for a hour, we had anticipated further walking in the afternoon but our guide dropped us off at 12.50. The rest of the day was free but there is nothing to do in Sapa if your not out trekking, very disappointing. The guide was informative but also annoying as he was often on his mobile phone. Next morning the guide suggested leaving at 7 am, from our experience the day before I said 7.30. In reality we could have left at 9. Lovely 2 hour drive, we stopped at the market, which is like any other market in Asia , so no need to have 2 hrs there. We couldn't do the river trip as the river was too dry due to the dam restricting the flow of water. So we were back in our destination by 12 MD with 9 hours to fill in, in a City that has nothing for tourists. Here our guide was very helpful and got us a room in a hotel but it was a long wait, so we did two ten hour trips on a train for 2 hours walking, a three hour drive the next day. ( which was enjoyable) and 45 mins at a market. Please sort this out for others. I am sure that others have said this but Sapa is now very commercialised and you may want to suggest other things for the itenary. I hope you find this useful, it is intended to be. Best wishes Julie"}]}]