[{"name":"Sapa – Bac Ha Markets tour 3 days 4nights","reviews":[{"rating":"4.5","review":"I had an absolutely wonderful photography and motorbike tour with Zonitrip in October this year! You will be extremely lucky to have a guide like Nghia, her professionalism, flexibility, patience and dedication to my needs were beyond my expectations. This was my second tour with Zonitrip and will definitely my prefer tour operator when I plan for my next trip to Sapa and Hoang Su Phi. Highly recommended!!!"},{"rating":"4.5","review":"The cost was not proportionate to the tour. Many others paid a fraction of the price charged by tourradar."},{"rating":"3.5","review":"We had an excellent guide who made sure we did all the trekking we could do and made sure we had very good accommodation and vegetarian food that was amazing. The hosts at the homestay were very warm and accommodating. Awesome experience overall."}]},{"name":"Saigon to Phu Quoc 7 Days (with Mekong Eyes Cruise)","reviews":[{"rating":"5.0","review":"Great tour, enjoyed our trip very much. Guide and driver are very much recommended!!"},{"rating":"4.0","review":"Excellent service from Tourradar, efficient, person centred and kept me well informed. We were picked up on time from Hanoi airport by our guide, Tang Kim Dung she took us to the hotel and made sure that everything was in order before she left. Next day she was there on time. Very knowledgable and efficient, she gave good explanation of everything. I must mention the driver, ver polite, he kept an immaculate car and always had fresh water for us, a lovely touch. We were picked up on time for our trip to Halong Bay, all went well but I am not sure what we received for our additional $25 per person for the galla evening, not even a glass of champers at midnight, some cheap stuff that wasn't drinkable. Please don't get me wrong the crew were great but I sensed that quite rightly they were always great. Guide then picked us up for our trip to Sapa, again she ensured we were safely on board and settled before she left. Sapa - well this was a bit of a disappointment. Our itinerary stated a trek, what we got was a 2 hour walk on a proper road, yes there were interesting things to see, but there were lots of people on the same road. We then stopped for lunch for a hour, we had anticipated further walking in the afternoon but our guide dropped us off at 12.50. The rest of the day was free but there is nothing to do in Sapa if your not out trekking, very disappointing. The guide was informative but also annoying as he was often on his mobile phone. Next morning the guide suggested leaving at 7 am, from our experience the day before I said 7.30. In reality we could have left at 9. Lovely 2 hour drive, we stopped at the market, which is like any other market in Asia , so no need to have 2 hrs there. We couldn't do the river trip as the river was too dry due to the dam restricting the flow of water. So we were back in our destination by 12 MD with 9 hours to fill in, in a City that has nothing for tourists. Here our guide was very helpful and got us a room in a hotel but it was a long wait, so we did two ten hour trips on a train for 2 hours walking, a three hour drive the next day. ( which was enjoyable) and 45 mins at a market. Please sort this out for others. I am sure that others have said this but Sapa is now very commercialised and you may want to suggest other things for the itenary. I hope you find this useful, it is intended to be. Best wishes Julie"}]},{"name":"Vietnam Essential 10 days","reviews":[{"rating":"4.0","review":"Thank you so much for everything you did to make our honeymoon great, we had an amazing 3 weeks! I left a Trip Advisor review for BestPrice and called you out, and I'm attaching the feedback form here. We enjoyed all the wonderful places and were very pleased with all the accommodations and how smoothly all the transportations went."}]},{"name":"5 Tour Hanoi Package Including City Tour, Bat Trang and Halong Bay","reviews":[{"rating":"5.0","review":"Lioncub tanzania is wonderful tour company. Actually the tour was so amaizing, we went serengeti and seeing migration of wildebeest, walking at Arusha nationa park, big herds of elephant in tarangire also tree climbing lions in Manyara and descent to the crater flow"}]},{"name":"Bun Cha & Biking in Vietnam","reviews":[{"rating":"4.5","review":"Excellent trip. My experience of Vietnam ticked all the boxes. Our guide was superb. He was very knowledgeable and helped group members with all sorts of issues. The itinery was very interesting. Only disappointment was when we visited the Ho Chi Minh morselium it was closed to the public (this is more of an observation rather than a criticism). Our accomadation was excellent, as was the food. Highlights for me was Halang Bay and the Cu Chi tunnels. Would definately recommend and use Exodus travel again."},{"rating":"5.0","review":"The Vietnam cycling adventure was amazing. I wasn't expecting the level of care and accomodations that Exodus Travel...\nShow more"},{"rating":"4.5","review":"My Vietnam trip exceeded my expectations, Nam our tour guide went above and beyond every day. Dealing with all the...\nShow more"}]},{"name":"Tour 6 days Ho Chi Minh – MeKong – Phan Thiet","reviews":[{"rating":"4.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"5.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"5.0","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"8 days 7 night Ha Noi – Sapa (by bus) – Ninh Binh","reviews":[{"rating":"4.5","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"Tour to Hanoi plus 1 Night on Serenity Cruises 5*","reviews":[{"rating":"4.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"3.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"8 days 7 night Ha Noi – Sapa (by train) – Ninh Binh","reviews":[{"rating":"4.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.5","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"5.0","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"6 Days Explore Mekong Delta & Phu Quoc Island","reviews":[{"rating":"4.5","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"5.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]}]