[{"name":"Vietnam Classic Tour in 9 Days","reviews":[{"rating":"4.0","review":"We are group of 7 joined with luxury vacation package for whole week from hanoi- north west sapa, bac ha market, we explored many passes to reach the highest mountainous region and visited some primary school, did donation foundations, helps...Lvp operator played an important role in supporting our group for both definitely travel with work in hanoi. Thanks and recommend this operator to everybody"},{"rating":"4.5","review":"Best wishes to LVP Travel thanks for helps and services kind regards"},{"rating":"4.5","review":"Great Trip in Vietnam ! Love all people of LVP Group and Excellent Guide for a week in North of Vn sincerely"}]},{"name":"Explore central Vietnam 6 days 5 nights (Da Nang- Hoi An- Hue)","reviews":[{"rating":"4.5","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"VNA003 - 11days Essence of Vietnam","reviews":[{"rating":"5.0","review":"Great tour covering all the important sights, culture and food. The guides in Ho Chi Min were excellent. There were a few glitches along the way but Lily from Your Vietnam always apologised and resolved everything quickly. I would highly recommend this tour."},{"rating":"5.0","review":"The tour exceeded our expectations! From start to finish everything was planned expertly and never missed a beat, all the tour guides and companies they chose were excellent and made the experience that much better. Hotels were also excellent and provided amazing customer service! Highly recommend."}]},{"name":"Charming Vietnam – 12 Days - Flash Deal + Bonuses","reviews":[{"rating":"5.0","review":"Sunny was very organize, friendly, and pleasant to deal with."},{"rating":"5.0","review":"Jame and I did the 12 day tour VIETNAM with Vietnam Allure Travel. \nWe really enjoyed the trip. We started in Hanoi in 15 Jan then flew out from Saigon.\nThe trip was well arranged from Transportations, hotels and daily road tours.\nWe highly recommend Halong bay overnight and Hoian"},{"rating":"5.0","review":"We loved our Vietnam tour. Our travel consultant was so helpful and accommodating. We have nothing to worry from visa, hotels, tours booking and cruise. The food in Vietnam was very good. We loved Hoian, Halong and Hanoi. Beautiful country with culture, amazing landscape and friend;y people."}]},{"name":"5-day Amazing Northern Vietnam: Hanoi - Ninh Binh - Sapa - Halong Bay cruise","reviews":[{"rating":"4.0","review":"Guides were very friendly and welcoming. Tour bus from Hanoi to port was relatively new, clean and comfortable. Boat like many others in the bay was fairly old and a bit run down. Had a great view from the top deck. The lock on our room broke and we needed to be moved to another room, the shower in the new room did not drain water so well. The tour packed in a lot of activities over the three days including a cave visit and hike up Ti Top island. Expect to pay for all drinks on the boat and corkage fee to bring your own drinks. Cat Ba island hotel was nice with a great view of the harbour and only a short walk to town. The hike included on Cat Ba was quite strenuous but the view from the top of the mountain fantastic. The trip to monkey island on a small boat off Cat Ba was cool - the monkeys can get a bit agitated, and are experts at raiding back packs, zippers pose no problem for them. Overall a lot of fun was had on the tour and it was well organised and the guides kept the group busy."},{"rating":"4.5","review":"The tour was a great overview of the life and industry on the Mekong Delta. The bus was comfortable and the tour guide very knowledgeable. It was a very on the go tour and long distances made the day tiring. We did not arrive at our homestay (we chose the homestay option - there was a hotel option) until quite late. But the homestay, while at first seeming quite isolated and off the beaten track, actually had about 25 other tourists also staying there. The highlight was the cooking lesson for dinner and then eating all we had cooked. All in all, a great overview, but long distances to travel."},{"rating":"3.5","review":"The tour guide and staff were excellent. The food was good. The rooms were great. Pick ups and drop offs smooth. I can say only good things about the staff. Their sense of humor and duty to their jobs was above board. The only problem I had was with how many other tours and tourists were doing the same thing at the exact same time."}]},{"name":"North and Central Vietnam 7 Days 6 Nights (Hanoi, Halong Bay, Danang and Hoi An)","reviews":[{"rating":"3.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"4.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"10 Days Vietnam Flavors","reviews":[{"rating":"4.0","review":"Everything was perfectly coordinated. The guides in Sapa were fantastic and made the experience unforgettable. The food was fantastic, whether in one of the farm homes on the hikes, at the hotel before and after the hikes, or on the Ha Long cruise. The Friends Travel were world class. They were very friendly, accommodating and extremely capable. I could not suggest a single improvement and look forward to using them again."},{"rating":"3.5","review":"The accommodation choices were fantastic especially the hotel in Hanoi - LaSiesta!"},{"rating":"5.0","review":"Great tour Highly recommended"}]},{"name":"VNA002 - 10days Vietnam Classic Tour","reviews":[{"rating":"5.0","review":"Great tour covering all the important sights, culture and food. The guides in Ho Chi Min were excellent. There were a few glitches along the way but Lily from Your Vietnam always apologised and resolved everything quickly. I would highly recommend this tour."},{"rating":"4.5","review":"The tour exceeded our expectations! From start to finish everything was planned expertly and never missed a beat, all the tour guides and companies they chose were excellent and made the experience that much better. Hotels were also excellent and provided amazing customer service! Highly recommend."}]}]