[{"name":"Vietnam excursion 14 days - North, central to South","reviews":[{"rating":"4.5","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.5","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Best of Vietnam, Max 6 People","reviews":[{"rating":"4.5","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"5.0","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"4.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"Halong Flamingo Cruise Package Tour from Hanoi for 5 Days","reviews":[{"rating":"2.5","review":"Very disappointed.  5 days of nothing..2 days on a bus and no pick up at airport..a big waste of money..will never recommend. \nNot 5 days of anything.."},{"rating":"5.0","review":"We have group of 4 and were given a private tour by DNQ travel, wow it was a great feeling like in the movies when visiting Halong bay. We had good seafood lunch on board the boat and we have fun do kayaking and boating and also visited the caves. It definitely a good choice.\nAlso we are very happy with our Guide Mr Hung, he speak well in English."}]},{"name":"North Vietnam Family Explorer","reviews":[{"rating":"4.5","review":"Our family of 5 enjoyed the Halong Bay 3-day bike trip. It was a nice way to see the area -- better than just viewing from a car window. Great guides!"},{"rating":"4.0","review":"Shame on me! We should have brought our own bikes! between us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own. bikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting. We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected. Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"5.0","review":"Fantastic tour, with extremely diverse sights -- from the beaches of Central Vietnam to the temples of Angkor Wat. We particularly enjoyed the hill country of Vietnam (the climbing day was excellent) as well as the temple sites in Cambodia. The accommodations were generally no-frills (due, in part, to the remote locations we were traveling through), though the hotel in Angkor Wat was excellent. The meals were fantastic -- the guides did an excellent job of selecting restaurants with great local fare. Would definitely recommend."}]},{"name":"7 Days Mekong Delta Cruise & Phu Quoc Island Relaxtion , Max 6 Guests","reviews":[{"rating":"3.5","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"3.5","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"4.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]}]