[{"name":"Viet Nam 5 Days Super Save Package","reviews":[{"rating":"5.0","review":"The trip was very well organized. The transportation was always on time. Communication with my contact was easy, with quick and helpful responses every time. All of my accommodations were really nice and comfortable. A couple lunches in the \"restaurants\" could've been a little bigger in portion size but the food was great. This particular tour covered a lot of Vietnam in 5 days and I was very satisfied. I highly recommend this tour!"},{"rating":"5.0","review":"It was fantastic tour to see Vietnam. The tour will make you fall in love Vietnam. As the tour will take you to beautiful landmark like Halong Bay Tour and experience culture of Vietnam like visiting Mekong Delta. The tour will guide you with their good English speaking skills. Especially tour agent were very supportive and helpful."},{"rating":"4.0","review":"The 5 days Vietnam tour I took was very satisfying over all. The guides are excellent, accommodations are in well situated area, easy for foreigners to navigate the area as well as get entertained. Would recommend tour radar to anyone who's visiting Vietnam."},{"rating":"5.0","review":"This made our groups trip to Vietnam as easy as possible. Every driver was there to pick up up, every hotel was ready for us when we got there. Both hotels were in amazing locations in Hanoi and Ho Chi Minh, and the river cruise was beautiful. Ms. Thu was the most helpful woman ever, she was constantly in contact with us and kept us updated as things changed. I cannot wait to go back to Vietnam and use Ms. Thu again! The only problem with the trip was it wasn’t long enough."}]},{"name":"Sapa Bac Ha Sunday Market 2Days/3Nights","reviews":[{"rating":"1.0","review":"I booked two tours on Tour Radar.\n118034-EASFC - Sapa Bac Ha Sunday Market 2Days/3Nights\nand 117790-KNT3U Hanoi - Halong Bay Cruise overnight on Boat Short Trip for 5 Days\n\nA total of $1045.87 AUD\n\nThe trip was a disaster and misrepresented in its entirety.\nThere were so many issues I am unsure where to start but I will start with the two most upsetting and frustrating issues.\n\n1. I was the ONLY person on this group tour \n2. I did not have a tour guide with me \n\nI am and was completely baffled during the whole tour, being a female solo traveller who had just volunteered in a hospital in Ho Chi Minh and had treated myself to this amazing sounding tour so I could explore Vietnam with other people. Mainly so I was not alone and for the safety of other people and a tour guide.\n\nAfter just day two I realized I had booked something that had been completely misrepresented and I was distressed.\nSo I emailed a complaint to Legend Travel Group and Indochina Legend as once booked via Tour Rador these were the companies who sent me my itinerary and details of the tour. There were 9 email address who received my complaint and I did not receive one reply. This is when I realized I was in trouble.\n\nBelow are the details of the trip that has left me very distressed and upset and wondering why or how this could of happened, I am a strong individual and it was not my first time in Vietnam. I am not a naive and vulnerable traveller but still this group tour or lack of (as I was the only person) has left me extremely upset and distraught. I want answers.\n\nDay 1 –  Friday 24th November \nI arrived to Hanoi, met by a man who didn’t speak English and didn’t tell me where I was going, he simply pointed to a car and I dragged my bag over.\nI arrive at the hotel and I am met by a man and told I am the only person getting the 8 hour night train to Sapa. Himself who I assume was the English speaking tour guide and no other guests on the tour would be joining me.\nI then thought I was having a Private Deluxe Cabin on the train as stated online (plus I had paid the extra single supplement so I didn’t have to share) but instead I was told I was having a shared cabin, so I paid an extra 2,200,000VND ($128AUD) cash to get the Private cabin. I then travelled alone - no tour group, no tour guide.\n\nDay 2 –  Saturday 25th November \nThe driver who picked me up at Sapa in a busy mini bus (I was relieved and hoped these people were on my tour, sadly they weren’t, I again was the only person on this group tour) didn't give me the correct details of my hotel, he gave me a piece of paper with \"11 Maong Hoa\" which was incorrect and pointed down the road but I did not know this was incorrect so proceeded to walk to the location following my satellite navigation. I had called the man who had put me on the train and he said the hotel was U Sapa not knowing the hotel has renamed to BB hotel. I got lost and upset and started to feel distressed, I then had another man call me and I met him at the legend hotel, I then assumed he was the English Tour Guide (he was not).\n\nI then start my Sapa trek which wasn't great – I was directed to go with a local native non English speaking woman, it was so muddy and slippery it was dangerous. I fell over so many times I had to turn back and go a different way with the woman who did not speak any English. We were also not informed on the level of difficulty of the trek, nor that we should wear gumboots.\nThere was no picnic lunch? But instead a lunch served to us, which was spoilt by many many women forcing us to buy products. After this I left.\n\nFinally I get to the BB Hotel to check in and the reception have no record of my name, so I then have to call the other man who I had met in the morning to speak Vietnamese. I then check in. Hotel is very nice but was ruined due to screaming children running the hallway outside my room and the connecting door to my room are having a party. I made two complaints to reception. Reception said I can't move rooms as they are fully booked so I cried myself to sleep.\n\nDay 3 –  Sunday 26th November \nI checkout and I join a mini bus with other people and we drive to Bac Ha Market and a local village.\nWe were in the fully packed mini bus for over 6.5 hours that’s 3.5 hours there and 3 hours back with us spending a total of 2.5 hours out of the mini bus.\nThis I could deal with as I was with other people and enjoyed having human contact.\nHowever what frustrated and upset me about this day was getting dropped at the train station at 4.30pm……. my train was not till 9.40pm! That is over a 5 hour wait on my own, alone as I had no one on my group tour, what and why was this done, this is not acceptable.\nThe train station is not in a nice part of town and I was constantly harassed by men wanting to wash shoes and at one point had my shoes taken off my feet until I started screaming, they were then returned.\nAfter a 5 hour wait I was then be told my train ticket I had paid $128 AUD for was NOT A RETURN! I then got in a shared cabin with a family of 4 for an 8-hour train journey back to Hanoi.\n\nDay 4 –  Monday 27th November \nI spent the day alone in Hanoi, as I had no other people on my group tour and no English-speaking tour guide. I was lonely and upset. I still had no reply to email complaint.\n \nDay 5 –  Tuesday 28th November \nTo upset and angry to go on my tour.\n\nDay 6 \nI joined the boat trip to Halong Bay called GARDEN BAY CRUISE this was lovely and would recommended booking separately it would be far cheaper just 500,000VND just $29 AUD.\n\nDay 7 \nI had a nice time at Halong Bay.\n\nAs you can imagine I am livid as my trip was completely ruined due to what I booked being completely untrue and misrepresented, I did not get what I paid for and it has left me very upset.\n\n:( Laura "},{"rating":"5.0","review":"Hi Ms Nguyen\n\nYour services were excellent and I will be recommending your company to friends and colleagues who may be wanting to travel to Vietnam.\n\nI am hoping to get back to Hanoi later sometime mid-year as I would like to visit Sapa, so will definitely be in contact again with you.\n\nKind regards\n"}]},{"name":"Seven Days Discover Real Charm North Vietnam","reviews":[{"rating":"5.0","review":"They were very helpful. I planned for my trip but then I had to reschedule due to Visa problems and they helped me reschedule. Very nice and very organized"},{"rating":"4.5","review":"This tour was actually a combination of a few smaller tours combined. Each segment I found myself with different people. \nInitially I was uncertain if I’d made a wise decision as on the first scheduled day of activities, nobody came to pick me up from the hotel. Eventually a lady came and explained/apologised for the situation. The bus had gone without me, traffic problems etc. I was offered some cash to help compensate. Luckily for me I had a free day at the end which I was able to substitute for the initial missed day, so it all worked out. The man in charge (who I’d met the day before)was extremely apologetic & very good with communication at all times....especially when I got nervous about future pick ups!\nThe hotel was a good base to come back to each time in between the overnight trips to Halong Bay & Sapa. Staff here were friendly & looked after luggage while I was away overnight. \nThe boat was quite old looking, but seemed to be the case for most on the bay. It was safe though, food really good & great activities while on this segment of trip. Not too much space around the bed itself to move around. \nThe home stay with the tribal people is very basic and may not be suitable for everyone. If you’re young, energetic & keen to see the simpler side of life then definitely go for it. It is very basic though. Cement floor, hard bed but has a mosquito net & there’s a lightbulb dangling freely from roof. To access the shower you needed to walk down a narrow sloping track which becomes very slippery after the rain. \nLeaving the place the following day I also nearly slipped down the trails which had become dangerously slick due to heavy rain overnight. The family though are kind & you’ll be fed well. Amazing considering the rudimentary kitchen!!\nThe various guides throughout the different segments of the trip were all very friendly & mostly quite good with their English language skills. \nIn summary I’d say it was good value for money, I’d recommend the trip (despite my initial concerns & the muddle up at the beginning) but suggest that for slightly older travellers (like myself) or those wanting a little more comfort, you should probably consider upgrading to something a bit more luxurious."},{"rating":"5.0","review":"Everything from start to finish was well organized. I felt supported the entire trip which was nice since this was my first experience tracking alone. When I didn’t utilize the airport shuttle service I was refunded accordingly for that service. I met the general manager in person and he gave me a nice travel bag gift.  I would highly recommend Vietnam Real Tour to my friends and family."},{"rating":"4.5","review":"Brilliant overview of the highlights of Northern Vietnam."},{"rating":"5.0","review":"Spent one week in northern Vietnam and had a wonderful time! The trip was so well organised and if I ever had questions - they were answered within minutes.\nThe accommodations were all nice and clean. The food on the trips were of good quality. I would for sure recommend booking with this tour company!"},{"rating":"4.0","review":"Very well organized, everything went smoothly. Manh kept in constant contact and was very helpful when I had questions! It is a very busy itinerary but the trips were all great and as described."}]},{"name":"Highlights of Vietnam - 8 Days","reviews":[{"rating":"5.0","review":"Awesome.... Legend Tours is great"},{"rating":"4.0","review":"Our Ho Chi Minh city tour guide was excellent.\nHowever, the one at Hoi An was a little disappointing. The ones at Hanoi and Danang were OK."},{"rating":"4.5","review":"We enjoyed the tour overall. Ha long Bay trip was superb. Hanoi, Hoi An and Saigon itinerary were good, balancing between site visit and personal time. Much appreciated effort for arranging halal food as we requested."},{"rating":"4.0","review":"If you only have a week and have never been to Vietnam like me, then this 8 day trip will give you a chance to sample(quickly) the North, the Mid Viet and the South.\nStarting in Hanoi, the Legend tour manager Mr Do Thanh Tung met me in my hotel & remained in instant contact throughout my stay in Vietnam.\nThe tour is essentially a combination of trips provided by different operators put together by Legend.\nAll pick ups and transfers were operated very reliably and punctual.\nThe Hanoi & Halong Bay tours were very well organised indeed.\nIn Danang/Hoi An too much time was taken up on the tours with visits to ceramics , jewellery & wood carving \"factory\" outlets - tourist selling spots that were not my thing and on an express trip like this were too time consuming.\nAll the hotels used on the upgraded package were very good except for the Bay in Ho Chi Minh city, which I liked the least (hotel reviewed separately on Trip Advisor).\nLegend put together a very good package and it was executed very well, with only the odd hiccup-mainly due to Vietnam Airlines changing schedules.\nThis tour took in Hanoi, Halong Bay(overnight), Hoi An and Ho Chi Minh City.\nI was reassured that Mr Tung was on call 24 hours a day to answer any queries I had. I would recommend using Legend as Vietnam experts in tours of this fine country."},{"rating":"4.5","review":"Traveling was painless and a good experience"},{"rating":"4.5","review":"This was a wonderful, well-organised tour with amazing guides, accommodation, itineraries, and friends made. I felt safe, well informed and value for money. At times I thought it would be more fun to have more people on the tour, I realised I should feel important to have a private tour guide. The weather was a little disappointing but you cannot control this. I'm just appreciative I did not have to be evacuated at any time! \nThankyou for the special cake organised on my birthday, what a thoughtful and lovely surprise. \nI highly recommend you to any tourist. \nThankyou for everything. "}]},{"name":"Surprising Vietnam in 10 days - HCM/ Hoi An/ Halong Bay","reviews":[{"rating":"3.0","review":"Absolutely loved all the places we visited.Would have liked a little more time at certain spots as it felt a little rushed at times. Expected to have a group that we would travel the whole tour with. It was quite unorganised, as we were told certain pick up times & it was wrong a number of times. Also details that we would be spending a whole day cycling through village & rice fields which turned out one of us had to miss out on because they werent physically able to ride, especially given the hectic environment of Vietnam traffic.Expected a tour guide to take us through the entire tour, but this changed daily & if I hadnt checked my email i would not have even known when & where we would be going each day. So overall disappointed in the organisation of what could be an exceptional tour."},{"rating":"5.0","review":"Very nice experience with Realistic Asia tean. The team understood what we were looking for a trip and was very pro-active when we encountered setbacks due to the weather. I highly recommend a great team like them for my friends and my family."},{"rating":"5.0","review":"This trip opened my eyes to Vietnam. It's truly an underrated destination. I totally will be back there with the help of Realistic Asia. Good destination for my budget but still relaxing and charming."},{"rating":"5.0","review":"Excellent trip, well-organized, quality services and much appreciated attentions! We all loved this trip. Hotel, transport, tours, etc. everything was perfect. A special mention for our guides who knew how to accommodate and make us discover this beautiful country and were ready for help!"},{"rating":"5.0","review":"Most of the services, tours and accommodations were awesome as my friends recommended before our arrival. But we had to wait for flight delay due to bad weather. I felt thankful for all your words to comfort and truly care for our feeling when pumping into this inconvenience. You don’t act like a broker who just is a third party to buy and sell products and gain commission but well take care your travellers. Cannot recommend higher!"},{"rating":"5.0","review":"Realistic Asia was awesome with their arrangement according to our requirement. We were picked up on time and had a guide to reach out whenever we had any questions. I would definitely go with them! My family plans to take a trip next June to Cambodia. Looking forward to their great support"},{"rating":"5.0","review":"Realistic Asia knew how to get our desire of accommodations. We received a detailed itinerary 15 days before the trip and also detailed notes we need to know before departure. It's the first time I have been to a new country like Vietnam so I had many queries for them. They were so patient to answer clearly and thoroughly. They took care of our group and checked the quality daily to make sure I felt secured. This will remain as a wonderful memory and will encourage our motivation to be back to this beautiful country and book with Realistic Asia. Thank Dat for all of your hard work and care. Don't forget my promise to welcome you whenever you have a chance to visit my hometown. Thanks a lot!"},{"rating":"5.0","review":"Realistic Asia did a great job in planning and following our family’s trip around Vietnam. We had two daughters and wanted a balance of sightseeing and activities for my family. This package was perfect to my family. The local guides were knowledgeable and caring. Hotels and cruise recommended were all located in center and unique in design. I will go with them for sure."},{"rating":"5.0","review":"My 10-day trip to Vietnam was a rewarding experience. All activities were fantastic, and beyond my expectations. Dat prepared my trip perfectly. Hoi An Coco River was superb!"},{"rating":"5.0","review":"It's a logical way to cover three parts of Vietnam. Each of them has its different taste of cuisine. We requested the street food tours for all big city: Hanoi, Hoi An and Ho Chi Minh. It's worth to try. All local guides were so friendly and helpful."},{"rating":"5.0","review":"We had an excellent trip to Vietnam last winter, thanks to Realistic Asia. We had researched lots of destinations in advance. This package included most of them so we decided to book. Dat was professional to respond to any of our querries in a timely manner. His knowledge was surprising."},{"rating":"5.0","review":"Mot was must-try drink in Hoi An. It's herbal drink, so fresh and cheap. There were several places to buy but the one in Tran Phu street was my fave. There were many unique colorful paper lanterns. So lovely to see."},{"rating":"4.5","review":"Mr David had a wonderful job with me. This trip was perfectly \nThank you Touradar and Sviet Travel"},{"rating":"4.5","review":"It was great having someone looking after us and we were able to modify our tour with no problems. We ticked off everything on our bucket list and more!"},{"rating":"5.0","review":"We chose S Viet Travel based on their reviews and wasn't disappointed. Planned an excellent holiday for us at a good rate and kept us up-to-date all along, including quickly responding to changes we wanted to make along the way"},{"rating":"4.5","review":"The best thing I have during and after the trip to Vietnam and Cambodia are good accompany.  Luckily I traveled with other like-minded travelers. Together with Mr Hoan, we had a really good time travelling. Thank you tourraadar and S Viet Travel for bought us together. .Highly recommended."},{"rating":"4.5","review":"This tour is good value and quality for price. I have seen pretty much just for 10 days. And it’s a great trip over all."},{"rating":"4.5","review":"Nice time exploring Vietnam with my family, well-arranged accommodation and friendly local people. Besides, Hoi An memories show is spectacular and stunning, should check it out while you’re in the city, Thanks Minah for the recommendation"},{"rating":"4.5","review":"I don't know about others tour operators but this tour operator surely won my heart.\ngreat support, great service and of course suits your budget.\ni would suggest you must visit places- hanoi,halong,da nang,hoi an,sapa and ho chi minh.\nthis tour operator was no where compromising on services, prompt telephonic support and whatsapp support and all the hotels n vehicles were good and cruise was awesome i chose 4 star cruise.\ni would highly recommend this operator"}]},{"name":"Hanoi & Halong Bay plus Mountain Resort - 6 Days","reviews":[{"rating":"5.0","review":"Fantastic tour package"},{"rating":"3.5","review":"Staff and guides were all helpfull, lovely people. The transport was modern and always punctual. The accommodation was poor, first room was damp and musty smelling, and was transferred to a suite for extra price which had badly rotting floorboards that precluded me from using certain parts of the room. The tours were potentially good but took to long to drive, made worse by enforced stops to entice us all to buy products on a commission. The eagerly awaited Halong bay trip, the only reason for the 5 day stay, was cut short only on arrival at the boat and after a 4 hour journey with 2 shopping stops. We were told of bad weather approaching which must have been forecast before we set off that morning. The trip on the boat only lasted 5 hours with the lobster dinner, overnight on boat, kayaking, beach , swim, breakfast and brunch all cancelled. The staff tried their best but management should have handled the whole situation differently and certainly better. The special part of the trip was ruined."},{"rating":"4.5","review":"Staffs are good! They provide excellent service.  I will recommend to my family and friends."},{"rating":"2.0","review":"I booked two tours on Tour Radar.\n118034-EASFC - Sapa Bac Ha Sunday Market 2Days/3Nights\nand 117790-KNT3U Hanoi - Halong Bay Cruise overnight on Boat Short Trip for 5 Days\n\nA total of $1045.87 AUD\n\nThe trip was a disaster and misrepresented in its entirety.\nThere were so many issues I am unsure where to start but I will start with the two most upsetting and frustrating issues.\n\n1. I was the ONLY person on this group tour \n2. I did not have a tour guide with me \n\nI am and was completely baffled during the whole tour, being a female solo traveller who had just volunteered in a hospital in Ho Chi Minh and had treated myself to this amazing sounding tour so I could explore Vietnam with other people. Mainly so I was not alone and for the safety of other people and a tour guide.\n\nAfter just day two I realized I had booked something that had been completely misrepresented and I was distressed.\nSo I emailed a complaint to Legend Travel Group and Indochina Legend as once booked via Tour Rador these were the companies who sent me my itinerary and details of the tour. There were 9 email address who received my complaint and I did not receive one reply. This is when I realized I was in trouble.\n\nBelow are the details of the trip that has left me very distressed and upset and wondering why or how this could of happened, I am a strong individual and it was not my first time in Vietnam. I am not a naive and vulnerable traveller but still this group tour or lack of (as I was the only person) has left me extremely upset and distraught. I want answers.\n\nDay 1 –  Friday 24th November \nI arrived to Hanoi, met by a man who didn’t speak English and didn’t tell me where I was going, he simply pointed to a car and I dragged my bag over.\nI arrive at the hotel and I am met by a man and told I am the only person getting the 8 hour night train to Sapa. Himself who I assume was the English speaking tour guide and no other guests on the tour would be joining me.\nI then thought I was having a Private Deluxe Cabin on the train as stated online (plus I had paid the extra single supplement so I didn’t have to share) but instead I was told I was having a shared cabin, so I paid an extra 2,200,000VND ($128AUD) cash to get the Private cabin. I then travelled alone - no tour group, no tour guide.\n\nDay 2 –  Saturday 25th November \nThe driver who picked me up at Sapa in a busy mini bus (I was relieved and hoped these people were on my tour, sadly they weren’t, I again was the only person on this group tour) didn't give me the correct details of my hotel, he gave me a piece of paper with \"11 Maong Hoa\" which was incorrect and pointed down the road but I did not know this was incorrect so proceeded to walk to the location following my satellite navigation. I had called the man who had put me on the train and he said the hotel was U Sapa not knowing the hotel has renamed to BB hotel. I got lost and upset and started to feel distressed, I then had another man call me and I met him at the legend hotel, I then assumed he was the English Tour Guide (he was not).\n\nI then start my Sapa trek which wasn't great – I was directed to go with a local native non English speaking woman, it was so muddy and slippery it was dangerous. I fell over so many times I had to turn back and go a different way with the woman who did not speak any English. We were also not informed on the level of difficulty of the trek, nor that we should wear gumboots.\nThere was no picnic lunch? But instead a lunch served to us, which was spoilt by many many women forcing us to buy products. After this I left.\n\nFinally I get to the BB Hotel to check in and the reception have no record of my name, so I then have to call the other man who I had met in the morning to speak Vietnamese. I then check in. Hotel is very nice but was ruined due to screaming children running the hallway outside my room and the connecting door to my room are having a party. I made two complaints to reception. Reception said I can't move rooms as they are fully booked so I cried myself to sleep.\n\nDay 3 –  Sunday 26th November \nI checkout and I join a mini bus with other people and we drive to Bac Ha Market and a local village.\nWe were in the fully packed mini bus for over 6.5 hours that’s 3.5 hours there and 3 hours back with us spending a total of 2.5 hours out of the mini bus.\nThis I could deal with as I was with other people and enjoyed having human contact.\nHowever what frustrated and upset me about this day was getting dropped at the train station at 4.30pm……. my train was not till 9.40pm! That is over a 5 hour wait on my own, alone as I had no one on my group tour, what and why was this done, this is not acceptable.\nThe train station is not in a nice part of town and I was constantly harassed by men wanting to wash shoes and at one point had my shoes taken off my feet until I started screaming, they were then returned.\nAfter a 5 hour wait I was then be told my train ticket I had paid $128 AUD for was NOT A RETURN! I then got in a shared cabin with a family of 4 for an 8-hour train journey back to Hanoi.\n\nDay 4 –  Monday 27th November \nI spent the day alone in Hanoi, as I had no other people on my group tour and no English-speaking tour guide. I was lonely and upset. I still had no reply to email complaint.\n \nDay 5 –  Tuesday 28th November \nTo upset and angry to go on my tour.\n\nDay 6 \nI joined the boat trip to Halong Bay called GARDEN BAY CRUISE this was lovely and would recommended booking separately it would be far cheaper just 500,000VND just $29 AUD.\n\nDay 7 \nI had a nice time at Halong Bay.\n\nAs you can imagine I am livid as my trip was completely ruined due to what I booked being completely untrue and misrepresented, I did not get what I paid for and it has left me very upset.\n\n:( Laura \n"},{"rating":"4.0","review":"The boat is not the newest available but the staff were quite friendly.  With regards to the accommodation, the air conditioning was a bit deficient as it would not work when the boat was moving, and when it did blow in the cabin it was ineffective and blowed moist humid air."},{"rating":"4.0","review":"I stayed at the Viet View hotel, which had a great location, right at the heart of Old Quarter.\nThe tour to Nihn Bin was not spectacular, as the guide rushed to do it, however the cruise was excellent!"},{"rating":"5.0","review":"Unfortunately we had to cancel our trip due to a major illness. \nIndochina Legend staff was very helpful, handeld the cancellation with the cruise company and granted a 100% refund. \n\nWe will definitely book with them again. \n\nThanks Indochina Legend team!\nVisited December 2015"},{"rating":"5.0","review":"Used their service during our 7-day trip to Hanoi & Halong Bay. Was not really sure what to expect as i just found them on the internet. But once we arrived at the Hanoi airport until we left, everything went really smooth & according to schedule. The transport provided & hotel accommodations were very comfortable and to our satisfaction. The great thing was, we did not have to pay for the entire cost upfront. Just required us to pay a booking deposit. \nThanks to Ms. Phuong who patiently communicated via email for organizing and re-organizing the tour to our convenience.\nWould highly recommend travel agent."}]},{"name":"VIETNAM COLLECTION 3 - Romancing Vietnam","reviews":[{"rating":"5.0","review":"The guide’s pronunciation sometimes was terrible"},{"rating":"5.0","review":"I'm really enjoy this tour. All hotels are located in city center, I love Pavillon Resort in Hoi An and Swan Cruise in Halong Bay so much, it's really nice & luxury. Guide team of Footsteps is excellent, Kent in Saigon and Kim in Siem Reap are great, knowledgeable and helpful. I highly recommend this tour, especially cruise along Mekong Delta & speed boat to Cambodia - such an amazing experiences! Thanks Footsteps a lot!"},{"rating":"4.5","review":"Fantastic, they focus on quality, take care me a lot, hotel, car and guide is really excellent"}]},{"name":"Discover Vietnam","reviews":[{"rating":"4.5","review":"Love you both dearly always come through fo people, the extra care & caring tips for everyone\nAnd yes I would do a 3d trip with no regrets"},{"rating":"5.0","review":"This was probably the best vacation my wife and I have ever had, thanks in no small part to the excellent itinerary and the attention and commitment shown to us by our guides Jane and D. I was touched in many ways during our visit to Vietnam.  From the beauty of the country with its different and varied landscape to the open, friendly and humble spirit of the people we met along the way. I believe our experience of Vietnam was greatly enhanced by the volunteer component and by our stays in the older quarters of Hanoi, Ninh Binh, Hue and Hoi An. While I only rated the accommodations as good, the local experiences and connections made by staying in these older lodgings where more than worth the occasional lack of creature comforts."},{"rating":"5.0","review":"Jane and D was amazing from the moment they picked us up from the airport to the morning we left they made sure we were cared for and felt safe. They were so calm and loving and patient. They were always available. What they had made happen for our trip was an experience of a life time."},{"rating":"5.0","review":"Bamboo did it again"},{"rating":"5.0","review":"Jane and Dee were absolutely fantastic guides. Caring, friendly and knowledgeable (and funny!) \nI would recommend this trip to everyone, it’s life changing "},{"rating":"5.0","review":"Incredible tour. Our tour guide was so kind, funny and helpful, couldn’t have asked for better! We got to see so many amazing places and try out great food. The hotels were always in good locations, however, home-stays may be a bit comfier! I will be recommending this tour to everyone I know."},{"rating":"5.0","review":"The discover Vietnam trio was fantastic! Jane and Dee made us all feel very welcome from\nThe start even with the typhoon blowing outside! They quickly rearranged everything and we didn’t miss out at all!!\nDee the took over the tour from Hanoi. His knowledge and his enthusiasm for his home country made me feel a connection to Vietnam straight away! Dee is a very funny and considerate guide, where nothing is too much at all! \nThe activities in the trip were a good range., cycling, kayaking, swimming in ha long bay, oh and the night bus!!\nThe volunteering part of the trip topped it all off! Helping and supporting a family was lovely, they made us feel so so come . It was great to help them and helped us gel into the fantastic five ( and D)\nI would highly recommend this trip!!"},{"rating":"5.0","review":"Discover Vietnam under Jane’s lead was an incredible experience. Jane has a deep understanding of Vietnam, its culture, and its people which is on display throughout the tour as you visit the cities, towns, and natural wonders. \n\nIf you were looking for a specific meal, gift, or experience, Jane knew where to go and when to go. She took us to places you rarely get to see unless you’re a local person such as the elephant springs or a bamboo workshop. \n\nJane is just an incredible spirit who knows how to run an amazing tour. I hope more of you get to experience how amazing Vietnam is in the able hands of Jane!"},{"rating":"4.5","review":"Amazing tour. Amazing tour guides. Wish we would have more accommodations with pools during the hot season. But the hotels were always clean. Always a smile of our tour guides face and plans to see somthing or do somthing amazing each day we were in their care. :)"},{"rating":"5.0","review":"Every day was packed with adventure! We had the most amazing time with our guides and met fabulous people who we traveled within our group. If you've never done a humanitarian trip I strongly recommend this one to Vietnam. It was hard work building a kitchen, bathroom and chicken coop for a very deserving lady and her family, but the smile on her face and joy in her heart made it all worth it!! The people of Vietnam are warm and caring and made the trip so memorable! The food and local beers were delicious!"},{"rating":"5.0","review":"Just came back from discover Vietnam. Great itinerary and very well organized with  the best guides ever,  Jane & D. This was my 2nd tour with Bamboo and it won't be my last.  I highly recommend Bamboo."},{"rating":"5.0","review":"Couldn’t recommend this tour more! From meeting in Hanoi to leaving from Ho Chi Minh City, we were shown so many beautiful areas of Vietnam. Each day we thought we could never have as good a day as the previous one but we did - it was truly awesome as my N American pals would say. Our guides were knowledgeable, very able, oh so friendly with excellent senses of humour - we laughed so much through the tour. I have travelled with Bamboo before and I’m travelling with them again in the future and I couldn’t recommend them more! Try Discover Vietnam - you will love it!"},{"rating":"4.0","review":"Loved this tour and Jane was a great guide, very knowledgeable and a lot of fun. Friends forever!"},{"rating":"4.5","review":"The tour has different activities every day.The tour co-ordination is always around to help and we never felt been abandoned ."},{"rating":"5.0","review":"The Discover Vietnam Tour with We Are Bamboo, has to be the most amazing thing I have ever done in my life!  I have traveled plenty in my younger days and wasn't so sure a tour was for me but I couldn't have been more wrong.  We did so much and saw so much in the 12 days.  Our tour guides Jane and D were outstanding!  They knew so much about the area and had already tried and tested different trips and types of travel etc ensuring that our tour couldn't have been better.  They catered for the needs of everyone in our group ensuring there was something for everyone of all ages and levels of fitness.  The volunteer work we did in Hue really added to the trip by empowering us all and giving us the most amazing feel good factor whilst helping a charity provide better living conditions to a disadvantaged family.  I did this tour on my own and have made some new friends that I have no doubt will be in my life forever.  I would recommend this trip and Jane as a tour guide to everyone and will be looking at booking onto something similar as soon as I have saved enough pennies."},{"rating":"4.5","review":"We had two guides: Jane and D.\nThey were both fantastic and brought us all together as a tour family. They couldn't have made it more enjoyable if they tried. They were professional and knowledgeable and were able to guide us through Vietnam. \nThe giving back project was a privilege to be involved in x \nGreat company, fantastic staff and wonderful ethical standards. X \nThanks Bamboo x"},{"rating":"4.0","review":"Jane is a beautiful soul who took us on a whirlwind tour of Vietnam. Jane was always there when a question needed to be answered. I have a problem with my hip and Jane was always concerned and went out of her way to accommodate. I loved the volunteer building project, after all that was the main incentive to go. \"Hearts for Hue\" did an awesome job and working in conjunction with Bamboo is definitely a winner. I love the Vietnamese people. I will go back and see some more of the stunning Vietnam. Thank you Jane, Love ya!"},{"rating":"4.5","review":"Fantastic tour guide, made sure everyone was happy, great sense of humour.  Different ages and all were catered for. Loved every minute of the tour and so proud to have helped the family have better life"},{"rating":"5.0","review":"This tour of Vietnam was absolutely fantastic!!! \nJane is really friendly, helpful, enthusiastic and is a very good sport, as she engaged in all the activities with our amazing group! \n I enjoyed the volunteer work and the itinerary was great because there were a wide range of activities to cater for everyone. This enabled everyone to have to bond with the group and the opportunity to experience the vietnamese culture too! \n    The meals were always delicious in every place we ate and the hotels were to a high standard. \n     I would definitely recommend Jane as a tour guide and this Bamboo tour too, since it was a memory that will last a life time!"},{"rating":"5.0","review":"Great country great people and great host...thank you Jane it was absolutely amazing "},{"rating":"5.0","review":"Awesome tour. Guides were great fun to be around and put a lot of thought in to the balance of the itinerary - Ninh Binh being a real highlight.\n\nThe food was amazing. \nSo were the happy rooms :)"},{"rating":"4.5","review":"Loved this tour with Jane.\nSmall group of 7 mixed ages had an amazing time with the ball of energy that is Jane. She swept us along with her enthusiasm with a caring nature.\nNothing too much trouble. Her organisation skills are brilliant.\nA truly amazing guide"},{"rating":"5.0","review":"Jane has been a fantastic host and guide, her heart is truly in Vietnam and she represented the best and most authentic side of her country, while also providing a very comfortable and luxurious experience! She managed to get all the highlights of Vietnam into the tour on a very well organised schedule that worked perfectly, and was well suited to everyone. She was always on call to assist any problems, or help organise separate trips or activities, and I never saw her without a smile on her face! Amazing"},{"rating":"5.0","review":"An amazing trip to see a very diverse place....thank you Jane ❤️"},{"rating":"5.0","review":"I don't even know where to start! There are no words to describe how beautiful Vietnam is and thanks to Jane we saw parts that would be impossible to find on your own! Every part of the trip was brilliantly organised and ran so smoothly and I could not recommend it more! I was so nervous as this is the first time I have done anything like this but felt at ease as soon as I stepped off the plane and bamboo was waiting for me to take me to our first hotel :) \n\nJane was amazing! She ensured that everyone was happy and that everyone could take part in all of the activities. \n\nThe whole experience is down to Jane and Dee and I can't thank them enough for the amazing time I had in Vietnam, it is now my favourite place!"},{"rating":"4.5","review":"I can’t recommend this trip enough, it was fantastic and the organisation of it was second to none. Nothing was too much trouble and Jane had the patience of a saint with our unruly group.... "},{"rating":"5.0","review":"Every miutdafsntadtic experience\nThank you from the bottom of my heart \nJane Bamboo And Dee "},{"rating":"5.0","review":"Jane Bamboo \nAwesome \nPhan (Dee) \nAwesome \n\nThese two are just so adorable and beautiful \nTheir hard work in planning this trip reflected in the fun and laughter we were able to have \nEvery minute of this trip was full of adventure and happiness \nJane and Dee made this possible \nThank you from the bottom of my heart "},{"rating":"5.0","review":"This is a fantastic tour! We saw North, Central and (with the bolt-on week) South Vietnam far better than if we had  planned it ourselves.\n\nNorth Vietnam has a strong French influence and some of the most interesting islands in the world in Ha Long Bay. We \"gave back\" in Central Vietnam by building a kitchen/ bath/chicken coop for a poor family, plus visited Friendship Bridge among several other sites. Vietnam War History was prominent in the Saigon bolt-on week as we also stayed in a local village home. Too many things to see to list all of them. \n\nDuyen (Jane) is a terrific guide with able assistance from Phan (Dee). My wife and I thoroughly enjoyed every minute.\nDuane Feldman and Paula Shane"},{"rating":"5.0","review":"I really loved the tour. Jane was a amazing guide, and is a really beautiful person. Vietnam is a incredible country and I hope to come back."},{"rating":"5.0","review":"This was an amazing trip which included trips to unbelievable places (Ha Long Bay and Hoi An being just two examples) as well as very rewarding volunteering. We helped build a toilet, kitchen and chicken coop for a family in a rural village. Everything was arranged by Bamboo and I felt confident that we were in good hands and that any problem would be sorted. \nWhat really made a great trip truly amazing were the tour guides, Jane and D. These guys are passionate about their country and their enthusiasm and eagerness was mind blowing. It was obvious that they wanted us to have the best time possible, we did. We all fell in love with Vietnam thanks to these guys. A credit to Bamboo and I would travel again with either of them knowing that they would ensure I had the best time possible. Thank you Bamboo team for making the trip possible and thank you Jane and D for making it unforgettable."},{"rating":"5.0","review":"Jane and Phan Bamboo \nThe best tour guides ever! \nThese two just ooze awesomeness \nI had a amazing time and all the hard work in the planning and the love and kindness shown by these Jane and Dee is second to none \nThank you from the bottom of my heart \nHope we cross paths again sooner the better Jane! \nLove you lots"},{"rating":"5.0","review":"I travelled around Vietnam with a wonderful group of fellow adventurers. Most of us had first met on another Bamboo trip last year (Thailand/ Cambodia) and we had such a wonderful time there together, that we wanted to meet up and explore Vietnam together this year too. It was a pleasure to also have some new faces with us this year and welcome beautiful new friends into our Bamfam, who I hope will remain for a long time to come. \n\nJane and Dee, had organised our trip to the nth degree and are obviously so proud of their country that they had real passion for wanting to show us as much as possible. Always there and on hand for any questions or advice along the way. Both very hands-on and joining in with us all, so as to never leave anyone out and ensuring we were all safe and well. \n\nIf I had one criticism however, it might be only that when there is a group of people of mixed ages (our group had people in their 70s through to their 20s), it also means there is a range in physical ability too. So perhaps it would be good to have a little more downtime in one or two places (another night on the boat in Ha Long Bay would have been lovely - so beautiful). And also perhaps the bike rides could have been taken a little slower too - there were people who struggled to keep up in the heat or, who wanted to stop and take photos of the beautiful landscapes etc along the way, which it would have been a shame to miss. \n\nBut overall, the trip was amazing and I'm still juggling my brain to try and remember everything we did. And I loved the sleeper coach ride too! That was a new fun experience! A wonderful & beautiful country and thank you to both Jane and Dee for giving us all an experience which will never be forgotten xx Cherished memories xxx"},{"rating":"4.5","review":"My first bamboo tour and I had an amazing time. Our tour guides were very passionate about Vietnam and taught us so much about the country. I loved the flexibility of being able to venture out on our own but also having days of nonstop adventures & activity. Would love to do another tour!"},{"rating":"5.0","review":"Hi I am just completing discovering Vietnam and it is my favourite place. I met Jane last year in Thailand and we all promised to join her this year. We have not been disappointed the programme planning has been as diverse as the country itself. We have experienced sensory overload from Halong bay to the golden hands bridge just wow . Can’t wait for next tour x"},{"rating":"5.0","review":"A brilliantly planned itinerary packed full with so many experiences while still allowing for some downtime. \nOur guide was so full of passion for her country it was contagious! Would totally recommend this tour!"},{"rating":"5.0","review":"Ah, the trick becomes how best to describe the Bamboo Vietnam experience?  I'm not a fan of spoilers - so if that's what your looking for, you'll have to refer to another review.  What I will share instead was my very personal experience, the feeling of absolute awe at creation, at culture, and at community...\n\nAt creation... You will see sights that will challenge your mind.  You will see magesty, and you will experience wonder.  Vietnam will surprise you, and it will captivate your very senses.  It will grab ahold of you not let you go.  You will be wowed.\n\nAt culture... What a special people.  There's a sense of pride, of warmth, and of strength, that is not shouted, that is not proclaimed - it is simply demonstrated, it is made manifest.  It is woven into the very fabric, the very essence, of the people.  These are good, good people.  These are people happy to have you visit, and proud to be able to share their country with you.  From their kindness, to their attentiveness, to their capacity for execution.  You will be wowed.\n\nAt community... Now community, I can't promise you.  Because the community that our group formed was, of course, unique.  But it too was part of the life changing experience that was our Bamboo Vietnam trip.  The people that we were blessed to share in this experience with us were second to none.  After two weeks I both consider them all, each and every one of them, part of my extended family,  without reservation.  And I also miss them... which very well may be the most difficult part of the trip.  This trip bonds you with the country, with the experience, and with the people both of the country and of the group.\n\nAnd that's before even mentioning the volunteering portion.  Take the experiences described above, and infuse them with the opportunity to do something meaningful, and challenging, and difficult, and well done.  Inject into the experience the opportunity to contribute... possibly in a way that you've never before contributed.  And know that you leave a little bit of yourself, a little piece of your effort, a little piece of your soul in Vietnam.  That a portion of you will always remain there in a contributory capacity, potentially improving and amplifying another family's experience hopefully far into the unforeseeable future.\n\nAnd finally I want to give thanks, generally to the Bamboo organization for putting together such a well implemented and well executed experience.  And specifically to Jane and D, our tour guides, our organizers, and our shepards - for sharing so much of themselves, their country, and their time with us.  Often in two minute intervals. (Inside joke.)  What good and kind embassadors they were.  Conductors, who produced nothing less than a master symphony of experience.  I cannot thank them enough.  Their help and their hearts formed the lattice that everything else was stacked upon.  They were phenomenal guides.  Without them, our trip would not have been the same.\n\nSo how best to describe the Bamboo Vietnam experience?  Four words: You will experience wonders.\n\n100/100.  Do it without reservation.  O and do not miss the optional show, the last night in Hoi An.  It was world class."},{"rating":"5.0","review":"Always smiling and welcoming from the minute I met her. She was so knowledgeable and if she was unsure of anything she went out of her way to find the answer for you."},{"rating":"4.5","review":"This was a trip of a lifetime. The guides shared their home country with love and expertise. They put together a fantastic itinerary that included spectacular scenery, a taste of the country and good hard work helping a local family. We shared laughter, stories, and experiences that will always be with us. It was a fantastic experience and I can’t recommend it more highly."},{"rating":"4.5","review":"What an amazing experience this trip was from start to finish. Jane and D worked so hard everyday to ensure we got the most out of it. Cant recommend them and Vietnam highly enough. I enjoyed it so much i will be booking my next bamboo trip very soon."}]}]