[{"name":"Hanoi Halong Bay Tour with Luxury Flamingo Cruise - 4 Days","reviews":[{"rating":"3.5","review":"The hotel was not good.\nLoud music til 4 in the morning so we could not sleep. Got another room last day but still noisy from the nightclub next door."}]},{"name":"3-day Halong Bay Cruise and Cat Ba Island","reviews":[{"rating":"4.5","review":"Guides were very friendly and welcoming. Tour bus from Hanoi to port was relatively new, clean and comfortable. Boat like many others in the bay was fairly old and a bit run down. Had a great view from the top deck. The lock on our room broke and we needed to be moved to another room, the shower in the new room did not drain water so well. The tour packed in a lot of activities over the three days including a cave visit and hike up Ti Top island. Expect to pay for all drinks on the boat and corkage fee to bring your own drinks. Cat Ba island hotel was nice with a great view of the harbour and only a short walk to town. The hike included on Cat Ba was quite strenuous but the view from the top of the mountain fantastic. The trip to monkey island on a small boat off Cat Ba was cool - the monkeys can get a bit agitated, and are experts at raiding back packs, zippers pose no problem for them. Overall a lot of fun was had on the tour and it was well organised and the guides kept the group busy."},{"rating":"4.5","review":"The tour was a great overview of the life and industry on the Mekong Delta. The bus was comfortable and the tour guide very knowledgeable. It was a very on the go tour and long distances made the day tiring. We did not arrive at our homestay (we chose the homestay option - there was a hotel option) until quite late. But the homestay, while at first seeming quite isolated and off the beaten track, actually had about 25 other tourists also staying there. The highlight was the cooking lesson for dinner and then eating all we had cooked. All in all, a great overview, but long distances to travel."},{"rating":"4.5","review":"The tour guide and staff were excellent. The food was good. The rooms were great. Pick ups and drop offs smooth. I can say only good things about the staff. Their sense of humor and duty to their jobs was above board. The only problem I had was with how many other tours and tourists were doing the same thing at the exact same time."}]}]