[{"name":"Vietnam Experience (including Mekong Delta)","reviews":[{"rating":"5.0","review":"Great trip, we got to see a lot of Vietnam in a short space of time"},{"rating":"5.0","review":"Great tour guide,very helpful and a top bloke"},{"rating":"5.0","review":"Fantastic, Elle brought the trip to life with great knowledge of the local areas we travelled through. I can’t wait to go on another tour with Elle"},{"rating":"4.0","review":"Ele was an incredible tour leader. Her enthusiasm, positivity and love for Vietnam really came through. A tour leader really influences the overall experience of a group tour. Can’t say anything but great things about Ele!"},{"rating":"5.0","review":"Vietnam was amazing! In the 2-3 weeks I was there we covered so much. I’ll never forget the street food, Halong bay, mud fishing, riding around Hoi An... the list goes on! I will be going back one day! All this wouldn’t have been possible without the amazing trip manager Elle! She puts so much passion and energy into her job, she really loves Asia and is very well educated about everything. Elle makes it her number 1 priority for everyone to have fun and make the most of their trip. You can ask her anything at anytime and she will make sure to help! She’s not just a serious trip manager though... she still loves to come out and party with everyone! If Elle wasn’t announcing her custom colourful co-ordinated day sheet everyday, you think she’d be one of the travellers with you! I will never forget this trip and I can’t wait to go back!"},{"rating":"5.0","review":"Very enjoyable tour, exceptionally well led and organised, and managed to see and do a lot in the time we were there. Great food. The itinerary is quite compact, if it were up to me they’d skip Nha Trang and spend more time in Hanoi or include a day trip to Ninh Binh."},{"rating":"5.0","review":"Talia is a passionate guide, who spent the whole of our trip caring for our trip group and letting us know all the intricate details of the culture and areas we visited in Vietnam.\n\nA pleasure to be with and would recommend anyone to join her trips - I'll definitely be back!"},{"rating":"5.0","review":"Talia was amazing trip manager, so fun and always know what she was talking about. She always made sure I was okay and the group. \nTalia was definitely a big part of my Vietnam experience!!!!"},{"rating":"4.5","review":"I had an absolutely fantastic time on my Vietnam Experience tour in May. The itinerary is jam packed with a great range of activities to give you a taste of everything Vietnam. It pushed me out of my comfort zone several times which was good for me, and go me trying new foods, doing different activities, etc. The accommodation was fine and in good locations when we were staying in the bigger cities. It’s the been Contiki tour I’ve been on - I was blessed with the best group and our tour guide Talia made it even better. She was great fun, had awesome relationships with the local guides, and always made sure we’re having a great time - even when things weren’t going as expected (weather in Ha Long Bay almost changed our junk boat plans!). Highly recommend!"},{"rating":"5.0","review":"I couldn't have asked for a better guide - Talia was so knowledgeable and friendly. You could tell how much she enjoyed her job and her enjoyment rubbed off on everyone else."},{"rating":"5.0","review":"Fi was awesome. She was always in a good mood and knew all about the trip. I would travel with her again immediately."},{"rating":"4.5","review":"Trip was amazing and well organised. Fi really knew her stuff and I didn't doubt her at any point, I trusted her completely (a big acheivement from me). Fi kept our spirits high and our eyes open, I really hope to get Fi as a guide on another trip! Miss you Fi! ❤ - Hannah"},{"rating":"5.0","review":"Fiona was an exceptional tour guide. Her energy and enthusiasm for every day and activity was infectious. No problem was too large to help with. She has made this trip extremely memorable and ensured I will return on a contiki tour to another destination very soon. Thanks Fi !xx"},{"rating":"4.5","review":"Super fun & organised Fi always so helpful with anything. "},{"rating":"4.5","review":"Such a better experience compared to my first contiki"},{"rating":"5.0","review":"Had such a great time on the Vietnam experience, would highly recommend!!"},{"rating":"5.0","review":"Aaron has good knowledge of Vietnam, he knew exactly where to go, what was good to eat, where was good to drink! Was a great trip"},{"rating":"5.0","review":"Best Contiki I've ever been on (out of 4)! The TM made sure everyone was comfortable and felt safe. Definitely helped that the group we had were an amazing bunch. Exceeded my expectations and made me want to go back to Vietnam straight away. Itinerary, organisation and locations were perfect."},{"rating":"5.0","review":"From the get go the entire trip was mindblowing. I'll honestly never forget the experience and the friends I made along the way for the rest of my life. None of it would have been possible without the amazing tour guides and the even more outstanding tour manager Rhi Zaa, who worked tirelessly to make sure that everyone was having the best time possible. Rhi, you the real MVP. The only downside was having to come home and leave it all behind."},{"rating":"5.0","review":"Had an absolute ball on this trip! I’ve done a lot of organised tours and Rhi is by far the best tour guide I’ve had! She is so organised and knowledgeable! She’s super fun, super friendly, super easy going.. nothing was a problem for her! The trip would not have been the same with out having her there! \nShe is so great at what she does!"},{"rating":"5.0","review":"The Vietnam Experience tour was a total  immersion into Vietnam culture, food and history, and great nights out!  On the tour we had the best gang of people. The general mood of the tour was always humorous, happy  and chill thanks to James unique ability to be a leader, a friend and just a very cool guy. The trip wouldn't  have been the same without him."},{"rating":"5.0","review":"James is absolutely amazing!! He truly cares about the comfort and happiness of his tour group and is consistently checking in with everyone to ensure everyone is having the best experience possible. James knows exactly how to read the mood of a group and is full of excellent recommendations for down time on a trip. Not only is he able to control a group but he also is willing to join in and have fun! Would love to take another trip with him in the future!"},{"rating":"5.0","review":"james definitely made the trip one to remember, i couldn't fault him.\nthe trip did feel a little rushed at times but to be expected and if i could change one thing it would be to remove mekong delta from the itinerary and add an extra night in halong bay"},{"rating":"5.0","review":"Amazing trip, great tour guide, great group, comprehensive itinerary and good recommendations for what to do in spare time"},{"rating":"5.0","review":"What an amazing experience, shout out to James who did all the work so I could just enjoy myself"},{"rating":"5.0","review":"Excellent tour, James was an amazing tour leader. Really great experience"},{"rating":"4.5","review":"This tour was amazing! Great itinerary and transport. James was the best tour guide, so happy with the overall experience!"},{"rating":"5.0","review":"Everywhere James took us to eat and drink was well thought out! I also loved the activities! Especially the bike ride through Hoi An."},{"rating":"5.0","review":"I literally had the time of my life. From the place itself to the everyone I was travelling with. Honestly cannot fault anything. would highly recommend this trip to anyone."},{"rating":"5.0","review":"Elle is the best tour guide and made travelling through Asia an awesome experience! Definitely booking my next trip throughout Asia with Elle!!!"},{"rating":"4.5","review":"Jelly is an absolute diamond, she made our experience unrepeatable. Her emotion and passion for travel extends to everyone who is fortunate enough to spend time with her. While her calm and fun attitude makes you feel completely at home in a new surrounding.\nIt was my first trip abroad with my now fiancée and it will be a beautiful experience that we carry through our life with one and other."},{"rating":"4.0","review":"Jelly is a fantastic tour guide! She made everyone feel comfortable and included."},{"rating":"4.5","review":"Yelitza “Jelly” is the best tour guide she is so caring and genuinely wants you to have the best time while on holidays. She is very knowledgeable about south east Asia. She takes us to great places and also gives great recommendations for food , activities, where to shop, best bars to go too etc. she leaves all her travellers at the end of the tour happy!!"},{"rating":"5.0","review":"Once-in-a-lifetime experience led by Jelly, who was so much fun, so passionate about her job, and led us through 12 days in Vietnam seamlessly."},{"rating":"5.0","review":"Jelly is an awesome guide! She knows her stuff which makes exploring a new country more enjoyable! 10/10!"},{"rating":"5.0","review":"Jelly was a one of a kind tour guide. Having done several other Contiki tours previously I knew what to expect but to say Jelly went over and above what was required is an understatement. Not only was she knowledgeable about local activities, lingo and cultural expectations, she ensured we were always well prepared, safe and most of all ensured we all had the best time possible. She always sought out different options  to cater for everyone’s needs (where possible). She was also the life of the party when it came to nights out and was always there to greet you with a smile in the morning. Jelly made my visit to Vietnam an unforgettable one, and has raised the bar for all future tour guides!!"},{"rating":"4.5","review":"Elle is simply amazing! She goes above and beyond for all her travellers no matter what time of day it is. Wish I could have her on every trip I go on!"},{"rating":"4.5","review":"Having Elle as my tour guide simply made my first experience in Asia an incredible and memorable time. Always there for us, very patient, knowledgeable and friendly, what else could I ask more?!"},{"rating":"4.5","review":"Had a great time throughout the entire trip. Eleanor was awesome and added a huge amount of value to the satisfaction of the trip."},{"rating":"5.0","review":"Elle was so lovely, I could not have asked for a better tour guide! The trip was so enjoyable and she made it even more so! Always so helpful and full of information! Thank you! x"},{"rating":"5.0","review":"It was an amazing trip and Eleanor was the greatest guide you could ever ask for! Forever grateful for her vibrant personality and her patient nature. \n\nThank you thank you thank you!"},{"rating":"4.0","review":"The Vietnam Experience trip was amazing in itself, from start to finish. What made the trip extra special, and so much more memorable, was Eleanor as our trip manager. She was approachable, fun and caring, and knew the county and its cities so well. Eleanor went above and beyond to make sure everyone was comfortable and having fun, and was wonderful at assisting travellers who were experiencing various difficulties on trip. It was very clear that Eleanor is so passionate about her work and her career."},{"rating":"5.0","review":"I had the most amazing time on this tour with Elle! I can’t thank her enough. You can just tell Elle’s passion and love for Asia from the way she carefully plans out everyday, tells us all the most incredible facts about Asia and most importantly takes us to all the best local eateries so we can get an authentic Asian experience \n\nIf I could rate more than 5 stars I definitely would :)"},{"rating":"4.5","review":"I loved my time in Vietnam so much, Elle was such a good tour manager and made sure everything ran as smoothly as it could, especially since we were there over Tet!"},{"rating":"5.0","review":"Elle was absolutely fantastic, such a fan and knowledgeable trip manager. I would definitely recommend Elle and the Vietnam experience. Highly enjoyable trip and one I would do again. I hope when I am in Asia again I get Elle as a trip manager."},{"rating":"5.0","review":"The trip was amazing and Elle made it fantastic! Always have us ideas on what was best to do for our free days and kept us all included!!"},{"rating":"4.0","review":"Rhi made our tour great! She is friendly, knows alot about the places we visited and is always emergetic and full of laughter. Best tour manager i have had!"},{"rating":"5.0","review":"Rhi was awesome!!!  I’d highly recommend her!"},{"rating":"5.0","review":"So inclusive, fantastic guide to introduce me to contiki"}]},{"name":"Ultimate Vietnam - 14 Days","reviews":[{"rating":"5.0","review":"Did the 14 day ultimate Vietnam tour with Laura as our tour guide and it was amazing!\n\nThe tour itself was a great taster and insight of the country. You pack an awful lot in 14 days which is great which is ideal if you want to see a handful of places across the country in quite a short time!\nIt was a good Variation between day activities and evening entertainment which was perfect. Also with a group up to 14 it still can be personal enough.\n\nLaura our tour guide was great! Very friendly and great comms right from the off, even before we had started and met. She knew her stuff and history about the country after being there for over 6 years. She knew a lot of people and is well liked by the locals which helps and says it all.\n\nVery personable and goes the extra mile to help you with information, onward travel, research etc etc.\n\nShe is very relaxed and for the ‘free time’ or evenings she is open to suggestions if the group don’t want to do what’s planned. She also is happy if people want to do something different if they are set on doing something or seeing something specific outside of the tour. \n\nWould highly recommend, throughly enjoyed!"},{"rating":"5.0","review":"Amazing tour! With Laura we were learning everything about Vietnam. She explain everything what you like to know and she is so helpful and friendly. Even in time of Corona she knows what to do and where we can go to eat or to see something. She give all information to us immediately. The group is number one for Laura and she is also loved by the Vietnamese people. She helps also if you like to have a romantic evening alone or some special places. We learned some Vietnamese words and phrases of her and how we have to act in Vietnam. Can not believe how much we learned about this country and the people because of Laura! Thank you so much!"},{"rating":"5.0","review":"This tour is great packed full of activities and never a dull moment. Our tour guide was Laura and she was FAB. Do not judge this girl by her Liverpool accent she was honestly fantastic and had so much knowledge of each place we visited and fun stories to tell about the history and culture of the areas. She made everything really interesting and I couldn’t recommend her or this tour enough. (Also don’t forget to ask her about her claim to fame in Vietnam!)"},{"rating":"5.0","review":"Ultimate Vietnam was a great experience, they have guides who know the local area for each stop. They can recommend what to do, what to eat, where to eat. The itinerary has a number of good stops throughout Vietnam, including Hanoi, ha long bay, Ho Chi Minh city, and many more. This tour is a really good way to get a taste of Vietnamese culture in a short timeframe."},{"rating":"5.0","review":"This tour was such a great experience. The itinerary is very good, but what really made the trip for me was the tour guide, Laura. She is clearly very passionate about Vietnam and that energy really rubs off on you. She knows so much about the country and culture and I really felt like I got a better understanding of Vietnam because of it. Thank you so much!"},{"rating":"5.0","review":"We had an amazing time in Vietnam! The tour with Ultimate is perfect to see the whole country with its different faces and cities. You‘ll get to see many beautiful places like hoi an or the halong bay, combinated with lots of fun activities like canoying or a motorbike tour through the streets of hanoi. Our tourguide Laura made our Trip unforgettable. She has a stunning knowledge about Vietnam and its culture and people, so you get to know the country really good. Together we had always something to laugh about and some funny evenings in the bar. Altough she always acted very professional. She has a lot of expirience and knows many local people and insidertips. She always helped us out, when someone lost their mind:) Even after finishing the tour she helped us planning our last few days in vietnam. All together, we had 2 very great weeks in Vietnam. Thanks Laura!!"},{"rating":"5.0","review":"The Ultimate Vietnam tour was amazing and was such a good time. I believe it was because of our amazing tour guide Laura! Laura knew everything and everyone and I mean this in the best way possible, she knew all the great spots, history on the places we visited and was literally friends with all the locals. She allowed us to explore the country our own way and she was always there to help. She never seemed stressed and was always so happy. She was above and beyond what I hoped for in a guide and I will 100% be looking out for her on my next tour."},{"rating":"5.0","review":"Laura was nothing short of amazing. She was always willing to help with the small things, like helping people get to certain stores or making recommendations that weren't on the tour itself. She worked hard to make everyone in our diverse group feel included. Things got a little hairy a few times and her ability to stay calm and problem solve was top notch. She was knowledgeable about the areas we visited and shared a lot of info. It was quite impressive. I would recommend her to anyone. Thanks for enhancing our tour Laura!! "},{"rating":"5.0","review":"Laura was a fantastic tour guide during our two week trip around Vietnam. She was so approachable, knowledgable and funny and her love of the country rubbed off on everyone else! Laura was constantly available (I don’t know when she sleeps!) and was always aiming to make sure everyone in the group was happy and having a good time."},{"rating":"5.0","review":"I would recommend this tour to anyone. As someone who has had Vietnam on the top of their ‘to visit list’ for many years I am so glad I did it this way. \nAside from the beauty that Vietnam has itself, Laura made this tour for me. I don’t think it would be possible to find a tour guide that genuinely loves Vietnam, or South East Asia in general, and it’s people more than her and they love her in return - she can’t walk down the street without someone coming up and hugging her. This comes through in all the detailed information she gives you about the country’s culture and history. When she talks, her passion for what she does comes through. She wants everyone else to love Vietnam as much as her and will bend over backwards to ensure you have the best experience you can. She doesn’t clock out when the tour finishes either. If you’re travelling afterwards in South East Asia she will give you recommendations on where to go/what to do/where to eat and will help you with onward plans as much as she can. \nThe itinerary that Ultimate have I believe is much better value for money than the others on offer so if you’re thinking about booking this tour, just do it you won’t regret it. \nVietnam oiiiii!"},{"rating":"5.0","review":"Deutsch [Original Text] :\nMeine Reise nach Vietnam im Oktober 2019, habe ich damals sehr spontan und ohne darüber nachzudenken an einem Abend gebucht, da ich vor meinem 30 Geburtstag einmal mit dem Rucksack und ohne Freundin \"alleine\" verreisen wollte. \nEs war meine erste Reise nach Asien, ich bin ohne große Erwartungen in mein kleines Abenteuer gestartet.\nIch habe nur gehofft, dass meine Mitreisenden und unser Tourguide einigermaßen gut drauf sind und ich gesund wieder nach Deutschland komme :-)\n\nDie Tour selber habe ich über backpackerpack.de gebucht und war mit dem Service und dem Ablauf der Buchung sehr zufrieden. Ins besonders da dort sehr viele Aktivitäten schon inkludiert waren und ich mich um nichts mehr groß kümmern musste. \n\nAm besten während der Tour hat mir das Kayaking, die Halong Bucht (Vịnh Hạ Long) und die Rollertour in Hanoi gefallen. \n\nEin großes Kompliment muss ich allerdings unserem Tourguide Laura aussprechen!\nSie hatte definitiv keinen leichten Job mit unserer Gruppe, da sie sich 14 Tage mit 4 Männern auseinandersetzten durfte, aber sie hat es großartig gemacht. \n\nSie war immer sehr zuvorkommend, freundlich, hilfsbereit und super organisiert, sodass die Reise sehr schnell vergangen ist. \nLaura hat sich aber auch für jeden von uns Zeit genommen, um uns besser kennenzulernen und auf unsere Wünsche eingehen zu können und das hat die Tour mit Ihr perfekt gemacht. \n\nNachdem ich Anfangs sehr skeptisch war als ich die Tour gebucht hatte, kann ich nun im Nachhinein jedem diese Reise sehr empfehlen!\nDanke noch einmal den Jungs Ihr wart super und der lieben Laura für diesen unvergesslichen Trip in Vietnam.\n\nEnglisch: \nI booked my trip to Vietnam in October 2019 very spontaneously and without thinking about it, because before my 30th birthday I wanted to travel \"alone\" with a backpack and without a girlfriend.\n\nIt was my first trip to Asia, I started my little adventure without any expectations.\nI just hoped that my fellow travelers and our tour guide were in a good mood and that I would come back to Germany in good health :-)\n\nI booked the tour myself via backpackerpack.de and was very satisfied with the service and the booking process. Especially there were a lot of activities included and I didn't have to worry about anything.\n\nThe best thing about the tour was kayaking, Halong Bay (Vịnh Hạ Long) and the scooter tour in Hanoi.\n\nI have to pay a big compliment to our tour guide Laura!\nShe definitely didn't have an easy job with our group since she was allowed to deal with 4 men for 14 days, but she did it great.\n\nShe was always very courteous, friendly, helpful and well organized, so the trip passed very quickly.\nLaura also took time for each of us to get to know us better and to be able to respond to our wishes and that made the tour with her perfect.\n\nAfter I was initially very skeptical when I booked the tour, I can now highly recommend this trip to everyone!\nThanks again to the guys you were great and dear Laura for this unforgettable trip in Vietnam."},{"rating":"5.0","review":"The tour was amazing, we saw so many great things and Laura was the best tour guide ever!!! Thank you Laura, you showed us Vietnam from the best side."},{"rating":"4.5","review":"Laura couldn’t have been more helpful: I twisted my ankle she asked her local friends to find me a good doctors to help me get it sorted, I broke my phone she went to get a quote for me how much to get it fixed while I was out on a day trip, what ever anyone needed she was there to help with. It was a great two weeks that I’d highly recommend!"},{"rating":"3.0","review":"I was very disappointed with this tour. I booked thinking I’d be in a group of people aged 18-30, (I’m 23) and everyone was 10 years older than me. The tour guide was extremely unenthusiastic and unsure about the itinerary, and I’d have been much better doing my own thing."},{"rating":"4.0","review":"I was impressed about Laura. She is amazing, professional and little bit crazy. I loved that.\nShe could do everything, be a Partytiger, 'Babysitter' and resolve all problems and questions we have. I don't know how she could do that all the time. \nPersonally I missed a little bit more story about Vietnam,  but I think the tour was programmed more about adventure and Party and that was completely."},{"rating":"4.5","review":"The tour was quite nice , the groupe was nice , the places good chosen for the 14 days and laura made a great job. So i would recommended to everyone who is openminded and likes to travel with new people."},{"rating":"4.5","review":"Really great job - Laura is an excellent tour guide. She did a great job in sharing her knowledge and providing personal recommendations. The organisation and atmosphere was excellent and we always felt informed about other options - even with a big group. Many thanks to you!"},{"rating":"4.5","review":"Helpful, lovable, courteous, sweet, full of humor, always in a good mood...\nThis woman is indescribable!"},{"rating":"4.0","review":"Loved Laura! Very informative and just a wonderful person overall."},{"rating":"5.0","review":"Really Well organised and you feel really safe. We had Laura as our tourguide and she is absolutely amazing. She took us to a lot of great places that you would never have visited on your own. All in all an amazing experience that I for sure will recommend everyone!"},{"rating":"4.0","review":"My trip to Vietnam was booked on a whim to get a way from the work environment. I chose the Ultimate Vietnam tour and did not know what to expect. The two weeks I spent in Vietnam felt like a month as a result of the detailed itinerary that was in store. The tour itself went beyond my expectations. Every day was a wonder to venture into! My favourite highlights were the party boat we were on, kayaking around Ha Long Bay and Hoi-An. Putting aside the itinerary I think what made this trip more enjoyable then it was meant to be was the small group I was with and most importantly my tour group leader LAURA. She is really friendly, has an amazing presence, easy to be yourself around and such a compassionate person.\nShe always recommended the best places to eat and visit!\nWhat is also very intriguing about her is her passion for the locals! \nIf your looking to do a vietnam trip she is the person to go to!!\nHighly recommend it!!!"},{"rating":"4.0","review":"The tour was a great experience for my first time in Vietnam especially for the cost of the trip. I got to experience many places and when I go back I have great idea where I would like to spend more time. My tour guide ring was tinh was great and communicated very well and ensured to fulfill any questions needed. I would say to improve this experience would be the transportation as I found it was alot of time travelling on lower end buses, therefore I would be willing to pay more to have better transportation like flights to experience more time in certain areas of the trip. Overall the tour filled alot of the boxes and I got to experience Vietnam alot on my own which was a goal of mine. Great value!!!."},{"rating":"5.0","review":"I'm so happy I booked this tour with Ultimate - Laura was an amazing guide, very knowledgeable, friendly, funny, and respected and loved wherever she went! I had a great group (5 including me, so quite small) and everything was organised perfectly so we didn't have to worry about anything and could enjoy our holiday. It was definitely worth the money and I would recommend it to anyone. Laura, I look forward to my next trip with you!!"},{"rating":"4.5","review":"The tour was fantastic, especially because of our guide Laura. At the beginning, I was sceptical, as I travelled a lot on my own before. I chose this group backpacking tour, because I only had two weeks and wanted to get a good overview of Vietnam. Another reason was that i did not have the time to look up all the best places before and i wanted to try what its like to not lose time doing research. You guys know how often and how long it can take to find and organise the next destination. Further, I usually get bored after a while of travelling on my own and all of the same smalltalk that comes along. I liked the idea of a group for two weeks. Which turned out to be the perfect fit.\nI really enjoyed it, that someone organised that. Its a relaxed and comfortable way and everthing worked perfect. Also when i would have done the research on my own, i would never get to the places or activities Laura took us. Besides her very good knowledge of the country, people, their history, language and best places, Laura is smart, tolerant, friendly and funny ;)\nLaura is not only a guide, she became a friend. Laura, thank you very much! It was a pleasure, especially embarrassing you by my funny/stupid behavior at the market, the cafe, some bars and the elevator"},{"rating":"5.0","review":"I travelled ultimate Vietnam 14 day tour. Laura was an amazing tour guide! She is so friendly, positive, easy to get along with and always made us laugh. It was obvious just how much she loves Vietnam and the beautiful people. Her knowledge of Asia was amazing! She knew all the best places to go and always made sure we were having a great time and helped us with anything we needed. Highly recommend!!!!"},{"rating":"4.5","review":"An amazing trip that I would definitely recommend to anyone considering visiting Vietnam.  I had a limited amount of time to travel and this tour was well organised meaning that no days were wasted. Christine was a great tour guide, really couldn’t have wish for anyone better to show us Vietnam. She is very passionate about what she does and made sure the whole group was catered for. My only criticism of the tour would be the Da Lat hostel was quite far from the centre so felt isolated from any sort of night life."},{"rating":"4.5","review":"It was a fantastic trip! I met a lot of great and crazy people and saw a lot of nice places of Vietnam! I really don't want to miss one moment of the 14 days."},{"rating":"3.0","review":"There could have been more activities included throughout the days instead of a lot of free time. And more meals should have been included to make things easier for everybody."},{"rating":"5.0","review":"great guide, really chilled, easy to talk to/to ask questions and made many parts of the tour really fun as she was so involved & gave loads of good recommendations. Clearly very passionate about travelling and has a positive attitude (unless you wake her up on the sleeper bus hahah) all the time! Very happy I had her for my Vietnam tour!"},{"rating":"5.0","review":"Fantastic tour-guide! Wonderful experience:)"},{"rating":"5.0","review":"Had such a great time on Ultimate Vietnam with Christen, She welcomed us with such a positive vibe that there was no possibility of feeling uncomfortable. In every town she knows the best places to go at day and night! she brings good knowledge and a lot of laughs. all i can say is without Christen this tour wouldn't be fun haha.. i also gained alot of knowledge about vietnam from A-Z thanks to you Christen haha.. i highly recommended.. :D thanks alot Ultimate <3 <3"},{"rating":"5.0","review":"The whole Vietnam tour went above and beyond my expectations! Christine couldn't have done more for us as a group and as individuals. She was happy to change things to accommodate around specific needs, made sure we were comfortable, gave us tips and advice for the different areas plus she was such a fun person to experience a new country with and I also felt really safe. We instantly made friends with our whole group which made it even more enjoyable. The itinerary had such a range of activities and everyone agreed it was really balanced. We went on amazing nights out, food tours, visits to landmarks/historical sites, a stay on a private island, a boat party, canyoning, chilled beach/pool days and still managed lots of time to do some shopping and relax. We fit so much in that it felt like we'd all been there months. I would suggest bringing a light microfibre towel as a backup option just because a few hostels weren't always able to provide one or charged a lot to replace a lost towel and so it made it a bit inconsistent for a few people. Secondly, don't misjudge how cost-effective Vietnam is! We had to cover the cost of every evening meal plus quite a few lunches, and although all of the food/restaurants were incredible and totally worth it, it quickly added up and all of us had to get more cash out as the weeks went on (which was easy to do but worth knowing about beforehand). I'd highly recommend the tour to anyone who wants to experience a lot of Vietnam in one trip and I'd do it all again in a heartbeat. Thank you for the memories Christine!"},{"rating":"5.0","review":"Ultimate Vietnam was an incredible experience - I couldn't have wished for anything more. The activities were amazing, and every stop during the 14 days was truly eye opening. You fit a lot into the 14 days, and it feels like you've been in Vietnam for a month. It is such an amazing country with a great culture to explore. Laura was a great guide, she new exactly where to go for great food, a good night or, or where to go for a good bargain - it's like being mates with one of the locals. Can't recommend enough."},{"rating":"4.0","review":"I had an absolutely amazing time in Vietnam and fell in love with the country and alot of this was to do with the amount I got to do and experience and the fact that every little detail was organised so well. Our guide, Laura was brilliant, he knowledge about the culture and ways of life was always insightful and she was always there with a fun story to share with the group. Laura always made sure everyone was good and that we were having the trip that we as individuals wanted to have, even as part of the group! Massive highlights were the sunset at Halong bay, the cooking class and the canyoning! Definetly will be travelling with ultimate tours again!"},{"rating":"5.0","review":"Vietnam was all that I could’ve wished for, and more! It was my first time travelling solo, and in SEA, so I was a little nervous at the beginning of my trip - but Laura made the whole trip so much easier and better for us all! \n\nShe knew so many people so we were welcomed wherever we went, and was really good at knowing when we wanted some free time, as well as when we needed a bit of baby-sitting! She made sure everyone was accommodated for, even if we weren’t all doing the same activity, and was great fun on the nights out (her banana outfit is unparalleled). \n\nWithout Laura I don’t know where I would’ve ended up, and the tour itinerary showed off Vietnam extremely well! I couldn’t recommend the trip more."},{"rating":"4.5","review":"Was a great tour overall if you want an introduction to the whole of Vietnam. Laura was really great and easy to get along with! She was very accommodating to people's needs and always made sure you were okay and got back to your hotel safe."},{"rating":"4.0","review":"I'm delighted to have had Christine as our tour guide. She has such a sunny personality and went above and beyond in every way during our tour. She had great tips, taught us useful phrases and was always available when we needed her. She really was the best part of the tour and was more like a friend than a tour guide! I know she is going to Australia and will be a big loss to Vietnam but I wish her all the best and I know she will be great there too! I hope we meet again and would jump on a future tour with her without hesitation! Thanks again ! You're amazing!"},{"rating":"3.0","review":"As a young female, I look to join a group tour for a few reasons including a pre-set itinerary, safety, and to gain a more enriched cultural experience. I have a very busy schedule and a prearranged tour eliminates a lot of the extra stress and time needed to plan a trip that I simply cannot put forth. I am incredibly frustrated and disappointed with my experience with the Ultimate Vietnam tour. I paid such a large sum of money for the tour plus the additional travel expenses only to be left with a disorganized, below average travel experience that failed to meet my expectations.\n\nAs a guide, it is expected that you communicate to the group the activities and itinerary for the trip to the entire group. A lot of issues stemmed from the guide’s failure to perform her duties. The group was constantly left in the dark as there was very little communication or organization. Instead of actually performing her job, she spent the entire two weeks partying and drinking obscene amounts. She was always the most drunk person every single night, which meant if anyone from the group actually needed help they were left to figure it out themselves. This was completely irresponsibly behavior and did not create for a safe atmosphere. There were times when girls would be too drunk and get lost on the way home because the tour guide was too busy partying and picking up guys to answer messages or notice that someone was struggling. On multiple occasions, our guide would become so intoxicated that she would black-out or have seizures in the bar. The girls from the tour group ended up becoming responsible for getting the guide home safely instead of the other way around. In my opinion, this is completely unacceptable. \n\nThis entire trip turned out to be a party every night and hangover recovery every day. Our guide could not be reached during the day as she was sick, sleeping, or recovering from nights out. For the remaining members of the group that were hoping to explore each destination during the day, we were left to figure an itinerary and local activities for ourselves. \n\nI was so disappointed with this as I joined a tour to explore a new country and hope to gain an enriched cultural experience. If I wanted to party every day, I would have never left home. Those who did not participate in the “nightly festivities” were essentially looked down upon. I am perfectly happy to have few nights out, however, every single day was complete overkill and took away from my experience in Vietnam. \n\n\nIn regards to the arrangement of the tour, I felt the company did a very poor job of communicating the itinerary. The company failed to disclose the amount of travel that was actually required during the day. On the documents provided, Ultimate discloses information regarding a night bus trip to get from Hoi An to Ninh Van Bay, but does not mention that just about every other day is spent on public buses moving to the next location. \nDay 3: 4 hour bus to Halong bay\nDay 5: full day of waiting around to get back to the mainland to take the 4 hour bus ride back to Hanoi, only to leave for the airport the next morning for another travel day\nDay 6: Hanoi to Hoi An –  Late flight  another full travel day\nDay 8: 8 hour night bus from hoi an to Nin Vanh bay\nDay 10: 7.5 hour bus to Da Lat\nDay 12: 7 hour bus to Ho chi minh\nI understand that travel is necessary to reach all the destinations, however, we wasted so many days on a bus as we would not reach the destination until the evening and would not be able to explore any part of the new location. If I had been aware of the uncomfortable travel situations, I would not have booked this tour and would have made arrangements myself. The public bus transportation was incredibly uncomfortable and left half of the group upset with the organization of the tour as they were unaware of the number of full day bus travel throughout the trip. For the final bus trip from Da Lat to Ho Chi Minh, half of the group went out on their own to book a flight as it was very inexpensive and allowed us to actually spend time in a new destination. I think this goes to show that there was poor organization and communication with this trip as people were fed up and decided to make their own more efficient and comfortable travel arrangements."},{"rating":"4.5","review":"I totally recommend this tour! You get to see a lot in a short time without feeling rushed. Good balance of culture, nature and party! Most of the accommodations are good, woody house in Dalat had [comment removed in moderation] bathrooms and loud neighbors though! Special thanks to our guide Christine, she took such good care of us, made sure everyone was having a good time and was always down to whatever we wanted to do. In our free time she always had a lot of recommendations what to do and also had a lot of background knowledge about the culture, history and people of Vietnam!"},{"rating":"3.0","review":"Although Vietnam is a beautiful country and I certainly saw and did some incredible things while I was there, I have to say that, overall, I am disappointed with this tour. In regards to the itinerary, I felt that it was a waste of a day to travel back to Hanoi after the Halong Bay trip, and that that there was a little bit too much travel so close together at the end of the trip, especially when we were not even told about the one 7.5 hour drive to get to Da Lat...until we were 2 hours into the drive. I also felt that some days were a waste since activities did not start until later on, or that sometimes the activity for the day was to \"go to the market\" which is not really an activity, and is more something that you could do in your free time. \n\nI felt that our guide was not very knowledgeable about the country itself. She seemed to know a lot about the hot bar spots, and some basic facts about each city and some about the war, but I don't really feel as though I learned much about Vietnam from her, as I have from tour guides I have had in the past. This whole trip was actually booked by \"Buffalo tours\" and so often our guide didn't always seem like she was in control of our itinerary and in one new leg of the trip, she was very disorganized and wasn't actually prepared to get us off the night bus and into our next transportation van. Group members had to wake her up, and chat with the new transportation van to ensure that it was in fact the correct one. In regards to the same leg, she had told us that we would have a 4 hour drive, which turned out to be a 7.5 hours drive. Since this leg was not new to the company, and only new to our guide, this was in fact a huge oversight on her behalf. In another instance, our group encountered some very drunk travellers on a bus. Our group was very annoyed, especially when it became apparent to us that one of the travellers had peed on the bus, and it was trickling down the bus onto people's bags. Our guide kept saying she couldn't say anything to them, because they weren't part of the group. One of her group members actually stood up for the whole group and asked them to be quiet and got them to apologize to the girl who now had a urine soaked bag. Our guide's response? It wasn't a big deal, and it was better join to laugh with them rather than call them out.\n\nOften, when we would travel our guide would separate herself from the group, sit at the back of the bus and go to sleep. She would not make attempts to connect the group together, or get to know her group during these travel times. On times when the group was split into two vehicles, she would share information with one group, and then forget to let the other group in on the information she had shared with the other. She only let us know what was going on the night before it was happening, and if you asked for more information ahead of time, she sort of made you feel like you were being annoying for asking. \n\nIf you are looking for a party tour, then this may be the tour for you. I feel as though our group was a little split on \"party-ers\" vs more of a social drinking crew. Our guide really did connect with the party-ers, and if this is your jam, you will likely love this tour. However, I feel that at times her partying was unprofessional as it started to impact our tour. For instance, she would sometimes skip activities, or alter our activities in the mornings because she was hungover, or was getting \"sick\" because her severe lack of sleep due to partying. This happened on 3 occasions. She was often the most intoxicated person in the group, and at times group members had messaged her for help to get home, and she did not respond to them until the morning. In one instance, her group members had to escort her home to the hotel. She also implied that Ultimate travel expected her to go out and party every night. However, on one instance, she planned to go out and party on her own, without the group, after cutting a group activity short because she had \"errands\" to run.\n\nOverall, my experience with this tour company was poor, and I will not be choosing to travel with them again. I have had many other incredible trips and experiences with other tour companies that I have found on tour radar, but this company was not one of them."},{"rating":"5.0","review":"Best tour guide EVERRRR! \n\nLaura’s passion and knowledge of Vietnamese culture made for great listening (as well as her many hilarious anecdotes from living in SE Asia)! Her enthusiasm is infectious - I couldn’t help but be excited for every single part of our tour. There was NEVER a dull moment. \n\nThe thought of coming to Vietnam on my own and meeting my group made me feel super anxious but I felt at ease straight away and that was definitely because of Laura’s personality and way of engaging and interacting with us all "},{"rating":"4.5","review":"This was such a fun trip and I met so many kind, adventurous and positive people! Christine knew a lot of useful tips when it came to restaurants, bars, stores and was always willing to help out. She also went out of her way to make sure people were happy throughout the trip. She also was super receptive to any recommendations we had for improving the trip so she could work with management to make slight changes."},{"rating":"4.5","review":"The tour was so incredible and you definitely got your money worth! Christine was a great guide, always making everyone feel comfortable and was able to answer any questions that were asked! She was so bubbly and positive, which overall made my experience more positive! Would definitely do it again"}]},{"name":"VIETNAM COLLECTION 2 - Magical Vietnam 12 Days","reviews":[{"rating":"5.0","review":"I felt that I was so lucky when I had a chance to have this package tour with my wife on our wedding 10th anniversary and we were extremely satisfied with everything which is operated by Footsteps Indochina Travel. Our guides are so friendly, approachable and knowledgeable, they already took us to many promising destinations, we have many chances to experience the local life as well as local activities during our tour. Also, we can really testify how professional that Footsteps had to offer, from clean and comfy transportation to authentic Vietnamese food experience, could not ask for more. I will and forever be grateful that I have chosen Footsteps which companies with us in our memorable moments and will surely recommend to our relatives and our friends as well who would like to explore the timeless charm of Vietnam. Once again, I highly recommend that everyone who is worrying about the Tour Operator in Vietnam, you guys should choose Footsteps Indochina Travel: Well- Organized, Good Services and Excellent Guides."},{"rating":"5.0","review":"Out of all the hotels only 1 in Ha Noi was Good not great.  All the others were Great!  All guides including John for Jack Tran were excellent!  Harry in Ha Noi wasn’t as engaging as Dan and Huy.  Huy was a blast!!! Food was very good.  Transportation was exceptional in all cities.  Always on time, roomy and comfortable and big supply of water."},{"rating":"4.5","review":"The service by Jack was excellent. He was honest and always helpful and tried his hardest to make this a great experience for my husband and I. The tour was jam packed with various sights and activities in each location which is what we were after, though we did skip one or two tours of places we were less interested in so that we could have some downtime and relax a bit here and there. The accommodation was what it promised and was always clean and comfortable. Our highlight was the Halong Bay cruise, and we were on a lovely cruise ship, so that was a great end to our tour."},{"rating":"4.5","review":"Great for ones who would like to experience a Vietnam classic tour. Mr. Hanh, our tour guide has a wide range of knowledge. Jack from the office always takes care us and makes sure everything run smoothly.\nThank you, Footsteps."},{"rating":"4.5","review":"This is one of my favorite trips in Asia, I considered a lot and finally I chosen Footsteps Indochina, they had helped us a lot before I came to Vietnam, my family is 6 people, they helped us to get connecting room without surcharge. I highly recommend this tour because 2 domestic flights, it's really perfect (we flied with Vietnam Airline), fly instead of overnight on train is the best thing I want. Thanks Footsteps Team again! Samantha"},{"rating":"4.5","review":"Amazing! My family had a great time in Vietnam in Aug, Tony was an excellent guide, very professional and very supportive. Footsteps team is perfect, especially their gift for me on my birthday in tour. I will recommend this package for my friends."},{"rating":"4.5","review":"Absolutely fantastic trip. This was 2 best weeks in my life. Vietnam is so amazing, Footsteps arrange all services excellent. At every destination we came, we had a chance to make friend with guide, local people, deep inside their life to know about Vietnam. Itinerary is perfect from North to South. I like this tour because it's included 2 domestic flights, flight to save my energy and time. Hotel and meals is good (especially hotel in Hoi An and restaurant in Hanoi). I would like to say thanks with Footsteps team and my guide: Ms. Key! highly recommend this tour for my friends!"},{"rating":"5.0","review":"Me and my wife had a great time in Vietnam with Footsteps! Accommodation were good with centre location. Guide and drivers are always on time. Harry is very helpful and knowledgable. Highly recommend for those who are looking for a Vietnam package tour."}]},{"name":"North Vietnam - 5 Days","reviews":[{"rating":"3.0","review":"Driver to pick us came in late andDoes not speak English. The hotel room we stayed after Halong trip was not cleaned yet when we got in the room. They were trying to check out at 12 pm onnFeb 10, and we stated that we are checked till February 11 although we are leaving  11pm. Enjoyed the Halong cruise and half said Hanoi city tour."},{"rating":"3.5","review":"Tour guides needs more improvement, they need to be more adept to communication in English language."}]},{"name":"Xin Chao Vietnam - From Hanoi/ Hoi An To Ho Chi Minh City","reviews":[{"rating":"5.0","review":"My wife was so happy to see your secret preparation for room and event with cake for our honeymoon. We were a bit disappointed that we expected to trek Titop Island. But after the free upgrade of cruise, we missed it. Instead, dark and light cave was good."},{"rating":"5.0","review":"I heard about the heavy traffic jam in Vietnam a lot. And I was afraid that my hotel in Hanoi was in the center. They said to easily reach out sightseeings and local food. However, choosing this package was a right decision. We traveled to most of places away of dynamic lifestyle. Everything was elegent and peaceful. I totally trusted them after my real experience. Realistic Asia gave me sincere advice."},{"rating":"5.0","review":"It is so much interesting to enjoy local food in Vietnam. Each region featured a totally different taste. Our guides always suggest us places for cheap and yummy food. Hotel staffs were friendly and supportive."},{"rating":"5.0","review":"Superb! Cannot recommend higher!"},{"rating":"5.0","review":"I expected to get our driver's number in advance and quite annoyed to be passive. After few days, I got that you prepared so well that I did not need to contact anyone. Everything was well prepared. Everything is  punctual We always received the best instruction from Realistic Asia. Sorry for blaming you at first."},{"rating":"5.0","review":"Ha Long was spectacular. It's where the sky meets the ocean without any border, definitley worth visiting. I forgot the name of caves that we visited, it's stunning. Love it."},{"rating":"5.0","review":"Hue was not old but ancient. Mild people. Suggest you buy Ao Dai there. Realistic Asia was good as their reputation."},{"rating":"5.0","review":"A great choice to avoid a hive of activity. We enjoyed pleasant atmosphere during the trip. Good job."},{"rating":"5.0","review":"An unforgettable experience with local people in Ba Vi. We have joined in interesting activities in one day but still comfortable. Hoi An was great too. It was even nicer as described. A romantic and peaceful atmosphere. I have taken some lanterns to decorate my house. My friends asked where I bought them then I suggested them to take a trip to Hoi An. Of course, I also recommended Realistic Asia with our great support and knowledge."},{"rating":"5.0","review":"Xin Chao Vietnam - From Hanoi/ Hoi An To Ho Chi Minh City Thank Minah for her support. I was connected and enjoyed my trip. I would choose your agent again in the future."},{"rating":"3.0","review":"On the whole, the trip was ok. The company went to great lengths to sort out a few small issues we had. We appreciated this. However, they need to warn you when you book for a January trip about the Tet (lunar new year) disruption. We knew nothing about it. Several places were shut, a trip had to be changed which we weren't told about until the night before......and even the flat tyre on the bus couldn't be mended because of Tet. And personally, although the communication was good with our rep, we had to initiate all contact, asking for pick up times for the following day. They should be sent 24 hours before so we could plan our free time around tour arrangements. We had to pester our tour rep the day before constantly. Then he was very good at sorting things. Everything seemed very last minute. Even though we had sent our return flight details 2 weeks before, our rep asked for them again the day before our return flight .  Even though we booked the tour 6 months before, our rep booked the internal flights 2 weeks before.....so availability ( because of Tet AGAIN!!) WAS poor. I imagine they therefore  ended up paying more for the flights because they booked them so late ...just disorganised. (And we had a midnight flight!)\n2 of our hotels were disappointing. We were moved from one to a fabulous one....thank you. HCMC hotel was poor and breakfast staff rude - current pricing was about £25 a night so not surprising! For £35 a night they could have booked a much nicer hotel. At all other hotels staff were fabulous.\nThe last minute organisation was frustrating, but the Bavi eco trip from Hanoi was amazing, car transfers excellent, and the company boss phoned us and was very conciliatory."},{"rating":"5.0","review":"Mekong was so good. Friendly people, fresh tropical fruits. I crave for more time spending in fruit plantation. Amazing idea to be included in a tour. Cycling in breeze was an awesome recreational actitivity to get involved but not too strong."},{"rating":"5.0","review":"I used to think that choosing a travel is a dime a dozen but Realistic Asia totally changed my thought. They are so amazing. I enjoyed my trip. Thank you."},{"rating":"5.0","review":"Had a lot of fun during my trip, the guides are professional and had a great sense of humor."},{"rating":"4.5","review":"Committed staff, responsive to customer request, quick response with in-depth knowledge of Vietnam."},{"rating":"5.0","review":"I had a great experiences, everything is just outstanding"},{"rating":"5.0","review":"I visited Vietnam in July 2016 and had an amazing time! The people (tour guides and locals), places and food were absolutely terrific. I highly recommend Minah from S Viet Travel for anyone looking to visit Vietnam. Thanks again for everything"},{"rating":"5.0","review":"We had a great time in Vietnam our tour guide Sony in Hanoi made our first couple days amazing! He was very friendly and knowledgeable!"},{"rating":"4.5","review":"My wife and I had wanted to visit Vietnam for some time and are very glad we did. We were not sure where to visit and for how long so I reached out to see all of the options we could. And we found Minah from S Viet Travel. Minah did a fabulous job in making all the arrangements and throughout our journeys in Vietnam maintained contact to ensure that all was going to plan. The Tour Guides were very knowledgeable and accommodating and provided great insight. All the accommodation are clean and spacious."},{"rating":"5.0","review":"It's basic, but good and everything as expected."},{"rating":"5.0","review":"I travelled to Vietnam with S Viet for the first time and absolutely loved it! The itinerary was well-organised and, we had a great group dynamic and outstanding tour guides.  Can only recommend S Viet \nThank you for an amazing trip! Can't wait for the next one."},{"rating":"4.5","review":"Fantastic. Friendly and extremely helpful when need help, prompt response and always available when I need."},{"rating":"4.0","review":"We had best time in Vietnam, met friendly people, everyone we came across greet us with big smile. Thanks to our wonderful guide Huan, we have learned a lot about your country’s history and culture. All accommodations and transport are well organized. I’m glad that I’ve traveled with S Viet"},{"rating":"5.0","review":"We’ve just been back in the UK and I really miss the sun and the heat in Vietnam. But what I miss the most is warm-smile people and fantastic food.  I ‘m really glad that I took this tour with S Viet, everything is well-organized, the guides we had were all amazing and friendly. Thank you"},{"rating":"5.0","review":"My trip was well planned with the support from S Viet team from the first to the end of the trip. I even forgot my bracelet on the bus when we went to Halong Bay, thank you Megdo for all your help. Much appreciation and much love."},{"rating":"4.5","review":"had a great tour with sviet. Dat guided us and kept us informed the whole trip. Tet holiday made it even more special. \nI loved the tours on the country side,\ngoing the off beaten track, meeting awesome peoole and having the best food. Hoi an was the best spending watching the fireworks on new year's eve, and staying at a resort and spa hotel.\nThe only thing that I did not like was the tour in ho chi minh in mekong delta. It was full of tourists, below average lunch and filthy canals. I'm not sure if that is something that they have to show the tourist. \nBut overall my experience was great.. \nThank you so much sviet!"},{"rating":"4.5","review":"The trip has gone more than I could expected. Big thumb up for Meg, our wonderful guide"},{"rating":"5.0","review":"Hatrinh was a fantastic guide, very genuine and have a great source of stories; she went above and beyond to ensure we are all happy. The trip covers all nice place and beautiful destination, quite crowded but I believe everyone came for these stunning views"},{"rating":"5.0","review":"It has been a great experiences for me and my fiancé, Hoi An is beautiful and may be my most favorite place in Vietnam. Highly recommend S Viet team for anyone who is looking for authentic Vietnam experiences"},{"rating":"5.0","review":"I had a great trip to Vietnam with S Viet Travel. My experience with them is just wonderful, my tour guide's so cool and knowledgeable, I didn't have any hiccups during the trip, just a little confusion but was solved perfectly."},{"rating":"5.0","review":"My husband and I have travelled with S Viet travel and it was a wonderful trip. We were there for the first time and explored beautiful places of all three region. Halong bay is truly spectacular and Cu Chi tunnel is so fascinating. The food is simply awesome, it still make my mouth water when I think of bahn mi in Hoi An. I want send much love and appreciation for our tour leader, Minah. She is such a nation treasure, so much passion for her home land and always look after us. Definitely will come back in the future and take my kids with us."},{"rating":"5.0","review":"My husband and I have travelled with S Viet travel and it was a wonderful trip. We were there for the first time and explored beautiful places of all three region. Halong bay is truly spectacular and Cu Chi tunnel is so fascinating. The food is simply awesome, it still make my mouth water when I think of bahn mi in Hoi An. I want send much love and appreciation for our tour leader, Minah. She is such a nation treasure, so much passion for her home land and always look after us. Definitely will come back in the future and take my kids with us."},{"rating":"5.0","review":"Could not recommend sviet travel group enough . They were fantastic. Heip our guide in sapa made our trip fun informative and memorable . Hien our travel consultant In Vietnam did everything to meet our needs . She was in constant contact with us before and while on our trip checking that everything was ok. Our accommodation exceeded our expectations . It’s was just lovely and the locations spot on . Value for money  10/10 with private tour guides accommodation flights train travel food & entries amazing.We were a group of four adults that will definitely be using them again and have recommended them to our family and friends to travel with . Thanks Sviet travel for a memorable and exciting holiday x  karen Australia "},{"rating":"5.0","review":"I had my tour in Vietnam customized by An Nguyen, she planned everything according to my convenience. All the hotels were amazing and located on the main Street of the city, so I had time to explore the city at night. My itenarary was well managed not too busy and tiring. Loved every thing of my holiday. My tour guide Hannah was always available to guide me even before and during the trip. She always replied me instantly be it any hour of the day. Thank you so much An and Hannah for such a lovely vacation"},{"rating":"5.0","review":"I had my tour in Vietnam customized by An Nguyen, she planned everything according to my convenience. All the hotels were amazing and located on the main Street of the city, so I had time to explore the city at night. My itenarary was well managed not too busy and tiring. Loved every thing of my holiday. My tour guide Hannah was always available to guide me even before and during the trip. She always replied me instantly be it any hour of the day. Thank you so much An and Hannah for such a lovely vacation"},{"rating":"5.0","review":"I've travelled with S.Viet Travel for twice to Honai in the year 2016 and Ho Chi Minh last month 2018. The guide is very friendly and professional. The customer support team is super responsive, that's what put me in ease to book my Vietnam tour with S.Viet travel. Thanks for giving myself & my family had an enjoyable trip. :)"},{"rating":"5.0","review":"Excellent customer service! Very friendly staff!"},{"rating":"5.0","review":"At first I was not so sure whether to travel to Vietnam or not, and after reading about Vietnam finalized to go there for a family vacation.Got various quotes from different operators in Vietnam but the one who understood my requirements and provided me the best itinerary   at a reasonable price was S Viet Travel. The booked hotels were fantastic and the daily tour packages were excellent. With 24hrs customer care support I felt safe in Vietnam.I thank S Viet Travel for providing me a memorable family vacation."},{"rating":"5.0","review":"Vietnam was a revelation, and so was SViet Travels! Hannah, who handled the itinerary and the travel plans for our family of 6, was an absolute delight to communicate with and the organization was inch-perfect. I would recommend SViet to anyone traveling to South east Asia."},{"rating":"5.0","review":"Yes we did enjoy the tour. \nWe certainly got to see the highlights of Vietnam and we're just starting to feel confident crossing the roads in Ho Chi Minh before we left! Haha. \nIt was great value and well organized.\nThank you!"},{"rating":"5.0","review":"Vietnam is such an amazing place and anyone who haven't think about travelling to this country, well I think you should change your mind and start packing now. The people are lovely, the food is stunning, the landscape is spectacular. And I cannot thank S Viet Travel team enough for this, for putting together such a well organizing and memoriable experiences. Speciffically to Minah for her enthusiams and recomendation about Hoi An memories show, it was fantastic!"},{"rating":"5.0","review":"We have had the best 11 days in Vietnam. Every places has its own charm and gave me such a wonderful experiences.The tour is well implemented and worry-free, Thank you S Viet travel for always be there when we need. I will recommend S Viet travel to my friends."}]},{"name":"Vietnam Historic & Phu Quoc Island","reviews":[{"rating":"5.0","review":"I visited with the wife of mine and had an extremely comfortable drive to Hanoi, Ho Chi Minh City and HoiAn city. Particularly our tour guide Thanh was extremely humble and caring. This particular tour company is highly suggested."}]},{"name":"Hanoi - Sapa - Halong Bay & Bakhan Village 8 Days","reviews":[{"rating":"4.0","review":"Great. Enjoyed the experience overall."},{"rating":"5.0","review":"There were 5 or so guides across the tour, and every one of them were friendly, knowledgeable and open. The scenery was worth the distance traveled. Stunning :)"},{"rating":"3.5","review":"I enjoyed my trip to Vietnam but some things were not as I had expected\n\nI had thought I was booking a tour with a group and with 1 guide, as all previous holidays with tour radar. When I got there I was told there was no group and I met a different guide everywhere I went. This was not bad in itself (except for when I had to rely on a bus driver sending me to a shop, sending me to another shop and wandering around looking for someone I had no contact details for to give me my train ticket), but I would  have managed my expectations had I been warned. \n\nI was disappointed by the Sapa leg of the trip. My hotel, the Bamboo Sapa was still under construction. The sound of drilling was deafening, they were even drilling in the breakfast room as we ate. My room was still covered in dust from the construction. I spoke to other tourists who said they had been moved out of the hotel because it was not ready yet, I think I should not have been put there either. \n\nI also think that there should have been an alternative offered for the trekkking in Sapa or it should have been cancelled in the heavy rain. To me it was far too dangerous trying to get down the mountain in torrrential rain and very slippery mud. I fell many times as it was almost impossible to get down the hillside and it was impossible to enjoy the rest of the day when soaked to the skin and covered in mud. Given a choice I would have preferred to miss the activity as the day was miserable. \n\nThe rest of the trip was fine and well organised, and Tony did a great job of arranging in Hanoi. As I said, I think that it should be made clear that this is a self-guided trip and not really a tour at all, then other travellers might not be disappointed."},{"rating":"2.5","review":"This trip was so poorly organized, it was almost a joke. If you have any sense to book your own train tickets/day excursions, I would never go through tour company again. Book your tickets yourself. One of the biggest surprises was that this isn't really a \"tour\" where they load you in a bus with a bunch of people and you're traveling with them through your trip. Instead, what they do is coordinate the trip/plan your train tickets, get tickets onto the cruise or with another tour group for a day excursion. It was very poorly organized. We landed at 11am after 25 hours of travel... and had nothing planned or recommendations to go see. We ended up sitting in a hotel lobby until 8pm, until we could go to train station for  night train. We were so tired, and there was nowhere to freshen up or take a quick nap. Second big disappointment came on Day 3 which is market day. On Sundays, you get to go to a big market that takes hours to go through. But any other day of the week you just go to any market that's open. We were driven 2 hours out of Sapa for a market, were there for 15 minutes, and then got back into the car and taken to a train station, which we had tickets for a night train that left at 10pm. It was hell. The town was super boring/not much to walk around and see, nowhere to check-in and relax. We literally sat at a cafe and read for 8 hours. The ONLY thing we enjoyed about this trip were the day excursions Trekking through Sapa and Halong Bay Cruise... both of which were not run by this tour company and instead were day trips they helped set up. I can not emphasize enough that if I did it again, I would never go through tour company. Set up the tickets and excursions yourself."},{"rating":"3.5","review":"Highs and lows, some parts were excellent (halong bay stretch) and some parts were not so great (aspects of the sapa trip). Worth reiterating some of the other reviews...this is not group travel, rather lots of bits of trips strung together, but for me that was enough as a solo traveller. There was enough free time that you didn't feel like a lemon seeing just the tourist trail. Seemed to be a big difference between 3* and 4*, so if you can plug for it, it's worth it as 3* here is not equiveleant to a 3* in Europe. Overall pretty positive though. "},{"rating":"4.0","review":"it is hard to communicate with some tour guide and driver. There is room for improvement for their English skill.\nTour guide should follow the itinerary as the tour guide on the second day of our Sapa tour did not and asked us to pay for another side trip.\nOverall, the tour is good and I am very appreciated for the arrangement of showering opportunities especially after the train ride."},{"rating":"4.5","review":"Everything (transportation, tours and hotels) was organised and taken care of from the moment I arrived at the airport and up until my departure flight. The Halong Bay party cruise with Oasis Bay was so much fun. Very friendly and professional company. Highly recommended. A+"},{"rating":"4.0","review":"The tour was very well organised. Train ride was a little uncomfortable but an experience.Rest of the trip was excellent. Mo ,our guide in Sapa was really good.Lastlt Tony was very informative and kept everything running very smoothly for us on time."},{"rating":"5.0","review":"Just had a business trip to Vietnam and over the weekend, booked a tour through Indochina Legend. Were picked up at the front door promptly and from there on the day was brilliant. Did a days tour of the Viet Cong tunnels and then back for a tour of Chi Minh city. \n\nThe tour guide was \"Tin Tin\" and the driver was \"Tom Tom\". Tin Tin was excellent in providing commentary and in depth answers to any questions we had, no matter what the subject. I'm nearly 60 years old and have been backpacking for almost 40 years. This is only the third or fourth review I have ever written in that time."}]},{"name":"South and Central Vietnam Golf","reviews":[{"rating":"5.0","review":"We'd a wonderful time on overall things and the trip had been well organized and of a great standard with lots of great experiences. Go on the trip in Ho Chi Minh and also breakfast on the Mekong in can easily tho. Our guides went from their way making it an excellent trip."}]},{"name":"Vietnam Hike, Bike & Kayak","reviews":[{"rating":"1.0","review":"RIPPED US OFF for over $8,000!!! G Adventures will not refund us or credit us our hard earned money! Due to COVID_19 we could not travel.  I have anxiety attacks and fell sick due to G Adventures treating us disrespectfully.  We both are not working due to Covid_19 .  Our money is in their pockets and due to their services I am in a bad mental and physical state."},{"rating":"5.0","review":"A very busy 10 day tour that incorporates so much of Vietnam and leaves you wanting to come back.  Law is an amazing guide who has a passion for his job and makes sure everyone gets the most out of their trip.  Can highly recommend this tour to anyone after an active tour of Vietnam."},{"rating":"4.5","review":"Cycling in the mornings rather in the afternoon heat would have been better.\nAs expected, very fast paced and saw a beautiful country"},{"rating":"5.0","review":"From start to finish our Vietnam G adventures trip was the tops!"},{"rating":"4.5","review":"We had a great tour with wonderful group of like minded people.  Rocky, our guide was fantastic.  He was personable, organized and knowledgable.  Enjoyed all the activities and the food was awesome."},{"rating":"5.0","review":"Excellent tour!  Our 10 days included time in Saigon, Hoi An, Hue, Hanoi, Mai Chao, and Halong Bay and in-country transport via bus, taxi, plane, train, and boat.  The accommodations were all good to excellent and the activities well-planned and meaningful.  Dang, our CEO, deserves kudos for a job well done.   His love for Vietnam and excellent management skills made for a great tour."},{"rating":"4.5","review":"Had a great time! Surely would recommend it."},{"rating":"3.5","review":"Good way to see top cities from North to South. Wish we had more time in Hoi An! But great mix of active bike tours and sightseeing. Nice small group is perfect size for a group trip. Wish our guide had more background information so we could learn more about the cities and the people. Lots of fun, would do again!"},{"rating":"5.0","review":"Didn't give a 10 because some can't afford a tour like we had."},{"rating":"5.0","review":"Our trip was marketed as an \"active\" trip including biking, hiking and kayaking . . . which it was. However, I thought that there would have been a bit more biking in rural areas of Vietnam versus \"big city biking\" which I was not a favorite of mine ~ trying to keep the group in sight, not get into an accident and not being able to enjoy the sights along the way were problematic when biking through heavy trafficked streets. Biking in rural Vietnam, particularly Mui Chau was great. The kayaking in Halong Bay was great although it would have been nice to spend another day on the boat and in the area. The hiking portions of the trip were appropriate."},{"rating":"5.0","review":"Recent Bali Lombok tour was amazing, really enjoyed Vietnam too but the description of the tour as hike bike kayak could be a little misconstrued given the very small amount of hiking and kayaking so I'd want to assess their needs to ensure I didn't recommend something ultimately not befitting their primary objectives"},{"rating":"5.0","review":"Very enjoyable trip"},{"rating":"4.0","review":"A complete holiday that is fully inclusive with everything. The tour guide, the activities, all the hotels and takes the stress away from any planning. A perfect way to see a whole country and experience local culture as well as having a very fun time doing all the activities I love. I did have a couple of mishaps with the company including no organised pick up from the airport on arrival despite booking it. A couple of the hotels were too basic but overall these were minimal things and I would recommend and return again."},{"rating":"5.0","review":"Because I really enjoyed the Trip. Law is a passionate guide, very experience and took good care of us as a group. It was a well organized travel and we experienced a lot with lots of fun."},{"rating":"5.0","review":"The trips I have taken with you have experienced guides who work hard to ensure a good trip for all adjusting g as needed and helpful to the member. Plus a good balance of activities."},{"rating":"4.0","review":"Like the active side of the holiday"},{"rating":"5.0","review":"Nice Tour, nice Guide but to less action. 3 Kids and one girl who Can not cycle. Everybody has to wait. Law tries to make the best of it!"},{"rating":"5.0","review":"Professional service showing the best to offer, while supporting local communities and people"},{"rating":"4.0","review":"This is really a biking trip, not a biking and hiking. Really only one hike, which was great. The kayaking is forty minutes in a bay, and you cannot leave this bay - it was full of tourists when we went - generally unpleasant and quite boring, after a few mins. So G Adventures should remove any reference to \"Kayaking\" in the title. Ha Long is also terribly polluted, and over run by tourists - but that is not the fault of G Adventures. Cycling was great and other aspects, excellent."},{"rating":"5.0","review":"Trip was fantastic, it was my first international trip I had ever done so I didn't know exactly what to expect but my concerns were alleviated right away. Hotels were more than comfortable, transportation was enjoyable and even the home stay in Mai Chau was a very pleasant experience."},{"rating":"5.0","review":"The trip was well organised, the guide was full of information and allowed the tour to flow, places we went where unbelievable and would defo recommend this to anyone"},{"rating":"5.0","review":"Guide was really kind and helpful, he ensures we got the most out of our time in Vietnam. The accomodation and all transport was of a high standard. All the bike rides were very enjoyable and not physically exerting.à"}]},{"name":"South & North Vietnam - 6 Days","reviews":[{"rating":"4.0","review":"None ,excellent service"},{"rating":"5.0","review":"Hi Ms Xuan Dung Nguyen,\n\nI would like to personally thank you for the service provided by you and your company for my trip to Ho Chi Min City and Hanoi. Halong Bay trip is wonderful. Really appreciated it and will definitely book with you again in the future. THANK YOU :) \n\nRegards,\nK.Satish"},{"rating":"5.0","review":"Nice time in Vietnam\n\nVery good organisation. Friendly stuff and nice hotels. We really spent a very nive time in Vietnam without any preocupation. Nice trips in private cars o very small group. We will choose Legend travel again."},{"rating":"4.0","review":"Awesome tour! The tour guides were knowledgable and friendly. Special mention to Victor who took us through Ho Chi Minh city and the Cu Chi Tunnels. We had a great time! Transport was punctual and clean. Accommodations were basic but adequate. Overall a wonderful trip."}]}]