[{"name":"Vietnam: Hike, Bike & Kayak","reviews":[{"rating":"5.0","review":"I loved every minute of trip, well thought out; I think lots of my friends would enjoy such an experience."},{"rating":"4.8","review":"Loved the variety of activities, the group were fun and our tour guide outstanding"},{"rating":"4.0","review":"The entire trip was very organized and it covered a lot of northernVietnam in a short period of time with efficient travel time between locations."},{"rating":"4.0","review":"I enjoyed the whole trip. The activities and leader with both good"},{"rating":"4.2","review":"Very good organized. Good tour leader. Generally a bit too long bus drives."},{"rating":"4.0","review":"Awesome trip\n Long drives between locations took up lots of time on this short trip. Every location was worth it tho, so a minor drawback not major.\n Looooved the planned activities (hike, bike and kayak). Great for budgeting to know most major stuff planned and payed for before we got there."},{"rating":"4.5","review":"The trip had a lot of variety.There was a lot of interaction with the local people. The guide, Loc, was excellent.The accommodation was very good."},{"rating":"4.5","review":"Excellent pre-trip administration & information.Itinerary lived up to expectations, with good organisation, good food, great guide (Loc Phan) & a good group of travel companions."},{"rating":"4.8","review":"The whole tour was very well organised and included a great range of activities.There was good focus on ensuring all the group members had the information needed to ensure a safe and enjoyable trip.Loc, our guide was fabulous - providing personal insight into the country, its people, history and culture.The trip pushed my boundaries and abilities and I appreciated the support from Loc, our local guides and support team, and my trip-buddies!\n A great way to spend Christmas and New Year"},{"rating":"4.5","review":"Vietnam is a developing country, with a less developed culture compared to a first world country."},{"rating":"4.5","review":"The tour in general was great (really good)  our guide was a bit hit and miss.  Felt he didn't give us information about towns  and sights etc we were passing as travelling."},{"rating":"5.0","review":"A great tour and very well organised. Son, the tour leader, and his team were excellent and really made the difference to the entire trip. They were helpful, attentive, and made sure that everyone got exactly what they wanted. The activities were well paced, giving everyone the necessary time out from the activities, the local restaurants and food was delicious and suited our fellow travellers who had varied dietary requirements (including vegans). I had a wonderful overall experience in this beautiful country and I definitely will travel with Intrepid again - to Vietnam or elsewhere."},{"rating":"4.5","review":"I enjoyed all aspects of the tour and realise that the guide has a fine line to judge by how involved the group or individual would like to participate in the home stay experience I think your advertising should inform the traveler that you get out of it what you put into it"},{"rating":"5.0","review":"Thought it was a really balanced trip with all the activities showing you a different way to see & experience the country."},{"rating":"4.5","review":"Agree with the posted comments. Loc was excellent and made a big difference to overall experience; walk second day was too short; accommodation in resort at Halong bay was inadequate (but I understand you're changing that); this is not a ten-day tour but an eight-day tour so you should be clear about that - selling it as a ten-day trip only leads to buyer disappointment because you've over-sold it. The walk near Sapa is stunning; cycling was great and handled well; kayaking was excellent."},{"rating":"4.5","review":"Loc was a fantastic tour guide for our hike, bike and kayak tour through north Vietnam (23 Dec - 1 Jan). He was knowledgable, patient, calm and made the experience what it was. \nWe really enjoyed the activities on tour, especially hiking from Sapa as the weather was great. The homestays were definitely a highlight of the trip. My one negative would be that although the trip was advertised as a 10 day trip, the only activity on ‘Day 1’ was a group meeting and the final day was the day everyone left so I think it would be more realistic to advertise as an 8 day tour so that people can plan their travel arrangements accordingly- I ended up having 2 days either side of the trip in Hanoi as I had assumed we’d have activities on each of the 10 days. \n\nBut apart from that, everything was excellently organised, of a high quality and again Loc was a brilliant guide."},{"rating":"4.5","review":"Great tour long bus trips were hard Accomodation better than expected\n2nd day trek was too short"}]},{"name":"VIETNAM COLLECTION 1 - Vibrant Vietnam 10 Days","reviews":[{"rating":"5.0","review":"I just recently have this package tour with my families in this September and we are 100% satisfied with everything this company did to us. Our guides are so friendly,approachable and knowledgeable during our tour. Also, we can really testify how professional this company has to offer, from clean and comfy transportation to authentic Vietnamese food experience. I will and forever be grateful that I chose this company and will surely recommend to everybody who would like to explore the timeless charm of Vietnam."},{"rating":"4.5","review":"Very well organised! The team in Saigon were in touch often to check we were happy with the way things were going. We had a different guide each city but they were outstanding, in terms of knowledge, personality and bringing the group together as a team. These were Chuong, Huy and Khoi. The itenary was great if you have a shorter time in Vietnam but want to cover the highlights. We were always in an AC vehicle. The hotels were surprisingly good and we were even offered nicer upgrades if we wanted. Meals were also nice and in local restaurants, the one in Hanoi was exceptional. Overall I would highly recommend this tour as Vietnam is a big beautiful place to see but they make everything easy for you and fun!"},{"rating":"5.0","review":"Hi, would highly recommend this tour, we seen everything we wanted to see. All the guides were lovely, great English. It was great getting greeted at the airport and taken to your hotel.We picked the 4 star option and could not fault it. The tour gave you time to yourself to go and explore."},{"rating":"3.5","review":"Daisy of Swan Cruise in Halong bay was excellent, the other tour guides in the other cities did not provide the same level of service. Kevin in Mekong tour was very good too."},{"rating":"5.0","review":"Execellent tour with really good local knowledge including history to restaurant recommendations. Transport was seamless. We booked the 4* upgrade of hotels and they were all super with fabulous breakfast included. Of the tour guides, the guides in Hanoi, Hoi’an were more attentive than the guide in HoChiMinh. Overall a really good experience & excellent value for money. Would certainly recommend this tour company for a very real experience."},{"rating":"4.5","review":"Jack and the footsteps team could not have been more helpful, \nThe Tour was great."},{"rating":"5.0","review":"This is an amazing trip from the North to the South of Vietnam. Vietnam is brilliant country and very welcoming. Me and my friend have a great month in Vietnam, after this tour we enjoy a couple week in Phu Quoc island. Many thanks Jack & team!"},{"rating":"5.0","review":"I just recently have this package tour with my colleagues and we are 101% satisfied with everything this company did to us.Our guides are so friendly,approachable and knowledgeable during our tour.Also,we can really testify how professional this company has to offer,from clean and comfy transportation to authentic Vietnamese food experience.I will and forever be grateful that I chose this company and will surely recommend to everybody who would like to explore the timeless charm of Vietnam."},{"rating":"5.0","review":"I love everything in Vietnam, especially extension trip in Phu Quoc Island. My guide, Ms. Kelley and Mr. Joe is really nice. Footsteps team is really friendly and helpful!"},{"rating":"4.5","review":"I did the 10-day Golden tour and it was really cool and well-planned and organised. We've been to several amazing places and experienced different activities as well. Kaite was a good and friendly guide too. The only down was the accommodation in Hanoi because of the uncomfortable bed in our room. They upgraded us to a better one after I emailed the operator and it's great service! All in all, I recommend Footsteps and this tour to everyone who likes to discover Vietnam. Meals are great also, book a food tour in the evening if you are seeking for the real authentic food."},{"rating":"5.0","review":"Such an amazing experience! A great introduction to Vietnam. Thin, our tour guide is knowledge and love of his country made the whole experience a very memorable one."},{"rating":"4.0","review":"It rained all day when we were in saigon but we could not fault Footsteps at all as we travelled in rainy season. I recommend you visit Vietnam from Feb to Apr instead. Joen is our tour guide and he is very helpful. Meals are always fresh, highly recommend."},{"rating":"5.0","review":"Everything was well organized. Halong is my favorite, will recommend to my friends."},{"rating":"5.0","review":"I've never had an experience like it. I loved it so much I have been trying to save up and go back again! Vietnam was an awesome country with beautiful scenery, amazing people and delicious food and drink - there isn't anything not to like. The tour was made all the better for the people I met and our tour guide Joen. He knew all the best places to go and always had recommendations; but was also a good laugh and just up for joining in. I Couldn't recommend this tour and Vietnam enough!"},{"rating":"5.0","review":"Everything was perfect and perfectly-arranged !\nEverything was perfect, and I would have to say it was the vacation of a life time. I will do all I can to promote your company and your services. Thank you so very much for having arranged the magnificent trip we took !"},{"rating":"5.0","review":"An interesting and actvie tour of vietnam. Our guide Thinh was informative and funny, and the vietnamese people warm and friendly. A great country, and a great way to see it! Expect to come back a few pounds heavier, as vietnamese food is fresh, tasty, cheap and plentiful! :) Thank you Footsteps!"},{"rating":"5.0","review":"I had an excellent time. It was what I had hoped and more.I loved looking at peoples houses, seeing real Vietnamese life. Hoian and Halong Bay are my favorite.\nJoen in Ho Chi Min city and Henry in Hoian are very friendly and helpful, always be on time. Thank you Footsteps! Highly recommend for ones who would like to have a full experience for the first time in Vietnam."},{"rating":"5.0","review":"I travelled on July, good tour! The trip gave the perfect balance between organized activities and free time, allowing me to make the most of the short time I had in Vietnam. Services, guide,... everything is good. Especially transport with flight, I don't have enough time, so 2 domestic flights is perfect (our group fly with Vietnam Airline), Footsteps's guide is friendly and helpful!"},{"rating":"5.0","review":"By far the best experience of my life!! Had the most amazing tour guide, Joen, who added so much more to the experience, his guidance taught me so much about Vietnam and helped me understand the culture whilst partying our way through the country and seeing the beautiful sites. I also met some local guides who were so friendly and knowledgable. Footsteps took me through so many towns that I wouldn't of experienced if I were to go alone. I highly recommend this 10 day tour, for an enjoyable, cultural, fun filled adventure."},{"rating":"5.0","review":"Hello Footsteps Team, I had a great trip with my family in this summer. Thank you so much, your services is very good! Vietnam is so amazing, I had a problem with my flight and visa on arrival day, but Tony helped us and waited for us two hours at the airport, he is so friendly. I'm surprised with restaurant and hotel that Footsteps chosen, it's so nice, hotel is located in city center and restaurant is so beautiful with nice foods. I highly recommend Footsteps Indochina Travel if you have intention of visiting Vietnam!"},{"rating":"5.0","review":"The 10 days tour was genuinely amazing, the activities were well thought out and we had plenty of time to explore on our own. Most of the activities were things I would never have booked on my own but are things I'll remember forever. Our tour guide Thinh was nothing short of spectacular. He made me feel welcome from the moment he picked me up at the airport, told me places to go and visit as I arrived one day earlier than the departure date. He has been genuinely amazing the whole trip, and has made up most of my favorite memories since landing here. Meals are local and all are delicious! Thank you for some amazing memories Footsteps!"},{"rating":"5.0","review":"Footsteps Indochina Travel is really perfect, this tour has great itinerary. I will recommend for my friends, I just finished this tour last month. Hotel & cruise is very nice with balcony, near city center, both guide from North to South is awesome! thanks Footsteps Team a lot!"}]},{"name":"Vietnam Discovery","reviews":[{"rating":"5.0","review":"We had an amazing trip, everything went as planned. This was our third Intrepid tour and we were pleased with everything."},{"rating":"5.0","review":"Phat, our tour leader, was great. Most locations were excellent. I particularly enjoyed the homestays."},{"rating":"2.8","review":"The trip felt more like a tour where at every opportunity I was taken to a place to be sold things. However, I have been with Intrepid to Africa and that was a real adventure, so I would use you again - even though I was not too satisfied with this particular tour."},{"rating":"4.5","review":"Overall good experience with Intrepid."},{"rating":"3.8","review":"Excellent Leader,Tu"},{"rating":"4.5","review":"Our tour guides vast knowledge and charismatic attitude really helped gel the group together making for an overall wonderdul experience. We found ourselves fully engaging in all included activities and even opting to do additional activites as a group."},{"rating":"4.2","review":"Very enjoyable trip. Planned well no hassle and our leader Tu was extremely welcoming and always available to help us."},{"rating":"5.0","review":"Well organised trip that used time well to show what Vietnam has to offer."},{"rating":"4.5","review":"Fun, well organised, quality guide, good itinery"},{"rating":"3.2","review":"The group leaders attitude and leadership skills were poor. Please see comments from my husband Raneet Nana"},{"rating":"3.0","review":"The tour leader was an absolute disappointment. He on multiple occasions didn’t answer questions and when he did answer it was one word answers. At one stage he even asked one to the group members not to ask so many questions (it is important to know logistics and other travel info when with a group)\n\n What really upset my wife and I was we had carried 1 stationary packs for the kids at the second home stay upon asking Phat our leader if we can hand the packs over to the kids he simply checked the packs himself and decided to hand over the entire bag to the gentleman that served us lunch.\n\n What was even more appolling was that the gentleman put the bag away in a room and we never knew where the packs went to.\n\n The other disappointing facts were when we arrived in Hanoi after an overnight train Phat walked the group to a Highlands coffee chain for a morning coffee instead of perhaps showing us the market or something that was authentic to the city.\n He even went as far as saying that Highlands was authentic Vietnamamise coffee.\n\n On our bus trips us north and even on the boat rides home the group was left to freeze in the rain while Phat lay on a bed in the boat captains cabin. He failed to ask or even check if the AC in the buses could be switched off.\n\n On the last evening Phat had to attend to a family emergency and promptly cancelled the group dinner booking at Hungry Hanoi without informing any of the group members.\n\n Last Phat confirmed my transfer from the hotel to the airport but on the day we needed to leave for the airport the transfer shuttle never arrived."},{"rating":"4.0","review":"Thao was such a great guide! She was knowledgeable, approachful, funny and able to handle problems well. She also made GREAT food recommendations (local cuisine). The itinerary was great, got to see and enjoy a lot of Vietnam & the homestays were definitely highlights. Already looking forward to coming back to Vietnam in the future."},{"rating":"4.0","review":"Our guide Huy NGUYEN (Trip code: TVRN180130) was knowlegable, considerate and always accommodating to our needs.  He was flexible and several times we changed plans to accommodate the wishes of the group rather than follow status quo (ie.  walking tours vs. Prison Visit and HCMinh Masoleum in Hanoi.)\n\nThe itinerary was good but left more than ample free time so those prone to sightseeing needed to do research on what to do in that particular location.  Huy was always available for helpful suggestions.\n\nHotel accommodations were very good.  One less night on the train and at a homestay would have better suited my tastes.  There isn't anything to do at the homestays particularly when the weather is cool so we need to get going and return to the cities or next point of interest in the morning.  Huy was also very accommodating when these suggestions arose.\n"},{"rating":"5.0","review":"we have been to vietnam and cambodia for 10 days.we hired the services of vietnam discovery complete package.there services were uptake to the mark.we value their services and recommend everyone they should should use thier services"},{"rating":"5.0","review":"So glad I chose the 16 day Discovery Tour of Vietnam. Got to see all I expected and more with a great group of 11 of us. Accomodation was good to very good in 3star hotels. Same for transportation. Other than the overnight trains which were quite cold with the aircon. We traveled in March -April. There was a good balance of organised activities and free time  which our guide would suggest options or you could do your own thing. Our guide Bien was fantastic sharing his knowledge and stories that gave us a deeper insight into his culture. I suggest travel light- it only costs a dollar or two to have your washing done every few days- and leave room for souvenirs. Clothes are very cheap to buy. Buy or have it tailored in Hoi An. Highlight was the overnight cruise on Halong Bay -a calming end to a busy fun filled tour. I would highly recommend travelling with Intrepid and am looking at other tours they offer in Asia. "},{"rating":"4.5","review":"Great tour! In a short time you see a lot of Vietnam. Wonderful (local) tourguide. "}]},{"name":"Vietnam Essential Tour","reviews":[{"rating":"3.0","review":"We’re disappointed with the food included in the tour package knowing that Vietnam is known for good food"},{"rating":"5.0","review":"Such fantastic service throughout!! Always informed of next steps and everything was on time and taken care of. I didn't have to do a thing :)"},{"rating":"4.0","review":"Vietnam is a very interesting place. Overall, I liked the tour, and I very much enjoyed the personal touch which was given by everyone involved, from those who greeted me at the airport, to the hotel staff and the individual guides. Some of the guides were difficult to understand.\n\nThe arrival in Vietnam could have been better, had I been told that I needed to first fill out a form at the arrivals hall and also provide a passport photo. I had pre-arranged the visa document, but only after waiting in line for half an hour did I realize that I needed to fill out another document and have a passport photo. Had I known it advance a lot of frustration could have been avoided.\n\nHo Chi Minh City and Hanoi were crowded with a lot of traffic, But each was interesting. I very much liked the visit to Hoi An as well as the Halong Bay cruise. \n\nThank you for a very memorable experience."},{"rating":"5.0","review":"Only skipping the guide rating because I couldn't access it!\n The tour guides were all excellent - as in everything some better than others but all have another perspective to Vietnam. Our guide in Hoi An was particularly good. I have already commented to Vivienne about Tuan.\n."},{"rating":"5.0","review":"Cathy is completely amazing! Honestly had the best incredible time with her as well as the group. There are not enough words to refer to how memorable she's created this trip - a great deal of laughter and too much fun! I just wish she might be the leader of ours on all later tours!"},{"rating":"5.0","review":"Had the best incredible time on this particular trip from the minute we showed up until we boarded the plane of ours we've well looked after! Thanh is an excellent guide, fun that is good, always on hand to assist us out there with any questions/issues we'd! The standard format of accommodation was really high, there was really quite a high number of dishes to select from. The tasks had been a lot of fun and it is a good way to find out Vietnam and not keep worries associated with to book anything yourself. Definitely suggest!"},{"rating":"4.5","review":"We're a family of 4 and also spent 2 weeks in November in Vietnam. The majority of the guides of ours were fantastic. We did not need to be concerned about accommodations, and we noticed amazing sights. Particularly savoring the household was the one night cruise at Halong Bay."},{"rating":"5.0","review":"We took a tour by them and this was arranged well with and price that is affordable. Tour was effectively designed. Helpful and friendly guides as well as the driver. The driver and guide were superb. Thanks for all the arrangements, a friend of mine and I'd an excellent vacation!\nTry keeping up an excellent job."},{"rating":"5.0","review":"To begin with, ı wish to thank you again for all the kind help of yours, amazing hospitality and warm support that you have shown us before and also during this crucial trip.\nAfter this particular journey, Mr. KIRHAN had an extremely hectic business schedule and we could not catch one another until this day due to various other activities and my arrangements.\nIdeally, we are going to take one step ahead and continue our great relations on business also.\nI should say thank you again from the bottom part of the heart of mine."},{"rating":"5.0","review":"Greetings from a great day of England and please accept my apologies for my late response to your kind e-mail. \nFirst off all, I want to thank you once again for all your kind help, warm support and amazing hospitality that you’ve shown us before and during this very important trip. \nIt was also so important for me that Mr. KIRHAN had a fantastic time in your destination, especially when ı’am the total responsibility of this trip :) \nAfter this trip, Mr. KIRHAN had a very very busy business schedule and we couldn’t catch each other until this day because of other operations and my wedding arrangements. \nToday Mr. KIRHAN shared with me this beautiful picture and asked me to tell you that he had a great time during the trip, he was so satisfied with all arrangements and services. Hopefully, we will take one step forward and continue our good relations on business as well. \nI want to say thank you once again from the bottom of my heart "},{"rating":"5.0","review":"Thank for the amazing warm professional Gracie assistance for all they need locally! I also thank you for all your amazing collaboration and I hope that this was the First for future several Bookings!  I will do my best to promote Vietnam as a cool destination on our website and Social media. I love you and hope to meet you soon in the meantime I wish you all the best you will be my \"Charlies Vietnam Angels\"!"},{"rating":"5.0","review":"Thank you a lot. I can assure you we'd an excellent trip operator. The 2 guides had been just fantastic, service-minded, experienced and knowledgeable, all of the hotels were excellent - as well as the folks of Vietnams so inviting and friendly.\nI'm back at the office along with a bit hectic today, but we'll surely come back and provide you with great marks on Tripadvisor."},{"rating":"5.0","review":"Visited Vietnam in August arranged via Top Vietnam Travel. The program from Top Vietnam Travel was superb. Great everything and communication arranged as transfers occurred as it must. Couldn't fault the service. Phong was great providing us confidence on was our very first touring experience. I'd recommend."},{"rating":"5.0","review":"Tbh, I was a bit skeptical going with some local Vietnam company and I even had a friend check out the office in Hanoi for good measure. I had gone through several agencies and found a good rate for my initial agenda. Top Vietnam Travel was also far more responsive but what sealed my choice is mainly the fact that the attention I received was a lot more individual. Couldn't have asked for a better arrangement."},{"rating":"5.0","review":"Superb experience. From pickup at the airport in private cars to 5* hotels at strategic locations to attentive and knowledgeable guides, everything ran like clockwork. Our salesperson Lily was very nice and accommodating to our requirements from the get go despite many changes made to the itinerary and accommodations by us. She organized excess baggage, early check in and upgraded my hotel rooms for me at the last minute which just topped off the experience. \nWill definitely do a more in-depth tour next year and have Top Vietnam Travel arrange my tour!"},{"rating":"5.0","review":"Perfect itinerary to sample the country (quickly) for those with a little more than 1 week to spare. Vivian, who I would highly recommend, was always efficient and timely with her responses. Our guides were very passionate and kept us entertained for the entire trip. Even with the weather not in our favor, we very much enjoyed getting to know the varied country and welcoming people.\nIt's a pity I didn't have enough time to see more of the North but I sure will next time."}]},{"name":"Vietnam Express Southbound - For Solo Travellers","reviews":[{"rating":"4.0","review":"Extremely active tour, suited my Gyspy personality perfectly. Thanh Vo is an excellent tour guide, exhibits a true love of Vietnam. Hanoi & Saigon (HCMC) are chaotic metropolitan cities, I strongly suggest purchasing advance transfers plus pre/post hotels to adjust from USA long haul flights and lay overs. Enlist the services of an on line Visa service-they are professional and essential to clearing customs at International arrivals. Enjoyed the more rural/natural aspects of Vietnam since we met authentic people, amazing foods,smells and landscapes. Halong bay boat trip (plus caves) has been criticized for heavy commercialism and congestion but I found the boat had two extremely creative chefs, comfortable cabins and a peaceful vibe. Bike riding outside of Hue and sampling rice wine, meeting a guitar playing entrepreneur/veteran from the Vietnamese war with Cambodia was fascinating. Appreciated the historical aspects and museum displays within the imperial city. Definitely do an optional home dinner with a local family, she was an excellent cook and you will gain great insights to the aspirations of the next generation of Vietnamese people, All supplemental guides to Thanh on specific locations were professional, all motor coach driver extremely safe and prompt. Overnight train brought back many great memories of traversing the rural landscapes of Africa yet so unique to Vietnam's rice fields, villages, memorials and temples. Too much time in Hoi Ann, but mostly because I am not a shopper. Loved the Mekong Delta boat ride and visiting remote tropical villages. Overall Intrepid did an excellent job in executing a difficult, multi faceted and fast paced tour of Vietnam. Since this was a South bound solo tour it is worth mentioning, I was the ONLY male participant which did affect the chemistry and balance of energy. Finally the farewell dinner was listed as included on the Itinerary but NOT paid for by Intrepid-no explanation was given for this discrepancy."},{"rating":"5.0","review":"The trip was fantastic.  Great itineraries, companies, and a guide!"},{"rating":"4.2","review":"You should include an option for Very Good, which is my opinion, between Good and Excellent (which forces us to make a choice between the two and skews the results).\n I thought Halong Bay would be a highlight, but it was disappointing because of commercialism and boat traffic. Perhaps consider not going to the same places as every other boat/different route so not so crowded, even if it means one less place to see so it feels more authentic. However, food was great on our boat."},{"rating":"4.8","review":"Awesome trip. Great bunch of people, we saw and experienced a lot, and we had a brilliant guide (TV)."},{"rating":"4.8","review":"This is nothing against the tour or tour leader. I had not travelled with intrepid for sometime as I tried to claim my free trip some time ago as I had done many trips with Intrepid and had spent many thousands of dollars on tours. I was denied my free trip and then gave up travelling with Intrepid in around 211 and started travelling with G Adventures. I am not sure whether I will travel with Intrepid again to be honest. The only reason I did This trip was because of the timing of the tour."},{"rating":"4.5","review":"The trip was very well organised and I found it to be very good value for money. More than anything, our tour leader (Thanh Vu) was excellent and made everything run smoothly."},{"rating":"5.0","review":"Our guide TV had everything run so well that I was no only on a holiday to see beautiful Vietnam, but also on a holiday from taking care of details and logistics."},{"rating":"5.0","review":"I really enjoyed this trip, it was a great group size and had so many wonderful activities to choose from each day."},{"rating":"5.0","review":"The tour leader was fantastic. Even though it rained everyday - we had a great time."},{"rating":"5.0","review":"TV the guide was exceptional. He made my first tour ever so relaxing.Nothing was to much trouble and the history he knows is astounding."},{"rating":"4.8","review":"Intrepid itineraries are about as good as travel itineraries get. This is my twelfth trip with Intrepid. I’m a travel junkie and love to create my own itinerary but when time is limited I hop on an Intrepid. Also, it helped that we had an amazing group and an even more amazing guide in Thanh Vu. He was exceptional!"},{"rating":"4.0","review":"Our tour leader, Thanh Vu (TV), was excellent.He was very caring and thoughtful and very effective.He always went out of his way to make sure we were all happy.No task was too big or too small for him.We also enjoyed his sense of humour too.\n The itinerary was designed well.As it was peak season and Vietnam is becoming more and more popular as a tourist destination, the places we went to were crowded, particularly Hoi An and Halong Bay, which took away some of the beauty.The rain in Central Vietnam didn't help either. I understand those are out of Intrepid's control."}]},{"name":"Classic Vietnam","reviews":[{"rating":"4.0","review":"We had an amazing group and a great tour guide, Ngoc wanted us to have the true Vietnamese experience. Our dinners together were all amazing. Food was one of the highlights of the trip. On a tour where the country was beginning to shut down to tourists, he did an amazing job of keeping positive and continuing to share his knowledge of the country he calls home. Intrepid was not advising him about the changes that were coming down due to the COVID virus and so he was unable to answer our questions about parts of trip that were to be cancelled such as Halong Bay. Once the tour was cancelled Ngoc was concerned for our wellbeing and flights home. I will return on my credit received from Intrepid."},{"rating":"5.0","review":"This was my first organised tour, I had some reservations about doing such a holiday. Everything was organised and and went very smooth. I could not have done and have seen as much as we did if I were to do things my self. I just enjoyed being able to enjoy it and not worry about what I had to organise next. What I liked the most was staying with local people and being hosted by them, it gives you more of an attachment to the place and the people you visit. I can’t wait to do another trip with Intrepid."},{"rating":"5.0","review":"Intrepid trips are well organised and the small groups allow for visits to local home and businesses and the focus on local and socially responsible travel is great."},{"rating":"5.0","review":"Everything went off without a hitch. I had an excellent time exploring an amazing country.Our guide (Tam Ngo) was fantastic at every stage."},{"rating":"4.5","review":"It was the best trip I've ever taken? Perfect for solo travellers. The best route is definitely from Ho Chi Minh city to Hanoi. Be sure to shop in Ho Chi Minh and Hoi An"},{"rating":"4.5","review":"Well-managed trips to interesting destinations, with excellent local support."},{"rating":"4.0","review":"Good guide\n Excellent 4 star accommodation\n Good use of flights\n Good buses\n Good restaurants chosen\n Vegetarian food catered for\n Good amount of free time\n Good included activities\n Good recommendations what do in free time"},{"rating":"5.0","review":"The whole trip was organised very well and activities were picked very well. There was a wide variety of different things to do for different people."},{"rating":"5.0","review":"Excellent tour guide - very knowledgable about everything! He answered all our questions about history, culture, politics, places to eat and drink, etc."},{"rating":"4.5","review":"this was a great all round trip, but not suited to everyones needs"},{"rating":"4.5","review":"I recently returned from a Classic Vietnam tour, trip code TVKT170325, our guide for the 2 weeks was KHOA DUONG who is worth his weight in gold. With people like KHOA Intrepids reputation can only grow, He was very knowledgeable, thoughtful, and looked after everybody on the tour. The accommodation was first class, travel on overnight train was great, all bus trips very very good, will recommend Intrepid to everyone I talk to.\n                                                                                                Greg Amundsen"},{"rating":"4.5","review":"It was amazing. Would recommend this over the 10 day tour on offer.  Less rushed and plenty of spare time. Be prepared to go outside your comfort zone though and embrace the challenge. Great accommodation and we were looked after by our fantastic tour guide Ngoc."},{"rating":"1.0","review":"I used to love Intrepid but extremely disappointed in my last 2 trips.  The accommodation were closer to 3 stars but NOT when you consider I traveled on the \"comfort\" trip and kept running into travelers on \"basic\" or \"original\" that stayed in better hotels more centrally located.  We also noticed that they consistently traveled in nicer buses. Our overnight train was on a horrific car on New Year's Eve and we ended up running into travelers on the basic trip staying in a much higher class car.\n\nLast I want to warn people about the new tip kitty.  Sounds like a great idea to ensure local guides are tipped, however it apparently is a method to compensate the Trip guide at the local guide's expense.  Very sad as the local guides don't receive the same type of compensation or restaurant kickbacks and now the Trip Guide literally takes money out of their pocket.  Please do NOT participate in a tip kitty without a traveler administering the tips (careful as one of our guides had us do this but with a sealed envelope) or just say that you prefer to give out your own tips.  It turns tips from optional to compulsory and moves the funds from locals to trip guides.  WATCH OUT if your guide is Tho Nguyen.  You'll recognize him as he dressed as if he wore dress slacks, sports coats and dress shoes every day.  He didn't even try to hide his \"ill gotten gains!\"\n\nI would recommend the trip but with another tour company"},{"rating":"4.5","review":"Really nice country shown by a really knowledgeable and nice guide. With amazing scenery and yummy food."},{"rating":"5.0","review":"loved every minute of the tour, never been able to say that about a tour before, even when the weather was against us, our guide was able to juggle the local itinary features so that we got to visit/see everything. "},{"rating":"4.5","review":"Fantastic trip, great bunch of people and a fantastic tour leader, would recommend to anyone"}]},{"name":"Vietnam Real Food Adventure","reviews":[{"rating":"4.5","review":"This trip was interesting, exciting, extremely well-organised and had a good mix of activities and also some much-needed down time for relaxation."},{"rating":"4.5","review":"Our group leader Nhi was fantastic- she really made the trip for a lot of us and we were so happy to have a strong female leader. She was always happy and professional and was able to provide suggestions and recommendations on how to spend our time. I really enjoyed listening to her teach us about Vietnam and she seemed to always have an answer to whatever questions we had. Everything was planned so well by intrepid with a great combination of experiences."},{"rating":"4.8","review":"Great guide. Well organized and executed trip (with respect to transportation, activities, food and pace)."},{"rating":"5.0","review":"Intrepid was spectacular - a well-thought out itinerary, clearly communicated and executed, with a shining sense of integrity throughout. Good value for the price, a fantastic guide, and an excellent experience all around. Bravo!"},{"rating":"5.0","review":"Intrepid is among the best in the industry!"},{"rating":"4.8","review":"The focus really was on food which was the purpose if the trip. We got to try so many dishes that we would not have tried if we were on our own. We had may authentic local experiences which added much to our understanding of the food and culture."},{"rating":"5.0","review":"- small, well suited group\n - excellent tour guide who was entertaining, knowledgeable and gave us plenty of suggestions for ways to expand our experience, - use of local services and providers which was important to me\n - the places we went to eat were exceptional and food really was the theme running through the whole tour, which was what we were after, while still experiencing culture, history etc."},{"rating":"5.0","review":"This trip was fantastic with a great tour leader! Awesome inclusions."},{"rating":"4.8","review":"Loved it, amazing tour guide Tham and the food experience was great"},{"rating":"4.5","review":"This was a great tour with a really good balance between activities and downtime. So many activities/visits etc were included within the price and we experienced such a lot in a short time."},{"rating":"4.5","review":"Just got back from the Vietnam Real Food Adventure (end of May) and it was outstanding.  This was our first visit to Asia and you need to go with an open view of other cultures.   Things were not perfect but my review is an overall rating taking into consideration the outstanding guide we had (Anh), and the other people traveling were great and lifelong friends.   There is a lot of travel on this trip so be prepared but our buses were good in some cases older buses used.  The overnight train is an experience (not great for us), no bed bugs but mice.   But this is all part of the experience and all of the positives, the people, guide and all of the food stops (street food, cooking classes etc.) out weigh the negatives.  If you're not into Adventure travel maybe this trip isn't for you."},{"rating":"5.0","review":"I had the pleasure of spending two weeks with our guide, Giang Nguyen, on a food tour of Vietnam. Giang was an outstanding guide with a deep knowledge of the country and it's history, the regional foods and their preparation, as well as insights from his life in Vietnam. Giang managed a diverse group of guests, anticipating our needs and with good humor responding to our varied demands. His outgoing nature made him a friend to everyone on the tour and opened doors for us to meet local folks. For example, because Giang had befriended his wife, we had dinner in the home of a retired Vietnamese officer who served in the American war.  The evening was both a delightful opportunity to eat a home cooked meal and a thought provoking discussion of the war and it's aftermath. \n\nAs an added benefit, he is an award-winning photographer and generously spent time offering suggestions and tips to improve the photographs of the shutterbugs in the group. \n\nI could go on and on about Giang and his skill as a travel guide. I believe he made my trip a very special experience. "},{"rating":"4.5","review":"exceed my expectations.  the guide was outstanding and the trip was well orgainized.  the hotel in SagION, ASIAN RUBY BY THE PARK< WAS ONLY DISAPOINTMENT"}]},{"name":"Vietnam at a Glance - 7 Days","reviews":[{"rating":"5.0","review":"Such an amazing experience! For a relatively short stay in Vietnam, this trip offered a wonderful insight into the history, culture and cuisine it has to offer. All transport and activities were organised seamlessly without any delays or issues. The transportation and accommodations were comfortable and overall we found the tour fantastic value for money. All guides were knowledgeable and really went out of their way to help out with any questions or requests. W are already looking forward to booking another trip with Legend Travel Group in the future and special thanks to Danny and Hanna who were always on hand to help before and during the trip!"},{"rating":"5.0","review":"The whole experience is excellent. It gives a very good overview of the Vietnam culture, traditions and environment and how they are looking after them. Halong Bay is something to behold and it gives you an appreciation to preserve the beauty of this place. Food is very delicious and healthy. People are warm and welcoming. We want to congratulate Legend travel group. for this experience. It is worth recommending to our family and friends."},{"rating":"5.0","review":"The tour was great! Everything was very timely and we had no issues during our tour. Food was also great!"},{"rating":"4.5","review":"Only having a very short time to visit Vietnam we decided to do our first ever organised tour. We were very impressed with the tour guides and the itinerary."},{"rating":"4.0","review":"Very good value for money."},{"rating":"4.0","review":"Wasn't what I expected. We didn't actually meet a group, each leg was with a different tour guide and people.\nEverything went to plan and we had a great time in Vietnam. \nI will be checking out tourradar for any future travels that come our way."},{"rating":"4.0","review":"Our family really enjoyed the tour, especially up to Halong Bay.  The bus was a little cramped as they literally filled every seat so they had to use some of the folding seats.  That makes travel a little uncomfortable.  Still, good value for what we got."},{"rating":"4.0","review":"Amazing place! Well worth the 3 1/2 hour drive from Hanoi. Cruise was great. Staff were great and very attentive."},{"rating":"4.5","review":"Thank you to Legend Travel Group for taking such good care of me during my trip. I really appreciated the ease of getting around, the accommodation, the excellent tour guides. The trip on Ha Long Bay was amazing and I wished I had booked 2 -3 nights rather than just one. Special commendation to the chef on the boat - lovely food and amazing food decorations. Highly recommended. Thank you"},{"rating":"4.5","review":"I wanted to begin by saying that the online service provided by Legend Travel Group was quick and responsive during their business hours (Vietnam time). They were clear and answered all of my questions before and after I booked the tour. Before the tour started, the sales rep that was handling my account messaged me and suggested an alternative to the second day of the tour presuming that since i had family in HCM City (based on prior conversations) if my party might want to change our itinerary and venture out of HCM to see another city with a unique story. My family appreciated their suggestion and we accepted the new itinerary. All of the accommodations and transportation were organized as promised.\n\n\nOn the first day, the driver was on time and drove us to the intended destination (family house not hotel as requested by me weeks prior to the start of the tour). My family and I got ourselves to the hotel when it was time for check-in. Process was simple, just show your passports. The second day we joined a group of 8 people (including tour guide), we all had lunch together before being dropped off at the hotel again. \n\nThe third day, a driver picked us up to head to the airport to fly to Hanoi. Upon arrival, the next tour guide and driver gave us a private view (dependent on your arrival into Hanoi) around the 36 streets/wards of Hanoi before being dropped off at the hotel.The guide was very informative while explaining the history of the city. We felt comfortable with this guide as he was friendly and helpful when it came to our questions. \n\nThe next day was our trip to Ha Long Bay where we would meet the next and final group as we traveled by shuttle bus to the city of Ha Long. We liked our new guide too, he was full of character and very accommodating with us. The staff of Garden Bay Cruise was lovely and were great hosts. We felt respected and noticed all of their efforts in making the guests feel comfortable. The rooms were surprisingly spotless and food was much better than expected. I won't spoil the little surprises and experiences on board, but just know that we had a wonderful time and the cruise was our favorite part of the tour. \n\nThanks to everyone who made our trip memorable."},{"rating":"4.0","review":"We enjoyed our Ho Chi Minh-Hanoi-Halong Bay tour. We liked that we were with different people throughout the 5 days. Nice hotels, air conditioned day tours and airport-hotel transfers."},{"rating":"5.0","review":"We loved our four day tour of Vietnam with Indochina Legend Travel.  All the hotels were very clean and comfortable and in great locations with helpful staff.  Our tour guides were always on time, kept to the schedule and were very informative. We enjoyed a city tour of Ho Chi Minh, the Cu Chi Tunnels, the Mekong River, flights to Hanoi, airport transfers, and an amazing overnight trip to Halong Bay staying with Majestic cruises.  This also included the 3 1/2 hr drive each way to Halong Bay.  They staff on the boat were fun but don't expect a proper tai chi class in the morning.  The kayaking was fantastic and overall we had a great time.  Indochina Legend Travel also arranged some other domestic flights for us which made our trip very easy.  It was also fantastic value.  Our travel consultant in Hanoi, Miss Hanah Pham was extremely helpful and easy to contact via email.  We also spoke to other tourists when we joined in their tour of the Mekong and they were also very happy with their travel experience with Indochina Legend Travel."},{"rating":"5.0","review":"It was an amazing experience I loved every second of it the tour guides were phenomenal they were professional and friendly always. Just the hotel in Ho Chi Minh Liberty View is not a great hotel the staff there are awesome but i did see cockroaches and the breakfast was not great. "}]},{"name":"The Unexplored Co To Island - Halong Bay In 8 Days","reviews":[{"rating":"5.0","review":"It's a fantastic tour, superbly planned and covering the most exciting experiences. It combines some days in the capital, Hanoi, with relaxing countryside, cruise and plenty of leisure time on the beaches well as in-depth insight into the history and culture of the country. It's unbelievable that all this is packed in mere 8 days.\nThroughout the journey we always felt secure and well looked after, all the departure times etc. were known in advance, the guides were knowledgeable and enthusiastic, and the hosts were just incredible! \nOn the day when we were scheduled to go to Co To Island there were no boats due to rough weather conditions, and  Realistic Asia (Sviet Travel) acted promptly, allocating us to a hotel, arranging all the transfers etc. within a mere half hour! We are really impressed.\nIt's our first experience is Vietnam, and by no means the last one. We look forward to coming back very soon."}]}]