[{"name":"Ha Noi - Da Nang - Ho Chi Minh 8 Days 7 Nights","reviews":[{"rating":"4.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on board which was very good! The guides were all very nice and smiling but it was a stuggle  to understand some of them sometimes due to their poor English. The accommodation were ok, actually better than expected, the hotel in Da Nang was the nicest, too bad it was only for one night. The hotel in Ho Chi Ming was the worst, poor internet and oldest, but very central. \nThe breakfasts at the hotels were ok, the lunches very easy. The last one was actually very good! Unfortunately they don’t include any drinks (water on the busses) witch is stupid, drinks are cheap though. All the lunches are served in sharing plates with no cutlery, I thought that was disgusting and had to point it out several time (note that 90% of the people on the tour is wearing masks due to the corona virus and is very hysteric, but when it comes to food they all put their chopsticks and forks into the sharing plates! Disgusting! Definitely an improvement potential there). The lunch at Ba Na Hills was a very big buffet with drinks and everything! \nAll together it was a very good experience  to see lots of things around Vietnam! It’s worth to mention that a rappresentative of the company came to say hello to us at the hotel  the day before the trip started with a little gift and her contact in case we should need it during the trip. As I mentioned a very nice experience, totally worth it! I Recommend it!"}]},{"name":"Discovery Vietnam Golf Course","reviews":[{"rating":"5.0","review":"Good providers throughout the trip. The timing by pick up staff throughout the trip was ideal. The guides were all helpful and knowledgeable. Our flight was on the first morning and they've helped us to always keep the hotel room at a lower price. A huge thank you from all people to the team."}]},{"name":"Ho Chi Minh and Hanoi city in Vietnam 10 Days 9 Nights","reviews":[{"rating":"5.0","review":"The tour was well organised and communication was excellent. Manh was always available to answer any queries and even took time to meet me in person. This tour consisted of different tours within it and gave the opportunity to meet many people. It was well accomodating especially as a first time solo traveller. Overall it was a wonderful experience."},{"rating":"5.0","review":"The tour was very well organized! Manh was trully a diamond always responsive and alert. He was very helpful and supportive. He was honest and gave the true picture of all things included in the tour, therefore no hidden surprises and the tour overall met my expectations. Totally recommend the tour agency and especially Manh (since the tour you can customize as you like)! Highlight though of the tour was two days spend in Sapa and the homestay. Trully a unique experience. Manh thank you much for the unforgetable trip to Vietnam."}]},{"name":"Hanoi 5 Days 4 Nights ( Hanoi, Ha Long, Ninh Binh)","reviews":[{"rating":"4.0","review":"The places I went during these 5 days were incredible.  I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing.  I loved waking up in Halong bay to the sunrise as a start to my day.  As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam.  This made the long bus rides and average food worth it to me.  At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip.  She even gave me a little farewell token.  I feel that the communication and people with this travel group were professional and really amazing.  Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Classic Vietnam: Hanoi to Ho Chi Minh City — Plus","reviews":[{"rating":"5.0","review":"A great tour that gets you to some wonderful places. The right mix of activity and tranquility. Laos was an amazing country that I would love to go back to and see again! As ever Gadventures did an amazing job."},{"rating":"4.5","review":"Excellent tour, our tour guide Prado was very knowledgeable and helpful with any requests. Good mix of busy days and relaxing days"}]},{"name":"Vietnam the Marvellous Hyphen","reviews":[{"rating":"5.0","review":"Long was the best tour guide we have ever had. The overall tour was great value for money !  We had a great time !"}]},{"name":"7 days Experience The Beauty of Northern Vietnam","reviews":[{"rating":"2.0","review":"That was not a complete tour as booked, but pieces put together with different cars, groups and so on. That would have been much cheaper to make these tours arranged directly in hanoi. Besides, the prices on the boat were even higher as in Germany for drinks and since you were not even allowed to take water with you you had no choice."},{"rating":"5.0","review":"Mr Duong and team did a terrific job with his experiences and enthusiasm, was made our trip so amazing. We loved this trip and this company."},{"rating":"5.0","review":"Thank so much Duong and amazing team who organized this trip."}]}]