[{"name":"South to North Vietnam - 10 Days","reviews":[{"rating":"5.0","review":"Great tour with a very good snapshot of Vietnam. All the guides and hotel staff very courteous and obliging. We had a most enjoyable time. Each day was a new adventure. The internal flight were very good. We loved De Nang and Halong Bay the most. A bit challenging for older people at times and because of steps and rain had to skip marble mountain and Surprise cave but we always found something else to do. Great value and highly recommended."},{"rating":"5.0","review":"I would love to say thanks to Go Asia Travel team. I had a fantastic holiday with you. I will come back next time with my children."}]},{"name":"Vietnam Vacation from North to South via Hanoi, Hoi An, Hue, Saigon, Mekong Delta, Phong Nha cave","reviews":[{"rating":"5.0","review":"We cannot praise this company enough , first class service , so well organised , always on time , great staff & so helpful  many thanks to VietLong Travel"},{"rating":"5.0","review":"We had wonderful service from VietLong Travel  It was a fantastic. Everything was sorted and organised and if there was any hiccups, they were sorted straight away. \nThanks for making sure we made the most of our time in Vietnam. \nTherese"},{"rating":"5.0","review":"Vietlong Team made our trip more special with 2 below main things: \nFirstly, Awesome tour guides at all places provided us many interesting information about history, culture & lifestyle of local people at sites we visited. They also made sure that we were enjoyed & happy with arrangements & program can be flexible, which was suitable with weather change at different part of Vietnam. We can't thank them enough.\nAnother point, Planning in advance of a trip is worth it. If we didn’t book all services in advance, we maybe haven’t had perfect holiday like this. Vietlong Team did as they advertised. We don’t hesitate to recommend them!\nHighlights: Travelling from North to South Vietnam brings us mixed feelings about places we visited, with some World heritage as well."},{"rating":"5.0","review":"We just had 15-day trip to Vietnam organised by Vietlong Travel. It was excellent and we couldn't imagine how the experience could have been better. They were wonderful and promptly responding to all our emails. We had different tour guides in each areas of Vietnam, all of them were helpful, knowledgeable and caring that I cannot complain at all. I really recommend Vietlong and would definitely contact them for another trip in the future!"},{"rating":"5.0","review":"This was our first organised tour we have been on with travel agency. Viet Long team did a great job with this trip, everything organised professionally, the hotels we stayed in were all located in the center areas and the food was excellent. We had 2 days on Halong bay cruise and it was very enjoyable with great boat crew. All the guides that we met had a great knowledge of their areas. All the Caves were also breath-taking. I would not hesitate to recommend this."},{"rating":"5.0","review":"I had travel with VietLong Travel few days ago. I started in Hanoi and end in Ho Chi Minh City! With the discoveried tour Vietnam Vacation from North to South via Hanoi, Hoi An, Hue, Saigon, Mekong Delta, Phong Nha cave. HaLong Bay was amazing with nice cave. Hue & Hoi An was quite. Then different to Ho Chi Minh City. Ho Chi Minh was busy city. The servies was friendly & professionally. The next year i will continue go to Laos, Cambodia & Myanmar. I will come back then choose VietLong Travel again. Thanks so much for support from your team."},{"rating":"5.0","review":"We had a 16 days tour in Vietnam .Everything was organized by Ms Loan extremely well, no delays, no problems. I cannot imagine such a high level of service, in Europe this does not exist! Excellent trip, we had fun, we wore relaxed, all hotels included were great, all tours spoke perfect English and had a huge knowledge.\nI recommend VietLong Travel to anybody willing to visit the area."}]},{"name":"15 Days Exploring Vietnam From North To South","reviews":[{"rating":"4.0","review":"Overall, this tour was on roughly on par with what I expected. There were parts of the tour that were brilliant, thanks to the awesome guides and there were also parts of the tour that were absolute rubbish, which I put down to terrible tour attraction selection and indifferent guides.\n\nThis tour is not run by one company for the duration of the 15 days, rather it is 5 or 6 different tour companies sub contracted to provide the tours in each region visited. Our tour was billed as a 3 star 15 day family experience, and for the most part we received the 3 star food and accommodation we paid for. Unfortunately in Can Tho the travel agent booked us with YTC tours. \n\nThis company was horrible, and I rate them one star out of 5. We did the 2 day tour of the Mekong, and the boat tour took us through a canal that was worse than an open sewer. Not the Vietnam I want to see. When the rower extorted a tip from us, we relented and paid, only to have the 100 000 VND thrown into the bottom of the boat as it wasn't enough. All the other guides we had suggested this amount was the right tipping amount, but obviously not for these people. \n\nLunch on the first day was a bowl of rice and a bit of rubbery meat??? Some on the tour (Japanese???) were provided lunch that looked awesome, but we weren't served the same food. Our tour itinerary stated water was provided as complimentary, but we were made to pay.  The family accommodation provided was in a grotty zero star back packers. The mattresses' were thin low density foam, stained with god knows what, no sheets or pillows were provided, as it probably was assumed we would have sleeping bags. Security was dismal, the room itself was filthy and looked like it had never been cleaned. \n\nNeedless to say, I moved our family into a decent hotel around the corner from where we were staying. The tour guide was not happy about this, but I paid for 3 stars, not the local back packers. Other people on the tour did the same as us and moved to another hotel at their own expense, once they saw exactly where they had been accommodated. \n\nThe next morning, our family returned to the backpackers to continue with the tour. As breakfast had already been paid for,I availed myself of a juice and a coffee. I was then given a bill for my beverages. I said this was part of the breakfast I had already paid for, and they said as I didn't stay the night, I wasn't entitled to breakfast, even though I had already paid up front. Talk about gouging. I didn't pay of course.\n\nYTC Tours almost ruined my holiday. They were cheap, nasty and should be avoided at all costs. It's a shame that one company can almost undo all the hard work the rest of the companies put in to make my holiday a great experience."}]},{"name":"Vietnam Super Highlights - 15 Days Trip","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"100% reliable\n\n\n\nI went on a 15 days round trip with this travel agency. Every thing worked perfectly fine. I never felt unsure of anything and it was easy to get in contact if you had a question. I can highly recommend Legend Travel Group if you want to make a trip to Vietnam . Thank you so much. . Ingelise Frier, Denmark"},{"rating":"5.0","review":"Bert good organiced\n\n\n\nEverything was good arranged, good setup never anny connection is being missed. In the trip we onlu had lives one extra quiat stay, but al hotels where perfect."},{"rating":"4.5","review":"All works perfect\n\n\n\nWe are very satisfied with Legend. All works perfect - and this to a very cheap price. Therefore the price / performance relationship of Legend was a 1+. No question!"},{"rating":"5.0","review":"Great trip to Vietnam\nWe were very well taken care of by Mr. Tony and Legend Travel. We had multiple guides in multiple cities and the transition was very well handled every time. Bakhan Village Resort, I don`t remember location exactly but not far from Hanoi, really really nice place, highly recommended! Very reliable."}]},{"name":"Highlights of Vietnam Tour - 14 days","reviews":[{"rating":"5.0","review":"Hotels and transportation arranged by the company were amazing. Alex, a young tour guide but he was very knowledgeable and synchronised our difficult flights."},{"rating":"5.0","review":"This is a tour traveling to allover Vietnam. We landed in Hanoi as our first visiting place and visited Halong bay on a luxury cruise. We flew to Hoian after 5 days in Northern Vietnam to enjoy the old street and cycle around several rice fields. Mekong delta was the best area in Vietnam with plenty of rural foods. Before the last day, we had a free day to buy souvenirs and try local food in Saigon. Crossing Vietnam Tour is a best host ever. Highly recommend"},{"rating":"5.0","review":"The tour was very good. We had an amazing time. I would like to thank Lucy for organizing the tour for us. She was fully supportive all the time."},{"rating":"5.0","review":"Lucy was the point of contact with us throughout our tour (2 weeks) through WhatsApp and call as well if needed. She was very helpful and professional. In the meantime, I would thank Linh (was our guide in Hanoi) she was very friendly."},{"rating":"5.0","review":"It was an amazing tour \nAmazing viatnam thank you!!"},{"rating":"5.0","review":"We spent 14 days with Crossing Vietnam Tour to travel throughout Vietnam. Hanoi was our first destionation with an amazing food and city tour guided by a local guide. Halong Bay and Ninh Binh were magnificent. The middle and south part of Vietnam were the following stops. We also had great services and interesting activities hosted by the company. We want to say a big big thank to Crossing Vietnam Tour and especially Alex who professionally guided us for the entire trip. \nHighly recommend."},{"rating":"5.0","review":"We have been very busy so we sacrified our expectations to Crossing Vietnam tour agency. And they didn't disappoint us. All of the accommodation, vehicles and services were professionally taken care by the company. \nGood tour ever !!"},{"rating":"5.0","review":"Fantastic! We booked 14 days tour in Vietnam with this company and they gave us an amazing trip ever. We learned not only Vietnamese history and lifestyle but also various local food in authentic restaurants in Old quarter. Nightlife in Hanoi was surprisingly dynamic because this is hanging out time of locals. The tour was professionally organised in Halong bay and Ninh Binh so we could experience the nature with bare minimum. Following by Northern Vietnam, we went to Hoian and spent a whole evening roaming poetic streets. 2 days in Saigon was our last program of the tour including 1 full day city tour with unique floating market and 1 free and easy day to explore Saigon. Thanks for offering us an unforgettable trip ever."}]},{"name":"Vietnam for Solo Travellers","reviews":[{"rating":"5.0","review":"I had a very good experience of travelling in Vietnam with Threeland Travel. Best Tour Operators. Never feel any discomfort. Everyone must visit Vietnam once in a lifetime."},{"rating":"4.0","review":"Everything was very well organised and Threeland did everything they could to help if there was a little hiccup."}]},{"name":"Highlight of Vietnam","reviews":[{"rating":"5.0","review":"Our trip was amazing. It provided us with a fantastic sample of what Vietnam has to offer."},{"rating":"3.5","review":"Amazing tour! Great for if you only have a short time to see Mynamar - it definitely packs in all the best sites. The guides were all incredible, really made the travelling every day easy and enjoyable. Accommodation is good too, especially in bagan and inle lake. Would recommend!"}]},{"name":"Vietnam the Hidden Treasure of Pu Luong","reviews":[{"rating":"5.0","review":"A friend of mine recommended this tour. We did it and realized why my friend enjoyed it. Threeland Travel is a fantastic tour operator. A wide range of options with flexible budgets are offered to you.  Special thanks to Ms. Jacqueline  for her offers to answer any concerns I had and make our trip very perfect in all respects. The accommodation and the vehicles were very satisfactory. The food was also tasty, we gained weight 3 kilos after doing this tour - what an amazing thing :))"}]}]