[{"name":"Best of Vietnam & Cambodia - 14 Days","reviews":[{"rating":"5.0","review":"Great tour guides well organized"},{"rating":"5.0","review":"all good except ho che min hotel, ignorant staff, very unhelpful, kitchen told me to buy milk for my coffee, would not recommend trip if this hotel was on intinery"},{"rating":"5.0","review":"Everything abut this tour with Hoi An Express, booked through Tourradar, was excellent. It was the first organised tour we had taken so we were a little worried about how we would deal with not organising things ourselves. But all pickups from hotels, bus stations and airports were on time (Such a relief!); the guides in the various cities were excellent: very professional and well-informed; hotels ranged from good to excellent; breakfasts in the hotels ranged from OK to excellent; lunches .... on days where the tour provided them...were very good."},{"rating":"4.0","review":"The taxi driver was not in a visible place when I came out of the airport in Hanoi, so I thought I would have had to make my own arrangements so I went and bought a SIM card for $15 which was unnecessary. The driver informed me he had been asked to wait by a particular gate.\n2 The Moonshine Hotel in Hanoi was dirty. The bed linen had been changed but the floor had not. The second time we went to the hotel I had a different room which was very nice, but even dirtier. I took photographs, and showed them to receptionist.\n3 There were only five of us on the tour and yet I was placed in a different hotel, Hoi An Town Home Resort while the others were in Sunshine. Mine was much further away and so more expensive to pay for a taxi on my own. I complained to Hoi An but they said they Moonshine was full and  had already paid for the hotel so could not change. They also said that as I had booked last I was the one placed there. These two statements were untrue. I could have booked at the Moonshine and I was not the last to book with you. My room was next to the restaurant which had loud music until about 10.30. The breakfast was not buffet style and had limited choice. I asked for the omelette and was given two undercooked fried eggs and they took ages to arrive. I  asked for a proper omelette, which they provided. It also meant I had limited time to get ready for the transport as I had not anticipated waiter service. There was no fruit on the menu but I was given a nicely presented selection when I asked for some. The staff were courteous and pleasant.\n4 Hoi An provide a “free” $25 voucher for a bespoke tailor made item of clothing. However most of us had to pay a minimum of $20 for the item we wanted. (I chose a dress) It also takes at least half a day between choosing the item and returning for a fitting and in some cases a second and third fit. I just accepted my dress as it was as I didn’t want to return again. I feel this just wastes time and provides more money for Hoi An Express. I would strongly recommend that they reduce the price instead of the “free” voucher and stop this nonsense. People who want bespoke tailoring can make their own arrangements at the many available shops.\n5 There is a lot of free time available but no advice of suggested tours. The last tour I went on had the same guide throughout who could suggest itineraries and even phone taxi companies for us. \n6 The guides were all very pleasant, but some of their strong accent made it difficult to fully understand. Lors Sophea (not sure of the spelling) was one of the better ones and gave us a lot of information about the country.\n7 In HCMC we had a full day itinerary. One visit was to the war museum. This was a fascinating place, but we had 30 minutes to view everything. I had time to see two rooms, while others just skipped through everything. What we did that day could have been planned over one and half days not one day so we didn’t have to rush from one to the other\nOne the whole the planning was poor and I don’t think we had good value."},{"rating":"5.0","review":"We are very impressed with the organization of this tour. The services offered by Hoi An Express in this tour as to pick up from the airport at Hanoi, Vietnam and finally dropped off at Siem Reap, Cambodia and everything in between for 14 days (itinerary, air, water and ground transportation, accommodation, meals) were outstanding.\nWe would certainly recommend this tour to our friends and family."},{"rating":"3.0","review":"Parts were good and some days were not. We had excellent guides like our last one in Cambodia, and bad ones such as the lady in Ho Chi Minh City. The grueling day from 7am until 10pm spent on a bus traveling to Cambodia should not be part of the tour. The Floating Market was not a market at all but a boat ride. The floating village in Cambodia was interesting but accessing it through the area that was full of human sewage was horrible and probably dangerous to be exposed to. Everyone including our guide had to shield their face from the stench.  Ha Long Bay boat tour was nice. Hoi An was interesting and the lanterns at night scenic. The day spent visiting the tunnels and war museum was depressing and everyone left on the last day in Vietnam on a sour note. It is relevant information and historically interesting and important- but the way it is done I would want to save my precious vacation days and visited something else. More time in Cambodia would be better for this tour- less in Vietnam."},{"rating":"4.0","review":"The journey from ho chi minh to siem reap was very tiring\nBus condition was hopeless and it stopped in between becuase it ran out of petrol so they had to borrow some petrol to kerp going.\nRest of the travel was good.\n\nI think tour should add flight from ho chi minh to siem reap instead of optional because people get double minded"},{"rating":"5.0","review":"Excellent tour, all of our tour guides were good. Loved vietnam and the temples in Cambodia. \nWould highly recommend the tour."},{"rating":"4.5","review":"The guide in the Mekong Delta did not speak a word of english and did not know any history at all. We also were not able to see the caves which was on the itinerary. Other than this it was fanatsic"},{"rating":"5.0","review":"Although we experienced a few minor irritations they did not impact on the enjoyment of the tour. The initial communication regarding the pre planning and all the tour information ... given the difference in time between us and Vietnam was excellent.\nAll the tours and the guides that escorted us more than fufiled our expectations.. In particular,Bau was a mine of information and was able to answer our\\numerous questions. \nEveryone we encountered was courteous and friendly  and went out of their way to provide assistance despite on a couple of occasions there being some language barriers in the hotels.\nThis was a thoroughly enjoyable tour.. well organised and good value for money. I have no hesitation in recommending Hoi An express to any one planning a trip to Vietnam and cambodia."},{"rating":"3.5","review":"1. Accommodation- check to make sure all accommodations are at the standard as advertised and equivalent to the price paid. Some hotels did not have working restaurants, mini bars, etc. as advertised. Someone needs to be on ground to check the quality of each hotel frequently. \n\n2. Transportation - mini van transportation was fine. We had a late pickup at the bus station because the driver fell asleep. The bus was horrific! It was dirty, hot, cramped, and offered no WiFi (as advertised). We also had to switch buses which we were not told until halfway into the journey and the bus company put us in separate seats. We eventually switched, but I would not recommend this bus company. In addition, the staff was rude and could not answer questions in English. \n\n3. Guides - it was very, very difficult to understand the guides. They were not knowledgeable about the areas and we bought books and searched the internet in order to learn more information. The only exception was Bao in Ho Chi Minh City as his English was fluent and he shared a lot of information about the area. \n\n4. Itinerary - although it is nice to have free time, I would rather have full days instead of half days in order to see more. \n\nWe felt the price was high for the service we received."},{"rating":"4.0","review":"Wasnt keen on breakfast at location in Cambodia...too msny flies and coffee not good.Staff english at restaurant very poor so gog requests wrong.I got an omelette with only chillies!"},{"rating":"4.5","review":"The only thing that held me back from giving our itinerary and this whole tour an excellent rating was a horrible incident in Cambodia at the floating villages where we saw what was out-and-out animal cruelty. This was not the fault of Hoi An Express, but it put a damper on the last bit of our tour & I wouldn't encourage anyone with a real love of animals to do the large floating village on Tone le sap lake. Other than that we loved the tour. All our guides were excellent- including Sun in Hanoi, Bau, Hong & Peah in Cambodia. Accommodation was great( Ho Chi Minh was a little cramped  but it's a big city so we didn't expect much). Hoi An Express were excellent to deal with. A gentleman on our tour lost his jacket with bank card in it so we emailed Jenni at Hoi An as soon as we realised and she was on the phone to his emergency contact in Australia straight away. Communication break down did occur a few times, but it all seemed to work itself out. Overall we had a great holiday with Hoi An Express"},{"rating":"5.0","review":"A little confusion at first, pickup greeter was not visible and I went to Visa line instead of greeter going to line (for me) in Hanoi.   Overall an excellent tour, very pleased with company.   The hotels varied, some in my group had issues with various smells and etc., but I was well pleased overall.   Hoi An was quick to respond, and I found an additional tour available in Da Nang area which they were prompt to arrange as an add-on.   There was ample down time and lots of little extras, from learning about silk worms to tasting Snake Wine.   The cans were nice, cold water always available except Cambodia portions, guides often had towels and understood humidity/heat could be eased with thoughtful touches.   This was a great value, I was solo, recommend for any traveler."},{"rating":"4.5","review":"A full itinerary that ran like clockwork. Pick-ups and tours were always right on time and definitely underpins seeing the most of the countries in the time available. There is some down time slotted into the trip, but be aware, there is by necessity a lot of travel time. We went for 3 star hotels which were all absolutely fine, but you can't avoid the noise when you stay in Hanoi and Saigon whatever hotel you stay in. In summary, no hesitation at all in recommending the tour company, but remember it is a tour not a relaxing holiday!"},{"rating":"5.0","review":"A truly terrific tour. Perfect mix of having items planned and having free time to do what it is that you want to do. No idea how Hoi An Express can do SO MUCH for you on the amount you pay. Would totally recommend and do another tour with them in a heartbeat."},{"rating":"3.5","review":"Great time had by all, 6 in our group.  The guides were all knowledgeable but their English varied and was quite incomprehensible in some instances.  I got bored with asking him to repeat things or explain again, others didn’t grasp it either.\n\nBut everyone was v helpful and attentive\n\nIn Cambodia the trip out to the floating village was actually a long boat ride out to a floating mini zoo where animals were kept in terrible conditions. Europeans, and Americans won’t be pleased. Either don’t go, or get them to improve their act!"},{"rating":"4.0","review":"Nice stress free fully organised tour with some great and very interesting guides.\nJennie was very quick in responding and helped to sort out delays or other little issues, one email to her and she rearranged everything which made the holiday a lot less complicating and a lot more enjoyable. Great group size as well"},{"rating":"4.0","review":"We customised the 14 day tour by adding a week in Laos and extra days in some of the cities and a few flights.\nHoi An Express were excellent, everything worked like clockwork and if we did need to get in touch they responded immediately. If we had to change anything I think we might have left out Da Nang as we were a bit underwhelmed by the beach and the city.\nThe 3* hotels were excellent on the whole especially the City River in Siem Reap.\nOn the whole would recommend this excellent tour and tour company"},{"rating":"5.0","review":"We had an amazing trip! Expected to be in a ten person group! However it was just myself and husband that worked just as well for us!! Great tours! Absolutely no hidden extras! Lovely tour guides! Very informative and fun! All accommodations were lovely and we especially loved Siem Reap! Advice watch what the natives do crossing the road in Hanoi and Ho Chi Minh City and you will live to tell the tale!!! Would highly recommend this trip for fun and value x Apollo and Lorraine Rossides."},{"rating":"3.5","review":"My friend and I booked the ​14 Days Best of Vietnam & Cambodia​ tour by Hoi​ An Express in December 2018 (3 star option).  \n\n​Pros:\nThe tour has a solid itinerary, highlighting each region of Vietnam as well as Siem Reap area in Cambodia. The price for the 3 star option was very reasonable and most hotel options were sufficient  - good locations, clean, good breakfast, quiet (with the exception of our hotel in Ho Chi Minh City).  All tour guides were fluent in English and happy to answer our questions. \n\nCons:​\n​Communication coming from Hoi An Express needs improvement.  Leading up to the departure there were many emails from Hoi An Express requesting bits and pieces of information - some which I had provided earlier, and some information which I already provided to Tour Radar directly.  Communication needs to be streamlined to improve efficiencies and minimize the chance of mis-communication. \n\nAmong many of the communications, we learned the day before our Ha Long Bay cruise that our cruise boat would be different from the itinerary provided.  While we didn't think too much of this, it seemed to be a trend for the rest our the tour.  We were informed our hotel in Hoi An would be \"upgraded\", and while an upgrade is always nice, the new hotel was quite a way out of town.  Our original hotel was steps from the city core and we had researched and created plans based on the original location. \n\nBe warned - the \"free\" item of clothing in Hoi An is a scam.  There were limited items to choose from for free.  Additionally, I felt a bit pressured to buy something from Ann Tailor.  There were so many tailor shops in Hoi An that it would have been preferential to be given time to look around, check our different stores and then choose a tailor which met our needs.  \n\n​The hotel selected for us in Ho Chi Minh City was very poor .  The hotel, Hoang Ngan Hotel, was outdated, cramped room, found hair all over the floor, smoke smells waft into our room and noisy.  When we provided this feedback to Hoi An Express, they responded defensively claiming we were given the name of the hotel prior to the trip and could look it up online.  This wasn't the point of us providing feedback - it was so that Hoi An Express could consider booking a different hotel in HCMC for future tours.  \n\n​Lastly, I thought we'd see more of Ho Chi Minh​ City itself - the excursions to Mekong and Cu Chi Tunnels were good, but for 3 nights in Ho Chi Minh, I expected more time in the city.  \n\n​I hope this review provides insight for future travellers.\n​Cheers"},{"rating":"4.0","review":"very nice tour, good itinerary: highlights ot the country (north / center / south) and angkor temples, good Price, good 3* hotels, most of them downtown, small groups, good guides"},{"rating":"3.0","review":"Communication needs improvement. Without a guide that travels with the group there is lack of continuity. To compensate for this the local guides need to receive and communicate the agenda as guests arrive. This was done in Siem Reap and this seemed better organized. The hotel in Ho Chi Minh City was substandard, even for a 3 star property.(Icon 36)  We had to pay extra to get a room with a window in it and it still smelled like mold. Hotels in Vietnam are very affordable. There was no need to put us in that dump."},{"rating":"5.0","review":"Took the 3 star option. All hotels were good quality, clean and central with helpful staff. Ha long bay was an amazing way to start the tour. Tour of Hà Nội was limited to Ho Chi Minh morseleum and presidential palace grounds. Not able to get inside morselium as closed for annual maintainence, would have been good to have seen a bit more of the city, even if only from the mini bus.\nOur tour Guide for da nang and Hoi An was Hung. He was amazing, really informative and friendly. The foodie bike tour was great fun and enjoyed all the food. Only suggestion would be to spend a bit more time in the countryside on the bikes. \nAgain we had a great tour guide in Ho Chi Minh city, Lam. She was also really friendly, informative and fun. Massive difference from the Hà Nội city tour, felt like we’d seen more of the city and lam was very flexible to our requirements.\nMain reason for Siem Reep was the temples of Angkor wat. Tour guide not up to the same standard as Hung or Lam. When we arrived at the temples he said rather than going back for breakfast we would just stay and complete the tour. Probably worked out better as there were less crowds, but if we had known that we would not be going back to the hotel before the rest of the tour we would have brought bags with water, sun cream, hats, food etc.\nOverall the tour was really well organised, our guides were always there on time, or early. Would definetaly book a Hoi An Express tour again. Fantastic value for money.\nBooking experience with tour radar was also great. Loved the messaging system for updates and queries, very responsive and quick."},{"rating":"5.0","review":"This is a great tour, busy itinery but plenty of free time to explore at your own pace, hotels were well located and clean, we had the most amazing view in Ho Chi Minh, fab way of seeing the best of two beautiful countries. Would highly recommend. Foodie tour by bicycle great fun if somewhat terrifying!"},{"rating":"5.0","review":"The 14 Day Best of Vietnam and Cambodia trip run by Hoi an Express was Fantastic.  I enjoyed all the included tours and had at least half a day free at each city in which I could plan to do my own activities. I do suggest Travellers have a plan for these times but found that the local guides where able to direct us to good activities at each location.  We opted for the 3 star hotels and could not fault any of them on location or service.  They also provided an option to fly between HCMC and Siem Reap which gave us an extra half day at HCMC to take advantage of. We also booked the Water Puppet and Buffet Meal in Hanoi and were impressed by the quality of the buffet meal (a highlight of our trip) and the Bat Trang Pottery Village tour which we also enjoyed."},{"rating":"3.0","review":"I really would not recommend this tour company and theres a lot of detail i wish i'd known before i booked. I was solo traveller and that seemed to be a negative for these guys. They told me they wouldn't offer me any activities options because i was travelling alone and they don't do them for just 1 person. They then refused outright to provide any advice on how i could do the activities or visits at all. This is in stark contrast to other group tour companies. I'd just finished an Intrepid tour prior to this one and wish i'd continued with them. \n\nThe company are set up as a day tour company and for these longer trips they sort out the logistics of getting from place to place and the hotels. Otherwise its like being on a day/ half day tour for the things you do. There is no consistency and no one to ensure things run smoothly in-between. The tour guide is different day to day and not someone you can ask questions about the trip as a whole. They give you a local mobile at the start but its pay as you go, and after a couple of calls to their office it runs out and you have to pay to top it up to use it ( its an old nokia, not a smartphone).\n\nI booked the 4 star option. The hotels were generally 3 star level and were usually quite far out of city so you had to get taxi's everywhere. The hotel in Ho Chi Minh City was actually right next to the airport so 8 km out of city and they absolutely refused to acknowledge that this was a problem. I ended up moving to one in the city for 2 nights and paid for it myself. I didn't want the hotel to be the reason i didn't enjoy that city.\nThe hotel in Danang (Cecilia) was nice and next to the beach. Flower garden hotel in Hanoi was really unfriendly and unhelpful. I got terrible mosquito bites in their foyer waiting for my room. The Halong bay tour was great, but they're a different company that Hoi An Express buy from. My hotel in Hoi An was ok, a new hotel so slightly inexperienced staff but friendly, and again miles out from the city. They had a shuttle bus service but the times never really suited. The Siem Reap hotel ( Sokha Roth) was 3 star at best, not very clean and required a lot of prompting to get information to help me in the city. \n\nAlso, the \"free\" item of clothing in Hoi An is a scam. Its not like the pictures and you have to pay a lot extra for anything half decent. I went elsewhere and got something nice but the rest of the group were quite unhappy with what the got from Ann Tailor.\n\nProblem is i booked a group tour so that i would do the tour with other people around but the rest of the group were on a 3 star package and always in different hotels miles away so i essentially did the tour alone. \nThese guys have so much to learn about group tours for people from overseas. The established companies like Intrepid are much better and ensure your experience is good."},{"rating":"4.5","review":"Halong  bay cruise and Angkor Watt at sunrise"},{"rating":"3.0","review":"Felt like the accommodation could have been more central to tourist areas (especially Da Nang). Breakfasts at the hotels seemed to be orientated towards Chinese/ eastern tourists rather than western. The tour for Hanoi felt minimal as it was only 2-2.5 hours long and didn’t visit many places that were key tour sites, this was also the case for Da Nang. Ho Chi Ming, Hoi An and Siem Reap were fantastic tours. All the tour guides were fantastic."},{"rating":"4.5","review":"Halong bay was great but Angkor Watt was best"},{"rating":"4.0","review":"It was difficult at times when we didn't know what was happening. The bus ride to Siem Reap was a long trip and we were not told anything, like when to change buses, luckily another passenger told us we needed to change buses. The driver who took us all to the boat at Halong Bay did not explain anything to us. The guide (vanuk) who took us to Angkor Wat was excellent. The tour to the floating village was pathetic, we were taken to a floating shop only and not shown the floating residences nor did we have any interaction with a village family."},{"rating":"5.0","review":"I loved the tour, everything was amazing and so well organised. I particularly enjoyed the time spent in Hoi An. The accommodation was fantastic, the guide was brilliant and the atmosphere of the town was lovely."},{"rating":"4.5","review":"Amazing experience and surprise on by b'day 17/3/18. I received cake from TourRadar   which was left in the reception when we returned from daily activity and we had absolutely amazing cake share/cutting and eating with all my group members. It worked a great treat and I will never forget that lovely surprise and happiness it caused. It was delicious and most beautiful cake I ever got in my life.  \nYou are stunning guys, keep a great work you do. Best tour ever!"},{"rating":"4.5","review":"We really enjoyed this tour and felt it packed a lot in for the 14 days, making it very good value for money, particularly at the offer price. There's quite a lot of city time - watch out for mad motor bikers on pavements - and some very obvious tourist stops, but the activities were very varied and there was also some free time. The markets and temples were amazing although I wasn't so sure about the floating village being treated as a tourist attraction as it appeared that none of the money generated was going to the people there.\n\nWe stuck with the three star hotel options and they were all perfectly adequate, all with comfy beds and in good locations. We particularly liked the hotel in Hoi An and the lovely City River Hotel in Siem Reap.\n\nFood was good. I like trying local dishes and my partner is strictly meat and potatoes, no spice, but we both found plenty to suit our very different tastes. \n\nOur guides were excellent. Dung in Hanoi was super, and Dong, Ming, Bau and Sophea all looked after us very well. Yes a couple had quite strong accents, as you would expect from a local company, but they all had great local and historical knowledge and I felt I learnt a lot about culture and life in those two countries.\n\nHoi An Express are a great company to deal with. From the very first day they answered emails quickly and always let us know about any minor changes to timings in the itinerary in good time. We pretty well stuck to this itinerary but other people we crossed paths with on our travels told us they were very flexible in adapting arrangements if you wanted. The Vietnamese phone they provided was a very thoughtful accessory.\n\nWith the amount of development going on, and pollution from diesel fumes and plastics, I would really recommend going to this part of the world sooner rather than later. I hope they develop more ecotourism before it's too late. Definitely go though, you'll receive a warm welcome, especially in Cambodia, and it's a fascinating part of the world."},{"rating":"4.0","review":"This is a good tour if you wish a fairly relaxed and cost effective approach.  Generally, we had about 1/2 every day of free time.  The highlight for us was Ha Long Bay:  beautiful, very nice boat.  The two nights we spent in DaNang were not too interesting, except for the visit to My Son.  Hotel in Hoi An was delightful(we were using the 3 star option).  The custom tailor coupon was actually very nice addition.  The hotel in Saigon was pretty ragged--would definitely upgrade on that one.  Otherwise everything was good.  The guides were always helpful, but not quite up to what you would find on a larger tour group--ours was only 5 people.  There was only one screw up on the trip when, in Da Nang, the driver took us to international vs domestic terminal which caused us some heartache due to time factor to check in.  "},{"rating":"4.5","review":"From the first moment we contacted them to the final farewell of our holiday, Hoi An delivered. This is quite a full on itinerary and you can expect some early starts and quite a lot of travelling. Hanoi as a starting point was a bit of a shock to the system due to the traffic and madness of the motor bike riders but you got used to it and other stops were much more pedestrian friendly.  We might have liked a bit more time in out of town locations but there's only so much you can do covering so much ground in 14 days. \nAlthough the welcome on the first day didn't happen, the hotel looked after us and passed on itinerary information; all other transfers and pick ups went like clockwork, we were well notified of any slight changes to timings and the staff - admin, hotels and tour guides - were all great. Yes there were a couple of guides with quite heavy accents and not quite perfect English but that's what you can expect when travelling with a local company. They all had good local knowledge, we felt we learnt a lot, and they went out of their way to make our holiday a success.  \nThe three star hotels were all perfectly adequate and in good locations. (If we were doing it again, we might consider 4 star in the bigger cities.) We particularly liked City River Hotel in Siem Reap where the welcome from the staff was exceptional. \nThere was variety and some slots for free time - if you had the energy!  You need to be prepared for some poignant reminders of the region's history and also some very stark contrasts between rich and poor. The region has a long way to go in terms of balancing the needs of the local people and the environment with a growing \"selfie mad\" tourist trade but if you're going as we did to see new sights and sounds, try new foods and experience a different culture, you won't be disappointed.\nWe would happily recommend Hoi An as a company. They are a good sized, well established company who clearly know what they are doing. The attention to detail was good, e.g., the provision of a local SIM card mobile phone to be able to contact them 24/7 whilst in Vietnam. \nWe took one of the special offers on this trip and would say at that price it was exceptionally good value for money. "},{"rating":"4.5","review":"The trip fulfilled our expectations. Good with local guides. Accomodations were good. Hoi AnnExpress service was ontime on the whole trip. "},{"rating":"4.5","review":"We had the most amazing trip! Tour Radar and Hoi An express were fantastic. The hotels were good and all in great locations. Our expectations were fairly low considering the price we paid and were exceeded on every level. there were NO hidden expenses or costs and the tour guides were great and informative. we were lucky to have a great fun group to be travelling with and we were all likeminded which made everything easy. I can truly recommend Hoi An express and would definitely book with them again. Tour Radar were also very helpful when I had a few technical issues and sorted my problems out straight away.  One very Happy Customer. "},{"rating":"4.5","review":"We had the most incredible time. we were looked after very well and Hoi An express were great.\nthe guides were very good and always on time and spoke good English. We were with a fab group of likeminded people and that really made the trip fun. We saw so much in such a short time but it was really well organised and i can speak highly enough, especially considering what we paid (it was a half price deal) the hotels were fine, 3 star but in good locations and the last one in Siem Reap was fab with a pool and we had some time to chill. Thanks Tour Radar and Hoi An express."},{"rating":"5.0","review":"The trip was wonderful! Guides were excellent, accommodations and meals were all very good.  The itinerary was very thorough giving a good taste of Vietnam and Cambodia sights, food, culture.  "}]},{"name":"4 Days Private Hanoi Tour with Halong Bay Cruise , Max 6 Guests","reviews":[{"rating":"4.0","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"4.5","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"4.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"Trekking Fansipan and Mu Cang Chai Tour 5 Day","reviews":[{"rating":"4.5","review":"I had an absolutely wonderful photography and motorbike tour with Zonitrip in October this year! You will be extremely lucky to have a guide like Nghia, her professionalism, flexibility, patience and dedication to my needs were beyond my expectations. This was my second tour with Zonitrip and will definitely my prefer tour operator when I plan for my next trip to Sapa and Hoang Su Phi. Highly recommended!!!"},{"rating":"4.0","review":"The cost was not proportionate to the tour. Many others paid a fraction of the price charged by tourradar."},{"rating":"5.0","review":"We had an excellent guide who made sure we did all the trekking we could do and made sure we had very good accommodation and vegetarian food that was amazing. The hosts at the homestay were very warm and accommodating. Awesome experience overall."}]}]