[{"name":"Essence of Vietnam 17 Days ( Hanoi/Sapa/ Halong Bay/ Hoi An /Phu Quoc)","reviews":[{"rating":"4.5","review":"I and my wife had a wonderful trip to Vietnam organized with the team to add an additional 4 days onto our tour. \nDat and his team were brilliant to deal with and did and an amazing job accommodating for our request to extend the tour and also to meet my husband dietary requirements.\nThe local tour guides were great and provided great information and were very helpful. \nThe hotels locations were fantastic and close to everything. Again, We had a fantastic time and hope to travel with S Viet Travel - Realistic Asia again in the future,"},{"rating":"5.0","review":"Excellent travel itinerary to Vietnam with 24hrs support, great hotels provided. Thanks Minah for your support throughout the tour and making it a memorable family vacation."},{"rating":"5.0","review":"Me and my friend had a 9 day tour in Vietnam in January this year...It was absolutely fantastic from the first approach of my travel referent from S Viet Travel , Ms Minah. She helped us made some changes with tour and still have plenty of time for us doing our things.  We could not have been more pleased."},{"rating":"5.0","review":"It’s a good tour if you don’t have much time to explore Vietnam, you get to see a lot of what Vietnam is about"},{"rating":"5.0","review":"Deep into culture and boarden my mind a lot on this tour. We met many mind-like travellers and listened to many good stories from our guide Hannah. She is so good that no words can describe. Everything is great except for the lady in Hanoi  hotel, but then it's not a big problem at all."}]},{"name":"Vietnam Discovery in Depth - 17Days","reviews":[{"rating":"4.5","review":"Very good first experience This was our first time traveling with Legend and Tourradar and we would surely recommend it to all of our friends. Everything went very smoothly and was carried out by really friendly local Tourguide of Legend Travel staff like e.g. Tony."},{"rating":"4.5","review":"Very accommodating with changes due to weather conditions and made all changes on the spot.  This style of tour is great if you don't want to be a part of a tour group. All guides are helpful and nice.  "}]},{"name":"Stopover Vietnam Tour Highlight - 8 Days","reviews":[{"rating":"3.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Sapa Trekking & Sightseeing: Sapa - Laochai - Tavan - Catcat - Sinchai - Ma Tra - Ta Phin for 3 Days 4 Nights","reviews":[{"rating":"4.0","review":"Very nice tour with amazing guide. Although I wouldn’t rate it HARD hiking, it’s medium and some walking on the main roads. But overall a great experience with super helpful guide “Lu” and tour operator “Trang”. They were beyond helpful and professional."},{"rating":"4.0","review":"Very well planned, thank you"},{"rating":"5.0","review":"Do not hesitate to take this tour! We have an awesome experience with Crossing Vietnam Tours! Everything was well organised and Lucy(Hanoi office) was always available and ready to help! The ride in the night train was smooth and the trekking wasn't at a hard pace.  We had an excellent time walking through the rice fields!\nWe highly recommend to also take the Fansipan cable car(if you're not afraid of heights.\nOverall amazing experience with TourRadar and Crossing Vietnam tours!"}]},{"name":"Spectacular Sapa - 3 Days","reviews":[{"rating":"2.5","review":"Pick up was nearly two hours late which meant our first day tour was cut short. 20 mins late doesn’t equate to  early two hours.\nTour guide was good.\nHotel wasn’t the hotel they initially stated when I asked them.\nCollection for return was horrendous too the staff were telling us one thing on the phone and then a motorcyclist turned up and told us that the tour agent had requested we get on the back of motorbikes to get to the bus. We obviously didn’t go and luckily reception staff told them we will not be getting on the back of motorbikes with our luggage.\nReally annoyed with this tour agent, gives you a bad impression on Vietnam."}]},{"name":"5-day Explore Ha Long Bay and Sapa Highlights","reviews":[{"rating":"4.5","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Legendary of Vietnam 19 Days","reviews":[{"rating":"5.0","review":"I've got a trip with Mr.Danny and it was an amazing time! Da Nang's great but I love Sa Pa! Will be back soon! "}]}]