[{"name":"Vietnam Experience - 12 Days","reviews":[{"rating":"5.0","review":"Absolutely amazing tour really well coordinated by Mike from G Asia. He was available at anytime, came to meet us personally & adjusted any alterations we wanted to the purchased tour. Couldn’t recommend Mike & Go Asia highly enough."},{"rating":"5.0","review":"We have just returned from a 12 day tour of Vietnam organised by  Go AsiaTravel . We had a really interesting, well organised trip we were looked after from arrival to departure, nothing was too much trouble and our enjoyment was paramount.We stayed 1 nights on cruise. The whole experience was awesome . The trips were very varied and our guides gave us all the information we required. Transportation around by car was faultless. guides and drivers were always very punctual, polite and considerate. I highly recommend this company to anyone wanting to see Hanoi and enjoy the experience."}]},{"name":"Vietnam Highlights","reviews":[{"rating":"4.8","review":"Happy with the itinerary, was an very fun trip. Josh was awesome. Really chill, nice guy, super helpful and knowledgeable"},{"rating":"5.0","review":"Knowledgeable, and answered all questions, very up beat and goo to be around"},{"rating":"4.5","review":"For doing a highlights trip, it showed enough of Vietnam for me to want to come back. Amazing value, lots of to see, great adventure. However I wish we had another day in Hue. Less than 24 hours in a city is barely a taste. Aaron was a great tour leader for the whole trip. He had great insight of the areas we visited or went through and helpful advice for being grateful to the locals. He got us where we were supposed to, but treated us like friends."},{"rating":"5.0","review":"My trip to Vietnam was fantastic! Laura our tour leader was very knowledgable and helped point out all the local spots for eating and buying souvenirs to take home. Tucan offered a good balance of guided and free time throughout our tour, so you didn't feel like you had to be with the group all the time. For the price you pay it is well worth the money to take the pressure of having to organise everything yourself, as well as making new friends from all over the world!"}]},{"name":"Mekong delta and Da Lat 10 days 9 nights","reviews":[{"rating":"4.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.5","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"5.0","review":"Do it! Great tour, very authentic."}]},{"name":"5-day the charming North of Vietnam: Hanoi - Ninh Binh - Halong Bay","reviews":[{"rating":"4.0","review":"Guides were very friendly and welcoming. Tour bus from Hanoi to port was relatively new, clean and comfortable. Boat like many others in the bay was fairly old and a bit run down. Had a great view from the top deck. The lock on our room broke and we needed to be moved to another room, the shower in the new room did not drain water so well. The tour packed in a lot of activities over the three days including a cave visit and hike up Ti Top island. Expect to pay for all drinks on the boat and corkage fee to bring your own drinks. Cat Ba island hotel was nice with a great view of the harbour and only a short walk to town. The hike included on Cat Ba was quite strenuous but the view from the top of the mountain fantastic. The trip to monkey island on a small boat off Cat Ba was cool - the monkeys can get a bit agitated, and are experts at raiding back packs, zippers pose no problem for them. Overall a lot of fun was had on the tour and it was well organised and the guides kept the group busy."},{"rating":"4.5","review":"The tour was a great overview of the life and industry on the Mekong Delta. The bus was comfortable and the tour guide very knowledgeable. It was a very on the go tour and long distances made the day tiring. We did not arrive at our homestay (we chose the homestay option - there was a hotel option) until quite late. But the homestay, while at first seeming quite isolated and off the beaten track, actually had about 25 other tourists also staying there. The highlight was the cooking lesson for dinner and then eating all we had cooked. All in all, a great overview, but long distances to travel."},{"rating":"4.5","review":"The tour guide and staff were excellent. The food was good. The rooms were great. Pick ups and drop offs smooth. I can say only good things about the staff. Their sense of humor and duty to their jobs was above board. The only problem I had was with how many other tours and tourists were doing the same thing at the exact same time."}]},{"name":"Vietnam World Heritage Luxury Tour 10 days 9 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.5","review":"Do it! Great tour, very authentic."}]},{"name":"Highlights of Vietnam 08 days 07 nights","reviews":[{"rating":"4.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"5.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"3.5","review":"Do it! Great tour, very authentic."}]}]