[{"name":"Sapa Adventure (3 destinations)","reviews":[{"rating":"5.0","review":"Cut short by Covid-19 otherwise Perfect"},{"rating":"4.5","review":"We had an amazing group and a great tour guide, Ngoc wanted us to have the true Vietnamese experience. Our dinners together were all amazing. Food was one of the highlights of the trip. On a tour where the country was beginning to shut down to tourists, he did an amazing job of keeping positive and continuing to share his knowledge of the country he calls home. Intrepid was not advising him about the changes that were coming down due to the COVID virus and so he was unable to answer our questions about parts of trip that were to be cancelled such as Halong Bay. Once the tour was cancelled Ngoc was concerned for our wellbeing and flights home. I will return on my credit received from Intrepid."},{"rating":"5.0","review":"Amazing trip! We travelled to Sri Lanka in August/September 2019 and had a great experience with Step Lanka and our...\nShow more"}]},{"name":"Vietnam - North to South 10 days (incl. 1 free data sim card + entry to the Artinus 3D Art museum)","reviews":[{"rating":"3.0","review":"Could of offer better hotels."},{"rating":"5.0","review":"Great from start to finish, everything we did was amazing, every pick up and transfer was on time, sleeper train, plane and Halong bay cruise all were on time.\nThis tour was so well organised , met some great people, thank you tour radar and also thank you ms Lan and ms duyen your communication from initially booking the trip to the end of our tour was amazing "},{"rating":"4.0","review":"I thought everything was well organized however I was led to believe we would be part of a group of people for the whole trip which we were not. We were deeply dissapointed by this. I would like to book a tour around Australia with this company but I would like to be guaranteed that I will be staying with the same group of people."},{"rating":"2.5","review":"Vietnam Adventure Tours contracted out the tours in different cities to different tour groups - so it's hit and miss. The highlight if the tour is Halong Bay. The worse part of the tour was in Hanoi. The guide was barely comprehensible and fellow travellers remarked he looked like he doesn't enjoy his job. I was the only person who tipped him, and it was out of symphaty. As the tours were conducted by different companies, we visited the tourist traps- the lacquer painting places at least 4 times in different cities!! The Ambassador hotel in Ho Chi Ming is filthy . Sheets were clean but housekeeping didn't change the duvet covers!!!  There's no explanation of interesting sights along the way- explanation is given only about the sites visited. Also no help offered about places to shop or eat. I asked the tour organizer about places to eat and was told to refer to the hotel!"},{"rating":"5.0","review":"Everything about this tour was fantastic. The places that we visited were phenomenal (Ha Long bay was a highlight), the accommodation we had was excellent for a three star option. Included meals were delicious. The tour guides we had were information, humerus and accommodated all our needs. The length of the tour was also perfect. We liked that there was time to do our own things within this tour as well, as this gave us the chance to explore places we wanted to see. It was nice to know that everything was all organised in regards to transport and day tours.\n\nI coordinated all the booking with Ms Duyen Dao - I just want to say a big thank you for all your help! She was absolutely fantastic throughout the entire process from start to finish. She was even able to organise an additional day tour for us with one day notice when we were in Hoi An. She was easy to communicate with and even had special details organised for us for our anniversary during the tour. \n\nI would highly recommend this tour for anyone thinking about going to Vietnam. Very good value for money, and lots to see and do."},{"rating":"5.0","review":"It was so busy filled with exciting and informative day trips. The tour guides and most of the hotel staff spoke English really well and were very very helpful"},{"rating":"4.5","review":"We had an amazing tour experience with Vietnam Adventure Tours! All our guides were fantastic! King Kong in Ha Noi was so fun and informative! Thi in Ha Long Bay was also fun and excited for us, Mango and Vu in HCMC we so vibrant and fun! For our first organised tours this was great, all activities were informative and fun and were always on time! Ms Duyen and Ms Lan were both great with communication and confirming everything to perfection! Hoi An was the highlight for us with the beautiful ancient town full of tailors and lovely people! Will definitely book again with Vietnam Adventure Tours"},{"rating":"4.5","review":"The Tour was fantastic.It was very well organized and informative.The hotels we stayed in were good especially the staff in these hotels who were very polite and helpful. Halong bay Cruise was the highlight of our trip.All the tour guides on our day trips were great too. I would deffinately recommend Tourradar. Thankyou so much for making our Vietnam Holiday Awesome."},{"rating":"4.0","review":"Great tour, would ve liked more european food included, would alsove liked to tour with the same group of people everyday asnow we had a dif. tour leader and people on the bus every single day so you don't get to know anyone. Tour was. really great though and tour leaders where excellent. The transport was absolutely great aswell as they were on time every single day! Would recommend tour radar to anyone."},{"rating":"5.0","review":"The tour guides were friendly and excited about their country - plus as they were local, really knowledgeable. I loved all the locations and Vietnamese people.  We had a fantastic time and would recommend Vietnam Adventure Tours! \nThanks for a great holiday"}]},{"name":"Vietnam Adventure Tour","reviews":[{"rating":"3.5","review":"The trip was well organized .. the hotels they picked were nice ... the only comment I would say to improve the trip is to give people an option to do the Day Tour of Angkor Watt on the sunrise tour at 5am to avoid the VERY LARGE CROWDS..."},{"rating":"4.5","review":"I really loved this trip, we had very stylish hotels and they all with this Indian style what made it a unique experience. The temples, palaces, Taj Mahal were absolutely breathtaking, the culture was so different and I enjoyed the food so much. Our guides were knowledgable and I always could ask for some advise. The trip was very active so I was really grateful when we flew to Goa and I finally could relax, though I was a bit disappointed that we had just 3 days on the beach and had to fly back home!"}]},{"name":"The Best of Vietnam","reviews":[{"rating":"5.0","review":"I can represent the place as \"The Best of Vietnam\". The Golden bridge of Vietnam which is located at Ba Na Hills. The huge bridge placed in giant arms. Truly, the Best place to visit in Vietnam!"},{"rating":"5.0","review":"I had booked the tour with Threeland Travel in the back of May-2019. They gave me luxurious facilities with comfort. Thank you!"},{"rating":"5.0","review":"Had a great journey to Golde Bridge. You can see the beautiful and romantic panorama of the mountains. The best time for visiting is in the daytime on sunny days. Inside the campus, there are many restaurants ideal for taking virtual photos."},{"rating":"5.0","review":"Thanks for Everything!\n\nPeter and I just wanted to say a big thank you for all your help with our holiday. We really appreciated it. Everything was just perfect. We had a wonderful holiday. Thank you so much again !\""},{"rating":"5.0","review":"A friend of mine recommended this tour. We did it and realized why my friend enjoyed it. Threeland Travel is a fantastic tour operator. A wide range of options with flexible budgets is offered to you.  Special thanks to Ms. Jane for her efforts to answer any concerns I had and make our trip very perfect in all respects. The accommodation and the vehicles were very satisfactory. The food was also tasty, we gained weight ​3 kilos after doing this tour - what an amazing thing!"},{"rating":"5.0","review":"excellent services! Would recommend this company"},{"rating":"5.0","review":"Very well coordinated, using local tour guides. Itinerary was well communicated and was followed accurately.  Most tours were great but had to wait up to 45 minutes to pickup in the morning.  Also few of the guides included visits to tourist shops instead of more time at sites.  Overall great time!"},{"rating":"5.0","review":"An excellent tour from start to finish.  All we expected, wanted and more."},{"rating":"5.0","review":"It was lovely being assisted by Threeland Travel when we have 2 kids travelling with us. They helped plan the itinerary, give nice suggestion of hotels for family. \nWithin 10 days, we had brilliant time exploring highlights of Vietnam with tentative tour guides leading us to captivating places. Tons of thank to the team!!!!!!! "},{"rating":"4.5","review":"Fantastic trip!\nThe guides were helpful and care to our need along the trip. More time in Hoi An should be added. \nIn general, everything was scheduled perfectly."},{"rating":"4.5","review":"Fantastic trip!\nThe guides were helpful and care to our need along the trip. There should be more time for Hoi An.\nIn general, everything was scheduled perfectly.  "},{"rating":"4.5","review":"We decided to contact Threelandtravel to organize a trip in the north of Vietnam, we booked a private tour to Tam Coc - Hoa Lu from Hanoi. \nEverything was clear and easy to organize, the comunication is fast and efficient.   \nOur tour guide was very kind and professional, the one day tour was very interesting and not too long or boring. \nI will recommend this agency. "},{"rating":"5.0","review":"I've traveled twice with Threeland Travel and I'm planning for the third one! friendly guides and organized schedule makes me trust this agency and enjoy my holidays to its fullest. definitely recommended!"},{"rating":"4.5","review":"Fantastic trip!\nThe guides were helpful and care to our demands along the trip. There should be more time for Hoi An.\nIn general, everything was scheduled perfectly. Keep up the good job!"},{"rating":"4.5","review":"First of all we have to say: \"Thank you so much!” \nIt was our first holiday to Vietnam and we got a lot of wonderful experience. The organization of our holiday was just brilliant. It was really amazing and without your help we would never have seen so much of Vietnam: lovely & helpful people, awesome & breathtaking landscapes and rich & diversified culture. Really enjoyed the trip. \nYou did a really good job!\nThank you very much again!"},{"rating":"5.0","review":"One of the best trip we have ever enjoyed. We fall in love with Vietnamese people, stunning destinations, delicious food.. Everything was perfect.\nThank you very much David & Threeland Team who operated a memorable trip for me and my wife. "}]},{"name":"10-Day Relaxing from Ho Chi Minh city to Hanoi with Phu Quoc island & Halong Bay (FREE 1 DATA SIM CARD)","reviews":[{"rating":"4.5","review":"I could not fault the tour operator Ms Duyên Đào, she ensured that the drivers were on time for pickup and that the rooms were available and good quality.  Any problems she was of great assistance.  All the tour guides spoke good English and were very helpful.  I would highly recommend this company for any tours of Vietnam base on my experience with them."},{"rating":"4.0","review":"In overall it was a good tour. Vietnam adventure tour team did all their best to keep this tour as smooth as possible. I should say that the Vietnam adventure tour outsources the activities for their tour. It means that you will have a new tour guide and will be part of a new team every day.  Tours in Ho Chi Minh city and Pho Quoc island were organized very well but Hanoi was a disappointment. Hotels were good. Breakfasts in all hotels were really nice. Let's have a look on tour day by day. \nDay 1: Arrival. The taxi collected us from the airport, took us to the hotel. No problem.\nDay 2: we were collected from the hotel on time and instead of taken for the city tour were taken to Cu Chi tunnel. The tour guide was a bit lazy, he could give more information about the tunnel. He focused a lot on his own life during the war. After the tunnel visit about 15:00 we were back to the city and had a little time for city tour. We had to remind the guide what was in our itinerary for the day. At first, he only wanted to take us to Independence palace but we pointed to him that we have more than that.  \nDay 3 and 4: Mekong Delta tour. This was the highlight of the tour. The guide was EXCELLENT! Plenty of activities to do. We were part of a big group (44 people) but guide paid attention to everybody. At the end of day 4 we had to travel by public transport on our own. We were promised by Vietnam Adventure tours that travel guide will put us on the bus but this did not happen as he had to take other people back to Ho Chi Minh city. He booked bus tickets and taxi to the bus station for us but we had to collect tickets and find the right bus ourselves. So be prepared :) !\nDay 5 and 6: Travel to Pho Quoc Island -No problem. Problem was that guide could not speak English very well and we were part of Vietnamese tourists group. We did not get much information about the places we visited on Pho Quoc island but there were plenty of activities to do.\nDay 7: Arrived in Hanoi. The taxi collected us - no problem.\nDay 8 and 9: Ha Long Bay tour. We were told that we will be collected from our hotel at 7:30. This did not happen! We had to contact Vietnam adventure tour office twice in order to find when we will be collected. We were collected at 8:40!!! 1hour 10 min late. It would be good if we could be informed about the timing better. Even hotel staff was asking us if they could help to sort out the situation. Activities during the Ha Long bay tour were good. Overnight accommodation was surprisingly good. Meals were delicious. \nDay 10: Departure. This was stressful! We were told by Vietnam adventure tour that they arranged a taxi to take us to the airport at 17:00. The taxi was LATE AGAIN! It arrived at 17:20 after several calls to Vietnam adventure tour office. We even started booking Grab taxi ourselves. Staff at the hotel reception said that it is better to allow about 3 hours before the flight for comfortable arrival at the airport. Our flight was at 20:25. Traffic is really bad in Hanoi. It took us about 1 hour to get to the airport  (airport 13 miles from Hanoi old town area).\nThis tour could be excellent if the transportation in Hanoi would be better. But anyway we should say a big thanks to Vietnam adventure tours for the great service. I would advise to book this tour to my friends without hesitation."},{"rating":"4.5","review":"I am so glad we booked with #Vietnam Adventure Tours through #Tourradar. It was an unforgetable trip!! We saw so much and did so much!! We truelly exprienced the country and their culture!! Our tourguides went out of their way to make us feel comfortable and enjoy it "},{"rating":"4.5","review":"A great tour that gave us some good insight into Vietnam. It's a crazy place, full of amusing contradictions with very friendly people.\nThe tour itself was very well organised, everything ran like clockwork. We felt well looked after, with fun guides to show us around.\nThanks Tourradar and Adventure Tours Vietnam!"},{"rating":"4.5","review":"The tour was well planned and it was very easy to get a hold of them with any questions throughout. There was a nice balance of free time and planned tours. Would have liked to stay with the same guide/group for the whole trip. The quality of the guides wasn't consistent. With the exception of one hotel, all the accommodation was EXCELLENT.\nOverall, would do again!"},{"rating":"5.0","review":"I had a great time in Vietnam. Just 3 days before i  came to Vietnam i had searching some travel company in Tourrada  Website and I chose Vietnam Adventure Tours. At the first email I very impress to their good consultant attitude. They showed me some tours suitable for me . Beside, they had also recomments some special place which I have not seen in any companies else. I was satisfied with guide. Ms Vu awesome. She very friendly, knowledge and always on time everyday. I had gained a lot of exciting infomation about histoty and culture of Vietnam. Furthermore, i quite enjoyanable to acommodation, transportation and destination too. I really wanna return Vietnam again to explore somewhere not come there yet. I am very happy with all of service Vietnam Adventure Tour brings. Worth the money."},{"rating":"4.5","review":"if you want to see all the faces of Vietnam from the culture shock of Ho Chi Minh, the Backpacker heaven of Hanoi, off the beaten track through the Mekong Delta and the wonders of Halong Bay - then this is the tour for you. 10 days where every day holds a new Vietnam."},{"rating":"5.0","review":"This was a great tour with the perfect balance of sightseeing and relaxation. Every pick up was on time and the tour operator communicated with us very well - even giving me a SIM card to make communication easier. All of our guides were kind, well informed, and helpful. Hotels were very nice - we were even upgraded on two occasions. This is a great tour for the cost with most meals even being included. I would highly recommend this to anyone interested in a sampling of Vietnam - great tour!"},{"rating":"4.5","review":"Before arriving some doubts arose in my mind. Have I done well by getting a tour to Vietnam by web? But I had to tell tour thai this was one of the best trips and services we received during the 2 months we spent in different ansían countries! Always  in touch, caring and funny guides, beautiful scenarios... really  5 stars quality!"}]},{"name":"Northern Vietnam Escape: Sapa And Surrounds","reviews":[{"rating":"3.5","review":"Rhi is a fun, caring, knowledgeable host. She is an excellent guide who is able to give advice, supper and recommendations according to each person on her tour. Rhi made my Contiki experience unforgettable. Thank you Rhi!"},{"rating":"5.0","review":"The main reason I booked a tour was because I had no time or desire to plan a full itinerary for the places I wanted to go. Moreover, while on the trip I wanted to do as little work as possible to see and do as many things as possible! I can say with absolute certainty that this tour, especially with Jules as the trip manager, far exceeded my expectations! There was not a day that I wasn’t seeing amazing new sights or going on some kind of adventure. Aside from the trip itself, I felt like myself and the rest of the group were in great hands with Jules leading us through Asia. She was very thorough with briefing us with what to expect for the days ahead that nothing ever caught me by surprise! Even when unexpected things did happen, I am very happy that Jules was there to resolve any issue that came our way. I would 100% recommend this tour with Jules as the trip manager!"},{"rating":"4.0","review":"Jules was incredible! So friendly from the start automatically making me feel settled in. Everything was so perfectly organised and she knew something about everything. She also ensured if we needed help with anything at all she was there for us."}]},{"name":"Sapa Adventure: Hard Trekking for 6 days 5 nights","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Essence of Northern Vietnam 8 day","reviews":[{"rating":"4.0","review":"Thank you so much for everything you did to make our honeymoon great, we had an amazing 3 weeks! I left a Trip Advisor review for BestPrice and called you out, and I'm attaching the feedback form here. We enjoyed all the wonderful places and were very pleased with all the accommodations and how smoothly all the transportations went."}]},{"name":"Hanoi Stopover 3 Nights plus 1 Night on Paradise Elegance Cruises","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]}]