[{"name":"Hanoi Tour plus Overnight on Margaret Cruises 5*","reviews":[{"rating":"3.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"5 Day Small Group Hanoi and Halong Bay Tour Package","reviews":[{"rating":"5.0","review":"Lioncub tanzania is wonderful tour company. Actually the tour was so amaizing, we went serengeti and seeing migration of wildebeest, walking at Arusha nationa park, big herds of elephant in tarangire also tree climbing lions in Manyara and descent to the crater flow"}]},{"name":"NORTH & SOUTH OF VIETNAM 7 DAYS","reviews":[{"rating":"4.0","review":"The tour was great, however the booking through your site was misleading. I originally tried to book a room for three but your site told me that wasn’t possible so I had to book a double and a single room for an extra fee. On arrival I was checked into a shared room with three single beds, so it was possible to do this. I told the tour manager of my situation which they were not aware but managed to find a single room for me that I’d payed a significant extra amount for. Please fix your site to reflect the room possibilities available on this cruise. Otherwise thank you for your communications and organisation this was fantastic."},{"rating":"5.0","review":"The party boat was amazing especially the second day on the freedom island. It is a peacefull and beautiful place....\nShow more"},{"rating":"3.5","review":"Highly recommend! Our trip was perfectly organised by GO TRAVEL AROUND and Abhishek, you are great!!! The customer...\nShow more"}]},{"name":"6 DAYS IN CENTRAL VIET NAM","reviews":[{"rating":"5.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.5","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"3.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"Hanoi Tour plus Halong Genesis Regal Cruise 5*","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Best Vietnam Package tour for 10 days South to North","reviews":[{"rating":"4.0","review":"Fantastic! We just finished 8 day tour Hanoi - Pu Luong - Ninh Binh - Halong and Cat Ba. It was very beautiful nature, Friendly people and great adventure Thank you Go Vietnam Travel Team"},{"rating":"4.5","review":"Great time going back to Sapa trekking."}]}]