[{"name":"Ho Chi Minh - Cu Chi Tunnel - Cao Dai Temple - Mekong Delta 5 Days 4 Nights Package Tour","reviews":[{"rating":"5.0","review":"Luco Travel is just the BEST. Louis is an attentive, thoughtful, and knowledgeable guide who is incredibly kind and takes great care to make sure you are well looked-after. He makes sure to put *your* objectives for the trip first and ensures you have a wonderful time. He has boundless energy and humour, and he helps you to learn a lot about the history and culture of Ho Chi Minh City, Cu Chi Tunnels, Mekong Delta, and Vietnam overall while also making the trip super fun! He is also keen to know more about his tourists and open up about himself, which makes it seem like he sincerely loves his job and working with people. We were a fairly big group, but we were no trouble for Louis and his staff to manage; everything ran super smoothly with no issues. For us, it truly was the trip of a lifetime. Amazing tour operators deserve our support, and we really hope you'll support our dear guide, Louis. You won't be disappointed!"}]},{"name":"Hanoi to Hoi An - 8 days","reviews":[{"rating":"5.0","review":"Fantastic tour, great tour guide, loved every minute."},{"rating":"5.0","review":"I was feeling very lost in life, and somehow, as the cliche goes, I managed to find a part of myself in Vietnam. The crazy, colourful, vibrant country has wiggled into my heart and a huge gigantic part of this is due to Huynh. He was informative, funny, proud of his country, critical of it at the same time, and so gentle with the way he allowed us to explore Vietnam. I am so grateful to have been able to experience this trip. He was unassuming and never forced us to do things we didn't want to. Words cannot express how much I appreciated this tour and our amazing guide\n"},{"rating":"5.0","review":"Great holiday with lovely group people and tour guide , Si.\nWell organized tour and Si is very enthusiastic and always make sure everyones happy .\nGreat experience and really enjoyed it. Thank you"},{"rating":"5.0","review":"The tour was an incredible experience and I enjoyed every minute. Our tour guide made the holiday, everything was perfectly arranged and he was very knowledgeable about the different historical sites we visited. Nothing was too much trouble.  I definitely recommend on the go tours and will look to book onto another tour in the future. "},{"rating":"5.0","review":"The tour surpassed our expectations.  The activities that we did every day were varied and always fun, the hotels and food were very good, and we especially loved the junket boat.  The best part of the tour was our tour guide, Si.  He went above and beyond for all of us...he was informative, thoughtful, funny and sweet...he made our trip amazing for us!  He is a lifelong friend now, and we would love for him to win an award...he deserves it!"},{"rating":"5.0","review":"Just returned home from a wonderful 3 week trip to Southeast Asia and spent the final week touring Vietnam with our fabulous guide Sy.  Couldn't have asked for a better finish to a great vacation!!  Sy was responsive to all participants, genuinely took an interest in getting to know each participant and helping us to get to know each other quickly.  He made every effort to make sure we were happy throughout the week and gave us such a good overview of all the areas we visited as well as introducing us to so many things Vietnamese.  I have never done a guided tour such as this prior to this vacation and after my week in Vietnam would highly recommend this form of travel to anyone. "},{"rating":"5.0","review":"I had the chance to spend my 24th birthday on this tour. Most amazing tour & birthday that I've had yet!! He was able to get me to ride a water buffalo!!! Hung has been to best tour guide. He for sure knows a lot about Vietnam & is defiantly a people person.  He made me informed about so much that I didn't know.  I will 100% be visiting Vietnam & hoping to have him as a tour guide again. Thankful to have him lead our tour and spend the last 8 days with him! I can see why he was named 2016 tour guide! He is the best :) "},{"rating":"5.0","review":"It was a beautiful tour of Vietnam, and we loved it. In 8 days, members of our friendly international group who joined from America, England, South Africa, and Australia (some originally from Canada, Singapore, Malaysia, India and Viet Nam) got to see the beautiful country and the world top tourist places. Halong bay ever magical at twilight on the elegant Bhaya cruise, the admirable old quarters of Ha Noi, the adoring and poetic Hue, and the ultimate charm of old city Hoi An. Our guide Hung Do, who was highly organised, caring and charismatic, showcasing that you and your family can have a relaxed and enjoyable good value tour in Viet Nam."},{"rating":"5.0","review":"The tour was amazing!! One of my favourites . Had a great experience! Hung was an fun and knowledgeable host. His ability to quickly work out the nature of all his guests and make them comfortable was invaluable. I hope to tour with Hung again because you can't help but miss him!! We all fell in love. The best tour!"},{"rating":"5.0","review":"Loved the tour and everything about the tour. All experiences where great. It is an amazing country. I especially appreciate the quick response On the Go had to reschedule and re-accommodate us at the last minute in Ha Long Bay when the weather forced us to dock and not spend the night on the boat but had to return to Hanoi for the night,. It was expertly handled. "},{"rating":"5.0","review":"Ken was - brilliant, knowledgeable, passionate! - He did an excellent job, thank you! Had an amazing trip, everything ran according to plan and schedule. "},{"rating":"5.0","review":"The tour was terrific which was made even better by our tour guide Hung Do. We felt that the tour itself was planned well and ensured we got to experience as much of Vietnam as we could in the time we were there. Our guide Hung enhanced our experience through his knowledge and easy going nature, no question was left unanswered. All accommodation was above expectations (even our overnight train experience despite fairly ordinary bathroom facilities). This was our first On the Go Tour however with the professionalism and the overall experience we will not only book other tours but also recommend them to family and friends. "},{"rating":"5.0","review":"We really appreciate Hung's help thoughout our stay. He did a great job. "},{"rating":"5.0","review":"Hung was a fantastic guide, great sense of humor, very knowledgeable. He was great at prepping us for each day, attentative to travellers and energetic! "},{"rating":"5.0","review":"We Had a wonderful trip, the highlights were Ha Long Bay and Hoi An. The trip was made even more enjoyable due to our wonderful tour guide Hung Do. He always went tyo extra effort to make sure that everyone had a good time."},{"rating":"5.0","review":"Our tour was a magical and an adventure of a lifetime.  The accommodation excellent and the couch very comfortable.  Hung our tour guide from the time we met until the very last when we said goodbye was very helpful, informative, polite and made sure we were comfortable and experience the real Vietnam.  To Go Tours wonderful service and shall recommend."},{"rating":"5.0","review":"My daughter and I met up in Vietnam for a holiday having been on different sides of the world for a year. we were not too sure that an organised tour would suit us. We need not have worried. we had a wonderful 8 days with a lovely group of people and Hung was a super guide. he was very well organised and very considerate. He had a good sense of humour and was very knowledgeable about the places we visited. We will definitely use on the go tours again. great value for money and Hung ensured we had a really wonderful experience"},{"rating":"5.0","review":"The tour was very well designed and with excellent accommodation- especially the rooms on the river boat and the hotel in Hoi An. Hung was an excellent and attentive guide."},{"rating":"5.0","review":"If we were to do another tour in Vietnam, we would most definitely hope to have Hung as our tour guide. We would certainly look at the other tours that On the Go Tours has to offer.\nAll in all - a fabulous time. Thank you."},{"rating":"5.0","review":"Hung was very informative, friendly, had a great sense of humour and I couldn’t recommend him more as a guide. I loved this trip as an introduction to the amazing country of Vietnam "},{"rating":"5.0","review":"We had an amazing 8 days where we touched on the history, culture and beautiful sights of this spectacular country and it's warm and welcoming people. We felt that the tour was very well organised and gave us a great overview of the region travelled. Halong Bay was especially beautiful and our cruise boat was beautifully appointed and the staff attentive and lovely. Hoi An was another highlight with our cycle ride to a local farm, the cooking demo, the interesting little alleys & shops and the tailor who made our beautiful clothing overnight."},{"rating":"5.0","review":"It was a great holiday I do wonder if 3 nights in Hoi An may have been a little long but on the whole the holiday was lots of fun"},{"rating":"5.0","review":"My Hanoi to Hoi An your was one of the best tours I have ever taken, largely thanks to the organization and knowledge of Hung Do our guide."},{"rating":"5.0","review":"A great tour of Vietnam with a tour leader who obviously was passionate about his county, his people and passing his extensive knowledge to us.\n\nHe made a great tour an \"awesome\" tour.\n\n\nThe tour was well organised whilst taking into conisation our needs.\n\nAlso the quality of the accommodation and meals were great."},{"rating":"3.5","review":"The guide had an amazing knowledge of the place and the facts. \nI wasnt happy with the hygiene of the hotel, on one of them we saw them cleaning the mugs with the same cloth they used to clean the bathroom!\n\nAlso, the meals included weren’t great. On the last day the guide recommended us a restaurant for the group last meal together, he said it was a home restaurant and it was cheap and good. The food wasnt tasty. We ate 1 prawn! 1 Rib, soup ans fish. It was the most expensive meal we had in Vietnam and the “home restaurant” had a printed menu. \nAlso I told the guide I couldnt eat spicy food (not hot food) and in this particular case, of the home restaurant the guide didnt provide with an option. We asked the guide and he replied that the food wasn’t spicy for him, and the chillis come on the side, and didnt found another option. \nThank you."}]},{"name":"Hanoi and HaLong cruise to Ho Chi Minh 7 days","reviews":[{"rating":"4.5","review":"Had a great time in Vietnam! Did everything in the itinerary. From moment of arrival to departure, Mr. Jun organized everything. I would recommend this tour for any first timers to Vietnam. I also went solo, but felt welcomed wherever I went."},{"rating":"4.0","review":"The 3 tour guides were excellent, Johny, Cody and Fa. Their english speaking was very good. \nHa Long Bay was the best part of the trip, should have stayed and extra night.  Enjoyed the scenery the accommodation and the food. Would have preferred if tea and coffee were included in the price. We were a little disappointed with the hotel locations, very hard to find a place to eat close by The hotel staff were not able to advise where to go. No recommendations. \nThe staff at the Skylark hotel were very friendly. Breakfast was excellent. I would not recommend the Ambassador hotel in Ho Chi Minh city. The breakfast was average but we did enjoy the Pho soup. Room service was poor. On the second day both our rooms were not made up. Reception said they were short staffed which is a poor excuse when international travellers are staying  at the hotel . The hotel was not very clean."},{"rating":"4.5","review":"Our family took the Hanoi and HaLong cruise to Ho Chi Minh 7 days tour.  This also included one day in Ninh Binh.  Our guide, though very knowledgeable, made us feel as though he was rushing the entire day. He would take us to a site, talk about it for  minutes and tell us we had 5 minutes to take pictures and wander around and then off to the next point.  This barely gave time to go to the washroom (and with 2 small kids, this was a must).  Our group had 8 people, our family was 4 of those 8.  I was usually in the middle of the pack with the children and the people in the back, enjoying opportunities for photographs were usually at least 800 meters behind the guide.  There were times when he was walking so far ahead we couldn't even see him.  Then, when we went on the boat ride in Nihn Binh, he said the boat rides take 1.5-2 hours.  When all of our group assembled after 2 hours, he was nowhere to be found for another 30 minutes.  He sited \"I told you it takes about 2 hours\" as his reason for being 30 minutes late in his return.  At every stop, he seemed to pride himself on being first to arrive/leave and that we were back in the city early.  None of the other patrons tipped him.  \n\nThe guide we had the next day to Ha Long Bay was wonderful.  The cruise and food were amazing.  All the crew were very accommodating of our family's needs and supporting the children's eating habits well.  My only complaint was that there was too much food!  Another issue was that the boat that we were on was no where nearly as beautiful as the boat pictured on the website. My husband, who works as a director, who is trying to get a cruise company as a client, was very disappointed that the boat was not similar to the one pictured.\n\nOur guide in Ho Chi Minh who took us to the Cu Chi tunnels was incredible!  He was knowledgeable, fun, accommodating, helpful and a really great guide! His English was excellent!\n\nOur guide of the Mekong Delta was very good as well.  He was very knowledgeable.  He gave us several transportation options during the trip (depending on individual physical needs).  His English was very good as well."}]},{"name":"Magical Vietnam - Hoa Lu/Hue /Hoi An","reviews":[{"rating":"5.0","review":"We booked our trip to Vietnam through Realistic Asia and they were brilliant. So helpful, friendly and gave great advice that meant our trip went so smoothly and we were able to see as much as possible for the short time we were there. The fact that this company is an independent company meant there was a more personal touch to the whole process. Highly, highly recommend."},{"rating":"5.0","review":"Nice hotels, excellent location and good value for money. Thanks for your arrangement during my family trip."},{"rating":"5.0","review":"Fantastic short break booked with Realistic Asia. everything was excellent from start to finish. Hotel was exceptional for the price we paid. Will definitely book with them again"},{"rating":"5.0","review":"Great package holiday to Vietnam. Value for money. Thoroughly enjoyed. Thank you."},{"rating":"5.0","review":"Excellent trip. Everything in the package worked well with transfers and tours all as expected. Vietnam is really cheap and the trip was great value. Sadly wants to see the rice terraces in Sapa as we don't have enough time for the Northern part of the country but the organised trips were very good and enabled us to see several key sights."},{"rating":"5.0","review":"Our recent trip to Vietna was incredible. All transfers spot on,  knowledgeable tour guides; excellent hotels in good location. Thank you Dat and Minah for your great services."},{"rating":"5.0","review":"I am very impressed with Realisitc Asia and Minah was amazing !!! We had a wonderful trip to Vietnam It was a great vacation and  Realistic Asia was well organized!! Highly recommend them!!!"},{"rating":"4.0","review":"Good company to travel with. Very professional. Schedule was quite full with little time to enjoy some of the facilities/amenities in hotels due to late arrival and early departure"},{"rating":"5.0","review":"This was the most enjoyable experience in booking a vacation! Our consultant Minah “nailed it”! Having never traveled to Vietnam, we had no idea where to even begin. Minah took the time to get to know us first! Our interests, likes, dislikes, etc. Truly all engaging questions that led to an amazing well thought out trip to Vietnam for 10 Glorious days! Really wonderful experience!! Highly recommended!"},{"rating":"5.0","review":"This was my second time visiting Vietnam, and I can tell you that by far this company is the best. David, was well organized, knew the places well and has a great taste for hotels and restaurants. He is also well read about the Vietnamese culture and places we visited. In short, it was well money spent traveling with him. I highly recommend him."},{"rating":"5.0","review":"Vietnam is Wonderful. Hoi An was our favorite city on the tour and loved the experiences at Mekong Delta."},{"rating":"4.0","review":"It was really good. Enjoyed the tour very much. Was really only a 9 day tour.  The only problem we had was with the home stay. It was full and the partying went on until at least 1:30am and the roosters and dogs started at 4am."},{"rating":"4.5","review":"S Viet has arranged a trip that surpass our expectations. Among all the accommodations, I like homestay in Mekong the most, it was awesome to have interaction with local. Perfect place to end our trip"},{"rating":"5.0","review":"Thank you Dat, we had a wonderful trip to Vietnam and higly appreciate your support in well-organized everything from accommodations definitely will comeback for Sapa and discover more your beautiful country. We are happy to took you as your company to arranged  the trip. \nKind Regards"},{"rating":"5.0","review":"we’re home safely after a great trip to Vietnam. I felt it was worthwhile to use a local travel agent rather than an Australian one; that adds another layer of costs etc for a start.Thanks Minah, our guide for everything!"}]},{"name":"Vietnam Highlights","reviews":[{"rating":"5.0","review":"We booked this tour package from Threeland last January 2019, they did so well. This is my first time my wife and I travel to Vietnam, so we decided to celebrate my birthday at Halong Bay. First of all, we were surprised at the number of limestone islands, islets and the emerald water here. We stayed in Grayline Cruise for 2 days 1 night. We were taken to the most of top-rated attractions of the bay like Titov Island and surprising cave. A not to miss activity is Kayaking. Paddling thru a cave to admire the scenic and magnificient of the bay is a great experience. The staff warmly welcomed us and also prepared a birthday cake for us, we were deeply touched by their thoughtfulness. Overall a happy memory in Vietnam."},{"rating":"5.0","review":"It was our pleasant trip to Vietnam. Our 10-day tour to the most impressive destinations in Vietnam exceeded our expectations. We had the chance to experience the breathtaking and unique scenery on Ha Long Bay – a must see tourist attraction for visitors. We spent 1 day in Hoi An ancient town, which was the highlight of our trip. Walking over the tile-roofed bridge and strolling around the wonderful town with various kinds of lanterns are the best way to savor the charm of Hoi An. Local people are also friendly and hospitable. The food catered during the tour was also tasty and varied. If you are about to travel to Vietnam, Threeland Travel is highly recommended."}]},{"name":"Hanoi - Maya Cruises Halong Bay - Bakhan Village Resort 6 Days","reviews":[{"rating":"5.0","review":"With some trepidation we booked a 12 day trip to Vietnam via a Groupon voucher But what a great experience Everything was handled efficiently - from pre - trip communications to airport and tour pickups All along the trip we received confirmation about the following days pickup times as well as info about an alternative trip when the My Son excursion from Hoi An had to be cancelled due to heavy rains and flooding Hotels were 3 star but new and well situated and perfectly acceptable\nWe particularly liked that we were not part of a big group but simply joined others - usually not more than 6 or 8 - on various excursions \nOverall a very positive experience and excellent value for money We were offered some upgrades to the original itinerary such as a flight to Hoi An instead of an overnight train and a better class of boat for the Halong Bay cruise We were happy to have upgraded at a reasonable cost We definitely recommend Halong Tours\n\nVisited December 2016"},{"rating":"5.0","review":"Ms Kim of Halong Tours was super detail-oriented in servicing us and arranging pick ups. I must've sent over 20 emails to her asking her about the tour and payment and she was patient and timely answering all of them. Halong tours liaise with a bunch of other tour groups and pick up services for each segment of the tour. Contrary to what you might think it's actually quite smooth, they have your names and look for you around the lobby. (Most) of the hotels they booked for us had amazing customer service and amenities even though they were 3 star. I travelled with my friends on a budget so we were beyond happy to have received what we paid for\n\nVisited November 2016"},{"rating":"5.0","review":"we booked with Halong tours back in April and Ms Kim was fantastic, answering every email promptly, explaining every step of the way and offering upgrades when she thought we would like them. We were met on every bus, plane and minibus by a competent driver or tour guide. All the hotels were great, the staff so friendly and accommodating and the tour guides very informative. I can't speak highly enough of Halong tours and Ms Kim who met with us on our first night and explained in person the tour and even where to eat in Hanoi. We also met other people at times on the tour and they all spoke very highly of Halong tours and their tour guides and hotels. Don't hesitate to book with them, they are great and run on time want to share with you their fantastic country and culture.\n\nVisited December 2016"},{"rating":"5.0","review":"We did the 10 day north-south Vietnam tour...Halong tours were amazing. Everything was so well organised, communication is awesome right from booking, anything you need to know is addressed promptly.... all picks ups and drop offs were punctual, friendly and confirmed the evening before...I honestly cannot fault this company and its staff, who were exceptional. Don't hesitate in using Halong tours... We thank them for an incredible holiday in Vietnam....\n\nVisited October 2016"},{"rating":"5.0","review":"totally awesome .....best holiday ever and i was on honeymoon with my wife who has never ventured out of south africa before......They made us feel so welcomed......visited us at the hotel to make sure we were OK and every day she followed up with a phone call .i will highly recommend halong tours .....Vietnam is a beautiful country"},{"rating":"5.0","review":"Used their service during our 4-day trip to Hanoi & Halong Bay. Was not really sure what to expect as i just found them on the internet. But once we arrived at the Hanoi airport until we left, everything went really smooth & according to schedule. The transport provided & hotel accommodations were very comfortable and to our satisfaction. The great thing was, we did not have to pay for the entire cost upfront. Just required us to pay a booking deposit. \nThanks to Ms. Phuong who patiently communicated via email for organizing and re-organizing the tour to our convenience.\nWould highly recommend travel agent"},{"rating":"5.0","review":"We had 4 days 3 nights on Lavela cruise. It so amazing for me!!! Great service. Great food. Great atmosphere. Specialy thank to all team to take care of us on this trip. They are so friendly and profesional. Thanks again :))"}]},{"name":"Vietnam Foodie's Paradise ( Hanoi/Halong Bay/ Hoi An /Mekong Delta)","reviews":[{"rating":"5.0","review":"I cannot remember all the names of food that we have tried during the tour. Some of them were Banh mi, bun cha, pho, che, etc. It's suitable for food lover. Try it!"},{"rating":"5.0","review":"Noodle in Hoi An was really yummy. And now I knew Pho was famous not for nothing."},{"rating":"5.0","review":"I can highly recommend letting Realistic Asia arrange your next trip to Vietnam. We may not be the easiest guests and whatever we requested, they got it fixed and you never felt you were alone with the problems. It can be hard to establish trust over social media, but they were always good at calling back on one's inquiries and it's really nice to help them."},{"rating":"5.0","review":"A professional travel company that ensures that travelers get max “value for money”. Highly recommend Realistic Asia if you want a journey that provides experiences beyond the usual. Vietnamese local food was worth to taste."},{"rating":"5.0","review":"Came home a week ago after 10-day trip in Vietnam, a tour organized by David from Realistic Asia. Great to know you. We felt catered every day, with a driver and a good guide who picked-up on time. Our guides had a great sense of humor so we were quickly participated in the tour. Nice central hotels in all the cities. And it is definitely recommended to go with Realistic Asia."},{"rating":"5.0","review":"I can't help giving the agency my warmest recommendation! THANK YOU to Realistic Asia for 10-day trip in beautiful Vietnam!"},{"rating":"5.0","review":"Comfortable budget and good order of things. My wife and I experienced Hanoi and Halong, etc. along with their tour guide, we will definitely be leaving again."},{"rating":"5.0","review":"We had a really good trip with memorable experiences. Compared to what we have heard from other tourists about the experience of Halong Bay, it seems that ours has been extra good especially in terms of food and cruise conditions. We have generally met super nice guides and staff on our trips. In addition, you were very helpful in talking to the airport in relation to the luggage we had lost and offered to deliver it to you. Everything was as it should be throughout."},{"rating":"5.0","review":"I am usually worried about choosing food when travelling because I don't know which food is good and safe. So I decided to take a foodie tour via Tourradar. We was taken to the good places and felt satisfied with the cuisine in Vietnam. The taste of each region was so different. As my guide explained, it's derived from the features of geography and history of this country. The taste of the north was quite familiar with me but the south and the central was quite sweet and spicy. However, it's yummy. I remembered the places. When I came back, I will try it one more time."},{"rating":"5.0","review":"I think Halong Bay itself was an attractive scenic spot. Moreover, the cruise that I took had a good itinerary so that we can spend time in luxury cruise and outdoor activities. Vietnamese cuisine was so yummy and various."},{"rating":"5.0","review":"One of the best tours we have tried. Must go again with them!"},{"rating":"5.0","review":"Actually we had searched for reviews of Realistic Asia a lot before choosing them as our travel agent. Well, we tried with them. After choosing the package, I asked them to change some points in our itinerary. They were so patient to modify accordingly and advised me as a local person. Before the trip, we received a detailed itinerary including the date, the tours, the hotels, the contact numbers. Each day during my stay, they reminded me the time of pick-up and notes for check-in, check-out. They also called the hotel to cross-check with us for sure. Next Southeast Asian trip only with Realistic Asia."},{"rating":"4.5","review":"Highly recommend to go with S Viet. My partner and I just had a fabulous “Culinary Adventure” last week with them. The food is absolutely fresh and delicious. We try all local specialties in places off the beaten path. This is a great way to experience Vietnam’s culture."}]},{"name":"Vietnam Express 10 Days (Ho Chi Minh- Da Nang- Hoi An- Hue- Ha Noi- Ha Long)","reviews":[{"rating":"4.0","review":"Overall tour was good, Ms. Thu was absolutely awesome and helped more than I could have ever hoped for.  Last day of tour was very disappointing with too much driving tour guide that was not very helpful and poor choices of places to visit. Most where places trying to sell things and not at all interesting. Everyone on tour last day agreed to end tour early because it did not meet expectations."},{"rating":"4.5","review":"I booked this tour program for my daughter. All the agents and staffs were very responsive and helpful for completing the booking. She was very satisfied with this program and really enjoyed. Great tour program for going around Vietnam’s key cities and places."}]}]