[{"name":"Vietnam Family Adventure","reviews":[{"rating":"5.0","review":"A good venue for traveling with children. I especially liked the approach of \"free time\" with added option choices."},{"rating":"5.0","review":"We all enjoyed it, and felt looked after. We experienced things on the tour which we may not have otherwise."},{"rating":"5.0","review":"Good mix of independent and guided touring"},{"rating":"5.0","review":"Well put together tour"},{"rating":"5.0","review":"We had an amazing trip to Vietnam with a fabulous guide. Accomodation was of a high standard and we met some good like minded friends on the trip too. Currently planning our next trip."}]},{"name":"Authentic Vietnam tour for 12 days","reviews":[{"rating":"4.0","review":"Fantastic! We just finished 8 day tour Hanoi - Pu Luong - Ninh Binh - Halong and Cat Ba. It was very beautiful nature, Friendly people and great adventure Thank you Go Vietnam Travel Team"},{"rating":"4.0","review":"Great time going back to Sapa trekking."}]},{"name":"Halong 3days/2nights tour on UniCharm Cruise 4*","reviews":[{"rating":"5.0","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"5.0","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Discover North Vietnam - 8 Days","reviews":[{"rating":"5.0","review":"From pick up and drop off at the airport, the trip was fantastic. All pickups were on time, the accommodations, food and itinerary were excellent. We had no expectations going into the trip but came back awed. Sapa and our guide Suwe were the highlights but everything we did was thoroughly enjoyable.I would do another trip in an instant with Go Asia!"},{"rating":"5.0","review":"It was an absolutely amazing trip!\nI did it with my wife and two daughters and all of us was really impressed by a lot of things, like Vietnam overall, how tour was organized, all guides (Arrow in Ha Long Bay and Khu in Sapa)  was really friendly and they gave to us a lot of knowledge about people, history, and culture of Vietnam.\nThank you!"},{"rating":"5.0","review":"Originally booked the package through Scoopon, however package was phenomenal!! Entire trip was carefree with excellent travel guides, inclusions, transport e.g. Sleeping bus and transfers and accommodation. I would like to especially thank Tom who was our travel guide when visiting Ha Long Bay. The only issue throughout all ventures was the break stops which I found unclean, deceiving and uncomfortable."},{"rating":"5.0","review":"Everything was well organised, and tour guides were always prompt."},{"rating":"4.5","review":"We booked our entire holiday through GoAsia Travel. The best service and excellent itinerary. Everything went to plan. Lee and her Team were with us the whole way. Tours were exactly what we wanted. Guides were knowledgeable and the services was personal and pleasant. Cannot fault Go Travel Asia in any way. Hotels were comfortable and clean. Cars met us at airports and hotels on time every time. Lee was a phone call away. I recommend Go Asia Travels to any one who wants a truly hassle free holiday."},{"rating":"4.5","review":"First time in Vietnam and was a bit worried as we are in our 60s\nWe booked with Go Asia and was very happy.\nThey arranged everything from private car pick up,hotels ,tours and meals .\nContacted prior and whilst in Vietnam to let us know whats happening .\nCan highly recommend them.m/s Ruby was very helpful advising us on the best options like fly rather than train,one on one tours and their prices were very good"}]},{"name":"Vietnam Highlights Package 21 days/20nights","reviews":[{"rating":"5.0","review":"A big thanks to Mr. Danny and his team for enabling a great holiday experience in Thailand, Vietnam and Cambodia.\n\nI arranged my trip online. Mr. Danny was very speedy in answering questions and fulfilling wishes (i.e. changing bus rides to to flight tickets, etc, before and during holidays). The Indochina staff is very customer oriented and puts a lot of effort so that the entire holiday experience runs smoothly. Whilst I have often travelled individually in previous years, this time I have truly enjoyed the combination of having part of the trip organized (transport, hotels, minor excursions), but at the same time still experience typical \"local\" ways of transport, areas, etc.\n\nA big thank you. I clearly recommend Indochina to other travellers.\n\nVisited January 2016"}]}]