[{"name":"South Vietnam Getaway (Basix)","reviews":[{"rating":"4.0","review":"Cut short by Covid-19 otherwise Perfect"},{"rating":"5.0","review":"We had an amazing group and a great tour guide, Ngoc wanted us to have the true Vietnamese experience. Our dinners together were all amazing. Food was one of the highlights of the trip. On a tour where the country was beginning to shut down to tourists, he did an amazing job of keeping positive and continuing to share his knowledge of the country he calls home. Intrepid was not advising him about the changes that were coming down due to the COVID virus and so he was unable to answer our questions about parts of trip that were to be cancelled such as Halong Bay. Once the tour was cancelled Ngoc was concerned for our wellbeing and flights home. I will return on my credit received from Intrepid."},{"rating":"4.5","review":"Amazing trip! We travelled to Sri Lanka in August/September 2019 and had a great experience with Step Lanka and our...\nShow more"}]},{"name":"Best of Northwest of Vietnam 14 Days Soft Trek","reviews":[{"rating":"4.5","review":"Visit of North Vietnam\n\n\n\nA fine way to see the country and visit the local population. Stay overnight in one of the homestay's. See the touristic attractions but also the local ones."},{"rating":"4.5","review":"100% reliable: I went on a 14 days round trip with this travel agency. Every thing worked perfectly fine. I never felt unsure of anything and it was easy to get in contact if you had a question. I can highly recommend Legend Travel Group if you want to make a trip to Vietnam . Thank you so much. . Ingelise Frier, Denmark"}]},{"name":"Vietnam North","reviews":[{"rating":"5.0","review":"This was my first Tru Travels tour and definitely won't be the last. You cover a lot of ground in the 10 days and the time is used really well, feels like you're always onto the next fun activity! We did a lot of things I didn't even realise were on the itinerary. Our guide was amazing at welcoming everybody and even though our group joined halfway through the main 17 day tour you would never have known by the end who was on which one as we got on so well. We had a good balance of active, fun and more cultural activities and Bre was always able to tell us stories about the history of things or about local customs. With all the moving around she was also very organised in keeping us up to date with the itinerary and good at recommending practical details like when was best to go do errands, do laundry etc. Which is quite important when you're on a tight schedule! We ate in a nice mix of restaurants and a good amount of things are included. Really big thank you to Bre and Tru Travels!!!"},{"rating":"4.0","review":"As my first solo trip, I had an amazing time, and has spurred me to go travelling alone again. I had a fantastic experience, and have Edna to thank for this, she is warm, fun & bubbles character who will make the experience even more fun! Highly recommend "},{"rating":"4.5","review":"First time in Asia! I knew út would be different from all others travels I made before, and I was prepared. I'm not a jig travellers and I hate camping, but I knew I would find it hard in Vietnam because it's so different from Canada. But in the end, it wasn't too difficult. I love the history and I cultures and I loved the Imperial city and observe how they work here in Vietnam. The activities we did were excellent, the cooking class was a treat and the food was amazing.\n\nI particularly like Phong Nha, surrounded by the mountains, it was beautiful. I had so much fun in the dark cave and the water activities we did after.\nOne of the tourists had an accident there, and it seems that nobody there knew first aid, and it was a bit scary, but our guide Edna jumped in and with one of our group who has a doctor. In the end, all was well and such a relieve.\nThe castaways island was something that I never did before also, it was a bit overwhelming at first, but I had a lot of fun with our tour guide and the members of our groups. I think I misunderstood what was castaways island and wasn't prepared for the constant partying, but I know my limits so I went stopped when it was to much.\nAgain, I had a lot of fun dancing and drinking with my group mates \nDon't be surprised though, people are going there to party hard. \n\nFinally, what comes out of this for me, it's the time I spent with my groups and the fun we had with the activities, I feel I made friends and Edna, our tour guide, was a friend and a big sister to us or to me at least ❤️"},{"rating":"4.5","review":"I didn't know what expect from this trip! Being 34 years old, I hoped being young at heart would be enough, and it was exactly that!\nThe trip was a great mash ip of cultural activities, food and drinks and getting to know cool people. \n\nOur group leader Edna knew what she was doing and made sure we were comfortable and enjoying our time to the fullest. \n\nWe went as gây couples and everyone were accepting and open minded. It was a big stress free factor and I'm really happy on how it went. \n\nVietnam is a wonderful country and this trip is perfect for discovering it. \n\nA great thanks to our group leader."},{"rating":"5.0","review":"Thoroughly enjoyed my North Vietnam tour and joining the family in Hoi An. Happy i chose Trutravels, it's been a wonderful experiences, that I thoroughly enj every activity.\nTour guide Edna went above and beyond and was absolutely amazing, helpful and made me feel at home. Anything that you need she provides and was there to help you out. The time I got sick she is the one taking care of us, as mostly few of us are not feeling well, she is running here and there for our medications.\n I enjoyed every activity especially the bike ride in Hoi An and the basket boat tour, the food inclusion was pretty good. The night was pretty fun and every one is having the best time.\n\nHai vẫn pass was pretty cool and totally enjoyed it and one of my favourites. We are so lucky for the beautiful weather that time, open top jeep was sick experience, the view is unbelievable and neve expected this would be awesome like this. The cook class was so much fun and the food was really good. Zip lining and duck stop was so cool.\n\nCastaways is sick and tota loved it, thinking of going back for another tour with TruTravels and with Edna as the tour guide.\nHighly recommended!!! Thank you"},{"rating":"5.0","review":"Vietnam North was overall a very pleasant experience and I really enjoyed my time here. \"Papsi\" the tour leader was a friend to each one of us and made us all bond with each other and become a little family by the end of the trip. He always had a good time with us but made sure everyone was always included and felt safe.\n\nWhen we couldn't go to Phong Nha national park because of the flood, Papsi made sure to act fast and gave us an amazing alternative and quicky \n\nHe genuinely always asked us how we were doing and if we were feeling tired/down he made sure to make us feel better. Overall this was an amazing experience and a good variety of activities were included, but I would suggest to include a bit more cultural and historical information about Vietnam, especially in Hanoi."},{"rating":"5.0","review":"I had the most amazing time, saw everything that I wanted to and thoroughly enjoyed all of it. Castaways was the highlight of my trip - incredible. Both guides (Papsi and Phong) felt like friends rather than tour guides - very lovely people. "},{"rating":"4.5","review":"I had an amazing time on the Vietnam north tour. We got a lot of things done in just 10 days with a good amount of time to chill as well. Our tour guides (\"Papsi\" and \"Phong\") were uncredible. They were extremely helpful and attentive to all our needs, they were happy to answer all of our questions and were always making sure that we were always having a good time! My favorite activity was the cooking class, although all of the trip was super fun. \n\nThank you Trutravles and Thank you Papsi + Phong "},{"rating":"4.5","review":"I had an amazing time on the Vietnam north tour. We got a lot of things done in just 10 days with a good amount of time to chill as well. Our tour guides (\"Papsi\" and \"Phong\") were uncredible. They were extremely helpful and attentive to all our needs, they were happy to answer all of our questions and were always making sure that we were always having a good time! My favorite activity was the cooking class, although all of the trip was super fun. \n\nThank you Trutravles and Thank you Papsi + Phong "},{"rating":"5.0","review":"I had a great time, as my first Trutravels tour. All transport ran smoothly without problems which made the trip stress free.\nThe activities were really good. Edna did a great job getting everyone involved. Made friends and definitely will recommend to my friends."},{"rating":"4.5","review":"I booked the north tour very last minute and I'm very glad I did. I have an amazing time.\nEdna is an amazing tour guide, so much fun and everything is organized.\nEveryhting went really well!"},{"rating":"5.0","review":"I thoroughly enjoyed my trip with Trutravels. I learned the Vietnam tour from when I did the Bali tour last year, and it has lived up to my expectations. Edna was the best tour guide, loads of fun, good knwledgeable of the areas we went to and great overall guide. She remained professional and was proactive in dealing with a tough situations that had arisen few members of the tour. She treats everyone with respect and and makes the trip very enjoyable for everyone, especially with the sense of humour!\n\nThough it is difficult to find affordable accomodationsin a central locations which meets everyone's expectations. I would say, the accomodations way make ita less comfortable trip for some. \n\nOne thing, I would like to mention, and it may be out of the hands of trutravels, is the iterinary says that diving castaways on the cruise we will explore the caves on kayaks.. This was not the case, we got on the kayaks, moved 100m down from the boat and played, \"never have i ever\", and we directed to get back on to the boat, there was no time to explore and we did not see any caves or any monkeys.\n\nOverall, my trip was an amazing experience with TruTravels, I would recommend it to all my friends!"},{"rating":"5.0","review":"Papsi is the best! Always happy."},{"rating":"4.0","review":"By for the best Trutravels leader!\nThe itinerary was excellent, \"Papsi\" made everything much more enjoyable. I love how he always has his GoPro ready to take pictures so that we can enjoy the experience without having to take our own pictures. Papsi always informed us of the previous days plan well in advance. I would have prepared to pay more money for better accommodation."},{"rating":"5.0","review":"Great group, great tour and amazing group leader - \"Papsi\"!!\nSo fun, and experienced everything I wanted to and more.\n\nThe tour wouldn't be the same without Papsi, He was so fun, informative and was always making sure everyone was happy, safe and having a good time. He is a legend!\n\nThe castaways experience was so much fun, but I would say I would have preferred only one dayI might there and have had another day in Hanoi or somewhere else.\n\nI would also say this experience is definitely for a young age group and even though I'm 29, most people on the tour were 20's. This didn't ruin my experience but it would have been nice to know beforehand. \n\nAll in all, great experience and i will be recommending!!!"},{"rating":"5.0","review":"The tour was unbelievable! Everything from the activities, information, support and the tour leader Phi made it the best vacation that I have been on so far. This kind of tour is so much better than other tours I have tried. And since I’m from Denmark and goes on tour with an English company, that tells you all you need to know, about you don’t find tours like this in Denmark. The tour leader Phi helped me with further traveling information and set me up with other tour guides, since I’m going to travel on my own after this tour. Phi was such a cool guy. It’s so cool that the tour guide is so much involved and is a part of the group. Can’t recommend Phi and Adam enough! Without these guys the experience would have been totally different. The group was unreal as well and I will without a doubt come back again and recommend the tour to other friends. This is my second tour and the tour keeps getting better and better. I can’t keep on recommending the tour guide, and since Phi knows the Vietnamese language, he also helped us a lot with communication with locals. Here I can mention moments like going for direction, restaurants, communication with the barber, etc. Adam is the funniest and coolest guy you will meet and I haven’t laughed as much as on this tour. Keep up the good work Adam and Phi!"},{"rating":"4.0","review":"Joining a group that has established friendships was very difficult as it took a long time to feel comfortable with the original group. This is not Trutravels fault, but maybe a nudge or a brief ward could be given to those who did Vietnam South Tour. \nBa Na Hills is not on the original itinerary but I really enjoyed it there as there is something for everyone. The duck farm wasn't on the itinerary either but it was an absolute favorite of mine. Castaways was a good way to end the tour with everyone. Restaurant choices could be better. As a vegetarian, I feel my dietary requirements were met very well and I was always happy with the food offered to me. \nPapsi, He is a great leader , always made sure we were all okay and stayed together especially at Castaways. \n\nWe love you Papsi, we do!\nWe love you Papsi, we do!\nOhhhh Papsi we love you!!! <3"},{"rating":"4.5","review":"Trutravels is a great company. I liked Vietnam, would have liked more time to chill around pools, a lot of it was spent traveling but the activities were really fun!\nCastaway is quite grotty, would have preferred to had a choice to go there.\nAnd Loved having \"Papsii\" as a tour guide! <3 <3"},{"rating":"5.0","review":"I had an excellent trip. At first, I struggled due to events previous to the trip but Papsi was there for me from the start going out his way to check I was okay, which I really appreciated Thank you Papsi.\n\nPapsi was very informative however some of the local tour guides were a bit difficult to understand as they had to talk quickly to get the info.\n\nI really enjoyed Castaways however I think it would've been nice to have an extra towel and bedding.\n\nI had a great overall experience however I think it would've been helpful for Papsi to have another tour guide since we were a large group.\n\nThanks again Papsi, it was great! I will miss you and your positive energy. <3 <3"},{"rating":"5.0","review":"Vietnam North was an amazing tour. My friends put me off going to Vietnam but I'm so glad I went anyway! I previously went to Cambodia and much preferred Vietnam. The cooking class was one of my favorite activities, the food was so tasty, my other favorite activity was Jeep Tour on Hai Van Pass. \nOur tour guide Papsii made the tour very enjoyable. He is very fun and professional. He always had us laughing.\nOverall this was a great tour and i would really recommend it."},{"rating":"5.0","review":"Great mix of high and low Days. It’s good to have a mix of party and chill days. Transport can be rough sometimes because of the weather/humidity. \nSide note miss ten homestay was very accommodating in Hoi An. \nPapsii was the perfect tour guide always going above and beyond to make sure everyone got what they need and also very approachable. \nGroup get along really well and there was no animosity as the group got smaller. \nOverall great tour with excellent guide, people and feelings."},{"rating":"5.0","review":"I have had an amazing 10 days. Despite joining the group later, everyone was lovely and Edna got us involved straight away. It has been the perfect balance of culture whilst seeing the nightlife. I have loved every minute and I will deffo be travelling with TruTravels again. Thank you Edna."},{"rating":"4.5","review":"I came on this trip as an agent, and it exceeded my expectations. The inclusions were spot on, so many photos were taken, so much fun and a lot of memories. Tru really gives the balance between affordable and high standards. I remain fiercely loyal to Tru #justgo! <3"},{"rating":"4.0","review":"My first experience of TruTravels tour has been epic. Pinky was the best guide and was so knowledgeable, giving information and fun facts at every opportunity. The best part was the Dark cave + zip lining! Pinky was always attentive and made sure that we were happy at all times. She was fast to recommend the best dishes when going to eat. Even when we had free time, she messaged to ensure we knew where to go. The bamboo basket boat was incredible, to see the around Hoi an, such a beautiful place that is filled with amazing lanterns. Thank you Tru Travels + especially Pinky. xx"},{"rating":"4.5","review":"The variety on the tour was great, everything exceeded expectations. I would recommend the tour to anyone. Pinky was bubbly and informative."},{"rating":"4.0","review":"Great tour leader, great tour itinerary. There was a good variety of activities to do however I would have liked a bit more historical stuff to do. See more of the history of where we were instead of parties but that's obviously a personal preference. I really did not enjoy the overnight bus - however rest of transport was great. Pinky was always there to help with anything and was a generally great tour guide for anything we needed. I've really enjoyed my tour."},{"rating":"5.0","review":"The trutravels Vietnam north trip was an extremely fun and sociable experience. The tour was a great mix of cultural and social activities led by Pinky who was an incredibly informative, social and fun all round. It was a pleasure being in the tour and I highly recommend the tour, the guide and all the activities that were on the tour."},{"rating":"4.5","review":"Overall awesome experience with a great group. 2nd trip I've done with trutravels and look forward to the next. Absolutely knackered with the amount we've squeezed in and made a lot more memories."},{"rating":"4.5","review":"Really enjoyed the tour An was a great way to see Vietnam, especially as I have never been to Asia before. The experience was really fun an had a great time everywhere we went. I really enjoyed the open top jeeps at the Hai Van Pass, and the zip lining and cave exploring in Phong Nha. I didn’t enjoy the night bus as much but was a good experience to have. \n\nDarrin was a good fun and always made sure we were ok and enjoying our selves. The cooking class was another great experience about this trip."},{"rating":"5.0","review":"I have thoroughly enjoyed my Vietnam Tru Travels experience. Traveling as two blonde girls I would highly recommend doing a group tour to see Vietnam as we felt safer in this country. It was so nice not having to worry about transport an accommodations as that is already taking care of for you. Traveling between each place was so stress free seeing Vietnam. One of my favorite places of the whole trip was th beach club Kahunas in Hoi An. Darrin was a really good tour guide an always wanted to make sure everyone was having a good time An safe. He was always up for hanging out an took us to some awesome places to eat. I felt like he’s was a really good tour guide. Cast Aways was so much fun thanks Tru Travels"},{"rating":"3.5","review":"The itinerary was fab, the group was fab. \nPinky did take us to some nice places that you wouldn’t necessarily have found had you been travelling on your own.\n\nBut sadly I can’t give her more than 2 stars. I feel there was a severe lack of communication, and almost zero motivation to get us having fun in the evenings, she would take us to a restaurant (a pretty expensive one too for example the American diner in Hue, I have no idea what indication we gave to want westernised food this was literally on day 3 I do not miss that food yet...) but then if she left after food, would not really recommend any bars except for the karaoke which was one of my fave nights but again we only went there because we had all suggested karaoke.\n\nThe trip was 100% made worth while by the Castaways experience, and sadly that was nothing to do with trutravels. The staff at castaways are second to none I would recommend them any day, and I’m just glad that it was booked through the tour so for that thank you TruTravels.\n\nIt makes me really sad to leave such a poor review as my previous tour with you guys was amazing. We had 3 tour guides and 27 guests and everyone’s needs were catered for, this tour had 11 and I somewhat felt like we had to push pinky for answers a lot and I felt very much the last to know everything, maybe that just speaks about myself but with so little guests I would have hoped that we . She knew a lot about Vietnam which was good for the informative parts but otherwise no recommendations for the free evenings at all and information regarding the hotels was lost, for example I had no idea what time we were supposed to be checking out on the last day and when asking wasn’t really given a set answer still. \n\nThis is nothing on Pinky’s own personality she is a lovely girl and she has not had any cross words with anyone, I just feel somewhat let down by the lack of leadership. \n\nI will probably book with trutravels again because I have so much love for you as a company, except I will make sure that I get a western tour guide so to limit the language barrier and communication issues."},{"rating":"4.0","review":"Had a lot of fun on the tour with lots of brilliant people. The social side of the tour is fantastic, you make sure great friends that  will last a long time. Edna out tour guide was fun and helped us have a great time. Ninhvana was brilliant as was Castaways. My Highlight was the Hai Van Pass this had the fantastic views and was a great fun. To improve the trip it would be better if you could either had a Vietnamese tour guide as well, our tour guide Edna who had a bit knowledge of Vietnamese. This would help problem solving in the event of things going wrong.  It would also be good if you were notified in advance what things were included,i.e the abandoned waterpark.\nI love the Vietnam Explorer tour and would like to thank Edna for her help."},{"rating":"4.5","review":"This tour has been my favorite TruTravels tour. The itirenary was packed full, but also gave us time to chill. We experience things in so grateful to have done. After our mishop with there not being enough seat on the night bus and having to take the night train - I highly get to experience both bus and train, and it saved us coming at 6am. Train was good! The organization of this tour is the downfall. This was no reflection on our amazing tour guide Edna. I felt that was alot of wasting a round and not knowing what was  going on. Also, the book week, (especially Hoi An and Hanoi) the tour be 20/21 days and have more time or even a free day to explore the places further.\nThe activities were great."},{"rating":"4.5","review":"I think this tour had a fabulous mixture of culture and fun. A lot of packed in so I felt I got a great taste of Vietnam. I felt I had a lot of support throughout. My only complaint would be a day too long and night were was enough I believe. I found Ninhvana staff to be rude at times but obviously isn't the fault of TruTravels, generally the accomodations was a good standard + very comfortable.\nEdna was an amazing tour guide, she was very caring, attentive and made every effort to ensure we were okay and entertained. She dealt with the night bus issue well and was keen when she needed to be. Amazing food, Edna really made an effort to take us to a variety of places.\nOverall I've had the  best  couple of weeks and Trucrew for working it some of the best few weeks of my life."}]},{"name":"Complete Vietnam - 10 Days","reviews":[{"rating":"4.0","review":"Most 10 day tour was good.\nThe train journey shocked us. The train being dirty and very very uncomfortable for overnight travel. Food was very poor did not eat for 24 hours. We were shocked at the sleeping duvet and pillow was not changed we saw them straighten the sheet and folding duvet ready for next people at de Nang station. We felt as though we were sleeping on wood all night. Not good for people over 60."},{"rating":"4.0","review":"This was a good tour and the time spent in Vietnam was just amazing. Although it was awesome, we think it was a little undersold. I mean, Vietnam is more fantastic that what we think of it. Four stars, because the second stay at Hanoi was quite boring and we think it could have been better."},{"rating":"3.0","review":"I enjoyed Vietnam but expected a fully escorted 10 day tour with the same group of people. I wouldn't have booked this tour if I knew I would be travelling alone.Your website wording is misleading.\nThe hotel accomodation in Saigon was uncomfortable and in a dodgy area,  not suitable for families or middle aged travellers. In Hanoi the accomodation was too far from the main tourist spots, it needs to be in the old quarter."},{"rating":"5.0","review":"The tour was well organized. The tourguides and drivers were always on time to pick us up. The tourguides were \n very friendly and willing to answer our questions. And of course, to introduce the beautyfull sides of Vietnam to us. It was a really nice trip. I would have appreciated to have more time at some places."},{"rating":"4.0","review":"I am a solo traveller who decided to take this tour as it offered everything I was looking for! The transport was always on time and had air con. And the transfers to airports were brilliant. \nThe meals were best on the cruise (I am vegetarian and they made separate dishes for me) and at the local house. \nThe itinerary allowed me to meet some great people throughout the day which was what I was looking for. \nAll the guides were friendly, approachable and knowledgable. \nI enjoyed the accommodation in: Ho Chi Minh, Hoi An and especially the cruise. I wasn’t overly impressed with the accommodation in Hanoi. \nOverall I would recommend this tour however if you are also looking to travel on your own then remain caution that in the evenings you may be on your own and you must anticipate this. I tried to keep myself busy by doing different things (spa, lantern making, painting class). If you don’t like being on your own then probably choose a different tour."},{"rating":"4.5","review":"Excursions were all good. The only problems we had were communications. The travel agents text  and peaks English but does not understand many of the common phrases you may say no matter how much or how clear I could be. We even had an agent  like to is when I believe she forgot to have our transportation bus pick us up to go to Halong Bay. Miraclesly she found us a ride after being confronted about her deceit. Dont believe everything they say. If it doesn't sound right, its probably not. All of our tour guides were excellent except for 1, he was below average. Overall great company, well organized, we would use tourradar again. On a side note we took our family on this trip, if you  request a double bed 2 or 3 star hotel room or a king size bed room 2 or 3 star hotel they will be in different locations."},{"rating":"5.0","review":"We did a 3 weeks trip through Vietnam from north to south, Everything was well organized from the overnight boat in Halong Bay to the beautiful ancient city of Hoi An and the big city life from Saigon. luxury hotels in all cities and good busses and minivans took us everywhere we went. very well done by tropical journeys so keep up the good work !!!"},{"rating":"4.5","review":"Tour certainly was an adventure. Well planned. All pick ops on time. Hotels all well situated and excellent. Special mention to the Green Apple in Hoi An\nStaff brilliant. Tours and activities well planned and executed. Train journey an experience!!!"},{"rating":"3.0","review":"We chose the 4 star trip option for the complete Vietnam tour.  Emm Hotel at Hoi Ann stood out as the best hotel experience.  The Hà Long Bay cruiseon 20-21st March 2019 was the highlight of this tour and the tour guide was very good.  The worse was the tour on 16 March 19 afternoon boat trip at Back Dang Station.  The boat was a run down fishing boat and smelly.  We went on board from a rubbish dump. The included meal of the boat trip was a plate of rice with some vegetable.  The trip made me feel like a refugee.  The overnight train trip on 15 March 2019 took 18.5 hours.  It was a complete waste of time.  The train and the toilet were unclean.  The sweat smell of the bunk bed gave me the headache of the whole trip and the following day.  I think this is a very average intinery that I would not recommend to my friends."},{"rating":"4.5","review":"All guides for tours very good really enjoyed tour"},{"rating":"5.0","review":"We did a 10 day tour which started in ho chi mihn - Danang- hoi an- Hanoi- Halong bay and finished back in Hanoi .\nThis was our first time traveling to Vietnam and this trip from start to end was absolutely amazing!! Everything ran so smoothly! Highly recommend for first time travelers to this amazing country!\nThis tour had luxury as well as some history tours, island hopping, city tours and free time which was great .\n2 days in each place was plenty for us we were ready to move on by day 3.\n\nTransportation:\nAll transportation was on time ,you just had to make sure you where on time !\nThe only thing that I personally wouldn’t do again was the train trip from ho chi mihn to Da Nang (17hrs travel on a very uncomfortable train which I wasn’t aware that I had to share with strangers) if there was an option to fly I would have definitely preferred that!\n\nHotels: \nWe upgraded to the 4 star hotel package and it was definitely worth every penny , they were all absolutely stunning hotels!!\n\nMeals:\nAll meals at the hotels buffet where delish.\n The meals on the day tours where pretty average, you will still be a bit nibbly after.\nHa Long Bays food the whole time was amazing!!!\n\nOverall this tour has a 5 star rating from us , we absolutely loved it!!\nWould highly recommend to anyone of all ages !"},{"rating":"5.0","review":"We didn't expect too much at first, but when we arrived in vietnam, the guides, the company staffs welcomed us, that made us felt in love with this country so quickly. Highly recommend this tour for those who love to travel to Vietnam"},{"rating":"4.5","review":"The overall tour was amazing and it was planned out perfectly. Got to see lots of places but also explored on my own which left me with a beautiful experience and memories. The staff and tour operator was extremely helpful especially (Ms Lan) who was my tour operator. During my trip 1 hotel was not upto the standards. But others were very good."},{"rating":"3.0","review":"Basic tour. One of the mini buses was filthy dirty and every seat was taken so it was extremely cramped.  Upgraded the accommodation to 4 stars - not sure if that was worth it as the accommodation was average."},{"rating":"4.0","review":"We would like to thank Tourrader and Lan from Vietnam Adventure Tours who tracked our every move and made sure the tour went smoothly and a pleasurable experience for us.  Nothing was a problem when we contacted Lan for information and was sorted in an efficient and professional manner.  I admitted we were a little concerned about the quality of the 3 star tour for the price we paid, but all the accommodation was great and the tour guides were very informative with the areas we were taken to.  The only criticism I would have is the Mekong River Day Trip was not as enjoyable as I thought it would have been.  Overall I would have not hesitation in recommending this tour to friends as I believe it is value for money.  Thank you everyone for our stay in Vietnam."},{"rating":"4.5","review":"Very good itinerary. 10 days is quite short to visit Vietnam but this tour give a taste and show the beauty of Vietnam from South to North.\nStaff are very professional and helpful.\nI definitely recommend with no hesitation."}]},{"name":"Northern Vietnam Highlight","reviews":[{"rating":"4.0","review":"The tour guides were knowledgeable, enthusiastic and helpful, particularly Tony & were efficient and capable in the work of theirs and were actually in the position to prepare entertainment for the morning when the flight of ours was canceled at the final possible minutes. It's a great tour company in Hanoi and also really recommends for everybody"},{"rating":"5.0","review":"I just get back from my travel to Northern Vietnam, it was amazing. They take care of you through all trace, the guides are wonderful, the hotels, tours, and the drivers are perfect. Every question we have or problem was solved very fast. I will definitely book another tour with them"}]},{"name":"Vietnam Highlights - 11 Days","reviews":[{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time.  Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"},{"rating":"4.0","review":"Really good. There was some flexibility as we went along. Very well organised and guides even helped with transport. \nThe ratings system didn’t allow rating more than one guide. Linh, and Tintin were really good \nOccasional somewhat unnecessary things (eg stopping at the beach in DaNang for 30 mins seemed somewhat pointless \n\nOverall highly recommended"},{"rating":"5.0","review":"Well organised trip and all tours went exactly to plan. We experienced only one issue in Hanoi with the city tour, they picked up another independent couple and dropped them off first. From that point the driver left and we had to walk about 30 minutes back to our hotel. We thoroughly enjoyed the whole experience. Strongly recommend tour radar for your bookings. If you have any questions they get back to you promptly."},{"rating":"4.5","review":"Enjoyed the tour. The Halong Bay was excellent. We met interesting people and often reconnected throughout the tour. We loved the Pearl River Hotel in Hoi An. Our guide for the Mekong Delta tour was outstanding.  \nThe bed was hard at the Viet View in Hanoi. When touring all day, a good nights rest is essential. That overshadowed the helpful staff and good breakfast."},{"rating":"4.0","review":"Overall trip was good. Visited quite a few places throughout Vietnam. Guides were good though some struggled a bit with English. Hotels and food were generally good."},{"rating":"4.5","review":"Excellent tour, well organised, last minute changes (due to imminent typhoon that we knew nothing about) sorted quickly. Really good, knowledgable guides with excellent English."},{"rating":"5.0","review":"Legend Travel were excellent at coordinating the entire trip. The hotels and guides were all first class. The itinerary was exhaustive and very diverse. I believe that I have received a good 12 day 'glimpse' of Vietnam. The people are most friendly, sincere and polite. The food was delicious. I had a wonderful time!"},{"rating":"4.0","review":"Great trip. Very busy, lots to see and do"},{"rating":"3.5","review":"The guides in themselves were great, although we at times were felt rushed from site to site. In terms of organization, we have to point out the following: \n\nA common problem was that the guides ALWAYS arrived about half an hour earlier at the hotel, so some of them ended up angry chasing us as we were still having our breakfast. Be aware, the times that you are given on the itinerary are all over the place! \n\nNext, we were looking forward to see Ho Chi Minh's Mausoleum, just to learn that it was closed that day. Did none of the organizers bother to look up opening times in advance?\n\nWe were always taken to restaurants were all the other tourists were having their lunch, which is understandable, but I found the many stops at some (quite aggressive) souvenir outlets more than annoying. You lose the will to have a look at anything when the shop assistant is a few steps behind you, asking what we want to buy. Not cool. \n\nAnother thing to complain would be the location of the hotel in Ho Chi Minh City. We were located in the Backpacker's district, which is extremely noisy and full of annoying street sellers.  \n\nAll in all the individual guides did a great job and we experienced a few special moments, but we would not do such trip again, as the program was too intensive and did not leave much time to relax. \n"}]},{"name":"Vietnam Snapshot","reviews":[{"rating":"4.5","review":"Phat was the perfect guide, knowledgeable, caring, approachable, responsible and entertaining."},{"rating":"4.5","review":"Our 12 day Food Tour was excellent. We visited a number of cities and sampled the regional cuisine, including a number of cooking classes where we learned about the ingredients and techniques of preparing Vietnamese specialties. Our guide (Nhi) was always informative, enthusiastic, and showed great patience as she answered our many questions."},{"rating":"4.5","review":"Great itinerary but wished it included hill tribes north of Hanoi. Rest was excellent. Especially liked Ha Long Bay and Hoi An. Saw beautiful sunset through cabin window in Ha Long Bay and had a shirt and pants tailored in Hoi An. People in the group were great and there were only seven total. Excellent, friendly, helpful tour guide - Jolie."}]}]