[{"name":"Simply Vietnam (New)","reviews":[{"rating":"4.3","review":"Up to the usual high standard, I look forward to my 10th trip with Explore!"}]},{"name":"Discovery Hanoi - Sapa - Ha Long Bay - Ninh Binh","reviews":[{"rating":"4.0","review":"The itinerary is very well established so you see the top spots available from Hanoi: Sa Pa, Ha Long bay and Ninh Bin. The pickup and dropoff at the hotel make you not to worry about anything. I put 4 stars as the guides need to slightly improve their English. Sometimes it's very hard to understand. The hotel and the boat were good. The hotel was in the heart of old city center of Hanoi.\nOverall it was a very good experience with very good value for money for around 50€/day. \nAnother thing is: be prepared to tip on all the activities. No tips at restaurants in Vietnam, but tips are expected by people involved in the activities you will do. This will increase the cost of your trip."}]},{"name":"8 Day Exploring Vietnam From North to South","reviews":[{"rating":"5.0","review":"Excellent Service from LVP Travel, We travel to VN in the winter by family, and book tours online for 5 people group, all pick up, hotels, flight tickets...perfect. there no complaints about Trip. Just leave some messages here to recommend tourists should book and choose this agent for your next trip , luxury but reasonable and great time in Sapa, Hanoi, Saigon\nRapkip and Sopharath"}]},{"name":"Vietnam - 8 Days","reviews":[{"rating":"4.5","review":"Would have liked more explanation on the significance of the sites we were visiting and the foods we were eating. A lot of our time felt like a checklist of activities - Ho Chi Minh Residence, check. 36th Quarter Buggy Tour, check. \n\nUnderstanding why these are important would have been nice. \n\nI think 1 or 2 meals on our own would have been nice too. Just to break up our time together. Otherwise, the meals were good and the variety of cuisines chosen were very good."}]},{"name":"Discover Ha Noi 5 Days 4 Nights (Hanoi, Halong Bay and SaPa)","reviews":[{"rating":"5.0","review":"Booking travels made so easy. The trip was very fun and pleasant. I’m really happy I booked with tourradar. I will definitely use you guys again."}]},{"name":"A Journey Through Vietnam (Overnight on board in Halong Bay)","reviews":[{"rating":"4.5","review":"Our trip was amazing. It provided us with a fantastic sample of what Vietnam has to offer."}]},{"name":"Vietnam Highlights Package 10 Days 9 Nights ( Hanoi, Ha Long Bay, Hue, Hoi An and Sai Gon)","reviews":[{"rating":"4.0","review":"So this may be my fault for not doing better research but this tour was not what I expected. I expected a group of people traveling together with one guide but that was not the case. It was more that hotels and day tours were booked for you. As a solo traveler that wasn’t really what I was looking for, but I enjoyed most of the activities. For one tour I was picked up on a motorbike which I really wasn’t comfortable with and wasn’t warned about. Also the itinerary I was given had pick up times that weren’t always accurate, and one day my driver came to pick me up a half an hour before scheduled. This would be a good tour if you are with a group already but if you are a solo traveler looking to meet other travelers I would not recommend"}]}]