[{"name":"Ben Tre Homestay - 3 Days","reviews":[{"rating":"4.5","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"3.5","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"3.5","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Private Package Hanoi 4 Days","reviews":[{"rating":"5.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"3.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Hanoi and Ha Long Bay 4 Days 3 Nights","reviews":[{"rating":"4.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.0","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Discover Vietnam 17 Days 16 Nights From North to South","reviews":[{"rating":"5.0","review":"The tour exceeded our expectations. From start, tour manager, Mahn from Vietnam Real Tours contacted me and continued to provide excellent communication throughout the tour. We wished to update the tour to provide extra days in a couple of places along the way. As it was a busy time of Tet festival, some of the journey details were rearranged by Mahn who dealt with all bookings to accommodate our wishes so we did not miss any part of the tour. The tour was excellent, providing flexibility with dates on each component from pick up from airport to hotel to day trip and continuation of journey. All happened so seamlessly as organised by Mahn which took any stress out of bookings to fit within 15 day stay without visa. The hotels booked on the tour by Mahn were thoughtfully located to explore areas and of the best quality. I had an injury whilst in tour and Mahn arranged an upgrade for us to make me comfortable having to miss a day trip. I thank him for his care with this. The sight seeing trips arranged for us were great too. Good English speaking and variety to give us taste of Vietnam. I normally arrange all components of a journey when travelling lots in SE Asia, to save cost. However, thought for short time, first time to Vietnam, it was easy to have independence of dates but everything arranged for us. Definitely worth the price to know good research has been done by to our manager having knowledge and communication with all hotels and drivers already. Small price to pay. Thank you so much, Mahn. I felt you genuinely cared for us and our journey."},{"rating":"4.5","review":"Booking this tour took every stress away from planning a wonderful trip to Vietnam. I wanted to see as much of what the country has to offer in a short space of time, and this tour really does account for seeing the highlights, as well as giving you the opportunity to explore things you may have planned to see yourself. All for such an incredible price, if you want to see the highlights of Vietnam then this is the tour for you!"},{"rating":"5.0","review":"They were very helpful. I planned for my trip but then I had to reschedule due to Visa problems and they helped me reschedule. Very nice and very organized"}]},{"name":"Easy Vietnam 16 Days","reviews":[{"rating":"4.0","review":"The tour was great, however the booking through your site was misleading. I originally tried to book a room for three but your site told me that wasn’t possible so I had to book a double and a single room for an extra fee. On arrival I was checked into a shared room with three single beds, so it was possible to do this. I told the tour manager of my situation which they were not aware but managed to find a single room for me that I’d payed a significant extra amount for. Please fix your site to reflect the room possibilities available on this cruise. Otherwise thank you for your communications and organisation this was fantastic."},{"rating":"4.0","review":"The party boat was amazing especially the second day on the freedom island. It is a peacefull and beautiful place....\nShow more"},{"rating":"4.5","review":"Highly recommend! Our trip was perfectly organised by GO TRAVEL AROUND and Abhishek, you are great!!! The customer...\nShow more"}]}]