[{"name":"4 Days Hanoi City Tour and Halong Bay Overnight Cruise","reviews":[{"rating":"5.0","review":"Strongly recommend Halong Bay tour made by Hanoi local tour to whom looking for the real experience from Hanoi. Everything was much better than our expectation. We loved everything about their services such as the staffs, guides, food, and the room. The tour was quite fun and we gazed at the majestic center of Halong Wonder Bay. In comparison with hundreds of travel agencies passing by we all agreed that Bravo Indochina Tours must be the best 5-star one"},{"rating":"5.0","review":"Great customer service, good prices, and excellent quality"},{"rating":"5.0","review":"4 wonderfull days in Northern Vietnam. We were in Hanoi and Halong Bay 2 days.\nIt was awesome. The Guides are well nowing in history and telling you a lot about it.\nLitte bit to much because you can´t keep everything in mind but very intristing. You understand very well what they are talking. Good englisch knowledge. Highly recommend using Bravo Indochina Tours if you want a well organised holiday, I would certainly use them again to tour Thailand, Laos etc."},{"rating":"5.0","review":"I would definitely recommend this tour and intend to do another one with this company. As a single traveller I particularly appreciated the fact that all the other members of the tour were extremely friendly and easy to get on with. Also, the guides were very knowledgable and enthusiastic and all of the activities we participated in were extremely interesting and enjoyable. The warmth of the local people was very touching and the scenery and sights were beautiful"}]},{"name":"Best of Vietnam for Teenagers - 9 Days","reviews":[{"rating":"4.5","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"4.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"5.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Hanoi to Hoi An For Teens - 8 days","reviews":[{"rating":"4.0","review":"This was my first tour and I wasn't sure what to expect. I think that our tour guide Kien made the trip amazing. He was clear and concise, entertaining, and provided lots of useful information. I enjoyed his talks about Vietnam history, culture, and people. He was always so helpful. I felt like he was taking very good care of us throughout the entire trip. I can't say enough about Kien! As for the itinerary, there were two days of travel that I found tiring. One was the overnight train sleeper train ride to Hue. It's not easy for me to sleep on a train with three other people in the same berth. Still, I am glad I tried it as now I can say that I've done it. Plus, the people in my cabin were lovely and nice. There was one day when we had to wake up at 330 am to catch a plane to Ho Chi Minh City. The trip notes referred to this as \"an early morning flight to Ho Chi Minh City.\" I guess it didn't sink in just how tiring that day would be. After the flight, we took a three hour bus ride to the Mekong Delta. If you add up the time spent waiting in the airport and the time sitting on the plane, I think we must have sat for at least 8 hours that day. I am normally a very active person and one thing I found difficult about this tour was getting enough exercise. I felt like we sat a lot of the time, e.g. on a tour bus, at the restaurants, on boats, on a plane, on the train, etc. Having said all this, I don't know how I could have seen all the things that I was able to see in 10 days. I really felt like I saw Vietnam on this trip. And I also felt that the tour was well organized, all except for the first and last hotel. We weren't told which hotel we would stay at in Ho Chi Minh so I could not book my hotel for the next day (we stayed an extra day) with knowledge of where we would be moving from. I also did not know the first hotel until much closer to the tour date. By then, I had already booked a hotel in Hanoi in the centre of town. TOURRADAR will book additional nights stays before and after the tour in the tour hotel but I found the cost to be much higher than what I was able to find on BOOKING.COM. All in all, I give this tour a five star rating because I don't think much can be improved given the itinerary. One additional comment - it was an unexpected joy to get a pair of pants tailored in Hoi An. I wish I had scoured magazines for pictures of clothes that I like in advance to have them ready when I arrived. I chose to get pants tailored only at the last minute and was pleased with the results. So inexpensive and the pants fit perfectly! It's best to order the clothes on the first day to have time to make adjustments if adjustments are needed."},{"rating":"3.5","review":"Guides were great. Airport pick up at Saigon not there and phone number supplied did not work from my UK phone. Had to ask another tour rep to phone. 3 hotels were very good,Saigon hotel was adequate and clean. Tours were very good."},{"rating":"4.0","review":"This trip included most of the highlights of Vietnam and Cambodia. It was stress free due to everything being organised efficiently. The pace was good and provision was made for people struggling with the more strenuous parts. There is quite a lot of walking on rough terrain. The guides were knowledgeable, helpful and friendly. The hotels are good or very good. The coaches were good. Food was good with non spicy options for the less adventurous in the group. Vietnam and Cambodia, especially, have lots of litter, motorbikes and smelly bits along with magnificent tourist attractions. We normally go solo but an \"On The Go\" tour of this part of the world had the benefits of good guides and organisation. We are pleased we chose them."}]},{"name":"Halong Bay Independent Adventure","reviews":[{"rating":"4.0","review":"Hotel room has 3 lights not working. The shower hose hasn’t  been cleaned for a couple months it was filthy."},{"rating":"5.0","review":"all of the accommodations were well planned"},{"rating":"5.0","review":"Trip is already planned"},{"rating":"4.5","review":"Extremely well organized both on tour of Halong Bay itself and extra one day in Hanoi.  Great value on accommodations and tour itself."}]},{"name":"Hanoi Short Stay 4 Days","reviews":[{"rating":"4.0","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]},{"name":"Mai Chau Trails","reviews":[{"rating":"4.0","review":"Our family of 5 enjoyed the Halong Bay 3-day bike trip. It was a nice way to see the area -- better than just viewing from a car window. Great guides!"},{"rating":"4.5","review":"Shame on me! We should have brought our own bikes! between us we own 9 bikes and would have had no problem as to cost or expense but the logistics prevented bringing our own. bikes were 4-6 years old, not properly maintained, for example no rear brakes, chain \"jumping\" when shifting. We felt bad for our guide who also was an excellent mechanic but due to lack of support from Spice Roads he did as good as can be expected. Unless you bring you own bike or just go for a day ride, I would seriously suggest that you shop around."},{"rating":"3.5","review":"Fantastic tour, with extremely diverse sights -- from the beaches of Central Vietnam to the temples of Angkor Wat. We particularly enjoyed the hill country of Vietnam (the climbing day was excellent) as well as the temple sites in Cambodia. The accommodations were generally no-frills (due, in part, to the remote locations we were traveling through), though the hotel in Angkor Wat was excellent. The meals were fantastic -- the guides did an excellent job of selecting restaurants with great local fare. Would definitely recommend."}]},{"name":"Ho Chi Minh - Cu Chi Tunnel - Mekong Delta 4 Days 3 Nights Package Tour.","reviews":[{"rating":"4.5","review":"Luco Travel is just the BEST. Louis is an attentive, thoughtful, and knowledgeable guide who is incredibly kind and takes great care to make sure you are well looked-after. He makes sure to put *your* objectives for the trip first and ensures you have a wonderful time. He has boundless energy and humour, and he helps you to learn a lot about the history and culture of Ho Chi Minh City, Cu Chi Tunnels, Mekong Delta, and Vietnam overall while also making the trip super fun! He is also keen to know more about his tourists and open up about himself, which makes it seem like he sincerely loves his job and working with people. We were a fairly big group, but we were no trouble for Louis and his staff to manage; everything ran super smoothly with no issues. For us, it truly was the trip of a lifetime. Amazing tour operators deserve our support, and we really hope you'll support our dear guide, Louis. You won't be disappointed!"},{"rating":"5.0","review":"If you are a outgoing person or novel seeking person, If you want to gain cultural experiences, If you want to meet locals, If you want to know Vietnam culture deeply, Don't Hesitate just join their tour to explore it. it's worth it for you to travel Vietnam with Luco Travel."},{"rating":"4.0","review":"the schedule was quite smooth and thanks for his caring"}]}]