[{"name":"Simply Vietnam","reviews":[{"rating":"5.0","review":"We had an excellent experience, despite the challenging circumstances with Covid 19. We felt very safe and cared for . We had a superb guide in Hüng Trân Nguyen."},{"rating":"4.0","review":"Very good look at the country"}]},{"name":"9 Days Essential Vietnam trip from South to North, Max 6 Guests","reviews":[{"rating":"4.5","review":"All the excursions we went on were excellent. They provided us with a good amount of time and information for each. The tour guides were amazing. They were all very nice, welcoming and helpful. We would like to acknowledge our tour guides, Joey, in Ho Chi Minh city and Fifi in Hanoi because they were especially friendly, conversationalist, and always ready to help. They were astounding and made our trip even better. If we make this trip again, or if we recommend friends to do so, we hope they can be our tour guides again. However, we feel there were too many temples and so much information. We would have enjoyed to see less temples and have done a few different activities such as beach visits, etc. Overall, it was an unforgettable experience. Tour Radar did an amazing job in organizing the trip from the excursions, to our meals, to always providing fresh water for us, and tour guides always being on time and always ready to help us out. We would definitely use Tour Radar again, and we will surely recommend others to use Tour Radar as well. Thank you!"},{"rating":"4.0","review":"Everything was great a little too much temple’s for my taste but overall good, I definitely will book again and recommend"},{"rating":"5.0","review":"This was a fantastic value. The guides were fantastic and so was the itinerary. The hotels were so so. Two were terrific and two not so great. However excellent trip and tour radar service was top notch. Definitely recommend"}]},{"name":"Ha Noi - Ha Long Bay - Overnight On Cruise 4 Days 3 Nights Package Tour.","reviews":[{"rating":"4.0","review":"Luco Travel is just the BEST. Louis is an attentive, thoughtful, and knowledgeable guide who is incredibly kind and takes great care to make sure you are well looked-after. He makes sure to put *your* objectives for the trip first and ensures you have a wonderful time. He has boundless energy and humour, and he helps you to learn a lot about the history and culture of Ho Chi Minh City, Cu Chi Tunnels, Mekong Delta, and Vietnam overall while also making the trip super fun! He is also keen to know more about his tourists and open up about himself, which makes it seem like he sincerely loves his job and working with people. We were a fairly big group, but we were no trouble for Louis and his staff to manage; everything ran super smoothly with no issues. For us, it truly was the trip of a lifetime. Amazing tour operators deserve our support, and we really hope you'll support our dear guide, Louis. You won't be disappointed!"},{"rating":"3.5","review":"If you are a outgoing person or novel seeking person, If you want to gain cultural experiences, If you want to meet locals, If you want to know Vietnam culture deeply, Don't Hesitate just join their tour to explore it. it's worth it for you to travel Vietnam with Luco Travel."},{"rating":"4.5","review":"the schedule was quite smooth and thanks for his caring"}]},{"name":"Vietnam experience 15 days","reviews":[{"rating":"5.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"The Most Amazing Vietnam 13days/12nights","reviews":[{"rating":"5.0","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"4.5","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Cycling Vietnam","reviews":[{"rating":"5.0","review":"The Vietnam cycling adventure was amazing. I wasn't expecting the level of care and accomodations that Exodus Travel provided and our guide, Tung, and crew were excellent. And a great group of participants! Trip of a lifetime, thanks."},{"rating":"5.0","review":"Had a great trip with 8 cyclists. Can’t imagine the maximum of 18 people which is how the trip is described. Our trip leader Tri Was utterly amazing! So caring and conscientious and helpful to everyone  in fact our support team and trip leader were the best! I could not have asked for more. Most of recycling areas in the country were just beautiful. Could have avoided the larger cities due to so much traffic. The addition of cultural experiences was a nice touch.Tri Was able to give us a lot of information and history while on the bus which was appreciated by all. I would highly recommend this trip if the number of participants was kept to the Lowe number!!"},{"rating":"4.0","review":"The trip was described as a trip to Vietnam primarily by biking but was instead a bicycle trip with Vietnam as a backdrop. The trip was so demanding in terms of biking and most of the rest of the time was spent on buses traveling from place to place that we didn’t get to actually experience most of the sights that were described in the itinerary and had almost no connection to any locals other than our guide. Our guide saw himself as a biking guide and gave us little information about the country, its people, history, etc. His English was difficult to understand particularly his comprehension of questions or comments. He also wanted to please all the participants and was not adept in dealing with interpersonal issues."},{"rating":"4.5","review":"Everything was great, very well organized.  Tri, the tour guide, the mechanic and bus driver were all great!"},{"rating":"4.0","review":"I thought it was great! The cycling was more difficult than expected, but I kept up! I didn’t need the long sleeves and pants as much as was recommended, or the warm clothes for the Northern part Hanoi or Halong Bay. I liked it very much!"},{"rating":"5.0","review":"The tour was fabulous.  Our tour leader Long Le, kept us on schedule, helped out on whatever we needed.  Moving from hotel to hotel was easy, everything was taken care off.  No lost luggage or other traveling issues.  The meals were wonderful, very authentic and representative of the local cuisine."},{"rating":"5.0","review":"Mr Chi was an excellent guide who made this tour a wonderful experience. His knowledge of Vietnam and his focus on detail made sure that a complex tour itinerary worked like clockwork. His support team also carried out their roles in a professional and very friendly manner. Their customer focus was exemplary. I believe that Mr Chi and his team deserve a lot of credit for making this tour such an enjoyable experience."},{"rating":"4.5","review":"Overall the trip was more than we expected. The guide and his 2 assistants were terrific and so helpful."},{"rating":"5.0","review":"Fantastic tour guides everything"},{"rating":"4.5","review":"An extremely well organised tour. Felt completely  looked after from the pick up at the start to the drop off at the end.\nChi Nguyen the tour guide was excellent - informative, humorous and unobtrusively organised. The support team were brilliant too - bikes well maintained and a regular, timely supply of drinks, fruit and snacks.\nIt’s a huge country so there were some long transfer times on the coach.  Very good hotels.\nWould definitely recommend it - and definitely pack light as you stay in so many different places."},{"rating":"5.0","review":"Best tour ever; very well organised and everything with a smile. Chi and his crew made it unforgettable"},{"rating":"5.0","review":"The best tour ever. Chi and his crew had organized everything to perfection and all with a smile. Very good combination of sport, food, culture, transport etc."},{"rating":"5.0","review":"full of lots of activities but mostly the guide is what made the trip exciting, seeing all we could see, being inclusive of all"},{"rating":"5.0","review":"Lam and crew offer the best customer service I have ever seen!  They took great care of us like we were royalty."},{"rating":"4.5","review":"This was a very good organised tour. Everything was perfect.\nI would prefer staying in smaller hotels, but the standard was good\nThank you very much for this experience"},{"rating":"4.0","review":"that's great tour I love it!"},{"rating":"5.0","review":"Everything about this trip (14 day cycling holiday, from Ho Chi Minh city to Hanoi) exceeded my expectations.Linh Vo our guide, plus his back-up team,were outstanding.I’ve already recommended him for the Exodus Tour Leader awards.The cycling itinerary was well planned, and executed.All 18 members of our group had a fantastic holiday.Thank you Exodus Travel."},{"rating":"5.0","review":"Danh the guide was just faultless, his knowledge, time management, humour, people skills and persona were excellent."},{"rating":"5.0","review":"The planning, organization and accommodation were excellent. Our guide, Long Lee, was wonderful - informative, humorous and firm, he did an excellent job of encouraging and inspiring us while keeping us safe.  His support staff were ever thoughtful, helpful and reliable.\nThe only area I would recommend improvement in was the Rincon mountain bikes.  Giant hasn't made those bikes for a number of years now and, they are in my opinion, really showing their age.  The gears did not shift smoothly and one of our rider's seats came off suddenly.  It is time to replace these bikes.\nI loved the tour. One of the questions I will ask when signing up for another will be the age of the bikes we'll be riding."},{"rating":"4.5","review":"It was a truly amazing tour, exceeded all expectations - even after reading many many good reviews. Our tour guide, Lam, and his team, Xiu, Sao and Chu were brilliant, superbly organized, extremely helpful and always cheerful. Lam is a wonderful motivator who managed to get all 16 of us to cycle the Hai Van Pass in lashing rain and high winds - couldn't have done without him. \nWe tried a variety of means of transport as well as accommodations and dining - all of which added some extra value to this already unforgettable trip.The beautiful scenery, friendly people and remarkable sights along the way kept us amazed and made it the journey of a lifetime. I can only recommend it."},{"rating":"3.5","review":"My husband and I joined the 14 days Vietnam Cycling via Exodus Travel. Everything was good if not great. Except 3 \"little\" things:\n1. We were expected to pay approximately US$100 per person of tips to all the guides. I do not mind about the money because the service was excellent, however I prefer this was told before I joined the tour rather than after we arrived the destination.\n2. The lunch provided were just not good. No way close to \"mouth watering\" as stated. Not only lack of local specialties, they were extremely boring. In fact, I thought of \"my sister's cooking when she was very sick\". \n3. There were NO space for our bikes on the train. \nWe informed Exodus that we were bringing our own bikes in boxes and they said no problem. However, only when we were ON the train at Hue that we were told \" you are not allow to bring your bike on the train, and there is NO place to store your bike\". The result was we were given a \"teaching\" on the train, and several \"fines\" by the several \"officials\" when we arrived the destination. \nAs there were NO space to store our bikes, the only space was one of our bed. In another words, we were not able to \"sleep\" from Hue to Hanoi overnight train."},{"rating":"5.0","review":"This was one of the most memorable holidays i have had- largely due to our fabulous, amusing and passionate group leader - Tho ( Tom) Nugyen, the fun loving fellow cyclists and the delightful Vietnamese people we met along the journey. The  route was interesting, the cycling was challenging enough to remain  enjoyable and our guide and support crew went out of their way to make it the best experience for us. I loved every part of Cycling Vietnam and would recommend it to anyone who wanted to experience authentic Vietnam.   What was the most inspirational moment of your trip?  Each day had a highlight for me! The 30km downhill was a real buzz, visiting the Buddhist monestry and orphanage was heart renching, the fabulous fresh fruit, drinks and sweets prepared by the crew for our morning and afternoon breaks, the delightful children along our route and the wonderful overnight boat trip in Ha Long Bay would be up there with especially memorable moments.   What did you think of your group leader?  Tho Nugyen was such a nice person with a wonderful sense of humour, and his passion and respect for his country was contagious. As the group leader Tho set the tone for the group and he was a joy to be around. He looked out for each member of the &#xC2;&#xA0;group and tried to ensure that each person achieved what they wanted from their holiday. Tho went out of his way to smooth arrangements impacted by the typhoon and we felt that Tho went the extra effort to resolve any issues &#xC2;&#xA0;that arose- he was often seen with 3 phones on the go at once!!. &#xC2;&#xA0;I loved especially how Tho would present us with the problem and 2 - 3 ways to resolve it. He was a real gem, knowledgeable, informative and thoughtful and his goal was to make this trip a memorable experience for us - and indeed it was.   Do you have any advice for potential travellers?  You should be cycling fit to obtain the maximum benefit and enjoyment from the trip. All up we cycled around 550 kms ranging each day from between 30 kms to around 107km- and there was some undulating ( read &amp;quot;hilly') passages along they way with temperatures reaching the 30s on occasions. While the bus and support crew are there to help and you can leap onto the bus when your legs have had enough, the best sightseeing and interaction with locals comes when you are on your bike.   Is there anything else you would like to add?  This is the only guided tour i have done and the 'Cycling Vietnam' trip exceeded my expectations. Tho and the support crew were thoroughly professional and I was impressed by the level of organisation that went into each day. It was a fabulous experience in every way."},{"rating":"5.0","review":"We had a great time.  Danh was a great tour leader, full of enthusiasm for his country, our trip, cycling and our enjoyment.  Led his team superbly.  Never fazed by mini \"disasters\", took everything in his stride and with a smile.  We had a very good taste of the real Vietnam, not just the tourist traps.   What was the most inspirational moment of your trip?  Don't really like long downhills but really enjoyed the 34K descent we did.&#xC2;&#xA0; Total quiet, beautiful scenery, fabulous.&#xC2;&#xA0; And of course Hoi An is truly wonderful   What did you think of your group leader?  Simply the best, better than all the rest.&#xC2;&#xA0; Have been on many cycle trips with Exodus and your competitors, so I feel I am qualified to judge.&#xC2;&#xA0; &#xC2;&#xA0;Danh never just went the extra&#xC2;&#xA0;mile, he went the extra 500K.&#xC2;&#xA0; It always felt that we were his number one priority and nothing was too much trouble.&#xC2;&#xA0; I think he was a true friend to all of us.Very knowledgable about his country, history, customs etc.&#xC2;&#xA0;   Do you have any advice for potential travellers?  Several laundry opportunities so you really don't need all those clothes.........   Is there anything else you would like to add?  Would like to see always something on the back of my bike &#xC2;&#xA0;to carry my bits and pieces, not a full sized pannier, but something.Have been to Vietnam before and really think a missing part of this trip is the Mekong Delta - but of course you would have to take something else out!"},{"rating":"5.0","review":"Fantastic holiday - cycling is a great way to see the country.    What was the most inspirational moment of your trip?  Each cycling day had many highpoints, but for me the best day was the last one when we cycled 10k up the Danang-Hue pass, then 10k down again in torrential rain !! Ended the trip cycling through the villages as the children were leaving school.   What did you think of your group leader?  Simply the best ! My expectations for future exodus trip have been set extremely high.&#xC2;&#xA0;Not only were Danh and his team 110% safety conscious, he also ensured we experienced a variety of excellent food and gave us extensive insight into the culture and history of the country.   Do you have any advice for potential travellers?  The hotel accomodation was far better than I expected, so don't bother with a mosquito net !The markets in Ho Chin Minh sold good quality rucksacks, waterproofs, caps, casual crossbody bags plus lots more, so providing you plan to get there before midnight, you could pick up most things you need when you get there.&#xC2;&#xA0;Oh, and if you fly Malaysia airlines, carry plenty of spare clothes on the airplane with you. On the way there the baggage missed the connecting flight, and on the way back there was a 14 hour delay in KL - we were sent to a hotel for the night without luggage. Malaysia airlines don't supply sleepmasks/earplugs/toothpaste/toothbrush like most other airlines do on long haul.&#xC2;&#xA0;   Is there anything else you would like to add?  Try and watch Top Gear Vietnam before you go !!"},{"rating":"5.0","review":"A wonderful holiday - fabulous country, great company, delicious food, spectacular scenery, and the best guide ever (Danh).\n   What was the most inspirational moment of your trip?  Getting to the top of the \"bloody\" hill (it was only big in our minds!);&#xD;\nDrinking beer on nursery stools in the road;&#xD;\nWatching sea eagles fish;&#xD;\nCycling downhill through a herd of goats when I couldn't see where I was going because of torrential rain;&#xD;\nBeing entertained by Danh, whose giggle is infectious!&#xD;   What did you think of your group leader?  They don't get any better!&#xD;   Do you have any advice for potential travellers?  Do this trip, you won't regret it! Just ensure you are moderately fit, the rest will come with practice!&#xD;\n&#xD;"},{"rating":"5.0","review":"Great mix of activity, culture, history and socialising"},{"rating":"5.0","review":"Friendly, helpful staff; quality hotels; nice roads and a great route.   What was the most inspirational moment of your trip?  The last full day of cycling had about 30km on the flat then a 10km climb, 10km descent and then about 50km flat. The climb was challenging but not impossible. I was amazed at how much fitness I gained whilst on holiday. Since it was the last major day of cycling, I decided to ride as quickly as I could for the last 30km and was amazed that I continued to feel great as I pushed myself well beyond what I would have been capable of just a few weeks earlier. It was so nice to relax in the hotel pool after such a day.   What did you think of your group leader?  The leader was friendly and helpful. He had some great insights into Vietnamese culture and history.   Do you have any advice for potential travellers?  I was the only person on my trip with my own bike (a touring bike). Whilst it was lovely to be on my own wheels, I think it was more trouble than it was worth. After buying a new suit in Hoi An, I ended up paying about US$200 in excess baggage so there was no real cost savings.   Is there anything else you would like to add?  Cycling is a wonderful way to see Vietnam. It is quite a densely populated country so even though we were in the country, most of the time there were plenty of houses around and there were no shortage of children shouting &amp;quot;hello&amp;quot; or wanting high-fives as we went past.It was fantastic to be driven to the best places to ride. I expected more potholes and gravel road but often the roads were of about the same standard as my local area (Melbourne, Australia). Having said this, I would not want to ride a racing road bike on this trip. I have a pretty solid tourer and that was perfect.&#xC2;&#xA0;This sort of trip could be done without a touring company like Exodus but it wouldn't be half as enjoyable. Being ferried to the right places to ride, regular drink stops with lemon drink and tropical fruits being served as well as having all the accomodation hassles removed is worth every cent of the cost of the tour.This was my first Exodus trip but many other travellers had done several. I can see why. I would strongly recommend this to anyone who wants to have a holiday and come back in better shape than when they left.&#xC2;&#xA0;&amp;nbsp;"},{"rating":"5.0","review":"My husband and I have just returned home from our cycling trip and we can't wait to plan our next tour! Our holiday far exceeded our expectations. We had a great group, so ably led by Linh our tour guide. We were a little worried that we wouldn't be able to cope with the heat and humidity on the trip as we are both in our 50's but the backup we received from Linh, Y and the bus and truck drivers was amazing. Nothing was too much trouble for them. Their support and consideration made the experience an unforgettable one for us. We loved Vietnam - the food, people and country side. Well done Exodus on an exceptionally well organised tour. We have travelled with other tour organisers before, but from now on it will be Exodus all the way.    What was the most inspirational moment of your trip?  We loved the diversity of the tour. The challenge of cycling through little towns, the different resturants we ate in, the cooking class and the shopping experiences along the way. The children calling &amp;quot;hallo&amp;quot; as we passed was good fun but the stand out was the cruise on Halong Bay. It was a beautiful, relaxing way to end the trip.   What did you think of your group leader?  Our group leader, Linh, was exceptional. He went out of his way to ensure we were all safe and enjoying ourselves. He taught us so much about his country. It is great having a local guide. It really made the experience!   Do you have any advice for potential travellers?  We battled a little with the heat and humidity on the days we cycled bigger distances. I think it would be preferrable to cycle at a different time of year - probably November to March."},{"rating":"5.0","review":"I had very high expectations of the country having wanted to go there for over 10 years and put the trip off on a few occasions. I know many people who have been to Vietnam and they have all come back with glowing reviews and this trip did not let me down at all. I can honestly say that I enjoyed every single day and was amazed with how beautiful and old fashioned the country. Honestly, this is the best way to see a country as you really do take in sights, sounds and smells of it (plus a bit of mud, grit and diesel fumes). It will take a lot to top this trip.   What was the most inspirational moment of your trip?  Cycling to Dalat and up the Hai Van Pass were personal highlights as the scenery was so beautiful I did not dare stop when the going got tough as I wanted to savour the sights rather than zip through them on the bus. I can honestly say that around every corner and over the top of every hill was a sight worth seeing and savouring. One turn it might be a peaceful river scene with a little boat gently putt putting its way around, the next you might see a load of water buffalo snouts poking through the water right the way through to beautiful rainforests, the most stunning beaches and ocean views I can say I have seen anywhere in the world...to date.   What did you think of your group leader?  Danh was great fun and had a good blend of knowledge and humour all throughout the trip. Cocktails on the sleeper train, cramming all 19 of us into a 4 man cabin on the sleeper train and the &amp;quot;penguins&amp;quot; are all good examples of his sense of humour. Always made sure that the pace of the trip was suitable for all members and gave good guidance as to what was coming up in terms of the following day and what we needed to do, where we needed to be and by when.   Do you have any advice for potential travellers?  Do train for the trip as elements of it are tough. If you are relatively fit and take your time in the granny gears you can climb anything.  Read up on Vietnam as there is a lot of history that you will be ignorant to.  Whatever you plan on packing, I would say halve it and then take a few less items. You will only need 2-3 set of cycling clothing and the same for the evening. As Ryan said in the review before this one, you can buy anything else very cheaply when you are out there.  Take a mixture of Vietnamese Dong and US Dollars as both are useful to possess. You can change money in the hotels are decent rates without commission being charged as well.&#xC2;&#xA0;  &#xC2;&#xA0;   Is there anything else you would like to add?  If you have any questions regarding the trip, please feel free to contact me via my profile links."},{"rating":"5.0","review":"This trip seemed to have the right balance. A good amount of cycling with also a good portion of sightseeing. A good balance of hill and flat roads  and city and rural roads.   What was the most inspirational moment of your trip?  Final night drinks in Hanoi.&#xC2;&#xA0;&#xC2;&#xA0; And doing a 1700 meter downhill!   What did you think of your group leader?  Very good. Great attention to detail.&#xC2;&#xA0; A high level of organisation made everything run like clockwork.   Do you have any advice for potential travellers?  Take 3 changes of cycling gear. Don't bother taking too much else in the way of clothes.&#xC2;&#xA0; (buy cheap clothes there!)   Is there anything else you would like to add?  It would not like to live in Vietnam, but it is one hell of a place to visit."},{"rating":"5.0","review":"It was a trip that had a lot of promise,and it delivered it ,and indeed exceeded expectations.I would have difficulty in suggesting improvements,without lenghtening the duration of the trip.   What was the most inspirational moment of your trip?  The inspiration came from the people,and especially the kids who greeted us so enthusiastically.The people were friendly and welcoming,and placid-despite the overwhelming number of mopeds on the roads I never once encountered road rage !The scenery at times was spectacular,and the hotels were generally better than expected.   What did you think of your group leader?  Chi was superb,and hugely popular with the group. He was everything an excellent guide should be-knowledgeable,helpful,courteous,good sense of humour,always in complete control in a very relaxed way.   Do you have any advice for potential travellers?  I am not a serious cyclist-I am used to short rides of 2 hours or less-and I had no trouble with the cycling apart from the Mai Van Pass where I struggled,but made it ( I am in my sixties !&#xC2;&#xA0;).I did experience though saddle soreness at times,as did many others , so a gel cover is essential. Perhaps also a chamois cream.We were extremely well looked after at rest stops with refreshments-no need to take your own with you.Take care with the downhills,and with potholed roads - we had 2 accidents,neither fortunately too serious,but serious enough to stop any further cycling for the 2 individuals for the rest of the trip.   Is there anything else you would like to add?  I cannot recommend this trip highly enough-if you are considering but are not sure,do it-and do it before too long before tourism takes a big hold as it&#xC2;&#xA0;most certainly will in the next few years."},{"rating":"4.0","review":"Everything I’ve come to expect from Exodus.  Excellent organisation, great hotels, fabulous food and the best guide yet.  If you do this trip…..you want Chi as your leader!   What was the most inspirational moment of your trip?  The 30k downhill was superb and surprisingly riding through the tail end of a monsoon&#xC2;&#xA0;gave a real energy boost.&#xC2;&#xA0;&#xC2;&#xA0; The freshness after 3 days of humidity was wonderful.   What did you think of your group leader?  Chi organised the trip impeccably.&#xC2;&#xA0;&#xC2;&#xA0; He was fabulous and both him and his aides Nang, Can&#xC2;&#xA0;and Lee&#xC2;&#xA0;worked tirelessly to make the trip memorable and fun. &#xC2;&#xA0;&#xC2;&#xA0;This was my 8th trip and Chi was easily the best guide I&#xE2;&#x80;&#x99;ve had.   Do you have any advice for potential travellers?  Buy souvenirs when you see them.&#xC2;&#xA0; I was surprised at how localised items were.&#xC2;&#xA0; I saw a beautiful wooden bowl at one lunchstop (after the 30k downhill) and didn&#xE2;&#x80;&#x99;t buy it because I assumed there would be more&#xE2;&#x80;&#xA6;there weren&#xE2;&#x80;&#x99;t!&#xC2;&#xA0;&#xC2;&#xA0;&#xC2;&#xA0; also, at the top of the 10k hill you have to run the gauntlet of pearl bracelet sellers but these don&#xE2;&#x80;&#x99;t appear elsewhere.&#xC2;&#xA0; Definitely buy something if&#xC2;&#xA0;you like&#xC2;&#xA0;it.The boat in Halong Bay was wonderful.&#xC2;&#xA0; In fact every night&#xE2;&#x80;&#x99;s accommodation was of a far higher standard than I expected / have experienced on other trips.As mentioned by others, there was a delay in some of the groups luggage arriving.&#xC2;&#xA0; Make sure you carry at least one cycling outfit and one casual outfit in your hand luggage.Don&#xE2;&#x80;&#x99;t go mad downhill!&#xC2;&#xA0;&#xC2;&#xA0;&#xC2;&#xA0;&#xC2;&#xA0; There are long transfers on the bus so take music/book/pillow.   Is there anything else you would like to add?  The cycling was a great deal harder than expected because of the humidity.&#xC2;&#xA0;&#xC2;&#xA0; If you struggle in the heat this should be a definite consideration as to whether you book the trip (I found it far worse than India!)"},{"rating":"4.0","review":"Everything I"},{"rating":"5.0","review":"An amazing adventure that will always be a great memory. First Exodus trip, now planning our second   What was the most inspirational moment of your trip?  Seeing all the children on the side of the road as we cycled through the remote villages.Cycling downhill 30km and on another day cycling up 10kmThe Vietnamese people are a happy nation.Great crew who looked after us   What did you think of your group leader?  Chi and his 3 helpers were excellent. Chi's knowledge of his country was immense and he had a great sense of humour. Really well organised although I did think we could have got going quicker after some stops.   Do you have any advice for potential travellers?  We didn't have any problems with mosquitos.The overnight rail journey wasn't great - a lot of tired people next day.Our baggage didn't arrive on our plane but about 8 hours later. Consider putting any important cycling kit in hand luggage.Generally it is very cheap to eat and drink. If I went again I would take mainly Dong rather than Dollars.Waiting 6 hours at Kuala Lumpar on return wasn't fun especially as some in group caught a later flight with a much shorter wait.We had two crashes which kept the injured parties off the road for a couple of days - it is safe but you need to be careful   Is there anything else you would like to add?  Our fellow travellers contributed to a great holiday. The slower cyclists were very considerate and minimised any waiting around by getting started quickly after a stop.Chi organised some great group dinners in the evening.Night in Halong Bay exceeded our expectations.Hotels were generally of a good standard"},{"rating":"5.0","review":"This trip exceeded my expectations of the adventure I had signed up for. Vietnam is a beautiful country and there is no better way to get a real feel for the culture and 'real Vietnam' than to cycle through it. The cycling itself was great, I would say at the high end of moderate on some days, but the bus is always there for people who do not want to climb the hills.   What was the most inspirational moment of your trip?  Probably the children in the small villages and towns who wave, shout out hello and try and give you a 'high five' as you cycle past. These children are obviously poor, but they are so happy that it teaches us something about out material way of life.&#xC2;&#xA0;The ever changing scenery from coastal, to mountain and frm small villages to bustling cities is the other main memory of the trip, and Halong Bay is just fantastic!   What did you think of your group leader?  Tho was a great Group Leader, and let's not forget the support team (2 drivers plus the mechanic). As a team they worked very well indeed and we were shown places that 'normal' tourists would not see, ate in small house restuarants and generally avioded most of the tourist traps. Tho worked tirelessly and was knowlwdgable about the culture and history of Vietnam, always willing to talk about anything. Organisation was great: Turn up when you are asked to and that is all you have to worry about. Working as a team on the ride you should never get lost, but can ride at your own pace.   Do you have any advice for potential travellers?  Bring good quality padded cycling shorts (at least 2 pairs) and some 'bun cream'! Most people wear loose shorts over the top of the lycra ones. The only people who suffered were those who were saddle sore.Don't rush the rides through the most senic areas, stop, take photos, soak in the atmosphere!! Most of our group did.&#xC2;&#xA0;&amp;nbsp;   Is there anything else you would like to add?  If you are looking for a bit of an adventure that is not too grueling, with good oriental food and some sightseeing in between the cycling then this is a great trip. Our Group Leader said that every day would be another best day.. and he wasn't often wrong!!"},{"rating":"5.0","review":"A tough experience but thoroughly rewarding when you completed your day of cycling.   What was the most inspirational moment of your trip?  Cycling downhill through Bidoup Nui National Park, 30kms of winding roads in the glorious sunshine and wind against you, the view was amazing.Riding through the villages and children coming out and high-fiving youSeeing the amazing gravestones in one of the villages, known as Ghost CityWatching how happy and content&#xC2;&#xA0;the Vietnamese people are even with the simplest things in life, teaches us westerners some things as we have so much and are still never happy!   What did you think of your group leader?  Tom was brilliant!&#xC2;&#xA0; He couldnt help people enough and had so much knowledge.&#xC2;&#xA0;His quote summarised the trip - 'Everyday is another best day'   Do you have any advice for potential travellers?  Make sure you practice riding even if you are reasonably fit.&#xC2;&#xA0; I thought I was quite fit as I play netball and do bootcamps and am quite active but nothing prepared me for those long days on the bike and especially the hills!&#xC2;&#xA0; Make sure you take lots of padding for your backside!   Is there anything else you would like to add?  I really enjoyed this trip even though I am not a cyclist, just seeing the amazing places and people was fantastic and having a great group and leader makes all the difference, thankfully we had both!"},{"rating":"5.0","review":"This was a fantastic tour: a reasonably amount of cycling (329miles), some amazing scenery and some cultural highlights. The Vietnamese people were very friendly - even getting invited to sing at a wedding which we declined - and the food was great. Hotels were in the main pretty good and the boat around Halong Bay far better than expected. Organisation of the tour first class and couldn't be faulted.   What was the most inspirational moment of your trip?  The 30Km decent down the mountain from Delat and achieving 103.1 KM that daySwimming in the surf in the South China sea in Mui Ne as the sun setThe fishing village at Ngn Trang where very few tourists go. Also passing through the villages off the beaten track.Hoi An lit up at night, the rice cakes being crisped up and the hand made shoes being madeThe Mausoleum to Tu Doc in Hue and the Citadel.&#xC2;&#xA0;Learning about the history of Vietnam and something of the culture.&#xC2;&#xA0;The lagoon at Halong Bay.Local Markets &#xC2;&#xA0;The reviving lemon drink! &amp;nbsp;   What did you think of your group leader?  Danh was fantastic. Nothing was too much trouble to sort out. He was friendly and knowledgeable. The organisation of the tour went like clockwork. I can't praise him highly enough.   Do you have any advice for potential travellers?  It&#xC2;&#xA0; is worth seeeing this tour as a tour of Vietnam with some cycling, although some days are quite hard. I think we had 3 days over 80km which is quite hard on a mountain bike with pretty thick tyres. I took clip-on pedals and cycling shoes - which certainly helped me although only 2 us did in a party of 19.There are quite a few long session on the coach but this is more than main up by seeing the main cultural highlights of the country. There are stops every 20km but it is really too hot to wear a back pack (although some did). I brought a small carrier that can fit on the back of the bike a take a compact camera, my glasses and an energy bar which I found useful. A couple of 'wicking' tops were good.   Is there anything else you would like to add?  &#xC2;&#xA0;Would have like more time to explore Hanoi The tour of the Citadel in Hue was rather rushed but understand this not everyone wants to spend time looking at ruins!&#xC2;&#xA0;"}]},{"name":"Vietnam Highlight with 12 Days 11 Nights","reviews":[{"rating":"4.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Viet Nam Explore 12 days 11 nights (Ha Noi- Ha Long- Hue- Hoi An- Ho Chi Minh- Mui Ne)","reviews":[{"rating":"5.0","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"5.0","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"Cycle Vietnam’s Back Roads","reviews":[{"rating":"4.5","review":"A great tour that gets you to some wonderful places. The right mix of activity and tranquility. Laos was an amazing country that I would love to go back to and see again! As ever Gadventures did an amazing job."},{"rating":"5.0","review":"Excellent tour, our tour guide Prado was very knowledgeable and helpful with any requests. Good mix of busy days and relaxing days"}]}]