[{"name":"Wonders of Vietnam tour 15 Days","reviews":[{"rating":"5.0","review":"We did 15 day Vietnam Wonder tour with Andy. Our tour was phenomenal. Our guide in Saigon, Hai, was professional but had a great sense of humor and made the day fun and enjoyable. He speaks perfect English and is able to form a great connection with his guests. The pace of the tour was perfect - fast enough to keep the day moving but we alternated with some stops and slower activities so we didn't burn out. We saw all of the top sights and bypassed every line. We walked into the sights feeling like VIPs and knowing exactly what to do and where to go. This was the best tour I've done throughout all of my travels in Europe and Asia. We were sad when the tour was over and throughout the rest of the week in Bangkok we kept saying, \"We wish Hai were here right now!\" I 100% recommend Bravo Indochina Tours and was completely impressed with the tour. I look forward to returning to Asia and doing more tours with Bravo Indochina Tours"},{"rating":"5.0","review":"This was our first visit to Vietnam and Toni responsive and customized our tour without issue. Our tour guide Chloe was friendly and very informative. We learned more about the country, its rich history and people than we would from a self-guided tour. We were very pleased with the tour and truly enjoyed our time in this wonderful country!! Would recommend them anytime."},{"rating":"5.0","review":"We loved the tour. All the guide was exceptional . They was very well organised and careful to manage them group dynamic sensitively . Our group was 16 people and was a good balance of ages from 20 to 60 . The tour we did was a great balance  of history, visiting  local people and seeing the country  and wildlife.   The hotels were all excellent . Security had been stepped up in Sri Lanka since the bombings and we felt very safe"},{"rating":"5.0","review":"We are back from our trip with nice memories of this beautiful country. The history behind the places we visited, the natural beauty, the fantastic local cuisine and above all the hositality of the local people made our holiday memorable. We went through Bravo Indochina tours on the recommendation of a friend who had used their services last year and believe me we have no regrets !\nWe opted to take the Visa on arrival. Since we had printed the online form, filled it and kept it ready with the necessary fees and photos, we were done and out in less than 15 mins.\nThe transport was good and always ontime. The hotels were 3-4 stars and they were comfortable, clean and well located and the tour guides were helpful all times.\nThe tour coordinator made it a point to check with us about our food preferences, allergies etc and these were adhered to strictly. We opted for the local cuisine. The meals served were good in most places with set menus. All the guides so  friendly, supportive, enthusiastic, and often really funny to spend time with.\nAll in all it was a wonderful trip. Thank you Bravo Indochina Tours for makes out visit so seamless"}]},{"name":"Hanoi Hilton Opera - Paradise Luxury Cruises 5 Days/4 Nights","reviews":[{"rating":"3.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Orchid Cruises Halong Bay plus Bakhan Village Resort 6 Days Trip","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"3.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"3.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Halong Paradise Luxury Cruises 2 Nights plus 1 Night in Bakhan Village Resort","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Hanoi To Hoi An Ancient Town 7 Days","reviews":[{"rating":"4.5","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Unique Central Vietnam Tour 6days/5nights","reviews":[{"rating":"5.0","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"5.0","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"10 Days in Vietnam Experiencing Halong Bay to Hue and Hoi An","reviews":[{"rating":"4.0","review":"The tour exceeded our expectations. From start, tour manager, Mahn from Vietnam Real Tours contacted me and continued to provide excellent communication throughout the tour. We wished to update the tour to provide extra days in a couple of places along the way. As it was a busy time of Tet festival, some of the journey details were rearranged by Mahn who dealt with all bookings to accommodate our wishes so we did not miss any part of the tour. The tour was excellent, providing flexibility with dates on each component from pick up from airport to hotel to day trip and continuation of journey. All happened so seamlessly as organised by Mahn which took any stress out of bookings to fit within 15 day stay without visa. The hotels booked on the tour by Mahn were thoughtfully located to explore areas and of the best quality. I had an injury whilst in tour and Mahn arranged an upgrade for us to make me comfortable having to miss a day trip. I thank him for his care with this. The sight seeing trips arranged for us were great too. Good English speaking and variety to give us taste of Vietnam. I normally arrange all components of a journey when travelling lots in SE Asia, to save cost. However, thought for short time, first time to Vietnam, it was easy to have independence of dates but everything arranged for us. Definitely worth the price to know good research has been done by to our manager having knowledge and communication with all hotels and drivers already. Small price to pay. Thank you so much, Mahn. I felt you genuinely cared for us and our journey."},{"rating":"3.5","review":"Booking this tour took every stress away from planning a wonderful trip to Vietnam. I wanted to see as much of what the country has to offer in a short space of time, and this tour really does account for seeing the highlights, as well as giving you the opportunity to explore things you may have planned to see yourself. All for such an incredible price, if you want to see the highlights of Vietnam then this is the tour for you!"},{"rating":"4.0","review":"They were very helpful. I planned for my trip but then I had to reschedule due to Visa problems and they helped me reschedule. Very nice and very organized"}]},{"name":"Taste of Vietnam Tour from Saigon to Da Lat, Nha Trang, Hoi An, Hue, Halong, Hanoi, Sapa","reviews":[{"rating":"5.0","review":"Our children & us had best guides and travelled on a lot of guided tours in our whole trip from South to North Vietnam. All their team treated my family and I like we were their family. They always asked everyday about services they provided to make sure all of us were happy & adjusted if any. They brought us to really good restaurants throughout our trip, where we were treated to a delightful array of Vietnamese cuisine. An awesome experience when mixing many activities throughout whole trip. Extremely good value for the highest quality of tour services.\n\nHighlights: Discovering all main places in Vietnam within 20days, you will have chances to know more about lifestyles, culture & customs here."},{"rating":"5.0","review":"Our children & us had best guides and travelled on a lot of guided tours in our whole trip from South to North Vietnam. All their team treated my family and I like we were their family. They always asked everyday about services they provided to make sure all of us were happy & adjusted if any. They brought us to really good restaurants throughout our trip, where we were treated to a delightful array of Vietnamese cuisine. An awesome experience when mixing many activities throughout whole trip. Extremely good value for the highest quality of tour services.\n\n \n\nHighlights: Discovering all main places in Vietnam within 20days, you will have chances to know more about lifestyles, culture & customs here."},{"rating":"5.0","review":"What can I say about this tour operator, but FANTASTIC!! From the time it took us to decide where and when to tour up until the actual tour Mr. Bobby kept us so well informed with great suggestions and quick responses to all questions mailed to her (and there were many). Nothing was too much trouble for her....including last minute changes. As for the actual tour it was so well run for our group of 9 people (a mix of elderly as well as teens), with our own big tour bus (with some great music on some of them), excellent tour guides and very good hotels at each stop. The whole tour was so efficiently run. All we had to do was to basically wake up and each day's tour commenced; no worries about anything. The guides also assisted with great authentic street food and restaurant recommendations, and shopping suggestions. It was probably one of the most affordable holidays you can get, and the Vietnamese are such lovely people. Highlights included the Cu Chi tunnels, Mekong Delta, Halong Bay, charming town of Hue amongst others. And the food and coffee is to die for..............especially with a little condensed milk. Thank you Bobby and your team for a truly unforgettable experience....it will be forever etched in our memories. We hope to be back one day to see all the other places we did not get to see."}]}]