[{"name":"Sapa Adventure","reviews":[{"rating":"4.0","review":"Hotel was very good, home stay was a good standard, meals were a good standard, helpful host. A really good experience."},{"rating":"2.5","review":"There was a general lack of organisation throughout the trip. Homestay part was very good. But the hotel we got to stay in had a concrete slab for a bed.\n\nThe worst thing about this is the price. We paid 385 AUD for the basix package and found people in Sapa who organised it locally that paid 100 AUD. And got all meals included and same homestay. Where did the extra money go ?? I certainly didn't get 285 AUD more worth of experience. Would never use intrepid again. Best to find local tours that will cost way less and give you so much more."},{"rating":"4.5","review":"Amazing tour. Our local guide was so nice!"},{"rating":"5.0","review":"We did the Sapa Adventure tour after we had finished the Vietnam Express Northbound tour. I am so glad we did this trip and saw a different side of Vietnam. The Vietnam countryside is amazing - I much prefer it to the noisy, polluted cities. The trek was very doable (speaking as someone who is an occasional gym goer). Luckily the weather was in our favour. It was very enjoyable walking at a leisurely pace through Sapa and taking hundreds of amazing photos of the beautiful scenery! Thanks also to our tour guide Lan who shared many insightful facts with us."},{"rating":"4.0","review":"This is a value for money trip. From Hanoi you travel with your group unescorted on the train, where you are met by a bus driver then transported to Sapa an amazingly beautiful town in the mountains. Plenty of time to do a bit of shopping and eating delicious food before setting out on the hike. I found my enjoyment was hampered by village people hiking all of the trip with you just to try and sell you some tacky items. They got in the way when you were trying to take pictures or climb up or down areas of track. The walking is of moderate intensity but can be hardwork for the average middle aged person in the humidity of the rainy season Scenery is spectacular and the over night train trips great. Getting back to Hanoi and getting a taxi proved problematic and a lot of time was spent trying to get a legitimate driver to take me where I wanted to go. Overall though the trip was great value for money."}]},{"name":"Essential Vietnam","reviews":[{"rating":"5.0","review":"Really enjoyable and well structured tour. Tuan was a really helpful and insightful guide and was able to manage the group (and it's varying characters!) really well. Accommodation was all very good and the optional paid activities were all good value for money. Would definitely recommend."},{"rating":"4.2","review":"Professional Service, Excellent Guidance from tour leader - \"\"Lucky\"\" who provided us with adequate support and filled our heads with knowledge about Vietnamese culture and history. A truly memorable experience, enjoying the sights and sounds of this incredible country"},{"rating":"4.2","review":"Really good guide and lots of things to do."},{"rating":"4.5","review":"I gave this score as I believe this tour was an amazing experience and I would like others to discover Vietnam the way I did."},{"rating":"4.7","review":"Organises the basic of the trip and very flexible with activities. As well as the limit on the age group was good for solo travellers and meeting new people on the trip. Going to a different country with foreign language the tour leader made the whole experience safe and gave great recommendation and suggestions not to do due to the risks"},{"rating":"4.0","review":"Lucky was amazing and so helpful. He made us feel like a family and was sooo funny"},{"rating":"5.0","review":"Tour guide was highly knowledgeable and very fitting for the experience. I would highly recommend intrepid to my friends and family if all the guides are the same as Uoc."},{"rating":"4.8","review":"This was my very first experience travelling with Intrepid and I feel it was memorable mainly because of our Team Leader - Thao. He made sure we enjoyed every second of the tour and bonded with us extremely well. I would recommend Thao to be included in all the Vietnam tours.\n I would recommend all my friends to choose Intrepid whenever they're travelling to Vietnam. The whole experience created was very balanced. We indulged in the local culture, explored new places, ate local food, and made friends for a lifetime."},{"rating":"4.0","review":"Very well organised and plenty of free time to do activities to suit one’s interest."},{"rating":"4.2","review":"The start and ending were so great and there was a lot to do and see. However i felt we had too much time in some places especially the over night train days where we were just waiting around fot hours."},{"rating":"3.8","review":"I enjoyed my trip throughout Vietnam, although I think more activities could of been included. Thoa was excellent, he really cared about the members on the tour. Although at times he didn’t offer the group the optional activities, that was on tour outline. He’s knowledge was adequate regarding tourist attractions, further work could be beneficial."},{"rating":"4.0","review":"Had an amazing time on this tour. The itinerary provides a good mix of relaxing and cultural destinations. The group size was also perfect for getting to know everyone. Our tour guide, Ngang was knowledgeable and always willing to go the extra mile to ensure everyone had a good time. Would definitely recommend to anyone looking to tour the country!"},{"rating":"3.5","review":"Astounding immersive trip. Loved the contrast and colour. Great food and such kind people. Recommend"},{"rating":"5.0","review":"We had a terrific guide Binh Bui Van who was very thorough  and looked after our group of ten 24/7,\nWe did the trip from Hanoi to the Mekong delta and it was an adventure from day one, Binh explained the history and culture of Vietnam as we went along, we did planes,trains,boats,trekking,bikes, motorbikes kayaks,ate delicious foods and mete a lot of very friendly locals all the time watched over by our guide Binh, He organised us from day one so we had no waiting around going from hotel to a bus or taxi to our next destination, I am 71 and my wife 61 and found no problem doing this trip,which included a 14 km walk to a village in the mountains for a homestay, brilliant.  Thank you Binh."},{"rating":"5.0","review":"Highly recommend this tour, we got to see and do everything we wanted to in Vietnam and much more that we couldn’t have alone! Our leader Dai was amazing and made the whole experience even better"},{"rating":"4.0","review":"The tour was well planned and the guide Anh was great. I always felt safe and comfortable while having fun. Do most of the optional activities otherwise you won't enjoy it as much and be prepared for the trains."},{"rating":"5.0","review":"Absolutely Brilliant !!"},{"rating":"3.0","review":"The sites were great, food was exceptional and the people I met were amazing. I just wish more was included, and less expensive, or free, 'optional' activities. "},{"rating":"4.0","review":"Great group of people, tour guide shared stories and card games on overnight train rides! Did most of what I could imagine ever doing in Vietnam plus more."},{"rating":"4.5","review":"I had a very great experience with this Geckos Trip! Met some awesome people and our guide was even more amazing and took us to all great restaurants and shops and recommended us which activities we could do with a discount. I enjoyed every moment of it and will never forget this trip!"},{"rating":"5.0","review":"this was my second time in vietnam, and the best time. the first time I did it independently and missed out on so much stuff! with my guide, Khanh, I saw so much more, had a great understanding of the culture and history, and got to eat the most incredible food in the world! can highly recommend a place in Hoi An called 'Bale Well' - Look it up!!! loved this trip from head to toe, especially the night on the Junk boat in Halong bay - so beautiful and great food"}]},{"name":"Vietnam Explorer","reviews":[{"rating":"4.5","review":"Loved this tour, my group and my tour guide really made it an epic experience!"},{"rating":"4.0","review":"I've had the best time in Vietnam. Loved everything that we've done.\nEdna was great, always up for a good times and helping us out as much as she could when everyone of us get sick, she was there to take care of us ensuring we got all what we need and taking our medications and being hydrated.\n\nIf I was going to do it again, I would prefer to be staying in hostels as I feel this makes us meet new people where as our accomodations this time found was good but didn't get to fun experience.\n\nReally enjoyed the trip and love Vietnam!!!"},{"rating":"4.0","review":"I really had an amazing trip! Edna was always there to help, I have been sick and she took me to the clinic and was there for me (thanks)\nI love almost all the activities, but i hated most of the places we stayed in. We shouldn't stay in hotel as they are boring. The places we've been were really nice, but i felt there was more transport time than enjoying the places (4 long bus rides + 4hr ride to castaways, etc.) Maybe the tour should be more 4-5 days longer to enjoy the more of the places between traveling.\n\nBut in general, I had the great time of my life!!!"},{"rating":"4.0","review":"I had the best time in Vietnam! The trip was excellent. Edna is a great tour guide very kind and caring when you are unwell."},{"rating":"5.0","review":"Absolutely loved Vietnam, such a great country and the places we've been is such an amazing places. Itineraries is full packed and lots of choices for extra activities.\n\nMostly my favorite places we've been is the quad biking in sandunes in Muine. Also the war museums are pretty interesting. Bana Hills is pretty good and we had a great time visiting this place as an extra activities.\nIf i have to do it again, I would like to stay more on a hostels as I like to meet more people!\n\nAlso love Edna, she is so lovely, when we were ill and couldn't have done anything, she was there all the time to help us out all the time!\n\nSo much energy and so much fun to be with, couldn't asked much for a tour guide doing above and beyond at her work.Hands up!!!"},{"rating":"5.0","review":"I really enjoyed Vietnam with TruTravels. I never knew that one tour can show and teach số mũch about Vietnam.\nEdna at the first before the tour starts she already made me feel like a family, she's hilarious and ensuring I have all I packed on my upcoming trip and suggested places I could go for extra day. \n\nEdna and Adam were both great and they make everyone feel so welcome and comfortable throughout the tour and they were able to help with whatever we needed no matter what time or day it was. \n\nWe definitely wouldn't be able to see as much as we did in Vietnam if it wasn't for Edna and Adam. They were able to provide lots of information about where we went which made the experience that much better.\n\nI will definitely be looking to book another Trừtravels again on the future."},{"rating":"5.0","review":"I have had a brilliant experience travelling with TruTravels. The group really clicked well and we all hot on really well. Adam and Edna started the tour leading together. Adam was an absolute legend one of the nicest leaders I've had in years travel and Edna ensured we all our needs were met and went above and beyond being a group leader but also a mother to us all.\nMy favorite part was the quad biking in the sand dunes. It was an adrenaline filled with experience. The only recommendation I wou make would be to include Cứ Chỉ tunnels. The aspects of the tour were brilliant. I've made life long memories along the way. I would 100% recommend this tour to others who want to explore Vietnam - it is so beautiful!\n\nThank YOU Edna for taking care of us and being a cracking leader!"},{"rating":"4.0","review":"Edna was very helpful and knowledgeable of areas travelled to was excellent.\nI was bit older than the others but never really felt out of place. The only downside was getting a bit of sick for someone at the tour. But Edna ensure that we are been look after as some of us are just not feeling well. She make sure that every of us have all our medications.\n\nOverall experience Vietnam was an amazing place to travel and definitely will be back to the rest of the north of Vietnam and Edna as a guide."},{"rating":"4.5","review":"I have the best trip with the best people and a great tour guide, through an amazing country, stopping at awesome places from bottom to top. I found the trip and iterinary to be well thought out and not too rushed.My mains loves being at the war museum, Hoi An. The cooking class in Hue, quad biking sand dunes in Mui Ne and many beautiful sights along the way, Phong Nha was amazing.\nIf I could change anything it would be to add another 3-4 days to the trip and take the DMZ and Ninh Binh the way.\n\nEdna was a great tour guide, a true friend and caring guide. She looked after everyone that got sick. And really went out of her way a lot to ensure the happiness of the whole group.\nThank you Trutravels, I had the best time and feel I truly have made friends for life. And I'm excited for my next Trutravels tour in Thailand."},{"rating":"5.0","review":"Wow - Where to begin… Papsi absolutely made this tour for me. From the first night when he saved me from bed bugs in the hostel I was staying, to the final day when I didn’t want to leave him & we have a hand shake!! His English is amazing! I genuinely cannot express how different my time would have been without him. I had a great time in Vietnam and I’m really glad I did the tour as I felt safe and at ease throughout. Not as good but close to the 27 day Thailand. The North part of my tour has been my favourite in particular Hoi An which was absolutely beautiful - Papsi tailor recommendation was fab. The Hai Van pass was brilliant despite being ridiculously hungover! Phong always looked out me whenever I felt sick!! Castaways was an experience I will never forget… So surreal - I made a life long friend! I was sad that we had to miss Phong Nha, however Papsi did an exceptional job at organising alternative activities. All in all I’ve had a brilliant time! Papsi you’re the best THAIII BOIII out there!!! Phong you’re a legend. Thank you!"},{"rating":"5.0","review":"I had an incredible time in Vietnam. Having not really traveled before I was nervous about coming alone, but a tour was the best thing I could have done. Your guides can make or break an experience like this, and thankfully \"Papsi\" and \"Phong\" are both incredible people. I had an amazing time with both of them, sharing lots of laughed, good and history. I'm really grateful to the pair of them for working so hard to show us all the best spots in Vietnam I'd never have known about I'm sad to be leaving but made some great friends and I'll remember driving Hai Van Pass in the pissing rain, and star gazing surrounded by glow in the dark plankton in the middle of the night for the rest of my life!. The only thing I wish is getting to spend some extra time in Saigon as I thought it was cool as [expletive removed in moderation]\n\nThank you I will be back (with mates next time) <3 <3"},{"rating":"4.0","review":"Our tour guide \"Papsi\" is one of the funniest people I have ever met. I have ever laughed so hard, he is truly hilarious, kind and a beautiful spirit.\n\nThe itinerary for this tour is a perfect mix of culture and beauty, Papsi has so much knowledge and advice on how to experience this country to the absolute max. \n\nHoi An is a stunning city, Papsi helped us find some food, some rally cute coffee shop, local food and clothes. The adventure activities are incredible, ziplining sandboarding and tubing are all amazing experiences.\n\nAll in all, a perfect tour, a perfect guide, a perfect experience, Vietnam is the place to be. <3"},{"rating":"5.0","review":"Wow where, do I begin this whole experience was blowing my mind. I never knew that one tour could put so much passion and fun into their job. I was ever lucky though to have two of them. They both made everyone fool to home even though we where wikes away. The tour was fun so well from start to finish even when we had to change the itinerary due to weather. My personal favorite part of the trip was the sand dune quad biking and kayaking in Ha Long Bay. All in all this trip has been jaw-dropping, exiting and outright amazing. I could not fault the service given by the Trufamily from booking to doing the trip what an amazing experience."},{"rating":"4.5","review":"This is my second tour with Trutravels and once again it was amazing. Trutravels contacted me a month before the trip to let me know I was the only person on the tour and asked if I could change my travel date. They were fantastic in helping me change my travel date. \n\nThe tour was great starting in the south and making our way north, all travel and accommodation was sorted stress-free. It was great the Trutravels booked rooms for longer to store bags and have showers before move to the next place. Our tour guides \"Papsi\" and \"Phong\" were great, Papsi was full of energy and came out with us in the evening which was great. Phong was super knowledgeable about the history of Vietnam and knew the best places to get food. The activities on the tour were awesome, my favorite activity was the cooking class. But the Quad Biking on the sand dunes, kayaking in Ha Loing Bay and all the other activities were great too. \n\nI will definitely be booking another tour with Trutravels again!!!!"},{"rating":"5.0","review":"The trip was absolutely fantastic!The iterinary was brilliant and we did and saw so much in 17 days. For me the highlights were quad biking on the sand dunes, hai van pass on the jeeps, the dark caves tour and trying lots of great vietnamese food. All the activities were so much fun and really well organized. It was great to do some adrenaline activities (zip-lining, quad biking) as well as more cultural activities (imperial city tour, cooking class). \n\nThe tour was definitely made by our guide, Edna, who was absolutely fantastic! She was always so bubbly and just wanted to make sure we all had the best time without putting pressure on anyone to do anything we didn't want to. \nThank you, Edna and the best of the group for the best trip!"},{"rating":"5.0","review":"I went on the 17 Day Vietnam Explorer with the delightful Edna as our guide! She was very professional and always making sure we were all prepared and getting the best experience. She knew everything we needed to know or be aware of and we all felt in really good hands. It was a wonderful mix of activities, city and beaches, nature and culture. Definitely would recommend and loved everything that was included. Really good value for money and plenty of inclusions - loved that I didn’t have to stress about transport once or wasting time, there was always something to do, and it was all well organised. The only thing I would suggest or raise is that as much as it’s good not to have a rigid structure for city exploring, there should have either been more time in Hanoi or Ho Chi Minh, or at least more guided and supported suggestions and recommendations. There should always be a list of recommended things to do and see or where to eat or drink so that the guide doesn’t have to repeat themselves or forget to tell us, and for us always to refer to just in case. This would also be helpful for historical background info. \n\nOverall, really well done snd thought through, just should be more detail on itinerary and history/local delicacies/info provided for each place as this wasn’t always given. Solid 4/5 stars from me! :)"},{"rating":"5.0","review":"The Vietnam Explore tour has been the 4th Trutravels tour I have done and has definitely been one of my favourites! You get to see a lot of the country during the trip, but it doesn't feel rushed and even when some of the transportation between places was delayed/changed Edna handled it really well, so the distance travelled wans't stressful. \n\nMy personal highlights of the trip was quad-biking in the sand dunes, Ninhvana and Castaways,I loved all of it, everything was so much fun! The fact that we had such a good group and the tour guide meant that the experience was so enjoyable - the fact Trutravels tours are so social is an aspect I really like as I've made great friends who I got to share the experience with the cooking class and war museums, were also really good activities as it taught us more about vietnamese culture and history which is important. \n\nWe got to experience culture as well as partying which I'm really glad for. Definitely looking forward for more tours with Trutravels and with Edna!"},{"rating":"5.0","review":"The trip was absolutely fantastic!The iterinary was brilliant and we did and saw so much in seventeen days. For me the highlights were quad biking on the sand dunes, hai van pass on the jeeps, the dark caves tour and trying lots of great vietnamese food. All the activities were so much fun and really well organized. \n\nIt was great to do some adrenaline activities (zip-lining, quad biking) as well as more cultural activities (imperial city tour, cooking class). The tour was definitely made by our guide, Edna, who was absolutely fantastic! She was always so bubbly and just wanted to make sure we all had the best time without putting pressure on anyone to do anything we didn't want to. \n\nAs first timer in Asia, I had the best time traveling with my best friend as well. Met few people that will became friends. I enjoyed every activities we did and places we been, definitely will do another tour with Trutravels.\n\nThank you, Edna and the best of the group for the best trip!"},{"rating":"5.0","review":"Vietnam has been incredible! This itirenary was full of everything you would want to see and do in Vietnam in two weeks time. Edna was an incredible tour guide and the experience would not have been the same without her. She was always full of fun and professional at the same time. From medical advise to life advice she took care of it. We had a good group and it was really fun, the laugh, the night out, and the organized activities. Edna always make sure we all get informed of all the activities and some extra activities. Straight to the point. She make sure were having the best time and make us feel safe all the time. \nDefinitely recommended the full 17 days experience.\n\n At the end we all had an incredible time!!!!"},{"rating":"5.0","review":"Vietnam explorer has been one of the most incredible and wonderful experiences. We have such a fun time with such variety of experience. The balance of next got life and culture is great. I have made great friends. Edna made sure we having an amazing time even on small group. \n\nThere are plenty of  activities, each day was run smoothly and Edna make sure that we get informed about everything. All is organized, I really enjoyed the sand dunes where one of our group celebrated her birthday, the sand dunes was pretty sick . I really like Hoi An and the north part is pretty sick too. Edna was phenomenal, always fun and make always feel safe!\n\nOverall is an amazing experience, great country, great people and an amazing tour guide.\nHighly recommended tour anyone thinking of going to Vietnam!"},{"rating":"5.0","review":"I thoroughly enjoyed my trip with Trutravels. I learned about the Vietnam tour from when I did the Bali tour last year, Vietnam has lived up to my expectations. Edna was the best tour guide, loads of fun, good knowledge of the areas we went to and great overall guide . She remained professional and was proactive in dealing with a tough situations that had arisen between a few members of the tour. She treats everyone with respect and makes the trip more enjoyable for everyone, especially with her sense of humor.\n\nThough it's difficult to find affordable accommodations in a central location which meets everyone's expectations. I would say the accommodations may make it a less comfortable trip for some.\n\nOverall, my trip was an amazing experience with Trutravels, I would recommend it to all my friends!"},{"rating":"5.0","review":"As this is my first time traveling alone, I decided to book a tour, so I knew I wouldn't be alone. \nI was nervous from the start, but the moment I met everybody on the tour, I felt at ease straight away, my tour guide Edna was absolutely amazing from the start, any questions or worries I had she helped with and made me feel very comfortable.\n\nVietnam is such a beautiful country and I'd recommend the full 17 days tour, to anybody who wanted to see Vietnam, all the activities involved are brilliant and plenty of extra activities are available when you have free time to yourself and Edna is really helpful sorting them out for you. I've made memories that will last a life time and I honestly believe that is purely because of the tour and the laugh we had along the way will always keep me smiling.\n\nMassive thank you to everyone on the tour and a big shout to Edna for being an amazing the whole time."},{"rating":"4.5","review":"I've traveled across 4 Asian countries but VIetnam has been my favorite so far. It's been a good mix of sightseeing, relaxing and night out. The country itself is beautiful and the people are friendly and accommodating. This tour group has been the friendliest and definitely will be always in touch with them.\n\nEdna has been one of my favorite tour guide and she showed me around country side after the tour ended. I learned to drive motorbike on craziest busiest Hanoi. \nWe went to Ninh Binh and drive from Hanoi and stay there for a night before driving back to Hanoi. She even took care of me when I got my foot infected, thankful because she always have her medical kit everywhere she go, she gave me first aid. \nI really enjoyed the boat trip at  \"Kingkong Island\", in Ninh Binh, the goat pizza was really good. If you want to do the Vietnam Explorer make sure your guide is Edna, she will be your guide as well on and off tour if ever you fancy going somewhere else in Vietnam.\n\nI would definitely be grateful for the experiences off tour, as I survived in Hanoi's traffic!!!"},{"rating":"4.5","review":"This was not my first Trutravels tour but I was not dissapointed. I loved how easy and convinient travelling is when you do a tour. Everything ran smoothly. All transport ran smoothly and had aircon, therefore making journeys more comfortable for us. \nOur guide Edna was fantastic, she wanted to make sure all had a good time. Of course, it is difficult to pplease everybody but Edna always tried to make sure everybody was happy and could what they wanted to do. I feel that all of the activities were well thought out. \n\nI particularly enjoyed the sand dunes, fairy stream, lantern making and the cooking class. \nPersonally. I would've liked more activities perhaps in the evening, so that it's not all about drinking. Also, I would've liked to learned more history/culture but Edna was very knowledgeable when asked. \n\nEdna was also very helpful with organizing transport for extra activities and for onward travel.\nOverall, a fantastic trip with TruTravels again."},{"rating":"5.0","review":"Vietnam has been incredible! This itirenary was full of everything you would wnt to see and do in Vietnam in 2 weeks time.\n\nEdna was an incredible tour guide and the experience would not have been the same without her. She was always full of fun and professional at the same time. From medical advise to life advice she took care of it.\n\nAt the end we all had an incredible time!!!!"},{"rating":"5.0","review":"Had such a fab time on this tour. I thought 17 days would be a long time, but the whole tour has flown by. This is due to the awesome group we had, great tour guides and jam-packed itinerary. It was a great mix of culture and partying with no pressure to go out if you didn’t fancy it. Phi was a great group leader, giving plenty of recommendations for how to spend free time in Vietnam. He was really engaging when providing information about the country’s history and culture. Adam brought out the party side  and did his very best to ensure everyone was included.\nOverall, a fantastic trip, would recommend!"},{"rating":"5.0","review":"I had a great 17 days. I thought the way the itinerary was planned allowed us to enjoy the perfect balance of going out having fun during daytime events and evening drinks without feeling too tired. Quadbiking, caving and jeeps were by far my favourite activities; although more relaxing activities like lantern making and going to the duck farm, made for a refreshing change of pace.\nPhi was fantastic. I know this is his first tour with Tru Travels the man’s a natural. He put in a huge effort to provide us cultural and historical information about Vietnam when on tour, while also being a valuable source of translation when needed. Adam also provided the more ‘partying’ enthusiasm for the group which help keep team morale high. Overall, both Adam and Phi have been amazing; they’ve done Tru Travels proud!!"},{"rating":"5.0","review":"100% the experience of a life time. I was extremely lucky to be grouped with the people I was with. We formed a Tru Family and had the best holiday in the world. Adam and Phi were always there to help no matter the situation. They were always willing to stay out and do more than what was originally planned. Both were so caring and helped with our every need. I will definitely be recommending this tour to everyone at home. The itinerary was amazing and I couldn’t fault how well the tour flowed. We were always informed for the plans for the day and all our questions were answered with much detail. Adam and Phi definitely made the trip of a lifetime and I will not forget."},{"rating":"5.0","review":"Unbelievable! Comparing this to other tour companies, Phi and Adam have made this an unforgettable experience. Phi’s knowledge for Vietnamese culture was always on point and if I had questions he would happily answer them. When I was feeling low and upset, Phi and Adam were there to support me and help me to feel better. I loved getting to know Phi as he is such an interesting and inspirational man and I will take what I’ve learned from him and this tour forward. I simply cannot praise Phi any higher and I wish him all the success as he has the qualities to be a fantastic tour guide. Thank you Phi!"},{"rating":"5.0","review":"It was my first time traveling with Tru Travels and I’m already writing down my next adventure. Adam, a lovable brother figure with a wicked sense of fun. Phi, the kindest and funniest uncle figure. Phi made me feel part of a family and nothing was too much trouble. He has a heart of gold. As a granny of the group (aged 27), I was worried the tour could be too young. How wrong I was, Adam and Phi fixed me up with a fellow granny and I had an absolute blast. They kept saying ‘this is your trip’ and made me feel like I could do anything and everything I wanted. I had an absolute blast and I thank Phi and Adam for making me part of their Tru Family team.xxx"},{"rating":"5.0","review":"Before embarking on this EXPERIENCE OF A LIFETIME, I was a wee bit weary as I heard Tru Travels recruit a very young crew (mega party animals > turns out I was a dark horse all along). So, I was prepared and expecting to be traveling with a bunch of 18 years old. Instead, I had fallen in with a lovely bunch of people ( tour guides including of course.)\nMy mum and dad who were quite worried about me traveling on my own were instantly relieved when I sent them a group photo of all Trufam. I further made them feel at ease when I told them how safe and content I feel with three main people: \n\n1. Phi - aka mamabear. Phi has literately been my mother on this trip!lol. Especially when it come to all my unnecessary  skin reactions. I would text Phi that I need to go to the pharmacy and within 5 mins he would be there ready to be my trusty translator. Thank you so much Phi for looking after me on this tour.\n\n2. Adam - aka papabear, Adam made me feel less granny and about the fact that I’m a mega introvert and crave space a lot of time. He explained its our holiday and so ‘you do you’. Adam is extremely good at his job asa well as Phi. Very accommodating, organized and efficient.\n\n3. Lauren - aka my travel buddy. I was very fortunate to be paired with a fellow granny - my age, a teacher, dramatic as me > clearly fate as paired together. Being paired with Lauren has made my trip. I was worried about having someone to share memories/laughs with and Tru Travels provided that companion/friend for life to me."},{"rating":"5.0","review":"This is my second time doing a tour with this group and found Phi and Adam amazing compared to my last. Phi was so full of knowledge and kind, great to talk to and always made sure everyone was happy. He always took loads of photos which was great. I would genuinely say he is the most kind hearted person I have met. Adam was amazing also. Don’t think anyone could make me laugh as much, literately made everyone feel so comfortable and had great nights out with him and Phi. If it was not for Adam and Phi the tour would not have been the same. I will definitely do another tour and would hope to meet Adam and Phi again. Vietnam was amazing and so cultured and I am so grateful to have seen it with such amazing group.\n\nAdam and Phi forever xoxo"},{"rating":"5.0","review":"This is my first time traveling as part of an organized group and I can honestly say that it was one of the best experiences of my life. The 17 days absolutely flew and I have made memories and friends for all. Each location and all the activities were absolutely fantastic, but it wouldn’t have been the same if not for our tour guides Phi and Adam. They were whole-heartedly dedicating and ensuring we had the absolute trip of a lifetime. They made sure we were always safe and comfortable, and of course always have the best fun and laughs along the way. This has been my most memorable travel experience that I once only dreamed of doing. Genuinely an unbelievable, thrill-seeking experience and I’d travel with our crew again as a heart beat.\nAbsolutely phenomenal, hope to see you all again.\nLots of loves, Caragh."},{"rating":"5.0","review":"I rated all if not most things 5/5. Phi was genuinely the most incredible tour guide. His involvement, his humor, his wealth of knowledge was unreal. Not a single slip up, not a single mistake. The only downside is that it’s over. I would like to thank you all for the experiences you have given me Phi, on a personal note, you’re one of the most genuine person I’ve ever met. I wish you all the best of luck in the future.\nP.s. George is a ..."}]},{"name":"Explore Vietnam","reviews":[{"rating":"5.0","review":"Great trip made very special by our guide Ngu going the extra mile"},{"rating":"4.8","review":"This trip provides you with the convenience of having your transport and accommodation organised as well as the flexibility to choose your own activities in each city."},{"rating":"4.3","review":"The trip was excellent. The pace was good, the accommodation was good (with just one issue throughout the entire trip) and the guide, Cong, was excellent."},{"rating":"4.7","review":"The whole trip ran smoothly and was hassle free"},{"rating":"5.0","review":"It was my visit time with Intrepid & found the whole experience was very well organised & run from the start to the end."},{"rating":"4.0","review":"Whilst a budget tour, I feel it could Ofer more local insite."},{"rating":"5.0","review":"Very friendly and informative. He showed us lots of good local places to shop and eat. Very knowledgeable of the history"},{"rating":"4.0","review":"Instructor was full of knowledge and enthusiasm very well prepared and understood everyone’s needs."},{"rating":"4.2","review":"It was overall ok. Nha Trang wasn't really worth going."},{"rating":"4.5","review":"The experience was really awesome ! The country is amazing, the landscaps, the culture, the food ! Everything is amazing.\n Our leader was really great!"},{"rating":"4.0","review":"Everything went smoothly and our guide was excellent. Knowledgeable, friendly and helpful"},{"rating":"4.5","review":"A great touring group, knowledgeable guide, great attractions."},{"rating":"3.0","review":"General Pros - Good itinerary, similar age group, flexible to do your own thing. \nGeneral Cons - 10-12 hour overnight train rides, only 2 hotel rooms between 12 people to freshen up after long days & train rides. Bus rest stops were very touristy, pricey food menu. \nGuide - Knowledgable & easy going. However, beware - the guide will organise group lunches & dinners, many of which are very touristy prices and your guide will eat for free or split the bill so he gets a free meal. \nBiggest let down: Because it was a super flexi itinerary, i felt our guide took advantage of us by being able to suggest & organise group activities such as restaurants that were a rip off etc & tell us to do things on a certain day, to his benefit. However, the biggest let down was he booked the Urban Adventures Mekong Delta River tour for us. On the day, he said we will have a private tour instead - he became the guide himself (unexpected) and then during lunch, told us to pay $1.5 million dong each to a random lady at the village who spoke no english, for the full tour cost. It was very suspicious (he disappeared for an hr) and it did not feel like a genuine transaction - it was extremely expensive and most of our group ran out of money - not expecting that price. What is worse - scammed by your tour guide or a random local?"},{"rating":"5.0","review":"Excellent tour learnt so much history thanks to our great tour guide he was so helpful and would go above and beyond to make your trip memorable the accommodation was good and also was the traveling from each place will definatly travel Intrepid again."},{"rating":"4.0","review":"The scenery was good. Hotel were good and clean and the location of the hotels were spot on. Only the train toilets were disgusting. Overall we had a great experience. Hassim dinath"},{"rating":"5.0","review":"My partner and I had a great time on this tour - it was the perfect way to get a taste of Vietnam in a short amount of time. Hien was a wonderful guide, we felt so looked after throughout the whole trip and she could never do enough to help. Each of the many connections was super smooth, and we were really able to maximise our time in each place. This is my second booking with Intrepid and I will be back - it's a safe and convenient way to travel which still allows you to choose how you spend your time, and the reputation of their guides is deserved."}]},{"name":"Treasures of Vietnam","reviews":[{"rating":"4.2","review":"Excellent guides and good variety of itineraries but limited pre-trip information was provided"},{"rating":"5.0","review":"Our guide, Vuong, was amazing, very proud of his country & it's heritage, had a great knowledge base of past & present & was always ready & able to handle/organise anything we needed. The trip was just as described, only better, very well organised & a wonderful experience."},{"rating":"5.0","review":"The trip gave me many memories to look back on and some amazing new friends."},{"rating":"4.8","review":"I thought the trip was very well planned.We were able to obtain a nice snapshot of both countries."},{"rating":"5.0","review":"The professionalism of the guide, the variety of activities, the organization"},{"rating":"4.2","review":"The tour guide was fantastic - very knowledgeable, approachable and with lots of local tips to help us. The tour was a good balance of free time and scheduled activities (about 5:5), and it covered main features of the country without being too busy. The accommodation and transport arrangements were appropriate and pretty seamless."},{"rating":"4.2","review":"I am filling in this questionnaire based on the Vietnam portion of our trip as we received another questionnaire about the Cambodia part of our trip.The accommodation on the boat in Halong Bay was not acceptable.I have written to the Enquiries email address about this and hope to get a response."},{"rating":"3.5","review":"Transportation and hotels were nice, enjoyed the small group, and restaurants were good. However, Halong Bay boat was very poor, and I felt that the guide wasn't as polished as I expected."},{"rating":"4.0","review":"A very busy whistle stop tour of Vietnam. You visit HCMC Hoi An and Hanoi. Accommodate for a comfort style tour needs to be improved. Our tour leader was informative knowledgeable and good fun. If you have the time I’d probably advise you to take a longer trip especially Hoi An as we all loved it."}]},{"name":"Cycle Vietnam","reviews":[{"rating":"4.0","review":"Cut short by Covid-19 otherwise Perfect"},{"rating":"5.0","review":"The trip as fantastic! The guide and his crew were great."},{"rating":"5.0","review":"Our first group guided bike tour was a wonderful way to see Vietnam. The daily distances seem daunting, but  the riding routes are “cherry picked”. The cycling minimizes physical effort (terrain is undulating, flat or downhill) and maximizes scenic interest. The support team & bike mechanic provided excellent service & attention. Food was fantastic. Accommodation was better than anything we would have booked ourselves."},{"rating":"4.5","review":"The Support Team is awesome. Always have nice drinks & snacks waiting for us at the breaks. My water bottle is magically full during the breaks. It is also nice to have a rest day after a long riding day."},{"rating":"5.0","review":"Was everything we expected and we got more. Our trip leader Chi was excellent. The cycling was great and very diverse. We got to better understand the Intrepid role in providing responsible travel. The whole team (North and South) we’re fully committed to us and ensuring we were safe, happy and fulfilled."},{"rating":"4.2","review":"Well organised and supervised. Plenty to see of the country."},{"rating":"3.8","review":"It was a well organised trip, the support team (leader, driver and mechanic) were good at their jobs and helpful, and we got to see a good range of Vietnam."},{"rating":"4.2","review":"Excellent trip , so much more than a cycling trip. The guide was very knowlegable about all things Vietnam. Im going home feeling like i had a very real experience of Vietnam."},{"rating":"4.5","review":"A well organised trip All needs catered for .excellent guide. Good quality accommodation"},{"rating":"4.0","review":"We rated it as \"\"good\"\" and not excellent due to a couple of the accommodation places being not so great. We would have given the overall experience a \"\"very good\"\" if it was an option.\n We gave the recommending to friends a 1 because the trip was so very well organised."},{"rating":"3.0","review":"Overall the trip was well organized, the itinerary was challenging but well planned out. The Guide Chi Nguyen did a good job and had a great attitude."},{"rating":"2.5","review":"The trip was extremely poor value for money - having paid over USD 2,7, I was expecting to be provided much better accommodation and meals. Specially since cost of meals and accommodation in Vietnam is extremely cheap."},{"rating":"2.5","review":"Weather which impacted itinerary. Group dynamic, which is not Intrepid's fault."},{"rating":"4.0","review":"Cycling is a great way to explore parts of Vietnam most tourists will never see. Every day and every meal was a new experience. The sightseeing was always interesting. I will do another cycling trip somewhere for sure."},{"rating":"4.0","review":"Bicycle touring is the best way to see the country. Cars and motorcycles don’t stop or yield to bicycles or pedestrians."},{"rating":"4.0","review":"Things that exceeded expectations- food and logistics. Excellent support team in the south in particular. I did not enjoy cycling close to trucks and motorcycles for the most of the way. Sometimes it seemed we tried to cycle certain number of miles and the itinerary was built around it. I would not mind stopping earlier if the rest of the route is not interesting. Most hotels were good, but not in Hanoi and hoi Anne. Hoi Anne hotel has the worst food, I think. Finally long is not a good guide if you want to learn about the country in addition to the physical challenge. I can give many details why I didn’t like him and how he should not position himself within the group, but it may need a separate review if anybody is interested"},{"rating":"5.0","review":"I have had the best 2 weeks with Tung and the rest of the team on the cycle Vietnam tour. Everything was organised perfectly and tour gave great balance of challenging cycling and time to relax and experience Vietnam. I loved how the cycling route took you away from the main cities and into some of the beautiful quiet countryside where the riding was stunning and defiantly my favourite bits. Tung was brilliant as a guide, calm, knowledgable,  humorous and patient. Group was excellent, hotels lovely and weather perfect. Couldn’t have asked for more, will definetly be recommending."},{"rating":"3.0","review":"Completely over priced trip- very disappointing to see the quality of accommodation and food provided - will never use intrepid again"},{"rating":"5.0","review":"Super trip of Vietnam which exceeded my expectations. Slick organisation, excellent food and accommodation, a wonderful local guide (Loc Phan) and very other knowledgeable and professional tour staff. Excellent!"},{"rating":"5.0","review":"The trip was exactly what I wanted, A chance to experience Vietnam from grass roots on a bicycle. It was well organised and effortless except for the 30k climb up a mountain near Da Lat !!!"},{"rating":"4.5","review":"incredible variety of different sceneries, landscapes and vistas.  Our tour guide and the support crew were very helpful and approachable - they ensured that the bikes were in excellent condition and provided us with the necessary supplies at each \"pit stop\".  However, the emphasis is clearly on cycling, so there is not an awful lot of time for sight seeing along the way. There were a couple of places where we would have loved to stay a bit longer.\nPhysical rating of the tour was a bit on the low side - it was doable, but demanding, so not really suitable for non-cyclists. Having said that, there's always the option to sit out a stretch and take a ride on the support bus."},{"rating":"4.5","review":"I am reluctant to give an excellent award as I think it is overused by reviewers. However, in this case I have no hesitation. What makes it excellent is the level of organisation that goes on beforehand and during the tour. On a cycling tour much depends on the back-up team of the truck driver (for the bikes) the bus driver (for the riders)  the mechanic who rides behind and most of all the tour guide who leads. I have met many tour guides in my time but none have come close to Dahn. Needless to say he lectures in tourism and has won an award for his tour guiding. It was his ability to deal with everything from tired bikers to chefs and waiters in local restaurants that make him special. But most of all it was his ability to bind a number of strangers into a cohesive group with his personality and sense of humour that made the tour wonderful. The standard of the bikes was very good as was the level of comfort of the hotels and the overall quality of the food. What is best of all is the backroads taken through rural landscapes, villages and small towns where most tourists do not get to see. There have been discussions about the level of fitness to enjoy the tour; the average pace was about 20-22k and if you can keep that up for an hour or two you will be fine. We were told emphatically that we had to bring our own helmets which we did at some inconvenience and loss – we donated them at the end. Others on the tour did not and they were supplied.\n\n"},{"rating":"5.0","review":"Great tour well led by our leader Tiet. Disappointing to miss out on the rainforest section advertised. Program changed after booking. Highlights were home stay, Hoi An, Dalat. Food and hotel in Nimbinh were below the otherwise high standard. Tiet made the trip for us all. His personal approach, sense of humour and attention to detail was excellent. The support crew were always on hand and did an excellent job of looking after us. Biggest reccomendation cut out Nimbinh and reinstate the rainforest. A couple of rest days are a good idea especially in places like HoiAn. Loved it!"},{"rating":"4.0","review":"I really enjoyed this tour. Cycling really gave me the chance to see the real Vietnam, not just the parts designed for tourists. my only complaint about the trip is that we didnt get enough time at some destinations due to getting in so late. it would have been great to have an extra day in Hue, Hoi An, Quy Nhon, Nha Trang and Ho Chi Minh to allow us to explore the city's at a more relaxed rate. it would also breaak up the riding allowing us to recover a bit more before hitting the saddle again making the riding that bit more enjoyable. "},{"rating":"4.0","review":"Was a great trip, had a fantastic time."},{"rating":"5.0","review":"My trip was 2 weeks of \\'Cycle vietnam\\'. Our guide was Vu and he was great"},{"rating":"5.0","review":"This was an amazing holiday. I would go again in the morning if i had the chance."},{"rating":"5.0","review":"I loved the trip. Vietnam is a beautiful resilient country and Huy went to a great deal of effort to ensure we got to see it at its best."},{"rating":"5.0","review":"Overall had a great time. Trip exceeded my expectations. Leader made the trip for me though. I don`t where Vu gets his energy, but he has lots of it and made the trip a lot of fun."},{"rating":"5.0","review":"10/10 trip Exceeded all my expectations."},{"rating":"5.0","review":"Fantastic taste of Vietnam and after 500 km on a bike am as fit as I\\'ve ever been. Great itinerary and an excellent guide."},{"rating":"5.0","review":"Great Trip which I would recommend to others. The locals were fabulous and made us feel welcome and right at home."},{"rating":"5.0","review":"A fantastic trip and a great and varied group...would thoroughly recommend it to anyone wanting to spend some time in Vietnam off and on the beaten track! Huy was also a great guide - he really made the trip/holiday a true experience."},{"rating":"5.0","review":"I thoroughly enjoyed the cycle aspect of the trip which took us off the main highway. I enjoyed meeting other people on the trip. By the end of our time together, we had all formed firm friendships."},{"rating":"5.0","review":"This was a great trip. all the guides were fantastic. Huy was excellent in showing us around and teaching us about the culture"},{"rating":"5.0","review":"really enjoyed the two weeks,"},{"rating":"5.0","review":"fantastic way to experience the country and meet the locals"},{"rating":"5.0","review":"Excellent guide, Great trip and awesome food"},{"rating":"5.0","review":"I loved the trip, everything was organised really well and there was a good mix of local and touristy activities/ food and accomodation. WOuld definitely recommend!!"},{"rating":"5.0","review":"I had the best time! Everything was so well organised and casual. One of the best trips i have ever done!"},{"rating":"5.0","review":"Fantastic trip and well run by Intrepid."},{"rating":"5.0","review":"An amazing trip."},{"rating":"5.0","review":"A fantastic trip, well organized, great crew and memorable times."}]},{"name":"Cycle Northern Vietnam","reviews":[{"rating":"4.5","review":"We ware fully sattisfied with our excoursion.\nSon Nguyen was very helply and did a wonderful job \nThank you!"}]},{"name":"Vietnam At Glance","reviews":[{"rating":"5.0","review":"Everyone associated with tour radar provided exemplary service. They were excellent."},{"rating":"5.0","review":"The tour was really well organised. We were never waiting more than 5minutes to be be picked up by the bus. The tour guides were very knowledgeable about the history of the area and very helpful with recommendations of things to do and places to see. Both Mr Tan & K were excellent tour guides."},{"rating":"5.0","review":"go for it, you will eat a lot and have some down time to expore on your own. Make sure you ask your tour guid questions. You will have the same driver and guide for all of Hanoi. you will have a different group for Ho Chi Ming. The boat you will be with the boats tour guides. The tour guide will point out stuff on a map if you want go someplace at night."},{"rating":"5.0","review":"With Top Vietnam Travel, it actually is going in luxury so if that is what you're after I then cannot recommend them enough!\nThey really look after both you and your entire trip; the accommodation of yours, itinerary and tour guides. Their staff is extremely helpful and also the itinerary for Vietnam is impressive!\nDefinitely, a must-see the place. I will return soon!"}]},{"name":"Scenic Vietnam","reviews":[{"rating":"5.0","review":"Had such a great time on this scenic Vietnam tour! It was the perfect length of time to see as much as we did, any shorter might feel rushed. The tour covered so much, from the hectic city of Hanoi to the more chilled and beautiful Halong Bay. The homestays were a real treat, both families very welcoming and the food was delicious! Our guide was Huy and he really made it a special trip. He was so knowledgeable and was constantly giving us interesting facts. But he was also very attentive, always wanting to help with any issues we had. He even spent the ‘free time’ with the group, taking us to restaurants! Nothing was ever too much trouble for Huy and he must have the patience of a saint because our group liked to ask a lot of questions! Im so glad I picked this tour and wouldn’t change any part of it."},{"rating":"4.0","review":"The tour was good but I did not feel there was any additional benefits provided by the guided tour so I would recommend rather plan the tour yourself"},{"rating":"3.5","review":"The tour did not meet my expectations. I felt that there were areas where the main tour guide and other local guides did not meet my expectations in terms of knowledge and communication. I also felt that time management could be improved within the tour."},{"rating":"4.8","review":"So much planned for us to do and see...great variety of locations visitedbike rides, home stays, kyaking, great redtaurants, interesting and touching visits to Blue Dragon and The War Remnants Museum"},{"rating":"4.2","review":"Our tour guide Bao was so amazing! He was kind and patient and so knowledgeable and surprisingly funny guy!"},{"rating":"4.2","review":"Good tour with smallish group"},{"rating":"4.2","review":"Excellent and well planned our trip, with great activities included. Length of stays could be altered"},{"rating":"4.2","review":"The organisation was excellent. Travel well coordinated. No waiting around. Tickets to shows and other optional activities easily arranged."},{"rating":"4.8","review":"Great trip overall with a great leader and planning."},{"rating":"4.2","review":"Really good trip, interesting with a good deal of contact with local people."},{"rating":"5.0","review":"Our Guide Bac was excellent. He was always attentive, the scheduling of events and transportation was flawless. He made sure that we were updated on events and advised on extra things to do on free days.  He made sure that we were having a good time. Great job Bac. The itinerary was great. There was enough time to be busy and down time as well. The only thing I wished was there were more included events at Hoi An. We had two full days of free time, I think one day of free time would have been enough. Overall it was a great tour, met many new friends and great memories.  Thanks"},{"rating":"5.0","review":"Had a most enjoyable trip which was fun informative and full of great experiences. The homestays were a highlight but of course there were so many more. Troung our tour guide was amazing and made our tour a wonderful experience that I shared with a great group of people."},{"rating":"4.0","review":"This tour exceeded my expectations.  The amount of group time and the amount of free time was perfect!  The hotels were good and clean but if you are looking for 5 start accommodations you’ll be unhappy.  Our guide, TV, made the trip exceptional.  His wealth of knowledge and love for Vietnam is amazing.  We never had to worry about anything as he took care of even the tiniest of details."},{"rating":"5.0","review":"His enthusiasm and knowledge base are extensive. He has a great sense of humor and fun and made our travels a truly great adventure"},{"rating":"4.5","review":"This tour exceeded expectations! I was a little scared at first but quickly settled into the flow.  Our tour guide made Vietnam amazing!"},{"rating":"5.0","review":"The trip was above expectations. Our guide Nguyen was wonderful and gave much valuable advice. Accommodation was better than expected and I also liked the different means of transport. Good balance between included activities and free time. Great value for money!"},{"rating":"4.0","review":"To be honest, it took a few days for me to get into the groove of Vietnam. I felt really overwhelmed at first and wasn't sure if it was the right place for me. But I have to say, after a few days on the tour, I really fell in love with the place. I had great travellers in my group and remain friends with some of them to this day, years later. I feel like I saw so much of the country and experienced so much and was able to learn to feel comfortable thanks to being on the tour with great people.\n\nP.S. The food was the greatest food I've ever eaten in my life, anywhere."},{"rating":"4.5","review":"We visited a lot of sites, so it was always something new and exciting :)\nThe day's just flew by - even the train ride was great with the best tour-mates ever :D"},{"rating":"3.0","review":"I enjoyed this trip overall. The amount of time spent in each city was perfect. I also thought Son Le was a very attentive and thoughtful leader. However, the train rides were horrible."}]},{"name":"Northern Vietnam Adventure","reviews":[{"rating":"4.5","review":"This was a trip that went \"off the beaten track\". We saw few westerners after we left Sapa until we got back to Hanoi. There was one other tour group that was following a similar itinerary to us and this group accounted for most of the westerners we saw. I particularly liked the fact that we were exploring a part of Vietnam that is visited by relatively few. It gave us an opportunity to meet local tribespeople who had not been affected by tourism. The tour gave is an opportunity to go into peoples' homes and see how people from different ethnic groups live. This was a real education. \n\nThe opportunity to interact with people from different ethnic groups was one of the highlights of this trip. However, given the number if different ethnic groups it became difficult to distinguish between between them. There was just so much information to take in such a relatively short timeframe. I suggested to our tour leader that it would be helpful to have folder available on the bus that provided some basic information on the different ethnic groups and photos showing their traditional dress, style of housing etc. Having such a folder available would allow tour group members to refresh their memories of what they had seen. \n\nOur tour leader provided background information during our long drives. One of the best \"tutorials\" he gave was on the way in which accents are used in the Vietnamese language. I have been to Vietnam twice before but this was the first time that I became aware of the way accents affect the pronunciation of words in Vietnamese. It would be really helpful to provide a sheet with this information at the start of the tour (and at the start of other tours in Vietnam, for that matter.\n\nThe hikes around Sapa were an important feature of the trip but the information on these hikes did not convey the level of difficulty accurately. I am an experienced bushwalker and I found the hikes difficult, mainly because of the tracks being so steep, muddy and eroded. The hike later in the trip was much easier and was a terrific activity for those who joined in. I am glad I went on the Sapa hikes and I experienced a real sense of achievement by the time I reached the end but I would have brought different footwear had I been aware of the poor condition of the track on the uphill and downhill stretches. I would also have brought walking poles which is what I normally use when I bushels back home.\n\nFinally, the scenery on this trip is absolutely breathtaking. I knew the the area was mountainous but I wasn't expecting the views to be so spectacular."},{"rating":"4.3","review":"Overall the tour was absolutely incredible. We had experience that we would not have been able to have otherwise!"},{"rating":"3.8","review":"Enjoyed the trip a lot and have travelled with Intrepid before so I feel comfortable recommending them and their offerings"},{"rating":"3.0","review":"I was mis-sold the trip! Level3/5 ok I’m fit however it should state it’s for EXPERIENCED hikers! I’ve never hiked before and certainly did not expect to climb a mountain. Uneven terrain, sorry but at times I was on a muddy cliff edge. Not acceptable, you are too vague on your description of the trip. Also the accommodation had a lot to be desired. I have a video of bugs on one of the beds I was supposed to sleep on. It was disgusting, I couldn’t eat breakfast at that hotel either as the cup had dirty marks it was horrible!"},{"rating":"4.8","review":"Well run trip with excellent guide and driver"},{"rating":"4.0","review":"Intrepid provides authentic travel experiences but in a safe environment."},{"rating":"3.5","review":"We enjoyed hiking in the mountains plus the wonderful scenery."},{"rating":"5.0","review":"Well organised trip.Tour guide excellent. Good value.Trekking was \"\"just right\"\" - not to difficult - not to easy, and a good balance between trekking and other activities."},{"rating":"4.0","review":"The main reason is that Truong Le was such a gracious and caring guide!He make sure that everyone was taken care of and enjoying the trip.Also,the amazing scenery of Northern Vietnam and its kind people made this trip very special!"},{"rating":"4.8","review":"Felt the tour gave a very good idea of the local people and how the lived their lives. It was a god balance of culture and outdoor activity."},{"rating":"5.0","review":"It was a group of 1 plus driver, tour guide and trainee tour guide.It was well organised and the group blended well together."},{"rating":"4.0","review":"Cong was knowledgeable about the many different ethnic groups living in Northern Vietnam and shared this information easily. The road is tricky and the driver showed exceptional skill always choosing the safest options. The scenery was amazing."},{"rating":"5.0","review":"We are a well travelled middle aged couple who have just experienced the best tour ever. Thoa our guide was excellent, involving us in the culture and daily lives of the local people. The treks through the terrain though arduous were well worth the challenge. The hospitality of the people is over- whelming along with the scenery. I only wish we could have stayed longer."},{"rating":"4.0","review":"This is such an amazing part of Vietnam, in both culture and scenery. Its very different to other more travelled parts of Vietnam, so don't expect touristy restaurants. Expect real, local cuisine (which can be quite limited in some of the more remote towns). The Homestay on Ba-be-lake was beautiful, run by a friendly family who prepared delicious home-made meals - a real highlight!"},{"rating":"5.0","review":"I really enjoyed this trip. It was great to get out of the big cities and into the rural areas among the terraces. There were some great walks and it had a really local feel with few other tourists. Food is a bit limited though so be warned - especially if you are on a special diet."}]}]