[{"name":"Wandering Northern Vietnam Motorbike Tour to Ta Xua , Mu Cang Chai, Y Ty, Sapa","reviews":[{"rating":"5.0","review":"Make sure you go with a like skilled companion, insist on stopping if you’d like to take in some scenery and go with whatever your guide recommends in terms of food. My only critique is wanting to stop more for a swim, scenery or places to eat that were off the beaten path. Often we’d stop right on a main road where it was loud. Would go again! Seemless planning with Mr. Dong and first class service from our guide. Thank you so much Dnq Travel !"}]},{"name":"North to South Vietnam - 10 Days","reviews":[{"rating":"5.0","review":"Really well organised and great activities."},{"rating":"3.5","review":"Accommodation really average \nAnd always asking to pay when everything was already paid"},{"rating":"5.0","review":"It was absolutely great trip! Amazing experience. Highly recommended if you are as adventurous as I am. It will definitely blow your mind . The food is delicious,  people are kind and responsive, intinery was greatly structured."},{"rating":"5.0","review":"Without a doubt, this was one of our best trips we have ever taken.  Certainly the best organized.  And Mike with Go Asia was the best.  Book with him - total efficiency and very proud of showing his country.  We couldn't be more satisfied.\n\nJack and Karen"},{"rating":"5.0","review":"We had such an amazing time on our trip! Mike who organised our itinerary organised it so well, the hotels were great and all the details provided to us made our trip stress free. He was also available on WhatsApp if we ever needed him. We learnt a lot on this trip about Vietnamese culture and food and I would highly recommend this trip. If you get the overnight train, I would recommend upgrading to a private cabin like we did."},{"rating":"5.0","review":"We really enjoyed this trip. Was great to have everything planned out for us. From the pick up at the airport to dropping off at the airport everything went smoothly.\nOne of the highlights of the tour was Halong bay. We stayed one night on the boat. The food was amazing and the scenery too. Hoi An was another favourite. A beautiful little town that comes alive at night with cute little cafés. I would recommend this tour because it is so diverse and you see a little of a lot that there is in Vietnam."},{"rating":"5.0","review":"The tour was fantastic, visiting some really interesting and beautiful places. The accommodation was always very comfortable, and everyone was extremely helpful and friendly. Our guides had good knowledge of the area, and were really eager to explain the local history and help us with any questions that we had."},{"rating":"5.0","review":"It is such a memorable time we had with Go Asia Travel \nAll hotels are lovely. Driver and tour guide always wait for us. Hoi An will be the place we might come back. It is so beautiful \n\nThank you Go Asia for everything"},{"rating":"5.0","review":"Well-organized, generous accommodations, great food and activities. And great communication with organizer Mike Nguyen. All the guides: Henry, Duckie, Binh, Phuung, Jackie, we’re knowledgable, kind, and energetic. This is not a fancy schmancy tour, but a great down-to-earth one. Highly recommend."},{"rating":"4.0","review":"I enjoyed my time in Vietnam, however I thought I was booking a group tour where I would be with a group the whole time. Instead, it turned out that the tour from the North to South of Vietnam was a series of bookings only.  My hotels, transportation, transfers and tours were booked much like a travel agent would book things for you but there was no guide involved.  If this is what you are looking for then go asia travel did a good job.  However, if you are looking for a group tour, you will not find it here.  This was not clear in the information provided on the tourradar site or in any of my communication with go asia travel.  I caution others to be sure to ask the right questions so that they know what they are getting."},{"rating":"5.0","review":"Highly recommended and would go through Go Asia again for my next holiday! \n\nI had originally thought the tour was with one group from day 1 to day 10, and one tour guide, however the \"tour\" actually consists of separate individual tours, with different groups of people. As a solo traveller I wasn't sure how this would work out, however it turned out to be perfect! On each of the tours I did (Halong Bay overnight, MySon, Mekong Delta and Cu Chi tunnels) each tour guide was fantastic and made sure I felt comfortable and was enjoying my time. The hospitality in Vietnam is extremely friendly and caring! \n\nEach of the tour guides I had were great at providing information about Vietnam and the attraction to us, and happy to answer any questions we had. I was very impressed with their English and they even taught us some Vietnamese! They cared for each person on the tour group and made sure it was suitable for us. \n\nThe accommodation was great (I was on the 3 star package), spacious rooms, toiletries and towels provided, always in perfect locations and in the main area therefore never had any issues getting back to the hotels. Also the staff again were extremely caring and friendly. \n\nEach of the hotels had breakfast, which was plentiful, and on the days I had a tour there would be lunch included (sometimes dinner depending on the times). The hotels being in the main areas meant that when there wasn't a tour on it was very easy to find food. \n\nThere were two tours which finished around 2pm, and for this one's, Go Asia had booked lunch, however this was separate to the actual tour, so I ended up being dropped of at a restaurant by myself! This was slightly strange and it wasn't well explained what was going on and whether I choose my own food or there is a set menu. However I messaged my Go Asia operator about it and he replied straight away explaining what was going to happen. I probably would have preferred to be able to find my own place for lunch considering I was a solo traveller! But the food was very tasty.\n\nMy Go Asia operator, Mike Nguyen, was extremely helpful and friendly! He responded quickly to my queries and was more than happy to answer my questions and also provide assistance and advice. When I decided to change my tour a bit he organised it all so I didn't have to worry about anything. \n\nEach of the journeys between locations is also organised, and pick ups from the airport/train station was easy to find and prompt. Not having to worry about a single thing on this holiday was a bliss! \n\nWould definitely do again!"},{"rating":"4.5","review":"Fantastic! The itinerary consists of separate individual tours, so you're with different people on each of the tours, and the rest of the time is personal time. I wasn't clear of this at first but it ended up being absolutely fine, as every journey and every part of the itinerary that isn't a day/overnight tour is explained very clearly.\n\nEach of my individual tours (Halong Bay overnight, MySon tour, Mekong Delta and Cu Chi tunnels) was very well organised and with tour guides who were very knowledgeable and able to answer all our questions. \n\nThe hotels were great (I was on 3 star) and reception staff always so friendly and happy to offer suggestions of what to do during the free time.\n\nThe only shock was to me was when one of my driver's was on his phone the whole time driving! Coming from a country where that's not allowed, it was a bit of a shock, however that could just be for me.\n\nThere were two meals which weren't part of the day tour we were on, but an additional extra the itinerary included for after the day tour, and as it wasn't part of the day tour it meant sometimes I was the only one dropped off at a restaurant! Also that was probably the only bit that wasn't clear about what to do, as in wasn't sure if there was a set menu or I just order. But the organisers of the itinerary are extremely helpful and I would be able to contact mine with any questions and get a fast response such as in this situation. \n\nThe GoAsia coordinators are fantastic, so responsive and really want this experience to be well suited to each person. \n\nWould definitely do again!"},{"rating":"5.0","review":"Trip was all we expected and much more.\nPeople were friendly helpful and genuinely interested to make sure our experience was one to remember.\nThe sites were spectacular and diverse from north to south from rural setting to major cities.\nDriving by the local is something you can't discribe you need to see it."},{"rating":"5.0","review":"Mike of - Go Asia Tours - did a great job of planning our itinerary \nThe tour was well paced with many interesting sites - some were totally awesome - e.g. The caves in Ha Long Bay - totally awesome "},{"rating":"5.0","review":"We have just returned back from Vietnam. Hanoi to Halong Bay down to Hue, Ho An and then ending in HCMC. The whole trip was fantastic and Go Asia travel were excellent. My wife and i were a little bit apprehensive as our 1st time in Vietnam. Go Asia travel did not miss a beat all transport Hotels Tours were so well run and considering the price we paid on Scoopon great value for money. I would highly recommend there services and also our contact Ms Nga Nuguyen."},{"rating":"5.0","review":"We booked a 10 day North to South tour, via Scoopon. From the moment we contacted Go Asia, we have received quality service. Our travel agent, Ms Nga Nguyen, replied to all our emails on the same day, providing assistance the entire time.\nOur agent also met us in Hanoi, after almost 1 week, to personally give us train and plane tickets and for feedback. We only had one minor complaint, about the quality of food at one particular place. Our next prepaid meal was absolutely lovely, one of the best in Vietnam. Certainly made up for the bad food.\nI appreciated the flexibility, as we were able to add extra days and a Sapa tour to our trip. The door to door service is fantastic, knowing that a driver will be at the airport waiting for us after a long flight, is great.\nEvery driver we had was friendly, careful and ON TIME!\nEven though we had a lot of tours, the itinerary still allowed us time free time to discover each city our way.\nOur Vietnam holiday was fantastic, memorable and so well organised, I would definitely book any further IndoChina holidays with Go Asia."}]},{"name":"Explore Vietnam National Geographic Journeys","reviews":[{"rating":"4.5","review":"Excellent tour, fantastic itinerary well planned."},{"rating":"4.0","review":"The motor bike tour in Hue."},{"rating":"4.0","review":"This tour encompassed all of what Vietnam has to offer."}]},{"name":"Essence 10 Days in Vietnam from North, Central down South","reviews":[{"rating":"5.0","review":"The tour exceeded our expectations.\nFrom start, tour manager, Mahn from Vietnam Real Tours contacted me and continued to provide excellent communication throughout the tour.\n\nWe wished to update the tour to provide extra days in a couple of places along the way. As it was a busy time of Tet festival, some of the journey details were rearranged by Mahn who dealt with all bookings to accommodate our wishes so we did not miss any part of the tour. \n\nThe tour was excellent, providing flexibility with dates on each component from pick up from airport to hotel to day trip and continuation of journey. All happened so seamlessly as organised by Mahn which took any stress out of bookings to fit within 15 day stay without visa.\n\nThe hotels booked on the tour by Mahn were thoughtfully located to explore areas and of the best quality. I had an injury whilst in tour and Mahn arranged an upgrade for us to make me comfortable having to miss a day trip. I thank him for his care with this. \n\nThe sight seeing trips arranged for us were great too. Good English speaking and variety to give us taste of Vietnam.\n\nI normally arrange all components of a journey when travelling lots in SE Asia, to save cost. However, thought for short time, first time to Vietnam, it was easy to have independence of dates but everything arranged for us. \n\nDefinitely worth the price to know good research has been done by to our manager having knowledge and communication with all hotels and drivers already. Small price to pay. Thank you so much, Mahn. I felt you genuinely cared for us and our journey."},{"rating":"5.0","review":"Booking this tour took every stress away from planning a wonderful trip to Vietnam. I wanted to see as much of what the country has to offer in a short space of time, and this tour really does account for seeing the highlights, as well as giving you the opportunity to explore things you may have planned to see yourself. All for such an incredible price, if you want to see the highlights of Vietnam then this is the tour for you!"}]}]