[{"name":"Authentic Vietnam (Plus Golden Bridge) - 13 Days","reviews":[{"rating":"3.5","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"4.5","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"4.5","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Vietnam - An old school trip by train","reviews":[{"rating":"5.0","review":"TransViet with good services arrangement, of course nice friendly tour guides. helped us to enjoy an interesting trip in Vietnam. My family certainly recommend this tour to everyone who need to explore this nice country."}]},{"name":"Vietnam Culinary Delights - 10 Days","reviews":[{"rating":"5.0","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"5.0","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"4.0","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"The Golfer Conquest - Tee off through Amazing Vietnam","reviews":[{"rating":"5.0","review":"A best trip you couldnt missed when you want to visit Vietnam"}]},{"name":"12 Days Impressive Vietnam From Ho Chi Minh city","reviews":[{"rating":"4.5","review":"Communication with the tour operator was good. Flexible with our wishes. Fast response. All our trips, pick-ups and drop offs were smooth and easy. We enjoyed our trip very much."},{"rating":"5.0","review":"I am so humbled by the experience i got from this Vietnam tour. The tour agent was so well organised...pick ups were on time with good transportation. The itinerary was so great, with mind blowing highlights. I also loved the free days that gave me more freedom to do what i like. I would definitely recommend them and hope to use them again in the future.\nI hope the tour company explores the option of paring solo travelers in order to accommodate them in hotels as opposed to hostels."},{"rating":"4.5","review":"Although my friend and I asked him to make so many arrangements for us, he was so nice and always got things down right away.\n\nWe first booked this 12-day south to north tour through TourRadar but we got to have him change our itenerary quite a bit. We found this type of tour was exactly what we needed. We got to make your own itenerary, travel ourselves, and meet other tourists on each tour while hotels, transportation, and day tours are all taken care of.\n\nI would definitely come back to Vietnam but I just wish Manh offers this tour in other countries too!!"},{"rating":"4.0","review":"Well organised and good communication."},{"rating":"5.0","review":"Great company everything works like swiss watch I don't even had one complaint everything they planned for me was wonderful the quality of the people that's handled my trip were vary professional I will recommend this company to any one love everything will take more trips with this company thanks again David"},{"rating":"4.0","review":"All very good , Just the breakfast in the hôtel in Hanoi . Not many things to eat ."},{"rating":"5.0","review":"Thanks for all. Wonderful trip with the best guide I never know"}]},{"name":"Luxury Escape – explore Best of Vietnam in 10 Days incl Hanoi – Halong Bay – Hue – Hoi An – Ho Chi Minh – Mekong.","reviews":[{"rating":"5.0","review":"Travelling overseas to Vietnam and booking before you go can be harrowing and worrying. Will you get what you are expecting? Will you be looked after? Or worse, will you be subject to fraudulent activity? My suggestion is to book with Vietnam Allure Travel. They have a wide range of flights, tours and hotels available for you to customise your trip, but more importantly, they are trustworthy, efficient, and experienced. My experience has only been extremely positive , both in our email communication and then in person. Thoroughly recommend."}]},{"name":"Explore Vietnam Heritage & Cultural 11 Days","reviews":[{"rating":"5.0","review":"Thank you to both Angie for a wonderful trip in Vietnam. She worked hard with me to arrange our trip exactly as I wanted. She was sweet, helpful, caring, and diligent, and a pleasure to work with. When she left the company we were smoothly transferred to Mr. Billy who did a wonderful job with last minute changes as a result of the start of the Corona virus. Our trip was everything I dreamed of and Mr. Billy made sure that every day was worry free, checking in with us in the evening with updates.\nThe price was reasonable, a bit more than I would have paid on my own, but worth it as I didn't have to worry about anything after arriving in Vietnam. We were picked up at the airport by a driver with our names and at every spot there was someone waiting to meet us. All the cars were very comfortable and drivers were courteous and friendly. I recommend using Bravo Indochina Tours for your first time in Vietnam as they work hard to make your trip fun and worry free."},{"rating":"5.0","review":"I enjoyed working with this tour company. They were very helpful and could be reached immediately if needed. They designed a tour exactly as requested and changed things as needed to meet physical limitations. Excellent group"},{"rating":"5.0","review":"Just completed Vietnam Holidays with Bravo Indochina Tours. Words cannot describe how amazing the experience was. Hai’s knowledge about the history of Vietnam was exceptional and his passion for His country was contagious. Nothing was too much trouble and the itinerary included just the right amount of sights and experiences. Once again I can’t fault Bravo Indochina Tours. Thank you"},{"rating":"5.0","review":"I did the Vietnam tour and our tour guide Hai was simply the best tour guide I have ever had. so friendly and kind to everyone. He is so well organized. He should honestly be in management. I can't believe what a good time we had. I recommend this tour to anybody who wants to go to a cheap vacation to see all of Vietnam. Thanks for the great time Bravo Indochina Tours"},{"rating":"5.0","review":"Andy helped me put together a 11 day tour of Vietnam for my husband and I. He was very patient, helpful and tolerated me changing things lots of times. They were very price competitive! The trip went really well, with no issues, the guides were all great as were the drivers. Constantly available by e mail even whilst travelling to ensure all going well. I was unsure about using a chinese company but would not hesitate to recommend this company to anyone!"},{"rating":"4.5","review":"We have just returned a tour of Vietnam 11 Days. In the North we had a wonderful tour guide Linh and driver Chung. In Saigon to be met by Thao and our driver Yung. They have been fantastic, their knowledge and relaxed attitude has been excellent. We have received personal service throughout the trip. We visited places which were different to the normal tourist trips which was very special. Highlights were Hanoi , Ha long Bay overnight cruise; Visit to Cu Chi tunnel, War Museum, Palace, Markets & Mekong river cruise, and to finish our trip a dinner cruise on the Saigon which was most entertaining. Many thanks Bravo Indochina Tours for organizing our trip"}]},{"name":"Vietnam Signature- From North to South","reviews":[{"rating":"5.0","review":"The trip was very well organized. Dat was available all the time to answer our questions and to help us during the trip.\nThere are a few points to improve:\n- We were a little bit disappointed with the Tam Coc cycling, we only cycled on asphalt and for a short period, not what we were expecting. Maybe due to the rice fields being flooded.\n- The home-stay in Sapa was performed in Tavan Ecologic Homestay, which is more of a guest house than a home-stay (not a real daily life experience)\n- If we had the opportunity, we would change the schedule for the Phong Nha Cave, it takes 4 hours by bus each way, \n\nApart from these points, the hotels selected were perfect, the transfer services were always on the scheduled time, and we got the chance to experience a lot of Vietnamese cultures, from north to south. The different tour guides throughout the trip were very friendly and informative.\n\nWe will definitely recommend this tour, and will have Realistic Asia under the radar for any next holidays in south east Asia. \n\nThank you so much for your great service."},{"rating":"4.5","review":"Excellent tour. Everything was perfectly planned and the tour guides were always precisely on time."},{"rating":"3.5","review":"Had a fantastic tour. No issues at all. All the guides An day tours were really good. Accomodation was good as were the included meals. I was contacted by Dat at SViet travel each evening to advise me of the pickup time for the tour the next day and when I decided to change one of the train trips to a flight this was organised with ease by Dat."},{"rating":"5.0","review":"I was not sure how Sviet Travel would perform with our tour, however they certainly exceeded my expectations. Everything happened as it was supposed to. The hotels were were good quality and well placed. All hotels provided breakfast with a range of food available. The side trips were interesting. I especially enjoyed the Ba Vi eco tour into the countryside and homes of local Vietnamese. The guides were very informative and I loved hearing about Vietnamese culture past and present. Sviet organised drivers for all our hotel and airport transfers and every one turned up on time. If I had any queries during the trip, Dat responded quickly so we always knew what we were doing. I have no hesitation in recommending Sviet Travel for your trip to Vietnam."},{"rating":"4.5","review":"Our little travelling group of four have recently returned from the most amazing trip around Vietnam with the assistance of S Viet Travel. \nI was a little nervous as we were based in Australia but there was no need for any anxiousness. We were all informed about the pick-up time, guides were informative; accommodation and transportation are flawless."},{"rating":"5.0","review":". This is the first time l have participated in a group tour. Well-planned program as I was given time for myself as well as with my group. Enjoyed everything"},{"rating":"4.5","review":"We could not be happier with S Viet Travel. We love to travel and I usually spend months and months planning our perfect trip on our own. However, this time a friend recommended S Viet to me. And they fit perfectly within our budget and were incredibly affordable. Their customer service is top notch."},{"rating":"5.0","review":"Dat arranged our 2 week trip in great detail, we flew into Hanoi to start and were met by our 1st tour guide and driver to be taken to our hotel in the centre of Hanoi. Throughout the trip we visited Sapa, Ha long bay, Hue, Da Nang, Hoi An and Saigon, Lam organised all the hotels, private cars, tour guides, overnight boat trip, overnight train cabin,  plus many sightseeing tours. The whole trip was seamless and very well organised."},{"rating":"5.0","review":"I was in Vietnam with my friends and wanted to see something different. I enjoying going to these places because it make me humble. To see what the locals have to do every day to make a living to feed their family. I think it is worth visiting. Don't have high expectation and you might like it."},{"rating":"5.0","review":"Just return from Vietnam trip, wonderful time and had the best food. Great drivers and  guides in all places, they all have good knowledge and well spoken English. Everything is well arranged."},{"rating":"5.0","review":"Enjoyed all activities, the itinerary made it easy to see a large amount of the country in a short amount of time and our guide Son made the tour so much better thank to his knowledge and humor"},{"rating":"5.0","review":"The cruise on Halong bay was fantastic though the time siting on the bus was too long. We did a hiking in Sapa and this region is absolutely amazing. Our guide was nice to hang out with , yet the guide in Hue has very thick accent and it hard to follow him. Anyway except from his command of English, he did take really good care of us, no pushing us to tips or anything like that. Big shout out to Xiu in Sai Gon for being the best guide I have ever met, informative and provide us with many good advices. You are all know what you are doing so keep up the good work."},{"rating":"4.5","review":"My trip to Vietnam covering Hanoi; Sapa; Hue; Saigon, Hue, Hoian, Danang, Hanoi and Halong Bay was really memorable. The trip was very well managed by S Viet Travel, many thanks to the travel consultant, Mr Dat for  being well response and  supportive.  Over all, it’s a great trip"},{"rating":"3.5","review":"This itinerary is pretty much cover all places of Vietnam and also this was my first time going on an overnight train, shared a bin with a lovely family of three. Most of the time I ‘m with a small group but sometime is just me and my tour guide but I enjoyed this tour a lot."},{"rating":"5.0","review":"For the first time in Vietnam , for the first time slept on overnight train and  Paradise Cave which is truly heaven on earth, this trip has gone above my expectation."},{"rating":"4.5","review":"A great tour with wonderful variety of experiences."}]},{"name":"14 DAYS VIETNAM FAMILY HOLIDAY","reviews":[{"rating":"5.0","review":"The team at Swallow travel were fantastic when we booked our trip with them because we had to postpone our trip and we were worried it would affect our booking but they helped us change our itinerary and travel dates and we did not have to pay any extra cost. Thank you so much swallow travel for allowing us to have such a wonderful trip. I will definitely be using you again for my next trip."},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"We have run into a problem at airport my passport was only valid for 3 months and they didn’t let us travel as our plans. Luckily we got a new passport and flights in 24 hours. Vietnam ???????? traveling North to South starting in Hanoi, Ha Long Bay, Hue, Hoi An and Ho Chi Minh City. Can’t thank Thuong enough for organising an amazing holiday & also for being at end of phone whenever we needed her. Thank you again Swallow Travel ????????"},{"rating":"5.0","review":"Cannot thank the team from Swallow travel enough for the wonderfull trip we had. Everything was perfect from the tour guides to the places we visited. The team from Swallow travel were the best and went out of their way to help us with our bookings. Would definitely travel with them again."}]}]