[{"name":"Acrossing Vietnam 10days/9nights","reviews":[{"rating":"5.0","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"4.0","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Northern Vietnam adventure 8D7N (Hanoi to Hoi An)","reviews":[{"rating":"5.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"5.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"4.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Discovery Hanoi, Halong, Catba, Lan Ha Bay and Ninh Binh 6 days 5 nights","reviews":[{"rating":"3.5","review":"The tour was very well organised from start to finish with clear instructions and seem less transfers between activities. The activities were fun and insightful and a highlight was the floating market. I felt we really saw how people on the Mekong Delta live and some Vietnamese traditions. The accommodations was basic but given the price reasonable - the home stay was very good and it was lovely speaking to a Vietnamese family. Our only surprise was how little time we actually spent travelling on the river - I had imagined that we would spend most of the time travelling to Cambodia on the river however the first two days we travelled by bus with the last day heading into Cambodia on a fast ferry for 5 hours."},{"rating":"3.5","review":"All the pick-ups were on time, both the taxies and the day trips. Only the bus to Halong Bay had charging option on...\nShow more"},{"rating":"4.5","review":"Tour guides Dong and Kai were very knowledgeable and made the tour interesting."}]},{"name":"A Jouney to Forbidden Wildlife in Central Vietnam","reviews":[{"rating":"4.0","review":"TransViet with good services arrangement, of course nice friendly tour guides. helped us to enjoy an interesting trip in Vietnam. My family certainly recommend this tour to everyone who need to explore this nice country."},{"rating":"4.0","review":"A best trip you couldnt missed when you want to visit Vietnam"}]},{"name":"North And Central Hightlight Of Vietnam 9 Days Adventure With Halong Bay - Sapa Trekking - Paradise Cave - Zipline - Cham Island Snorkeling","reviews":[{"rating":"5.0","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.0","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Discover Hanoi, Halong, Cat Ba and Ninh Binh 6 Days 5 Nights","reviews":[{"rating":"4.0","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"4.0","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"3.5","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Mekong River(Sai Gon) To Red River Delta(Ha Noi) 8 Days","reviews":[{"rating":"3.5","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"4.0","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]},{"name":"Hanoi Vacation with 2 Nights on La Regina Royal Cruises 5*","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Vietnam Family Cycling Holiday","reviews":[{"rating":"5.0","review":"Cut short by Covid-19 otherwise Perfect"},{"rating":"4.5","review":"We had an amazing group and a great tour guide, Ngoc wanted us to have the true Vietnamese experience. Our dinners together were all amazing. Food was one of the highlights of the trip. On a tour where the country was beginning to shut down to tourists, he did an amazing job of keeping positive and continuing to share his knowledge of the country he calls home. Intrepid was not advising him about the changes that were coming down due to the COVID virus and so he was unable to answer our questions about parts of trip that were to be cancelled such as Halong Bay. Once the tour was cancelled Ngoc was concerned for our wellbeing and flights home. I will return on my credit received from Intrepid."},{"rating":"4.0","review":"Amazing trip! We travelled to Sri Lanka in August/September 2019 and had a great experience with Step Lanka and our driver and guide Tharaka. We visited some amazing places and Tharaka used his knowledge to make sure we were able to make the most of each destination. He also found us the best and most cost effective way of doing the excursions, trips and classes that we wanted to do - pigeon island snorkelling and cookery class, in particular. Thanks so much for an unforgettable trip. We hope to come back again soon! Alex and Gemma"}]},{"name":"Trekking through Nature Reserve 5 Days( Mai Chau - Pu Luong Nature)","reviews":[{"rating":"5.0","review":"Go for it! You wont regret taking the tour. It's very organised and bamboo hat tours will really look after you! The tour is really value for money. I dont have a single complaint of the tour. My agent was Sophie, she is extremely professional and friendly.She really cares about your experience and making you feel comfortable. I will be booking my next trip through her :)"},{"rating":"3.5","review":"Great tour if you want to stick to a schedule and yet cover most of the tourist attractions. Guides were great and entire experience was good."}]}]