[{"name":"7 Days South to Central of Vietnam","reviews":[{"rating":"4.0","review":"Thank you to our guides who provided a personal touch and perspective to the beautiful country of Vietnam."},{"rating":"3.0","review":"Scooter tour in Saigon was great but got sick from ice in my beer at the seafood restaurant my fault was told no ice outside hotel or majour resturant . So cant rate Da Nang was in bed. LOVE HOI AN like eveyone else easy to get around see and do stuff.  Hotels 3 starrs except Da Nang would give it 2 only ok pay the upgrade to 4 you get a pool to lie around. I would stick to the 10 DAY TOUR . I dont think 7 is enough to get you into the culture. Was told al transfers paid for but the last one was a cab and he wouldn't go untill i paid he followed me into the Airport' i told him him ring Hoi An Tour but he said no english as they do when ripping you off bet he got paid twice"},{"rating":"4.5","review":"What a fantastic and great trip! Thanks Huyen Anh, and Tin that were my fearless and amazing tour guides. I highly recommend this Tourradar. Transportation was always flawless and very punctual."},{"rating":"5.0","review":"nice country, nice people, good organization of the trip"}]},{"name":"Real Vietnam","reviews":[{"rating":"4.5","review":"The Real Vietnam tour was brilliant! There was a nice mix of learning about Vietnams history and culture and experiencing its night life. You have to be willing to have the long nights with the early mornings sometimes to get a full experience\nThe tour leader,Tan, was brilliant. H e had so much knowledge to share and has natural charisma that made him easy to get on with\n5 Star Rating for this tour"},{"rating":"3.8","review":"Days were mostly well planned."},{"rating":"4.5","review":"i like the tour guide Chieu le. He ia very helpful and always available for us. I especially like the optional bike tour in hoi an"},{"rating":"4.2","review":"Only 5 stars due to our guide, Chieu. There were some average moments and hotels but he made the trip worth it."},{"rating":"4.5","review":"Overall experience was very positive with a planned itinerary but plenty of free time to do your own thing, and a great way to meet new people!"},{"rating":"4.5","review":"I loved our tour guide and the places we visited.Some of the hotels could have been better in terms of comfort (beds) and noise (Ho Chi Minh)."},{"rating":"4.0","review":"Hotels could be revised"},{"rating":"3.8","review":"Some hotels were poor - HCMC hotel was way too loud, Cat Ba had rock hard beds and Hanoi was too far from the old quarter."},{"rating":"4.8","review":"Our tour leader, Ash, was amazing. She was very knowledgeable, helpful, funny and friendly, and made the trip thoroughly enjoyable."},{"rating":"5.0","review":"I had an awesome time, both my tour leaders (Paek and Ashley) were amazing, and their english was incredible."},{"rating":"5.0","review":"We had the most incredible trip to Vietnam. Although we booked a fairly basic tour the itinerary was full enough to keep us entertained whilst allowing for some needed rest and recuperation. We expected very basic hotels and were pleasantly surprised throughout. The transport between each of the locations was well organised and comfortable. What really made this trip unforgettable was our tour guide. His knowledge and love of Vietnam were clear throughout. He shared interesting stories about his family life and provided insight into life in his home country. Even on days that were scheduled as 'free time' our guide provided tips on what to see and where to go for meals which was a huge help. Quang is a huge asset to Gecko Tours and should be recognised for his dedication and hard work. "},{"rating":"5.0","review":"Absolutely best trip I could've asked for! This was my first time travelling by myself and it was incredible! I had an awesome bunch of people to travel with and a well-informed and enthusiastic tour guide, who didn't mind taking time out to show us the extra stuff along the way"}]},{"name":"Vietnam Experience","reviews":[{"rating":"5.0","review":"Great trip, we got to see a lot of Vietnam in a short space of time"},{"rating":"5.0","review":"Great tour guide,very helpful and a top bloke"},{"rating":"5.0","review":"Fantastic, Elle brought the trip to life with great knowledge of the local areas we travelled through. I can’t wait to go on another tour with Elle"},{"rating":"4.0","review":"Ele was an incredible tour leader. Her enthusiasm, positivity and love for Vietnam really came through. A tour leader really influences the overall experience of a group tour. Can’t say anything but great things about Ele!"},{"rating":"5.0","review":"Vietnam was amazing! In the 2-3 weeks I was there we covered so much. I’ll never forget the street food, Halong bay, mud fishing, riding around Hoi An... the list goes on! I will be going back one day! All this wouldn’t have been possible without the amazing trip manager Elle! She puts so much passion and energy into her job, she really loves Asia and is very well educated about everything. Elle makes it her number 1 priority for everyone to have fun and make the most of their trip. You can ask her anything at anytime and she will make sure to help! She’s not just a serious trip manager though... she still loves to come out and party with everyone! If Elle wasn’t announcing her custom colourful co-ordinated day sheet everyday, you think she’d be one of the travellers with you! I will never forget this trip and I can’t wait to go back!"},{"rating":"5.0","review":"Very enjoyable tour, exceptionally well led and organised, and managed to see and do a lot in the time we were there. Great food. The itinerary is quite compact, if it were up to me they’d skip Nha Trang and spend more time in Hanoi or include a day trip to Ninh Binh."},{"rating":"5.0","review":"Talia is a passionate guide, who spent the whole of our trip caring for our trip group and letting us know all the intricate details of the culture and areas we visited in Vietnam.\n\nA pleasure to be with and would recommend anyone to join her trips - I'll definitely be back!"},{"rating":"5.0","review":"Talia was amazing trip manager, so fun and always know what she was talking about. She always made sure I was okay and the group. \nTalia was definitely a big part of my Vietnam experience!!!!"},{"rating":"4.5","review":"I had an absolutely fantastic time on my Vietnam Experience tour in May. The itinerary is jam packed with a great range of activities to give you a taste of everything Vietnam. It pushed me out of my comfort zone several times which was good for me, and go me trying new foods, doing different activities, etc. The accommodation was fine and in good locations when we were staying in the bigger cities. It’s the been Contiki tour I’ve been on - I was blessed with the best group and our tour guide Talia made it even better. She was great fun, had awesome relationships with the local guides, and always made sure we’re having a great time - even when things weren’t going as expected (weather in Ha Long Bay almost changed our junk boat plans!). Highly recommend!"},{"rating":"5.0","review":"I couldn't have asked for a better guide - Talia was so knowledgeable and friendly. You could tell how much she enjoyed her job and her enjoyment rubbed off on everyone else."},{"rating":"5.0","review":"Fi was awesome. She was always in a good mood and knew all about the trip. I would travel with her again immediately."},{"rating":"4.5","review":"Trip was amazing and well organised. Fi really knew her stuff and I didn't doubt her at any point, I trusted her completely (a big acheivement from me). Fi kept our spirits high and our eyes open, I really hope to get Fi as a guide on another trip! Miss you Fi! ❤ - Hannah"},{"rating":"5.0","review":"Fiona was an exceptional tour guide. Her energy and enthusiasm for every day and activity was infectious. No problem was too large to help with. She has made this trip extremely memorable and ensured I will return on a contiki tour to another destination very soon. Thanks Fi !xx"},{"rating":"4.5","review":"Super fun & organised Fi always so helpful with anything. "},{"rating":"4.5","review":"Such a better experience compared to my first contiki"},{"rating":"5.0","review":"Had such a great time on the Vietnam experience, would highly recommend!!"},{"rating":"5.0","review":"Aaron has good knowledge of Vietnam, he knew exactly where to go, what was good to eat, where was good to drink! Was a great trip"},{"rating":"5.0","review":"Best Contiki I've ever been on (out of 4)! The TM made sure everyone was comfortable and felt safe. Definitely helped that the group we had were an amazing bunch. Exceeded my expectations and made me want to go back to Vietnam straight away. Itinerary, organisation and locations were perfect."},{"rating":"5.0","review":"From the get go the entire trip was mindblowing. I'll honestly never forget the experience and the friends I made along the way for the rest of my life. None of it would have been possible without the amazing tour guides and the even more outstanding tour manager Rhi Zaa, who worked tirelessly to make sure that everyone was having the best time possible. Rhi, you the real MVP. The only downside was having to come home and leave it all behind."},{"rating":"5.0","review":"Had an absolute ball on this trip! I’ve done a lot of organised tours and Rhi is by far the best tour guide I’ve had! She is so organised and knowledgeable! She’s super fun, super friendly, super easy going.. nothing was a problem for her! The trip would not have been the same with out having her there! \nShe is so great at what she does!"},{"rating":"5.0","review":"The Vietnam Experience tour was a total  immersion into Vietnam culture, food and history, and great nights out!  On the tour we had the best gang of people. The general mood of the tour was always humorous, happy  and chill thanks to James unique ability to be a leader, a friend and just a very cool guy. The trip wouldn't  have been the same without him."},{"rating":"5.0","review":"James is absolutely amazing!! He truly cares about the comfort and happiness of his tour group and is consistently checking in with everyone to ensure everyone is having the best experience possible. James knows exactly how to read the mood of a group and is full of excellent recommendations for down time on a trip. Not only is he able to control a group but he also is willing to join in and have fun! Would love to take another trip with him in the future!"},{"rating":"5.0","review":"james definitely made the trip one to remember, i couldn't fault him.\nthe trip did feel a little rushed at times but to be expected and if i could change one thing it would be to remove mekong delta from the itinerary and add an extra night in halong bay"},{"rating":"5.0","review":"Amazing trip, great tour guide, great group, comprehensive itinerary and good recommendations for what to do in spare time"},{"rating":"5.0","review":"What an amazing experience, shout out to James who did all the work so I could just enjoy myself"},{"rating":"5.0","review":"Excellent tour, James was an amazing tour leader. Really great experience"},{"rating":"4.5","review":"This tour was amazing! Great itinerary and transport. James was the best tour guide, so happy with the overall experience!"},{"rating":"5.0","review":"Everywhere James took us to eat and drink was well thought out! I also loved the activities! Especially the bike ride through Hoi An."},{"rating":"5.0","review":"I literally had the time of my life. From the place itself to the everyone I was travelling with. Honestly cannot fault anything. would highly recommend this trip to anyone."},{"rating":"5.0","review":"Elle is the best tour guide and made travelling through Asia an awesome experience! Definitely booking my next trip throughout Asia with Elle!!!"},{"rating":"4.5","review":"Jelly is an absolute diamond, she made our experience unrepeatable. Her emotion and passion for travel extends to everyone who is fortunate enough to spend time with her. While her calm and fun attitude makes you feel completely at home in a new surrounding.\nIt was my first trip abroad with my now fiancée and it will be a beautiful experience that we carry through our life with one and other."},{"rating":"4.0","review":"Jelly is a fantastic tour guide! She made everyone feel comfortable and included."},{"rating":"4.5","review":"Yelitza “Jelly” is the best tour guide she is so caring and genuinely wants you to have the best time while on holidays. She is very knowledgeable about south east Asia. She takes us to great places and also gives great recommendations for food , activities, where to shop, best bars to go too etc. she leaves all her travellers at the end of the tour happy!!"},{"rating":"5.0","review":"Once-in-a-lifetime experience led by Jelly, who was so much fun, so passionate about her job, and led us through 12 days in Vietnam seamlessly."},{"rating":"5.0","review":"Jelly is an awesome guide! She knows her stuff which makes exploring a new country more enjoyable! 10/10!"},{"rating":"5.0","review":"Jelly was a one of a kind tour guide. Having done several other Contiki tours previously I knew what to expect but to say Jelly went over and above what was required is an understatement. Not only was she knowledgeable about local activities, lingo and cultural expectations, she ensured we were always well prepared, safe and most of all ensured we all had the best time possible. She always sought out different options  to cater for everyone’s needs (where possible). She was also the life of the party when it came to nights out and was always there to greet you with a smile in the morning. Jelly made my visit to Vietnam an unforgettable one, and has raised the bar for all future tour guides!!"},{"rating":"4.5","review":"Elle is simply amazing! She goes above and beyond for all her travellers no matter what time of day it is. Wish I could have her on every trip I go on!"},{"rating":"4.5","review":"Having Elle as my tour guide simply made my first experience in Asia an incredible and memorable time. Always there for us, very patient, knowledgeable and friendly, what else could I ask more?!"},{"rating":"4.5","review":"Had a great time throughout the entire trip. Eleanor was awesome and added a huge amount of value to the satisfaction of the trip."},{"rating":"5.0","review":"Elle was so lovely, I could not have asked for a better tour guide! The trip was so enjoyable and she made it even more so! Always so helpful and full of information! Thank you! x"},{"rating":"5.0","review":"It was an amazing trip and Eleanor was the greatest guide you could ever ask for! Forever grateful for her vibrant personality and her patient nature. \n\nThank you thank you thank you!"},{"rating":"4.0","review":"The Vietnam Experience trip was amazing in itself, from start to finish. What made the trip extra special, and so much more memorable, was Eleanor as our trip manager. She was approachable, fun and caring, and knew the county and its cities so well. Eleanor went above and beyond to make sure everyone was comfortable and having fun, and was wonderful at assisting travellers who were experiencing various difficulties on trip. It was very clear that Eleanor is so passionate about her work and her career."},{"rating":"5.0","review":"I had the most amazing time on this tour with Elle! I can’t thank her enough. You can just tell Elle’s passion and love for Asia from the way she carefully plans out everyday, tells us all the most incredible facts about Asia and most importantly takes us to all the best local eateries so we can get an authentic Asian experience \n\nIf I could rate more than 5 stars I definitely would :)"}]},{"name":"Vintage Vietnam","reviews":[{"rating":"4.5","review":"Phat was the perfect guide, knowledgeable, caring, approachable, responsible and entertaining."},{"rating":"5.0","review":"Great itinerary but wished it included hill tribes north of Hanoi. Rest was excellent. Especially liked Ha Long Bay and Hoi An. Saw beautiful sunset through cabin window in Ha Long Bay and had a shirt and pants tailored in Hoi An. People in the group were great and there were only seven total. Excellent, friendly, helpful tour guide - Jolie."},{"rating":"5.0","review":"Went with my Mother for her 60th Birthday & we had a great time. Our guide, Phat was super friendly, helpful and knowledgeable. The accommodations were all top notch and a great medium paced trip, not too rushed through, we had time to really take in each place. Small group of only 7 of us and we all had a great time got along really well so it was a very relaxed & fun trip all round!"},{"rating":"4.5","review":"This was a trip of a lifetime for me! The hotel and transportation arrangements were seamless and Tho made every effort to accommodate the various needs of the group (including making arrangements to meet me in the Mekong Delta since I joined the group a day late). He was patient and very knowledgeable about the history of the cities, towns, temples, and pagodas we visited.  He led us carefully through busy streets filled with motorbikes and walked us through colorful street markets brimming with all kinds of fruit, fish, meats, and vegetables. And what a delight to meet and dine with local families and take advantage of the optional tours, like biking through rice paddies outside Hoi An and sea kayaking in Halong Bay! Thank you for an experience I will always remember with joy and delight!"}]},{"name":"Best of Vietnam","reviews":[{"rating":"5.0","review":"I was very impressed with our group leader.She was very passionate about showing the group her country and also spending extra time with us As a group."},{"rating":"4.5","review":"Well rounded trip,getting to meet the locals and experience how they live. Had a great guide who was very informed and was able to provide great insight for all the areas we travelled to."},{"rating":"4.5","review":"Our guide Nga was the greatest."},{"rating":"4.8","review":"Variety of activities, great experiences and an amazing tour leader."},{"rating":"5.0","review":"I love intrepid because it makes traveling so easy. They take care of all the small aspects of traveling that can be hard to do in a foreign country such as transportation, language translation, meals, and safety. I felt like having a native Vietnamese guide was very beneficial."},{"rating":"5.0","review":"Good experience of the country"},{"rating":"4.5","review":"Trip was packed with adventures and well organized!Our tour leader, Tan, was attentive, knowledgeable and helpful in all ways.Good value and we saw and did many varied activities."},{"rating":"4.5","review":"The locations covered on the trip were well planned. The tour guide provided by intrepid was very attentive and knowledgeable. This in combination with hitting the key locations of Vietnam make for a fantastic trip."},{"rating":"5.0","review":"Our guide had excellent knowledge of each location we went to and was able to assist us with anything we need. The trip wasn’t rushed it to slow we had a great time."},{"rating":"5.0","review":"Had the most absolutely fantastic time, the Intrepid guide made it even better with his vast knowledge of everything. Very educational, exciting, informative, different, just wonderful. Thank you Intrepid"}]},{"name":"Central Vietnam Culinary Tour","reviews":[{"rating":"5.0","review":"Top Vietnam Travel was an incredible company. The husband of mine and I applied them for our incredible honeymoon in Vietnam just where we traveled the length as well as breathing of the gorgeous state.\nTop Vietnam Travel ensured we had been well looked after with stellar accommodation and excellent drivers. They were able to fit all we were after into the itinerary of ours."}]},{"name":"Treasure of Vietnam (North to South)","reviews":[{"rating":"5.0","review":"[Original Text] Nous étions en groupe au mois de novembre. Organisation, choix d'hôtels impeccable. Je recommande cette agence."},{"rating":"4.5","review":"An excellent tour with an assortment of activities that are great. All of the accommodation was comfortable and clean. The tour guide of ours was beneficial and we didn't need to be worried about anything whenever we were away as things are currently organized. I'd highly recommend the trip !!!!"},{"rating":"5.0","review":"The very best trip to Vietnam! It was an incredible journey with an incredible tour guide. The favorite day of mine from the journey was Halong and also the accommodation there's quite good. I'd certainly recommend this particular trip to anyone! "},{"rating":"5.0","review":"Vietnam Top Travel was very amazing, I actually enjoyed each activity. From the terminal pickup to assist in arranging a taxi to the terminal, in the end, every second was planned extremely well and everybody was in a position to unwind and genuinely appreciate all that Vietnam is offering. In case you're anxious about traveling or going by yourself, do not be! Everything is organized for yourself and the group leaders of yours make anyone feel very comfortable ^_^"},{"rating":"5.0","review":"Really well-organized tour, well designed, confident aircon automobiles or maybe vans, all guides really enjoyable & helpful.\nI am going to recommend the company of yours to the friends of mine."},{"rating":"5.0","review":"We booked a 2 week journey steer with Top Vietnam Travel.\nThey had been extremely helpful. The arrangements had been detailed and accurate. The drivers were polite and punctual. The guide supplied was knowledgeable and helpful.\nWe will make use of them for any later visits to Asia."}]},{"name":"Highlights Of Vietnam","reviews":[{"rating":"4.5","review":"Tour guides both in Vietnam and Cambodia were very knowledgeable about their countries, both were friendly, helpful and courteous. Hotels were all excellent and great amenities such as pools. With the heat in the high 30's it was nice to have a refreshing dip. All included insights were fabulous and I manage two of the 5 optional tours which I was very happy with. The transporting between cities was done as a family as there were only 23...a nice group. All in all I would take another Trafalgar tour !"},{"rating":"4.5","review":"Tour was fantastic with many included World Heritage sights ! "},{"rating":"5.0","review":"Loved this tour, lots of interaction with the locals, sightseeing, shopping, hotels were excellent, overall a wonderful experience, would thoroughly recommend."}]},{"name":"Hello Vietnam","reviews":[{"rating":"5.0","review":"They made my trip around Vietnam more expectation. They were extremely knowledgable and were able to answer every question. Taking us out of the normal tourist-packed areas around the real authentic Vietnam. Thank You Top Vietnam Travel for a wonderful trip.\n❤"},{"rating":"5.0","review":"We'd the best incredible time, all were considered in advance as well as nothing was excessive difficulty for the guides as well as drivers we utilized. I'd definitely suggest this particular company to anyone going to Vietnam and would like to see the sights."},{"rating":"5.0","review":"I have just finished the essential Vietnam tour with these guys! Our hotels were amazing. The Halong Bay overnight cruise was pretty impressive. Very very good value for money and met lovely travelers along the way. I highly recommend and will use them again on my next trip to Vietnam."},{"rating":"5.0","review":"I thoroughly enjoyed our trip to Vietnam. It was so well organized, it gave us total peace of mind to enjoy our trip knowing everything was taken care off. Our guides and drivers were all wonderful. I would highly recommend your service to family or friends thinking of traveling to Vietnam."},{"rating":"5.0","review":"The really incredible trip and watched anything I might have wanted while being surrounded by excellent people and accommodation! The company was impeccable and I never ever had to hesitate about what I had to do. It absolutely was a fantastic combination of awesome activities as particularly on several hidden diamonds. We'd an amazing team and a fantastic manual with an ideal sense of all of us. THANK you for each second we'd!"},{"rating":"5.0","review":"I cannot suggest this company more. We spent two weeks visiting Vietnam in the care of theirs with a self-directed tour. It was fantastic. The manuals, drivers, and hotels have been excellent. They actually surprised me on the birthday of mine with dinner, a card, and wine. I will pick them to travel down the road!"},{"rating":"5.0","review":"The exceptional excursion organized by Top Vietnam Travel, by Ms. Cathy. We gave her twelve days to prepare, and what a brilliant journey - Hanoi, Nha Trang, Hoi An, and also the Mekong Delta. Great English speaking manuals, with a detailed understanding of Vietnam, do's and don't."}]},{"name":"Vietnam Highlights","reviews":[{"rating":"5.0","review":"Jules was incredible! So friendly from the start automatically making me feel settled in. Everything was so perfectly organised and she knew something about everything. She also ensured if we needed help with anything at all she was there for us."},{"rating":"5.0","review":"Absolutely brilliant tour manager! Made this tour a great experience and very knowledgeable about Vietnam’s history! Definitely knows how to show you a good time as well! \nGreat guy, anyone would be lucky to meet him!"},{"rating":"5.0","review":"Stef really knows his stuff and is a superb tour manager. He gave real insight into the history, culture and traditions - all while managing a variety of characters on the tour.\n\nThere were some more in depth questions about social economicals & Vietnam’s history with other countries that he answered with conviction & quality\n\nI’d be more than happy to be on any tour group that he manages. Money well spent."},{"rating":"5.0","review":"Was an excellent tour of a beautiful country. It ran smoothly, I’d highly recommend it."},{"rating":"4.5","review":"Absolutely loved Jelly! Legendary tour guide, keen to share her knowledge of the local area and happy to help so always ended up going the extra mile! Probably would have gotten lost on my last two solo days in Hanoi without Jelly’s advice and phone number!"},{"rating":"5.0","review":"Jelly made every step of the journey so so easy! From getting us to know each other straight away with a treasure hunt in Ho Chi Minh City to getting to know each of our interests and dietary needs so she could make it the best experience possible. The way she personalised each of the daily itineraries made us even more excited for what was to come. Whenever she didn't know something we asked, Jelly made it her business to find someone who did!\n\nJelly is such a nice person that even when the trip was over, our friendship continued. When Jelly herself came to Ireland, we met up in Dublin! And because of her skills in getting a big group to mingle, I am writing this review from South Africa right now as I am visiting a friend I made on Jelly's Vietnam trip!"},{"rating":"5.0","review":"Jelly was upbeat and friendly from the start. She made everyone feel comfortable! \nI enjoyed the itinerary and free time add ons! Accomodation was beyond my expectations, clean and great locations!"},{"rating":"5.0","review":"Jelly is one of the best and kind tour guides. I’d never been on a contiki before and she made the expierence so enjoyable. It was an amazing trip, I have met so many beautiful people from around the world who I’ll know for the rest of my life. The places in Vietnam we went to we’re incredbile. It is a short trip, but has given me ideas when I go back to Vietnam where I would. I went to a lot of different places, which I might not of gone to if I was just traveling solo or with friends. \nJelly is so down to earth, and always so much Fun. I would love to do another Tour with her ❤️✨"},{"rating":"5.0","review":"El was a great guide, extremely passionate about her job and very knowledgeable. Also more than happy to help with any questions or recommendations."},{"rating":"5.0","review":"Elle was the perfect guide. Her knowledge of the areas, ability to both get along with and manage the whole group, and unwavering ability to make the best of every situation made the trip an incredible experience."},{"rating":"4.0","review":"Ell was amazing. Such a friendly face and took us to some amazing spots"},{"rating":"5.0","review":"It was amazing! James went all out to make every part of the trip spectacular and memorable. Traveling became my passion."},{"rating":"5.0","review":"James made that trip. He was an incredible manager. Give him a promotion I love him\nSo much. I get anxiety traveling and made me feel comfortable the entire time and was a wealth of knowledge. Could not have asked for a better manager"},{"rating":"4.5","review":"I Would love to travel with Talia again, she made the trip a dream come true. Talia managed the group dynamics awesomely her incredible skills in people management allowed her to encourage everyone on the tour to engage, by the end of the tour it felt like we were a great big family. If you are lucky enough to travel with Talia you can guarantee that she will take the time to get to know you and play a big part in the amazing memories that you make."},{"rating":"5.0","review":"Sam was a brilliant tour guide, very knowledgeable and good fun!"},{"rating":"5.0","review":"An amazing tour with an even better guide! Eb was fantastic. The accommodation and transportation was far better than I ever thought. Such a great tour to get an overview of this amazing country."},{"rating":"5.0","review":"Great trip. Everything was organised well. Group size was ideal, not too big or too small"},{"rating":"5.0","review":"Greg, Vietnam and whiskers on kittens. These are a few of my favourite things! What an adventure to begin my year with. I couldn’t have asked for a better holiday. Vietnam accomodation was well above what I expected, I was a two star girl living in a five star world. "},{"rating":"5.0","review":"The trip surpassed all expectations!"},{"rating":"5.0","review":"Greg was able to provide an excellent review on accommodation, restaurants, bars and the history of where we stayed. He was also able to stick to achedukrs tightly, as well as making my first overseas trip the best adventure I’ve ever been on!"},{"rating":"5.0","review":"Greg was awesome, really great in depth understanding of the culture and countriy and with a knack for passing that knowledge along to the group in a fun way"},{"rating":"5.0","review":"Greg was amazing! Very informative and helped us out a lot even with what to do when we had free time. Something that I found a few contiki tour guides don't do "},{"rating":"5.0","review":"So so so so good! Greg was amazing and he exceeded my expectations "},{"rating":"5.0","review":"Absolutely amazing experience, such a friendly, charismatic and professional person! Will definitely be doing contiki again because of this! "},{"rating":"5.0","review":"The trip exceeded my expectations. I felt at home with the group and I utterly adored my Trip Manager Greg!"},{"rating":"5.0","review":"It was amazing. Greg our tour manager was absolutely fantastic. "},{"rating":"5.0","review":"Great tour manager and excellent accommodations planed and prep. Been an amazing Vietnam experience "},{"rating":"4.0","review":"Lisa guided Contiki Vietnam highlight tour pretty well. \nEnglish is not my mother tongue, so I have difficulty not catch all the verbal information correctly. She patiently repeats the information to me if I ask her, and her written itinerary does help me get the idea quickly.\nShe also could provide me some useful information when I have to spend my spare time around the city. Thanks for her information, the tour is overall over my expectation."},{"rating":"4.0","review":"A new experience for me and everythings from every aspects were perfect."},{"rating":"4.5","review":"Greg was an amazing lad, extremely well prepared and fun at the same time. Always knew the answers to your questions, purely from doing his own research and couldnt have been more pleased to have Greg as our trip leader. Greg had the perfect mix of culture, partying, history and most importantly knew where to get the best feeds!"},{"rating":"5.0","review":"The trip was fantastic! Greg was so knowledgeable and enthusiastic without pushing activities on people, he accommodated to everyone in the group and their interests and it made the whole group far more happy! "},{"rating":"5.0","review":"Trip more than met my expectations.  Everything was so well organised and travelling was an ease. Greg my tour leader and fellow travellers really made it a memorable experience "},{"rating":"4.5","review":"I travelled with Lisa on the Contiki Vietnam Highlights tour in January 2017 and she's an excellent tour manager and guide. She was always super organized with all of the logistics and I never had a problem knowing what was going on. Whenever we ran into an issue with travelling, she was quick to comfort and assure the others of what was happening and keep them smiling with her infectious energy. She's super fun and suggested great activities and restaurants for the group. Couldn't have asked for more in a trip manager!"},{"rating":"4.5","review":"My experience with Lisa as a tour guide was incredible, she knew exactly how to make people feel safe in a new environment, and had amazing knowledge on the history of Vietnam and always knew amazing places for recommendations, couldn't have asked for a better tour guide!! Xx"},{"rating":"4.5","review":"Vietnam was absolutely incredible! Absolutely went far and beyond what I expected! We didn't have to organise anything with regards to transport and accommodation and our guide went out of his way to organise \"family\" dinners and cool places to hang out and club. Honestly the tour wouldn't have been even half as good if we didn't have Matt with us! Whoever gets him in the future on their tours will be extremely lucky!"},{"rating":"5.0","review":"Matt was awesome, the trip was amazing and overall couldnt ask for more. I would suggest this trio to anyone with a thirst for adventure and little time to do it in. Matt added his own falovoyr with family dinners and suggestions for where to go out, which made our exoerience even better and brought us closer. Great trip!"},{"rating":"5.0","review":"This was my 3rd Contiki and Matt absolutely killed it! Best tour manager I've had!"},{"rating":"5.0","review":"Had the most amazing time on the Vietnam Highlights tour! Everything was planned out so well and the whole trip ran very smoothly. Matt even planned/suggested spots for lunch/dinner or a good night out after a day full of sight-seeing. Made the experience even more enjoyable!"},{"rating":"5.0","review":"Everything was as expected and more. Coach comfortable, accommodation great, food tasty and overall itinerary made me feel I didn't miss a thing"},{"rating":"5.0","review":"Most amazing tour guide! Not a minute wasted, constant fun and included everyone! Would go on a tour with him as the manager any day!"},{"rating":"4.0","review":"Contiki in Vietnam was AMAZING! Az is such an awesome tour guide- so approachable and so much fun to be around! He knows so much about every stop in the trip and includes everyone's interests along the way-  whether it's the foodies, the history lovers, the party-peeps etc! am-\"AZ\"-ing!"},{"rating":"5.0","review":"James was an excellent tour leader. He was so calm and relaxed, organised and professional. He made everyone feel warm and welcome and he's one of the best contiki guides I've had so far (in total I've done 3). The buses were good, hotels were great and local guides were so informative and friendly "},{"rating":"5.0","review":"The Vietnam highlights was amazing! James made the trip so much more by his knowledge and easy going attitude. I hope I get him for the next one! "},{"rating":"5.0","review":"I had the pleasure of meeting Lee on our highlights of Vietnam tour in November 2015.. She was amazing!! She made everything feel so easy on your, looked out for everyone and made sure our time & experiences were awesome!! I am so glad we got Lee as our TM :)"},{"rating":"5.0","review":"What a legend. Couldnt have asked for a better TM for my first contiki!! She helped me develop and absolute love for Asia thats wanting me to explore more! "},{"rating":"5.0","review":"Lisa was an excellent tour manager. She knew her subject and her audience very well. My girlfriend and I travelled through Vietnam on Lisa's tour. She catered brilliantly for the \"Foodies\", \"Culture Vultures\" and \"Party Animals\" in the group. \nShe was a great help when travelers became sick (as inevitably happens in Vietnam).\nShe made sure everything ran smoothly and tha \"Asia time\" was never a problem.\nShe was enthusiastic and positive at all times, despite getting about 4 hours sleep a night because she was taking care everyone.\nThe fact that every girl (and some men!) in the group decided to copy her hairstyle shows just how much everyone admired her!"}]}]