[{"name":"Sapa Adventure 3 days 2 nights","reviews":[{"rating":"5.0","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.5","review":"Do it! Great tour, very authentic."}]},{"name":"Vietnam Wellness - Naman Retreat (Halong Bay/ Da Nang)","reviews":[{"rating":"5.0","review":"Awesome time! Best guide ever!\nLoved the tour, loved the people and loved the food, Can’t wait to come back"},{"rating":"4.5","review":"I found the tour to be of great interest and educational. The transport and accommodation was exceptional along with the meals. I would have no hesitation in recommending this company to my friends and relatives. To give a score out of 10 iwould give an 11"},{"rating":"5.0","review":"I don't know about others tour operators but this tour operator surely won my heart.\ngreat support, great service and of course suits your budget.\ni would suggest you must visit places- hanoi,halong,da nang,hoi an,sapa and ho chi minh.\nthis tour operator was no where compromising on services, prompt telephonic support and whatsapp support and all the hotels n vehicles were good and cruise was awesome i chose 4 star cruise.\ni would highly recommend this operator"}]},{"name":"Conquer Fansipan peak during 4 days 4 nights in Sapa","reviews":[{"rating":"4.5","review":"Our tour was well organized went off without a hitch . All of our tour guides did a great job. Learned a lot they shared a lot about each city we visited."},{"rating":"5.0","review":"Cathy at Nhat Long Travel did a terrific job working with me to create a fantastic last-minute trip and continued to be of assistance when I was on the ground. The guides and itinerary she organized were both excellent."}]},{"name":"Vietnam Uncovered","reviews":[{"rating":"5.0","review":"Definitely go on this tour because the food is to die for. The buildings and architecture are beautiful. The cruise along Halong Bay was amazing (a night to party). It was also a very relaxing holiday. Take lots of photos because you will have great memories."},{"rating":"5.0","review":"I highly recommend booking through this company. It was worth every penny. I was skeptical about traveling with a tour group but the itinerary, accommodations, and our tour guide, Huy, were all top notch and made our trip so much less stressful and enjoyable. Huy was both hilarious and professional. He truly seemed to care about each individual's experience and needs. I really sensed that he is passionate about showing everyone how to enjoy and appreciate his country.  I also found that I really enjoyed interacting with the other tour members, but taking some alone time was not an issue at all."},{"rating":"1.0","review":"Beware ageist company. Wanted to take my 2 x adult kids, 22 & 25 for the trip of a lifetime but they refused to let me book as I was \"too old\" even though I am 57 and look and behave a lot younger."},{"rating":"4.5","review":"Great trip, our tour guide T was fantastic and gave us great insight into the areas we were visiting so we could plan our freetime well. included meals and recommended restaurants were all amazing too!"}]},{"name":"Vietnam Tour of Highlights To Halong Bay, Hue, Hoi An, Saigon and Mekong Delta","reviews":[{"rating":"5.0","review":"My family of 6 were in HCM,Hanoi,Halong Bay .. The service provided by Minh from DNQ Travel was truly excellent. Right from the very first e mail planning my itinerary to my departure flt out of HCM. He took care of everything, including all details, and always went the extra mile to ensure everything was fine, such as calling whenever i reached a new location. He was extremely patient with all my requests and enquiries through out the trip."},{"rating":"5.0","review":"My husband and I did a tour with DNQ Travel to Vietnam - we thought our tour itinerary was great / we were able to change things and do things that weren’t part of the original tour. Mr Dong from DNQ Trave was very good and efficient and we could not fault her attention to detail - we would not hesitate to recommend"},{"rating":"5.0","review":"Our 12 day tour started at Hanoi after a long flight. DNQ Travel was our professional Travel Agent, all things were arranged well which were precise and on time throughout our trip (Hanoi, Ha Long Bay, Hue, Hoi An, Bana Hills, Danang and Saigon/Ho Chi Min City) and Mr. Dong was always available for advice and support via WhatsApp or direct phone call. The Tour Guides she arranged for our excursions were well conversed in English and professional with a fantastic wealth of information on the history of Vietnam. Vietnam is an amazing Country with beautiful, caring people, great food, rich History. We can highly recommend DNQ as the best Tour Operators ever, especially the amazing attention we received from Dong that made us feel so special. We found that the whole trip was really good value and certainly would recommend Dong and his company to anyone looking for a holiday in Vietnam and if taking relatively young kids, it makes so much sense to have everything arranged ahead of one's arrival. \nIf we return to South East Asia such as Laos, Myanmar and Cambodia or Vietnam again, we will definitely contact them again."}]},{"name":"Picture Perfect Vietnam in 20 Days","reviews":[{"rating":"4.5","review":"My husband and I arranged for a 9 day travel tour in Viet Nam traveling from Hanoi, through Hanoi, Halong Bay, Hoi An and Ho Chi Minh City. In every city, we got service with a smile. Our drivers were experienced, cars clean and pleasant to ride in; our guides knowledgeable and eager to attend to any requests."}]},{"name":"Vietnam Legend Family Holiday 16 Days Trip (from Hanoi to HCMC)","reviews":[{"rating":"5.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"3-Day Kayaking and Exploring Caves - Cruise on Bai Tu Long & Ha Long Bay","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.5","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"3-day Hiking to Cat Ba from Hanoi","reviews":[{"rating":"4.5","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.0","review":"Do it! Great tour, very authentic."}]}]