[{"name":"Hanoi, Halong and Sapa tour in 7 Days","reviews":[{"rating":"5.0","review":"Toni is trustworthy and incredibly responsive. He was very effective in organizing our North Vietnam tour.\nWhen the weather turned out to cancel three days in Halong Bay, he was able to immediately react with our proposal of shortening the trip to fly earlier to our next destination, refunding the difference.\nOne suggestion: increasing the amount of details helps the customers to navigate among the dozens of anonymous guides more or less informed you will go to be handled through your trip"},{"rating":"5.0","review":"We have done a 7 day tour in Hanoi, Sapa and Halong with our guide, Tuan, and it was simply excellent. Tuan is the best guide we had in Vietnam, extremely friendly, knowledgeable, very well prepared, helpful and knowledgable. Not only he provided us with extensive information about our places to visit, with a lot of statistics, figures and facts, but he is well organized and was always smiling, making our trip unforgettable. He is a very special guide, full of charm. We recommend Tuan warmly to any tourist interested in a smooth and cultural visit of Hanoi and the surroundings, as well as other places in Vietnam. Thank you very much, Tuan"}]},{"name":"12 Days in Vietnam From Ho Chi Minh city Up to Hoi An and Hanoi","reviews":[{"rating":"5.0","review":"Excellent tour and itinerary  well organised every tour was imformative and punctual,the hotels were teally good ,clean and  the service was excellent . The tour was overall lots of fun and safe which was reassuring for all involved. Thanks for 12 fun days\nOc from Australia"},{"rating":"4.0","review":"Everyone was always on time and very courteous picking us up....the sites were good that we visited...we needed more info on the train experience...we thought there was a dining car, there wasn't...i would like more ideas of thiings to do on the off tour days....such as going to Que and Saba..Michael was good to talk to and work with...the hotels were good...good breakfasts...i would recommend this trip to other friends."},{"rating":"5.0","review":"The moment we made payment our tour was arranged and itinerary sent. Everything was done so seamlessly. I like that this tour was pretty much a Vietnam holiday arranged for us. We had all private transfers and our own accomodation and only met new people on the day tours that where arranged and included in our itinerary.  Manh was easy to contact on WhatsApp with any questions I may have had. He also took the time to contact us half way throughout the tour to check everything was ok. Highly recommend a trip to Vietnam with Vietnam Real Tours."},{"rating":"4.5","review":"An excellent trip with all things catered for and very efficiently organised with all pick ups for tours like clock work . Thanks Mr.Manh."},{"rating":"4.5","review":"We travelled to Vietnam for the first time in November 2019 and used Vietnam real tours to arrange our internal tours and travel.\nFrom the outset Mahn was amazing to deal with. Highly responsive and communicative. Extremely well planned. And a service provided that was second to none where even the last minute changes we made in our schedule were catered to immediately without question as Mahn was always available to help by phone and email.Mahn even went out of his way to come and meet with us in person at our hotel in Hanoi and we appreciated how he negotiated with the hotel to give us a free room upgrade in addition to bringing us a gift.\nMeeting Mahn was an absolute pleasure as he is so warm and welcoming and nothing is a problem.\nThank you Mahn for making our first time in Vietnam so stress free and relaxing. For all of your expert organising and coordinating of tours, transfers and hotels. And for your friendly, professional and first in class service provision. We couldn’t recommend your tour services more highly to other visitors to Vietnam. \nSimone McGill and Steven Richards\nCam on\nANZ"},{"rating":"5.0","review":"Beautiful people all guides very knowledgeable and friendly."},{"rating":"5.0","review":"Amazing tour, perfect itinerary for a short time in Vietnam, you get to do all the musts . Manh, from the tour agency, was really helpful. He was always looking out for you and making sure everything went well. I had a fantastic Vietnamese experience. From my personal point of view, Hoi An was simply amazing! Ba Na Hills is so crowded....you can skip it. You can choose this tour and relax... everything will be fine and for sure you will enjoy it!"}]},{"name":"Ho Chi Minh, Hanoi and surrounding in 7 days","reviews":[{"rating":"5.0","review":"We have just returned from a trip to Vietnam organized by Bravo Indochina Tours - It worked like clockwork. from the time I booked the trip to the time we got on the plane on the way home. We had four guides whilst we were away and every one of them were exceptional - helpful, knowledgeable and caring I really recommend Bravo Indochina Tours and would definitely use them again"}]},{"name":"Best of Vietnam - From Top to Tail 14 Days","reviews":[{"rating":"5.0","review":"Great tour, enjoyed our trip very much. Guide and driver are very much recommended!!"},{"rating":"4.5","review":"Excellent service from Tourradar, efficient, person centred and kept me well informed. We were picked up on time from Hanoi airport by our guide, Tang Kim Dung she took us to the hotel and made sure that everything was in order before she left. Next day she was there on time. Very knowledgable and efficient, she gave good explanation of everything. I must mention the driver, ver polite, he kept an immaculate car and always had fresh water for us, a lovely touch. We were picked up on time for our trip to Halong Bay, all went well but I am not sure what we received for our additional $25 per person for the galla evening, not even a glass of champers at midnight, some cheap stuff that wasn't drinkable. Please don't get me wrong the crew were great but I sensed that quite rightly they were always great. Guide then picked us up for our trip to Sapa, again she ensured we were safely on board and settled before she left. Sapa - well this was a bit of a disappointment. Our itinerary stated a trek, what we got was a 2 hour walk on a proper road, yes there were interesting things to see, but there were lots of people on the same road. We then stopped for lunch for a hour, we had anticipated further walking in the afternoon but our guide dropped us off at 12.50. The rest of the day was free but there is nothing to do in Sapa if your not out trekking, very disappointing. The guide was informative but also annoying as he was often on his mobile phone. Next morning the guide suggested leaving at 7 am, from our experience the day before I said 7.30. In reality we could have left at 9. Lovely 2 hour drive, we stopped at the market, which is like any other market in Asia , so no need to have 2 hrs there. We couldn't do the river trip as the river was too dry due to the dam restricting the flow of water. So we were back in our destination by 12 MD with 9 hours to fill in, in a City that has nothing for tourists. Here our guide was very helpful and got us a room in a hotel but it was a long wait, so we did two ten hour trips on a train for 2 hours walking, a three hour drive the next day. ( which was enjoyable) and 45 mins at a market. Please sort this out for others. I am sure that others have said this but Sapa is now very commercialised and you may want to suggest other things for the itenary. I hope you find this useful, it is intended to be. Best wishes Julie"}]},{"name":"Vietnam Family Holiday","reviews":[{"rating":"4.5","review":"Great variety of things to see and do, we felt well looked after by our guide."},{"rating":"4.3","review":"Our tour guide, Hoc, was terrific, and the hotels were comfortable and pleasant. Compared to other Intrepid trips we've taken, the itinerary for this tour was somewhat lacking in adventure and connectivity to nature. But, on the whole, it was an enjoyable tour."},{"rating":"4.2","review":"Fabulous tour that showed us an insight into Vietnamese life and history and a great guide. Thanh"},{"rating":"4.5","review":"Very well organised with a great guide."},{"rating":"4.8","review":"A great family holiday with plenty of new experiences."},{"rating":"4.5","review":"I absoloutely loved this trip! It was extremely educational but fun at the same time. We had a wonderful tour guide who explained everything and helped us a lot to love the experience even more. I definitely want to do another tour very soon!!!"},{"rating":"5.0","review":"Sonnie the EXCELLENT guide. Small groups. Compatible families. Stress free. Great accommodation. Affordable. Punctual. Well organised. Good route trip. attention to detail"},{"rating":"4.3","review":"organisation, places visited and services received"},{"rating":"4.5","review":"We really appreciated having all the planning and logistics arranged ahead of time, plus having a guide with local language and knowledge/commentary, who has lived through much of the modern history added a depth to our trip that was amazing."},{"rating":"5.0","review":"Our guide, Trung, made this trip a memory of a lifetime. He was knowledgeable, attentive and pleasant. He consistently went the extra mile to ensure we maximized our experiences. The itinerary provided a a good introduction into the history of Vietnam and an opportunity to be emerged in its culture. Great experience."},{"rating":"4.5","review":"Awesome tour - especially with kids. Amazing country, the homestay and overnight on Halong Bay being the highlight. Cong did an awesome job of coordinating a range of kids and adults and getting htem places on time."},{"rating":"5.0","review":"Fantastic trip. Our guide, Jay, was great, nothing was too much trouble, his knowledge was perfect and he also made the trip so much fun. The whole family loved it as we learnt so much about Vietnam, made new friends and experienced the lovely food, drink and the Vietnamese hospitality."},{"rating":"4.0","review":"Unfortunately there was a big component on our Family - trip missing and that was other families.  Ultimately, Intrepid did not find another family to go during our tour period, and it was too late for me to change dates.  As a single parent with a 10 year old while we had an amazing guide, without companionship of other families for a variety of reasons the trip was more work for me than was promised and a bit lonely.   Additionally, there were several side trips we just couldn't take as they were usually booked for groups only.  Our guide really saw this was a problem and worked hard to find compromises for these activities and I really appreciated that.  My suggestion is if it is important for you to have other families along in the tour just don't book too early. Wait until there are enough during the time period you wish to go so this won't be an issue.  "},{"rating":"4.5","review":"Where do I start?  From the moment we met our tour guide and the rest of our group on New Years Eve we had the most amazing time. We had 8 adults and 8 children on our tour and the ages of the kids ranged from 8 to 15, and a great mix of interesting people. \nOur tour guide Thanh Vo was amazing.  Not only was he a wealth of information but very funny, interesting and great with the kids.  He took us to some amazing places to eat and always made the journey by bus although sometimes long seem short.  We even enjoyed the Karaoke on the bus very much.  The tour was well organized with a mix of tours and some free time as well.  The amount of time spent at each destination was well thought of and perfect for this tour with a mix of things for both the adults and children, especially the water puppet show, markets, optional cooking class, bike rides, cyclos, tuk tuk, boat rides and the water theme park on the last day. It was so sad when it came to an end and we all had to say goodbye but we have make some lasting friendships from this trip.  I have no hesitation in recommending this trip to anyone planning on going to Vietnam.  We went in January so the weather was absolutely perfect and alas no rain. "},{"rating":"5.0","review":"Wow, what a great way for a family to see Vietnam in a safe and informed way. I cannot thank our tour leader (Khiem) enough for his assistance and insight into his wonderful country."},{"rating":"5.0","review":"Excellent trip - really well organised and enjoyable"},{"rating":"5.0","review":"I had a great time in Vietnam. Our group leader Viet was excellent. He helped us in any way possible and was a lot of fun. The whole trip was a great enjoyment thanks to our group leader."},{"rating":"5.0","review":"I had a awesome holiday and it was a good experience to travel intrepid because you move around alot a get to see all the different parts of vietnam."},{"rating":"5.0","review":"Really great trip, interesting and fun, and the group/leader dynamic of it makes for a far more enjoyable trip than just doing one independently. Vietnam is a beautiful, fascinating country - we\\'re definitely glad we went."},{"rating":"5.0","review":"This was a very enjoyable trip.We travelled the length of the country and had a good mix of organised activities and free time. Our leader was great fun and very helpful."},{"rating":"5.0","review":"Vietnam was fantastic, moreso as a result of Intrepid\\'s thoughtful tour itinerary which offered good variety and experienced guides."},{"rating":"5.0","review":"Trip was excellent, had a lot of fun and experienced Vietnam in the easiest and most enjoyable way. Viet was always happy, engaging informative and ready to help."},{"rating":"5.0","review":"I said on the trip that \\\"I have not stopped smiling.\\\"\"The Vietnamese trip left me with many fond memories.\""},{"rating":"5.0","review":"Well worth the money, invaluable to have a local travelling with you."},{"rating":"5.0","review":"I had a great time It was AWESOME and I LOVED the motorbike trip"},{"rating":"5.0","review":"Wonderful adventure, outstanding and fabulous tour guide. Amazing place, enjoyed all the experiences, children and adults well catered for. Would definitely travel again wtih Intrepid."},{"rating":"5.0","review":"We had a great time in Vietnam, I loved it! We went on an elephant ride, on a motorbike tour and ate lots of different foods! I loved sleeping on a boat and jumping off the boat!"},{"rating":"5.0","review":"We had a fun holiday. My favourite part was riding an elephant, going on the cyclos and seeing the water puppets."},{"rating":"5.0","review":"Great holiday, I loved it!"},{"rating":"5.0","review":"Great and succesful trip. Well planned trip that showed our family the best of Vietnam. We enjoyed the travelling through the country and learning along the way. Good balance between holiday activities and travelling and learning."},{"rating":"5.0","review":"The trip was very well organized and a great experience. I enjoyed the water park, the motorcycle tour and the night in Halong Bay. Intrepid have given me very fond memories of my time in Vietnam."},{"rating":"5.0","review":"I would definately travel with a local guide and intrepid again. It enabled me to enjoy my holiday with less responsibilities and stress. We certainly experienced much more by travelling with a guide and group."},{"rating":"5.0","review":"I liked our time there and our guide was really nice. I enjoyed meeting other families from other citys/countries."},{"rating":"5.0","review":"We had a fabulous family adventure in Vietnam."},{"rating":"5.0","review":"I really enjoyed this experience except for the days when it was so hot I couldn\\'t bear it! I didn\\'t like shopping in the markets either."},{"rating":"5.0","review":"I loved every minute of this trip"},{"rating":"5.0","review":"The Intrepid Family adventure was a fantastic way to see Vietnam with a family. We travelled with three young children who thoroughly enjoyed themselves!"},{"rating":"4.0","review":"Wonderful trip, the kids had a ball."},{"rating":"4.0","review":"Wonderful trip - kids had a great time."},{"rating":"5.0","review":"I loved using intrepid because we have great tour leaders like Cong."}]},{"name":"Vietnam South to North Outlook 7 Days","reviews":[{"rating":"4.0","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]}]