[{"name":"Hanoi - Halong bay - Ninh Binh 5 days With Overnight on Cruise","reviews":[{"rating":"4.5","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]},{"name":"Hanoi & Sapa with Fansipan Mountain 5 days","reviews":[{"rating":"4.5","review":"This tour is outstanding and the tour operator (Daisy--Sales Director) was truly fantastic! Daisy communicated with us regularly prior to our departure; she handled our VISA applications and provided speedy answers to our many questions. This made our trip smooth. The accommodations, the meals, the itinerary and the tour guides were excellent. Daisy even took the time to meet us at our hotel on the last day and she treated us to egg coffee at a scenic spot. She was lovely! This tour operator is highly recommended by us!"}]},{"name":"Best Of Vietnam - Sapa/ Mekong Delta/ Mekong Delta","reviews":[{"rating":"4.5","review":"We had a two week holiday totally organized by Realistic Asia. Was absolutely fantastic. We saw so much of Vietnam. The guides were brilliant, the transport was fantastic. Everything went so smoothly. Drivers always on time, internal flights arranged. Tours were so much fun, interesting and well organized. Highly recommend and will definitely use again!"},{"rating":"5.0","review":"Overall tour arrangement was well done with closely update on the tour.  Special thanks to S Viet Travel team for working out the arrangement for us. We had a memorable holiday in Vietnam."},{"rating":"4.5","review":"Still be in the cloud thinking of my trip in Vietnam last September. Thank you David  for prompt  response; informative and supportive to help me had a best journey in Vietnam. Love Hoi An so much"},{"rating":"4.5","review":"Having returned home safe and sound, on behalf of our group I would like to thank you S Viet  from bottom of our heart. I was leaving to the airport for my flight back home then I that I forgot my daughter backpack at the hotel.  S Viet has understand my situation and helped to send it right away. Thank you Lynn for your professional, and sorry for woke you up with the call at 4o’clock in the morning.  The communication with you is excellent and promptly , this was very much appreciated."},{"rating":"5.0","review":"It’s a great journey overall. Every day is a new experience. Hoi An is so lovely, especially in the early morning, I’m in love with this town and our guide, Minah. I have many friends who is planning to go to Vietnam, will definitely recommend  your company  and Minah, you both great ."},{"rating":"4.5","review":"This is a great tour which gives you all the best bits of Vietnam. I tried overnight train to Sapa and it really unforgettable experiences. Accommodation was also pretty comfortable as you stay in hotels most of the time. Overall I'd highly recommend this tour for people wanting to see Vietnam"},{"rating":"5.0","review":"Thank you for providing us the most wonderful trip to Vietnam ever. Our tour guide minah is fanstatic and took care of us throughout the trip. I have to admit their food is amazing, don't stick to the hotel's meals , just go out and try all their street food because its superb!!!"},{"rating":"5.0","review":"Great Vietnam exploration with S Viet Travel , commited tour guide, comfortable coach and nice accomodation have been arranged throughout the Hanoi and Halong Bay trip and other places"}]},{"name":"Vietnam Heritage Discovery - 15 Days Tour","reviews":[{"rating":"5.0","review":"We had a great 2weeks touring Northern Vietnam at a leisurely pace."},{"rating":"5.0","review":"Excellent trip to Vietnam\n\n\n\nwell planned trip to Vietnam - helpfull and nice people "},{"rating":"4.5","review":"Vietnam - amazing holiday\n\n\n\nVery good organized tour, from north to south. We have experienced all types of public travel, from sleeping bus to domestic flight, pick ups are well arranged. Some excursions include very interesting activities, however not all guides are good (hanoi, halong bay), also some of them are not very understandable. In general we had very great time, amazing food, friendly people, Vietnam you were amazing! \n\nAnnvisible\n\nBelluno, Italy"},{"rating":"5.0","review":"Great service\n\n\n\nMy girlfriend and I have had a wonderful time in Vietnam. Legend travel group helped out a lot. Making sure everything went according to plan. The service they provided has been top class. Highly recommended."},{"rating":"4.5","review":"No Words I can use more than \"perfect\"\nEverything was organised to perfection. The drivers, the guides and hotels were all very good and very punctual. I can strongly recommend this travel agency if you should go to Vietnam. They help you everywhere they can."}]},{"name":"Classic Vietnam: Hanoi to Ho Chi Minh City","reviews":[{"rating":"4.0","review":"The Hanoi to HoChiMinh tour was very good,because of a good group of travellers and historical sites to visit,but the tour guide,Chen from Cambodia was superb,10 out of 10.Good English,clear information and good company.He added much to my trip.The efficiency of the trains,plane and ferries was as good as could be possible.Thank you."},{"rating":"3.5","review":"The group mix was awkward. The CEO did his best to make it work. Vietnam not the most interesting country I have visited."},{"rating":"4.0","review":"This was a decent tour to get an overview of the country. It was good value for the money. Hotels were nice and guide was helpful."},{"rating":"5.0","review":"T as we called him was amazing. He is very articulate and has tons of knowledge about Vietnam.  Probably the best guide i have had in my travels.  The locations of the hotels were always perfect, nearby sights and comfy 3 star hotels. Thang went out of his way to make sure everyone was happy, comfortable, and of course having the best time possible. He paid such attention ti detail.  G adventures is truly lucky to have such a caring, patient, and easy going guide. Highly recommend this tour and G adventure.  Safe, fun, and full of adventure.....Next time we get Thang abscaling..... lol.   Thank you for a trip of a life time."},{"rating":"4.5","review":"Great tour, great Guide, great group!!! Really enjoyable experience . All was so organized and smooth."},{"rating":"4.0","review":"We asked for a extra night 31/3 , we didn’t. We received a email telling that our hotel was change during our trip to Hanoi, we arrived to Boutique Hotel without accommodation. \nCabins train are for people under 30 years old not for people over 40, cabin are too small for 4 adults and when two of them are men more than 1,75 m. \nOur guide Mr Bin was the BEST! He found solutions for everyone, excellent leadership, so profesional and friendly. My husband had health problems and we received all the information and guidelines that we need. We don’t have enough words to thanks him"},{"rating":"5.0","review":"Loved Vietnam and the trip was made a real pleasure by our super special guide"},{"rating":"4.0","review":"Kim was the most fantastic guide I have ever had the pleasure to get to know on any guided tour I have ever taken. He was professional, knowledgeable, efficient, dependable and FUN!! He made our group feel like a family on a wonderful adventure!!!"},{"rating":"5.0","review":"Kim was a fantastic guide - informative and funny and very professional- mostly!  He made the trip the success it was and I would certainly do another trip with him!"},{"rating":"5.0","review":"Coco was a great guide, provided good recommendations for local restaurants, and took very good care of us.  Thank you!"},{"rating":"4.0","review":"I made the right choice to take this trip with G Adventures. The group was 15 people, around the globe. It was amazing experience. I will definitely take another trip with G Adventures!"},{"rating":"4.5","review":"This whole tour was amazing from start to finish and I’d recommend it to anyone wishing to see Vietnam. Our guide Channy made the whole experience, he was passionate about his job and making sure everyone got what they wanted out of the tour and looked after us so well. He really cares about what he does and about people and is an absolute ambassador for gadventures. Can’t recommend this trip enough."},{"rating":"5.0","review":"This is one of my best trip ever and the first time I have used G Adventures.  Organized with superior customer service. Tour Radar has done me well too.  A definite repeat customer."},{"rating":"3.5","review":"The hotel in Hanoi is bad.  There was a bit too much down time."},{"rating":"5.0","review":"We had a great time which was made even better by having an awesome tour guide!!"},{"rating":"5.0","review":"He was great, he showed us the really Asia I had the best experience with Kim and my life"},{"rating":"5.0","review":"Sochea is a great guide wish fantastic attitude! We all got along well and had heaps of fun. Would definitely recommend!"},{"rating":"5.0","review":"Sochea is a great guide with a awesome attitude and everyone got along really well. Would definitely recommend!"},{"rating":"4.5","review":"I came on my first solo trip and Ratha was our CEO. He not only made everyone and myself feel comfortable, but he was kind, generous and very knowledgeable. Our group felt like a family in the end and I couldn’t thank him enough for such a great experience. Hoping to do another tour with him sooner than later!"},{"rating":"5.0","review":"Jack made the tour great."},{"rating":"4.5","review":"Excellent tour to see many different parts of Vietnam. Itinerary is well designed and we saw a lot!"},{"rating":"4.5","review":"This trip was excellent.  I would recommend it to any first-time or experienced traveler who is curious about Vietnam.  I thought it was a great mix of fast-paced travel, relaxed free time, natural beauty, history, cuisine, culture, and active outdoor optional activities.  My tour leader wasn't Vietnamese but had lived there for a long time, answered any questions we had, introduced us to locals and places to go, etc.  We had local Vietnamese guides in the various cities.  Hotels were all nice and in convenient locations.  The overnight boat was not luxury but was great fun.  And if anyone is apprehensive about the overnight train, the one we took was pretty clean, quiet, and comfortable (but there isn't a ton of storage with 4 people per cabin, so pack light for this trip).  I loved the people in my tour group also... amazing how a small group of strangers who are all so different can become like family in only 10 days.  Thanks for a great holiday, G Adventures!"},{"rating":"4.0","review":"I have just been on a fantastic, educating, cultural and enjoyable experience from start to finish on a classic Vietnam tour. Our tour guide was Dat who is a very true part of the reason why we had such a great time. I would recommend this tour to everyone for fun, value, accomodation, activities, food choice and the people of Vietnam are so nice so big shout out to them too! "},{"rating":"4.5","review":"Truly enjoyed the tour!  Phong, our guide was super. The itinerary was well organized and flexible, with many optional activities. Would definitely recommend it to everyone!  "},{"rating":"5.0","review":"Excellent trip. Excellent guide(s).  As is normal with this tour, we had an overall guide, Zam, and individual local guides who took us round specific sites.  We even had a guide who had been fighting for the south vietnamese to take us round the Cu Chi tunnels!  What more could you ask for?  This is a very well paced trip with plenty of down time as well as many opportunities to explore Vietnamese culture and history.  The hotels were really very good quality, and some had their own pools.  This trip has something for everyone as although not specifically part of the tour, you could get to the beach at Hoi An and we did a three hour impromptu beach stop on our way too.  We also went on to do the Cambodia trip which was also good.  I would not hesitate to recommend G adventures.  Their ethical brief also allows tourists to contribute in a very positive way to the local economy as well as opening your eyes to local circumstances that you might be unaware of with another tour."}]},{"name":"Vietnam Super Saver Package - 13 Days","reviews":[{"rating":"5.0","review":"Most amazing experience of my life! This trip was so well planned and taken care of, all i had to do was just enjoy! The guides were unbelievably knowledgeable and spoke good English, they were all so much fun and such a joy! I loved this trip but I really, really loved the people who took care of me!"},{"rating":"5.0","review":"perfect organisation\n\n\n\nTravel group: perfect organisation. \nVoyage: big cities are to avoid: crazy and dangerous traffic, pollution, not so much to see (except War museum in Ho Chi Minh City!).\nSapa, Halong bay, Trang An are great but extremely touristic.\nHoi An is perfect (only city with traffic free area)."},{"rating":"4.5","review":"My best trip ever\n\n\n\nFirst time we used Tourradar & Legend Travel Group and everything was perfect, we’re more than satisfied so of course we already told friends about our lovely holiday in Vietnam, the beautyful country with so many intreresting things to enjoy.\nCmy615\n\nStockholm, Sweden"},{"rating":"5.0","review":"Everything worked smoothly on our round trip in Vietnam\n\n\n\nI must admit that I was little worried if that all hotel bookings, transfers and excursions would work out, but they did! Everything worked smoothly on our round trip in Vietnam. There was always a guy with a board with my name on it right on time! We had a wonderful time in Vietnam and can recommend Legend Travel as a travel agency."},{"rating":"4.5","review":"Danny - We are at the airport, getting ready to end our trip. What a WONDERFUL trip it was!  \n\nThank you SO much for all you did to make this such an enjoyable and smooth trip. Your professionalism and quick attention to our every question was outstanding. We appreciate everything you did. \n\nBlessings and good wishes to you.\nDiane and Tom Erickson"}]},{"name":"Sapa 3 Days 2 Nights Trekking Tour From Hanoi (1 Night In Ta Van Village, 1 Night In Hotel)","reviews":[{"rating":"4.0","review":"It was a good trip with a really helpful guide."},{"rating":"5.0","review":"-Very well organised.\n-I stayed at : The View Hotel , excellent room and staff.\n-homestay accomodation was great as well.\n-all tour guides in the different segments of the journey where great.\ni’n very happy about my choice."},{"rating":"4.0","review":"The travelling to and from Sapa was great. The sleeping bus was very comfortable.\n\nThe communication about the trip in sapa could have been better. As it was sometimes not clear what would be next. Also the first day in CatCat village was a bit disappointing as it was really focused on tourist. \nThe hikes on the second and third day were amazing as were the hotel and home stay !\nThe tour guide was great unfortunately we forgot her name. She was very enthusiastic en was great with handling our diverse group."},{"rating":"5.0","review":"Great tour !!! Everything was well organised, hotel was beautiful and clean, nature in Sapa is incredible and the tour guide was really nice 100% recommended."},{"rating":"5.0","review":"Great 3days-2nights sapa tour.\nWe booked a 3days 2nights homestay trek with Vietnam Travel Top through our hotel at Hanoi. From the minute we were picked up from our hotel in Hanoi we have received nothing but the best service.\nThe bus was filled with 42 sleeper stations where you can either sit up or recline. It was very comfortable. The view out the window was fantastic, the ride was smooth, and the hours flew by.\nOur guide was called A Pang, He spoke English very well and his knowledge was thorough.\nOur trek was not too strenuous but also not for the unfit. The scenery was out of this world, our homestay hosts were very hospitable and the provided lunch at the hotel was plentiful and delicious. Vietnam Top organised a room with a mountain view, it was great. I would highly recommend this group to anyone who feels like roughing it just a little bit and experiencing something just magical."},{"rating":"5.0","review":"Highly recommended!!!\nMy family and I did a 3 day/2 night trip from Hanoi and are so glad we did.\nThe 5-6 hour bus ride each way was well worth sleeping seat are good and comfortable.\nOur tour guide was A Sao and she was amazing! Definitely ask for her. She's incredibly knowledgeable, speaks perfect English.\nOur first night was a homestay in a little village deep in the hills of sapa.\nCouldn't have asked for anything better. In short, amazing tour and A Sao is an amazing guide."},{"rating":"5.0","review":"As part of our tours in Vietnam, we  joined tour to Sapa 3 days 2 nights organized by Vietnam Travel Top.\nOur group has 12 people from all over the world: Singapore, India,  England, France, Hongkong, Australia, America...and we really had good time together.\nWe stayed one night in hotel and one night homestay which was really amazing. Plenty food, friendly local people.\nVery nice host. We sat together, talked until midnight, shared many stories and jokes.\nThank Vietnam Travel Top so much."},{"rating":"5.0","review":"The bus trip there was very comfortable, the food was lovely throughout the trip and the scenery on the walk was amazing.\n Our local guide A Sao was very friendly and informative. The homestay was a good way to see how the locals live.\nThe local people are friendly and kind and food is amazing.\nIn summary, if you come to Vietnam, this is a 'must do' tour.\nWe highly recommend and would come back here."},{"rating":"5.0","review":"It is the most comfortable long distance travel experience I have ever had and I am surprised more of these do not already exist.\nWe were picked up from our hotel by a smaller bus and transferred to the sleeper and after 6 hours of driving we were dropped off very near our hotel in Sapa.\nOur guide was friendly, kind, full of great information, and always had a smile on her face! Our group trekked for 3 days with her and each day was a different experience.\n I highly recommend this Tours and hope that you have the chance to learn about Sapa with Vietnam Travel Top."},{"rating":"5.0","review":"I booked a trekking tour with this company Sapa tour by bus.\nThe bus is comfortable and much more enjoyable than an overnight train. Our tour guide was very helpful with info and facts. The trek was nice and fantastic.\nI did one night at a home stay and another in a hotel  both were great. My tour was very authentic and few visitors on my trail.\nThe guide called \"A Sao\" she was so lovely and spoke englisj very well and show me a lot amazing things of her ethnic, I have never seen it.\nThank you so much!"},{"rating":"5.0","review":"We had a Sapa trekking tour with Vietnam Travel Top 3 days/2 nights and we really had good time together. We stayed one night in hotel and one night homestay.\nHomestay was in Ta Van village, the host is friendly and prepared sooooo much food for dinner as well as breakfast.\nwe spent 2 days with a young tour guide walking through hills and 2 villages.  Scenery, cant stop speaking out loud \" wow\". Trekking road is nice with local people help us in difficulty.\nWould go back again."},{"rating":"2.0","review":"I was in 2N & 3D Sapa tour led by a local company Vietnamtraveltop.com. \nThere was one person as a \"tour agent\" who contacted me via WhatsApp at the beginning of the trip but between his limited English and him being in Thailand I had very little help for the trip. When I arrived to Sapa  on a bus there was no one for me to follow to the hotel. My agent and the company weren't responding when I texted and called. Everyone from my bus was taken to their hotels but me. About 20 minutes later finally someone showed up and put me back of his scooter and took me to my hotel. \nThe first day of half day walking tour was guided by a lovely local gal for a local couple and myself. Unfortunately I didn't speak Vietnamese therefore my interaction with them was quite unenjoyable. I arrived back to the hotel and hoping to find other fellow travelers but none was seen. I had a late lunch and dinner in the massive dining room without a single soul. \nContrary to the intinery there wasn't any \"group evening activity and social\".\nI was a solo traveler and it was a \n quite creepy staying. \nThe following day I joined a pretty nice group of people to trek further Sapa villages which I enjoyed. However on our way back in a van our driver became angry at another driver from the oncoming traffic he broke out a huge machedi underneath his seat and ran after the other driver. Several of us were getting ready to leave the scene and walk back to hotel but the other driver gave in the conflict. When we returned to our hotel and voiced the incident the trip agent blew us off saying \"it was the other guy's fault\".\n\nThe trip was orchestrated poorly, communication wasn't  there and professionalism didn't exist."},{"rating":"3.0","review":"Sales manager wasn't kind and no respect to costumer."},{"rating":"5.0","review":"Great adventures. Best tour ever. From the start to the end, we have been taken care well. Great company with the tour guides.\nThe whole group were very friendly. For the hiking, ask for Su Linh to show you around. Altogether a very enjoyable couple of days. Thank you SuLinh."},{"rating":"5.0","review":"Sapa is the highlight of our  trip in Vietnam. The homestay was very good, with hot showers, tasty dinner (we learnt how to roll spring rolls), we even had a double room for us. Our group has 10 people and we had a great night talking.\nThe walks were relatively easy, we could even have done a bit more on the second day. It was quite a short time to stay in Sapa but great to have a taste of it and totally worth it! I would definitely recommend Vietnam Travel Top for these kinds of tour!"},{"rating":"5.0","review":"Excellent tour service in Vietnam. Wonderful! We joined this tour by bus to sapa in this December with one night at Amazing Sapa hotel. Our 3day/2night trip with Vietnam Travel Top turned out to be our smoothest and most memorable experience. We got a room with mountain view. Meals were adequate and tasty. We felt that our positive experience was especially due to the staff who were genuinely attentive to our needs.\nI will definitely be recommending this company to our friends."},{"rating":"5.0","review":"Highly Recommended\nWe had the delightful experience of booking my Vietnam day tours through Vietnam Travel Top.\nOur tour organiser could not have been more helpful, very easy to deal with and answered all our queries prior to our arrival.\nWe were so impressed by his professionalism and he made sure every detail was perfect for what we wanted.\nI was able to telephone them directly and Email them with any questions or problems that needed attention.\nOur tours and guides were a delight, with everything going according to plan.\nWill definitely be booking with Vietnam Travel Top on our next trip to Vietnam."}]},{"name":"Vietnam Romantic Honeymoon and Phu Quoc Island Extension - 14 Days Trip","reviews":[{"rating":"4.5","review":"We took the Vietnam Romantic Honeymoon Tour with Legend travel group and enjoyed our trip very much. It was easy to communicate with the office staff before the trip and Mr. Danny was very helpful (and responsive) when we had some issues once we were on the tour itself: when a storm canceled our Ha Long Bay trip, Mr. Danny extended our stay in Hanoi and set up alternate tours for us as well as keeping us updated when one of our guides in another city was running late.\n\nIn Hanoi and HCMC the daily excursions were with larger groups rather than a private tours like Hue, Hoi An, and Phu Quoc. Legend Travel finds local providers for the tours (and airport pickups) and most of the guides have a deep knowledge of their tour sites and had a decent to excellent ability to communicate in English with us. Tours often included lunch but tended to be at slightly whitewashed tourist style. I may have been a little picky/critical since I grew up with Vietnamese food.\n\nThe hotels we were booked at were mostly good to quite excellent and in walking distance of local attractions. We were in different hotels than listed for Hanoi (decent hotel) and HCMC (poor experience) so keep in mind that the tier of room may differ from the hotel's descriptions. The breakfast included on the schedule was the hotel breakfast buffet.\n\nI imagine that we would have been able to book and build our own tour with some savings but that would require a lot more time and legwork so we were very happy with what was included in our tour package. "},{"rating":"4.5","review":"My wife and I have just returned from a visit to Vietnam and We would like to thank Indochina Legend for organising an excellent trip for us from beginning to end we were always picked up on time the vehicles were very good there staff and guides were very informative and helpful especially for local information WE would Like to thank Mr Danny for organising such an excellent trip for us we could not have done it without them\n\nVisited September 2015"},{"rating":"4.0","review":"Online I arranged a 9 days tour starting from Saigon - Da Nang - Hoi An - Hanoi - Halong Bay - Hanoi.\nI'm very thankful and glad to Phuong who answered all my questions through e-mails and made me a fantastic trip me my friend and I. A unique selection with unique guides almost in all areas except one. Immediate contact and punctual in time. Another thanks for Danni a hotline person who drop me to the airport as well. All guides Hue, Vinh, Thuong and others made our trip a fruitful and amazing.\nDefinitely I recommend this agency for all Vietnam visitors.\nThank you Indichina Legend Travel."},{"rating":"4.5","review":"Excellent services provided during our trip in Hanoi in Dec 2015, we ready enjoy our trip for the 9 days!!\nThank for the great services\n\nVisited December 2015"}]},{"name":"12 Days Ultimate Vietnam From Hanoi To Central and South","reviews":[{"rating":"5.0","review":"Booked this tour as a Christmas getaway with my sister. Travelled to Vietnam with not much knowledge about the country & we loved every bit of it. Met interesting people along the way, learnt so much about the history, food, culture & the people. Our tour was super organised, thank you Vietnam Real tours for the amazing time. Will deffo recommend you to people & visit Vietnam again!"},{"rating":"5.0","review":"Well planned and executed. All the pickup and drop off all well planned"},{"rating":"5.0","review":"My tour was arranged through Mahn the tour operator from Vietnam real tour, I didn't do the complete tour but the few days I did with though him were excellent.\nHe has a good understanding of what it is to be a good tour operator, he met me in person to explain the itinerary and to chose the things I wanted to do .\nIf you are looking for hustle free tour, then Vietnam real tour is your biggest adventure and Mahn will be your ultimate tour guide to assist and support you and you will have value for your money."}]}]