[{"name":"Vietnam Superior Tour Package 18Days/17Nights","reviews":[{"rating":"5.0","review":"This trip went beyond our expectations!We were collected and delivered promptly politely and safely throughout the 16 days\"Our local guides were all very different with a different skill set at each location which made for an interesting and never boring tour.We joined a group only in Hanoi one day a different group for 10 cabins on the boat at Halong Bay and a different group of 10 people in HCMC for the Mekong Delta tip so we never felt \"stuck \"or \"trapped\nWhen we decided 4 days in Nga Trang may be too long as we live on the beach at home your company organised a private tour to Dalat in the mountains.Likewise again at short notice we went on a private tour from Hanoi to Bac Ha and then Sappa.All sso very interesting and all so easy!!!"},{"rating":"5.0","review":"Thank you so much for your help on our trip. We had a lovely time. We loved Hanoi, our guides were friendly, funny and well informed. We liked the lunch restaurant in Hanoi and they sent us away with a huge amount of food for our son who slept through lunch!  The only thing we wished we would have made time for was exploring/ shopping in the Old Quarter.  The children lived the water puppets and we all enjoyed the cyclo ride. The stay at the Sofutel was perfect- comfortable and family friendly.\n\nThe Ha Long bay cruise was amazing. The staff, service, and food in the boat were exceptional. The staff on the bait went above and beyond for our children and we appreciated their help and friendliness.\n\nOur time in Saigon was nice as well, TinTin was a fantastic guide with a great sense of humour. We liked the day on the Mekong. We felt that the lunch restaurant was a little run down, the table clothes were dirty and the surrounding garden was junky- but the food was enjoyable. The hotel was ok- a little outdated and not to our standard of 5 star/ but we are greatly appreciative of your efforts to make our family comfortable and happy.\n\nOur time at Angkor was perfect and our guide, Lei was kind enough to bring us for lunch straight away as the visa process was very long. Le Zmerufuem was s lovely choice and our stay was very comfortable- I would recommend other travellers to stay there.\n\nThank you again!\n"},{"rating":"4.5","review":"The tour we booked was absolutely excellent. The hotels, the guides, the restaurants & the tours were fantastic. Without question if we know of anyone going to Southeast Asia we will strongly recommend your Company.\n"}]},{"name":"Sapa 3 Days 2 Nights Trekking Tour From Hanoi (2 Nights in Hotel)","reviews":[{"rating":"5.0","review":"We really enjoyed the trekking in Sa Pa! Such a great experience. The town is quite nice and seeing the traditional people and learning about their way of life was interesting. The only thing I could suggest for the tour to be slightly better would be to include another activity instead of having so much free time as there is not much to do in the town. Thank you Vietnam Travel Top!"},{"rating":"5.0","review":"Amazing Sapa tour!\nwe had a 3 day/2 night trip from Hanoi and are so happy we did.\nOur guide for the trekking, Su Linh, was delightful. Time was just a little bit short for us for more photos but we really enjoyed it. The food was great, the people were super friendly and we hung out all night before going to sleep in a nice loft.\nWe will definitely come back here again."},{"rating":"3.5","review":"Fabulous scenery. Good food. Hotel good standard with very helpful staff. Good coordination on the ground. \nMore suited to independent travelers, this tour isn’t an intact group, you will meet up with people on other tours / schedules which has pluses and minuses. You will have quite a lot of free time on your own (massages, shopping, exploring the town) \n\nSome negatives: \nWe lost our guide in Cat Cat Village and had to make our own way back to Sapa. That meant I had to get on the back of a motorcycle, which I had no intention of doing. \n\nDuring our walk to the villages on day 2, some of the local Hmong ladies had walked to Sapa that morning and walked with us back to their village. While I did appreciate the help on some of the difficult parts of the walk and to avoid slipping, I did feel obligated to buy goods from 2 of them when we arrived at their village. A 3rd lady began pressing for sales too which really made the whole experience feel like a shakedown. I had no problem giving them money as a thank you but this felt forced and excessive. \n\nI did ask to be brought back early, to bus that brought us back to Sapa, to get a seat near front. It ended up that the bus was waiting for me approx 20mins late by the time I was dropped off."},{"rating":"5.0","review":"Our Sapa tour was fantastic, it was a great mix of culture food and activities. The views in Sapa are fantastic and the Hmong people are lovely. Leon Dao (Dao Huu Luan) was very responsive to my calls and emails, and i appreciated his excellent customer service. I would highly recommend this tour as a great adventure to Sapa Hills."},{"rating":"3.0","review":"I had a very touch and go experience with this tour. I arrived off the bus not knowing where I was supposed to go and basically having to orchestrate the whole 3 days myself. It did not feel as if I was able to relax a great deal. The hotel was half-decent and the restaurant lacked something to be desired (it was dirty and some of the food was cold when it should have been hot). Leon, however, was somewhat helpful and met my requests after I gave reasons why I was making them. I was not originally going to stay in a home stay according to Leon, but he made it happen for me and it was one of the best experiences I’ve had while in Vietnam. That being said, considering the price, I would not buy a package next time and would simply have organized everything myself knowing what I do now."},{"rating":"5.0","review":"Vietnam Travel Top ensured our recent trip to Vietnam ran smoothly. The entire trip was planned through Ms. Kathy and was spot on perfect. From prompt email responses to outstanding customer care, perfectly coordinated transfers and day trips. Completely professional and friendly, it was the most perfect get away. Thank you for making this a memorable trip."},{"rating":"5.0","review":"Vietnam Travel Top, Mr John, , organised some very interesting tours for us when we recently visited Vietnam. He is a wonderful tour organiser and came up with some great ideas for places to see and things to do. He was very patient with our requests and questions.  I'll say he did a wonderful job in settling the Vietnam tour for us. He is an asset to his company."},{"rating":"5.0","review":"we joined tour to Sapa 3 days 2 nights organized by Vietnam Travel Top, which was really amazing. Everything is well-prepared, from clean bus with good driver. Su Linh was our guide and her English was excellent. Trekking road is nice with up and down, pass through mountain, stream, bamboo forest .. local guides helped me much in difficult road, and they were really care about our safety. Thank you Su Linh for everything."}]},{"name":"Vietnam in Depth - 19 Days","reviews":[{"rating":"4.5","review":"Vietnam in depth - a great tour\n\n\n\nOverall a great experience! All transfers and guided tours on time. Guides very nice and professional. Would be even better if drivers were English speaking as well! A good feeling to have everything booked and not have to travel \"in a big group\". Hotels satisfactory. Some small changes in the excursions that we were not informed of!"},{"rating":"4.5","review":"Vietnam in depth - a great tour\nOverall a great experience! All transfers and guided tours on time. Guides very nice and professional. Would be even better if drivers were English speaking as well! A good feeling to have everything booked and not have to travel \"in a big group\". Hotels satisfactory. Some small changes in the excursions that we were not informed of!"},{"rating":"4.5","review":"SUPER planned program and all carried out accordingly\nDear Legend Travel\nWe want to send you our biggest thanks for an extraordinary fine travel experience and very well-planned itinerary. We carry along so many good memories from your very nice country - your beautiful nature, culture, history and great hospitality and positive mindset.\nBest regards Poul and Anne-Marie"}]},{"name":"Hanoi Culinary Experience","reviews":[{"rating":"4.5","review":"I had a great time. The cycling tour in Vietnam was very well organized and conducted. Our guide was knowledgeable, friendly and personal. The crew were very helpful. They all made the trip enjoyable. The only comment is that Tour radar describes the experience, if I remember right, that it is appropriate for any level but it could actually be challenging for older or less fit persons. That being said, electric supported bikes were made available to a couple bikers otherwise they may have had difficulty keeping up."}]},{"name":"Highlight Vietnam Tour plus Phu Quoc Island - 20 Days","reviews":[{"rating":"5.0","review":"Thank you so much for your help on our trip. We had a lovely time. We loved Hsnoi, our guides were friendly, funny and well informed. We liked the lunch restaurant in Hanoi and they sent us away with a huge amount of food for our son who slept through lunch!  The only thing we wished we would have made time for was exploring/ shopping in the Old Quarter.  The children lived the water puppets and we all enjoyed the cyclo ride. The stay at the Sofutel was perfect- comfortable and family friendly.\n\nThe Ha Long bay cruise was amazing. The staff, service, and food in the boat were exceptional. The staff on the bait went above and beyond for our children and we appreciated their help and friendliness.\n\nOur time in Saigon was nice as well, TinTin was a fantastic guide with a great sense of humour. We liked the day on the Mekong. We felt that the lunch restaurant was a little run down, the table clothes were dirty and the surrounding garden was junky- but the food was enjoyable. The hotel was ok- a little outdated and not to our standard of 5 star/ but we are greatly appreciative of your efforts to make our family comfortable and happy.\n\nOur time at Angkor was perfect and our guide, Lei was kind enough to bring us for lunch straight away as the visa process was very long. Le Zmerufuem was s lovely choice and our stay was very comfortable- I would recommend other travellers to stay there.\n\nThank you again!\n"}]}]