[{"name":"Vietnam World Heritages - 10 Days","reviews":[{"rating":"5.0","review":"We thoroughly enjoyed our tour. The hotels were an  excellent choice. We were welcomed and transported by friendly staff. The days tours were diverse and interesting HalonBay was magic. Would recommend Go Asia Travel for future trips. Thank you to Mike Nguyen and Maya."},{"rating":"4.5","review":"Overall Vietnam experience was excellent. From North to Central to South, all tour guide were excellent. They're very knowledgeable about the history of Vietnam. We learned a lot of history from the places we have visited. We also used domestic flights twice in this tour via Vietjet and it was very good. Hassle free flight. We have to pay extra to go to Sun World Bana Hills. A place you should not miss while in Da Nang area. \nBreakfast at the hotels were good, we always have fresh fruits which I love the most. But the lunch included in Mekong delta tour was not satisfying. We arrived at the lunch area and food was already on the table covered with plastic wrapper. The food was cold and spring roll was soggy. I know that they make an effort but western people hardly ate and there were plenty of left over food. Maybe this can be improved. \nOur tour contact person at  GO Asia, Mike was excellent. Communication was constant. He was always checking on how we went. Everything went smoothly with pick ups and transfers.    Friends and family like our photos posted on social media and they are already asking about the details of our tour.  We highly recommend GO Asia to anyone."},{"rating":"5.0","review":"I’m very happy with everything"},{"rating":"5.0","review":"From we first booked with Go Asia until we left Vietnam we had a very positive experience with this company. We toured Vietnam starting in Hanoi(including Halong Bay cruise, then Hoi An and finally Ho Chi Minh City. Go Asia was excellent communicating with us before we arrived and recommended additional trips for us as we had an extra few days. We didn’t take the overnight train to Hoi An Go Asia  organised hotel stay and flights for us. We were very happy with the hotels booked through Go Asia and the transfers, pick up at airports, tour guides, bus drivers and itinerary were all very good. We can fully recommend this company"},{"rating":"4.0","review":"Good & knowledgeable"}]},{"name":"Vietnam Adventure","reviews":[{"rating":"5.0","review":"Excellent trip. My experience of Vietnam ticked all the boxes. Our guide was superb. He was very knowledgeable and  helped group members with all sorts of issues. The itinery was very interesting. Only disappointment was when we visited the Ho Chi Minh morselium it was closed to the public (this is more of an observation rather than a criticism).\nOur accomadation was excellent, as was the food. Highlights for me was Halang Bay and the Cu Chi tunnels.\nWould definately recommend and use Exodus travel again."},{"rating":"5.0","review":"My Vietnam trip exceeded my expectations, Nam our tour guide went above and beyond every day. Dealing with all the necessary details, outlining each day with additional knowledge of each location. Pointing out extras that were interesting and fun as only a happy guide who travels with you could!  I could not imagine two weeks traveling  through Vietnam without having the same tour guide. The group on my tour was friendly and also well traveled.  We spent most of the days together."},{"rating":"4.5","review":"My wife and I are experienced world travelers but this was our first organized tour. The group was great. Two Americans, 12 Brits and two Vietnamese. Great mix of cultures and accents. No complainer, lots of laughter and great humor. Most of us were in the same age range so that made it easier.\n\n My wife and I found the schedule to be overly packed on at least 1/3 of the days. We actually bailed out of some of the tour sites. We didn’t expect to like them all or want to do them all but there were to many sites to see in the allotted time. The tunnels from the Vietnam war comes to mind as one we did not want to do.\n\nHighlights of the trip were Halong Bay, the bicycle trip, Hoi An, the overnight train trip, Mekong Delta boat and overnight stay and the cooking class. One would be safe in saying I ate my way through Vietnam. Food was beyond amazing. Tham out tour guide was a master at picking great restaurants with varied menus to cover everybody’s culinary needs.\n\nIt became evident to us that the tour guide is the glue that makes every thing work. Tham was great. She had great English, fabulous organizational  skills and even better people skills. We would go with her again in a heartbeat! We came to the tour with a complicated travel itinerary before and after the trip and they handled it with ease.\n\nWe had a wonderful time and would go with Exodus again."},{"rating":"4.0","review":"The organisation of the tour was very good. All accommodations very brilliant, better the aspected. Our tour guide Duy was very helpful and look after us very well.\nDownfall of the trip where other local tour guides ( special the one which was used for tour to Mekong Delta) as they English were very bad, was very difficult to understand and no much information was given.\nPersonally I would stay longer on trips like Halong bay and Mekong river and spent less time in busy cities."},{"rating":"5.0","review":"very good tour in Vietnam"},{"rating":"4.5","review":"Vietnam Adventure Dec 2016/Jan 2017.\nThis trip was cut short due to my wife sustaining an injury to her face & teeth.Not caused by the Holiday group or Hotel. The quick help & speedy return to UK was helped by the way Exodus went about they part of the operation. As it was UK New year this causes some problems which they sorted out.The local hotel & people we met were really helpful & I would use this company again at any time."},{"rating":"4.0","review":"An excellent couple of weeks skillfully and cheerfully orchestrated by Nam our local guide.   What a beautiful country.What was the most inspirational moment of your trip?Most inspirational moments were:++ sheltering from really monsoon rain near the cu chi tunnels++ celebrating the awesome Sai Gon rush-hour++ speaking (obviously nonsense) vietnamese to the nun in charge of a local orphanage++ capturing the most beautiful flowers on camera in a peaceful garden++ a new and untried fruit for lunch most daysÂ ++ Han OiWhat did you think of your group leader?Nam was ever cheerful, with enormous amounts of energy and lots of interesting tales to tell. Â He will make the trip for many who travel with him. Â Key phrase; 'are we feeling heavy?' - which you could take to mean;1. Do we need an exceptionally strong local coffee?orÂ 2. Is it so long since we had a pee that we have acquired an additional 10Kg in weight?Huge thanks to Nam for his energy and good humour.Â Do you have any advice for potential travellers?Key advice - dont take so much stuff with you!!!Oh - and - do visit the backpacker area in Sai Gon after dark if you like to see what the local (and international) folks get up to. Â A real treat to drink beer hoi and watch the hundreds of people sitting in the street.Â "},{"rating":"5.0","review":"What a brilliant country! This was a wonderful trip for experiencing the landscapes, people, culture, towns and villages of Vietnam with the help of a well informed local guide. It was a great introduction which has whetted our appetite to go back and explore further!   What was the most inspirational moment of your trip?The whole holiday was full of amazing experiences so itâ&#x80;&#x99;s difficult to single out one momentÂ  but here are a few of our favourites:Â  Kayaking in Halong Bay â&#x80;&#x93; enjoying the tranquillity of this awesome limestone landscape The Old Quarter of Hanoi â&#x80;&#x93;the lively street life and managing to cross the road by ourselves Hoi An â&#x80;&#x93; the fun of the tailors, the lanterns at night, theÂ  bike rideâ&#x80;&#x93; the exhilaration of hearing the wind rising in the banana trees before the monsoon rain descended on us Dinner with local people â&#x80;&#x93; the courtesy of our hosts and the wonderful food (but not the betel nut chewing â&#x80;&#x93; beware!)The Citadel at Hue â&#x80;&#x93; the monksâ&#x80;&#x99; music resonating around the courtyard of this splendid buildingGroup team building at Brown Eyes, Hue!!War Remnants museum â&#x80;&#x93; because it brings home how recently Vietnam and her people have experienced devastation and makes their optimism and sense of fun all the more amazing The Mekong Delta trip â&#x80;&#x93; all of itWhat did you think of your group leader?Ha was terrific â&#x80;&#x93; very knowledgeable and enthusiastic about his country. He seemed to intuitively know how much information we needed and when. We were a small group and therefore had the bonus of spending a lot of time with him. This was brilliant as he was great fun to be with â&#x80;&#x93; full of laughter and fun â&#x80;&#x93; which made for a very happy holiday. He gave us the opportunity to have a wide range of experiences and to better understand and appreciate Vietnam and its people. An excellent representative for Exodus!Do you have any advice for potential travellers?As others have mentioned do travel light . You donâ&#x80;&#x99;t need to take a lot of clothes as the laundry facilities at Hue or Ho Ann are cheap so you only really need to take a weekâ&#x80;&#x99;s clothes for a two week trip. Leave sufficient luggage space to bring home souvenirs. If possible have an idea of a garment youâ&#x80;&#x99;d like made at Hoi Ann â&#x80;&#x93; itâ&#x80;&#x99;s really worth it and great fun. Â Take up all the optional excursions on offerâ&#x80;&#x93; these provided some of our best experiences. Â Just go â&#x80;&#x93; go soon â&#x80;&#x93; and make the most of the experience!Is there anything else you would like to add?We went on the Angkor Wat extension. Whilst it was great to travel in Cambodia weâ&#x80;&#x99;d suggest that Â Exodus consider re-ordering the trip as the visit to the Killing Fields and Genocide Museum are at the end Â which means you leave on rather a sober note. We would have preferred to end with the positive experience of the temples at the Anghor complex."},{"rating":"5.0","review":"This is an amazing trip from the North to the South of Vietnam. You manage to visit Cities, sail in Halong Bay, travel by overnight train and get to experience some wonderful countryside. It's hectic but there is time to rest and relax and enjoy the amazing sights. A fantastic trip.What was the most inspirational moment of your trip?Too many to single out one thing. The night on Halong Bay was lovely. Hoi An is an amazing place with its lovely buildings and river. Sailing through the Mekong delta canals being rowed by a little old lady. The peace and quiet of the homestay. Cycling in Hoi An was great. Too windy to go to the beach, but we had a fantastic cycle through the countryside, rice fields and seeing where all the local vegetables were grown. Followed by a barbeque on a quiet river bank - bliss.Cocktails on the 50th floor of the building with the helipad in Saigon.What did you think of your group leader?Thuy was great. He really looked after us and took us to many lovely restaurants. We were very fussy eaters which I think proved a bit of a challenge at first but Thuy managed to make sure we were well catered for. Very knowledgeable and kind - a great representative for Exodus.Do you have any advice for potential travellers?As others have said laundry is cheap and easy to get done. So travel light as there are so many beautiful clothes to buy or get made out there.Is there anything else you would like to add?My only problem was the fact that you don't fly directly to Vietnam but have to go to Kuala Lumper then on to Hanoi on the outward journey. It made the journey so much longer especially as we were delayed on both legs going out. However Malaysian Airlines are very good so maybe it's better to keep the quality. I love the fact that with Exodus you do so many different things on holiday. I feel that i've done so much it feels more like i've been away a month. The mixtures of cities and countryside is great - you get such a good feel for the country."},{"rating":"5.0","review":"This was an amazing introduction to the variety that is Vietnam - every day had its special memories so it is impossible to identify a single highlight.  The guide, Chinh, was brilliant and his passion for his own country was contagious.  The peoples of Vietnam must surely be the most charming, friendly, smiling and laughter-filled peoples in the world!What was the most inspirational moment of your trip?As is obvious from the above, picking out one individual memory above all others is impossible. Â Should it be the Marble Mountain Pagoda? Â The homestay and preparing (or at least attempting to be of some help with our efforts) the evening meal, the war museum in HCM City, or the ready laughter and good humour of the Hanoi shop keeper as my wife attempted to haggle a bargain price? Â Or the Cu Chi Tunnels, Halong Bay, the overnight train from Hanoi to Hue, the ...? Â I can't choose.Â What did you think of your group leader?Absolutely excellent in every regard. Â He was instrumental in creating this memorable holiday and a large factor in so many of the warm memories we carry from it.Do you have any advice for potential travellers?Pack light. Â Buy any extra clothing you need when in the country. Â You'll be glad you left room in the case for your purchases. Â And don't be put off by accounts of the traffic and road-crossing experience. Â It's actually quite exhilerating.Is there anything else you would like to add?Exodus don't over-sell their holiday in their information sheets and notes. Â If you like what you read about what is on offer on this trip, I can guarantee the reality of the experience will be so very, very much greater than your expectations from the brochure text - so go for it!"},{"rating":"5.0","review":"A wonderful introduction to the history, culture and present day life in Vietnam.  However, it was quite city based and we felt that it would have been good to have had more opportunity to experience the countryside as well.   What was the most inspirational moment of your trip?  Halong Bay - even though it was misty!&#xC2;&#xA0; This added to the atmosphere in a strange sort of way. I loved Hoi An.   What did you think of your group leader?  Excellent - very knowledgable and good fun. He sometimes spoke a little bit too fast for our aging hearing.   Do you have any advice for potential travellers?  Be prepared for quite an intensive agenda, but above all enjoy it!   Is there anything else you would like to add?  The organisation and planning was second to none and we felt in very safe hands."},{"rating":"5.0","review":"A brilliant country to visit - beautiful and very welcoming.   What was the most inspirational moment of your trip?  We were lucky that the sun shined on us at Halong Bay and Hoi An was a lovely destination i would go back to,Mekong Delta was beautiful&#xD;\nWe took the options to cycle and those were some of the best moments of the holiday with the chance to see the countryside and villages and interact with local people.&#xD;\nLaughter yoga at 6am in Hanoi an experience not to miss !   What did you think of your group leader?  Hai was a great leader -he was endlessly jollyn and he worked very hard to keep a diverse group of people all happy. His choice of restaurants every day were great and gave us a great diversity of different food. His recomendations through out the holiday were always spot on which meant he never got a night off from us !!&#xD;   Do you have any advice for potential travellers?  In the cities - just go for it when crossing the roads ( and repeat ' oi choi oi ! ' continuously  ) as you stare down the bikes ! &#xD;\n&#xD;\nTravel light - there are laundry options as you travel. &#xD;\n&#xD;\nLast night in Ho Chi Minh City - cocktails at the Rex Hotel are  a must!   Is there anything else you would like to add?  I had a brilliant holiday but - The train was truly as bad as i had been warned by fellow travellers over the last year. I had looked at organising my own transfer via inland flight and it would have been easily done without needing to involve Exodus in any extra work.However on phoning them i was told it was not too bad a train - basic but ok and anyway everyone spends time in the bar carriage. The truth is the berths were filthy,you have to sit on the bottom  beds to eat , going down to the bar involves trying  to wade your way thru 10 carriages crammed with people in the walkways to a bar only able to take a few people- and the berths can never be left unattended so someone will always be left behind.. I am a traveller used to basic conditions but this was not a pleasant experience.&#xD;\nThere were several people who would also have chosen to spend extra to fly Hanoi to Hue and pay the extra involved.&#xD;\n&#xD;\nThe hotel in Hoian needs to get room safes sorted out - its a complete pain keep going to reception and having to recount your money in front of the public everytime you want to take money out of their safe."},{"rating":"4.0","review":"Vietnam by wheelchair - interesting!! (But very do-able)Beautiful Country, wonderful food and very friendly and helpful people   What was the most inspirational moment of your trip?  Vietnam is not what you expect - what did I expect...I don't know. It was very beautiful especially Hoi An, Saigon is gobsmacking and really takes you by suprise - more like New York than how I visualised Saigon. The best bit... going on a San Pan and staying at the home stay in the Meekong Delta, lovely... being part of a large family, cooking the dinner and relaxing in the open air on a very pretty veranda.   What did you think of your group leader?  Our group leader was excellent, yes we did have a couple of blips but we had some very strong personalities in our group, a partially sighted lady and my husband in a wheelchair... but we all came out unscathed and the tour guide really thought ahead, if we couldnt do it, he had already planned an alternative...&#xC2;&#xA0; that may have been a different route in or out of a place .e.g slope, lift etc instead of stairs or a different activity.. I went up into the caves my husband did Kyaking   Do you have any advice for potential travellers?  Lots and we have written a guide called' Travel tips for wheelchair users in Vietnam', which we have sent to Exodus. A few tips to think about...Walk in the road, go slow and dont rushOnly consider Vietnam if you have a little mobility - you will need to get in and out of your wheelchair as every where has a step or two, but once you are in - fairly flatLet people help you - they are only too willingBe flexibleBe prepared for half measures of disability awareness - lovely assessible toilet with grab rails - up 4 steps...Saigon you can use the pavements - they have ramps - but they are not parallel to each other you have to look for the next one - so you will go down a ramp go across the road and find you are facing a high pavement edgeIt can be hard at times but worth itMake the most of your free time to recharge your batteries   Is there anything else you would like to add?  If you are going to visit and are taking a wheelchair with you the two places that are no no's are My Son, all ruins and totally inassessible and the tour round the Meekong Delta Home stay Village, quite hairy by foot, impossible by wheelchair.You will not be disappointed with the Vietnamese people they were so friendly and helpful, even if you didnt ask they will see if you are okVietnam is easy to navigate and very safe to wander around on your own - great holiday... Thank you"},{"rating":"5.0","review":"An incredibly enjoyable and captivating trip along the length of this spectacular country.   What was the most inspirational moment of your trip?  I loved every day of this trip, but highlights included:Hanoi - the remains of Hoa Lo Prison (dubbed the &amp;quot;Hanoi Hilton&amp;quot;) and getting lost wandering the streets of&#xC2;&#xA0;the Old Quarter taking in the sights and sounds of everyday street lifeHalong Bay - sailing among the picturesque limestone peaks and the fantastic seafood on boardReunification Express - no trip&#xC2;&#xA0;would have been&#xC2;&#xA0;complete without riding on this train which unites North and SouthHue - dragon boat ride along the pefume river stopping to see the stunning mausoleum of Tu Duc, and to see the impressive Thien Mu Pagoda. The Imperial Citadel tour was also a highlight. An optional King and Queen night allowed you to dress up and dine with traditional music played whilst eating - completely tourist-driven, but memorable nonethelessHai Van Pass - stunning views to the oceanDanang - walking on China Beach and dipping a toe in the sea, and&#xC2;&#xA0;walking up the steps to Marble Mountain to see the impressive caves used as a hospital by the Viet&#xC2;&#xA0;Cong during the warHoi An - beautiful small town with historic buildings and oodles of charm.&#xC2;&#xA0;Apparently nicknamed the culinary capital&#xC2;&#xA0;with a buzzing&#xC2;&#xA0;riverside market. Each shop-front is also obliged to have lanterns hanging, which look beautiful come evenings.Ho Chi Minh City - vibrant metropolis with lots to see and do. I enjoyed sitting in the cafes watching the world go by, the crowds at the Ben Than Market, and Saigon Skydeck (Bitexco Tower) watching the city from the 49th floor. I particularly enjoyed the Reunification Palace whose architecture and interiors were pure 1970s kitsch, along with the basement's military command centre, still equipped with old rotary-dial phones and radio equipment. The War Remnants Museum had some&#xC2;&#xA0;haunting&#xC2;&#xA0;photographs. I would strongly advise taking a walk to the Old Post Office (designed by Monsieur Eiffel), Notre Dame Cathedral, and if you get chance wander to the Ho Chi Minh City Museum and Fine Art Museums which are housed in grand old colonial buildings. Although you can't enter the Hotel De Ville, it is certainly worth viewing from the exterior. The Municipality Building (Opera House) although only open for twice-monthly performances is also worth viewing from the outside. The Sri Thendayyutthapani Temple is also well-worth visiting with a very interesting rooftop tower.Try to make time to&#xC2;&#xA0;enjoy the rooftop garden at The  Rex Hotel, The Saigon-Saigon Rooftop Bar at The Caravelle Hotel, and Level 23 at The Sheraton Hotel, which all have great views.Cu Chi - tunnels are a must-see with interesting demonstrations of the traps the Viet Cong used to set, a shooting range and, although widened for Westerners, a very claustrophobic and humid short-section of tunnel to crawl throughMekong Delta - riding in a traditional wooden sampan and an enjoyable homestay   What did you think of your group leader?  Our group leader, Thuy, was excellent. He was very knowledgeable and approachable. He was also passionate about Vietnam, it's history and people. Most importantly his English language was excellent and he had a great sense of humour.   Do you have any advice for potential travellers?  Although this trip is marked as Moderate, I have been on Exodus trips labelled as Leisurely which have been more exertional, so fear not.There is a great balance of sight-seeing and free-time. I booked this trip for January as although I knew the weather may not be perfect in the North - Hanoi and Halong Bay - (10-15 degrees C with some drizzle and clouds), I was aware that in the South it would be warm (30 degrees plus). Rainy season in the South is from April, although I hear it only rains for short bursts each day, but is incredibly humid.Internet availability was excellent throughout Vietnam and wifi is freely available in all the hotels.Take a bunch of $1 bills for buying mementos, and try and get smaller notes of Dong prior to going to Vietnam - 50,000, 100,000 and 200,000 should be fine. The ATM will only let you withdraw &#xC2;&#xA3;60 at a time, although this does equate to 2,000,000 Dong. Aside from Ho Chi Minh City - you can eat and drink well for very little.You don't need walking boots for Marble Mountain   Is there anything else you would like to add?  I took along 'The Rough Guide to Vietnam' which was an invaluable&#xC2;&#xA0;aid to&#xC2;&#xA0;my free time and enabled me to do plenty more sight-seeing in addition to the itinerary.Great trip. Can't recommend it enough. Book it. ;-)"},{"rating":"4.0","review":"  Wow, what a country to visit - Go before it all changes!  This trip was well structured and everyday brought a new experience; Hanoi is a 100% culture shock with its own sound track - the horns of a million mopeds, Halong Bay was a cool break from the city, the train south was memorable - just don't order room service!  Hue and Hoi An were full of new sights, sounds and tastes, Ho Chi Min City was crazy and chaotic and the Mekong homestay was a tranquil respite to end the trip.   Do you have any advice for potential travellers?  Treat the Vietnamese with respect and they will welcome you with a smile. Go with the flow.&#xC2;&#xA0; Don't expect western standards everywhere, although you'll be surprised by how the arrangements all work seamlessly.&#xC2;&#xA0;   What was the most inspirational moment of your trip?  My highlights:   Halong Bay overnight - No sign of 007, but what a memorable location.  Mekong homestay - Sipping a cold beer in a hammock on the veranda, looking forward to a delicious dinner of fish and seafood. Yummy!   Hue - cycling into the country and watching the duck farmers shepherding their flock down the canal.   Hoi An - bartering for two new handmade shirts in one of the many tailors.   What did you think of your group leader?  Hai was a great trip leader; always ready to help and to ensure we were enjoying the trip.&#xC2;&#xA0; Our safety came first - it's been a while since I was helped across the road!&#xC2;&#xA0;Beware his sense of humour."},{"rating":"5.0","review":"This trip converted me from backpacking to organized tours, as a way of relaxing and getting to know a place. It was very well organized and covered interesting ground, at just the right pace. But far and away the best thing was our Vietnamese guide, Anh Nguyen, a consummate professional. He was unfailingly attentive and generous with interesting information, even about himself.    What was the most inspirational moment of your trip?  Favourite tours were the tunnels, watching food being made in the Mekong Delta, home stay in the MeKong Delta, Marble Mountain's astonishing natural 'cathedral' and the magnificent giant Buddha hiding around the corner in a secluded magical sunbathed grotto. &#xD;\n&#xD;\nMost inspirational were the wonderful scenes of Vietnamese people going about their business, giving us lip in the markets, and dealing with traffic. The winner on that score was the woman crossing the street in HCM City while about 15 motorbikes, cars, trucks and buses moved abreast in a wave toward her, while she carefully counted a wad of cash, a tiny baby sleeping on her shoulder, not even glancing at the traffic, instead letting it weave its way around her. SO Vietnam.&#xD;\n&#xD;\nAnother favorite moment was when Anh performed a song in the middle of a field, inspired by a flower there.   What did you think of your group leader?  See above. Wonderful.   Is there anything else you would like to add?  Thanks for a great and unforgettable experience Exodus and An&#xD;\nh"},{"rating":"5.0","review":"I have never been on an Exodus holiday before or anything that involved travelling with an organised group.  I had a truly fantastic time and during 14 days I saw many places in Vietnam and had some great experiences.   What was the most inspirational moment of your trip?  For me and my husband the food was truly superb.&#xC2;&#xA0; It was all so fresh, tasty, good quality and (for us) good value.&#xC2;&#xA0; Halong Bay was the most memorable place we visited.&#xC2;&#xA0; The thousands of motor bikes in Hanoi and Ho Chi Minh City will never be forgotten!&#xC2;&#xA0; We also met some very nice and interesting people within the group.&#xC2;&#xA0; The Vietnamese people are also very polite, hospitable and welcoming.   What did you think of your group leader?  The tour leader really made the trip a great and memorable epxerience.&#xC2;&#xA0; Zung was very knowledgeable, considerate and patient.&#xC2;&#xA0; It seemed very strange to leave him behind at the airport for our departure back home!   Do you have any advice for potential travellers?  This is a very busy two week trip.&#xC2;&#xA0; There will be times when tiredness sets it as it is very 'full on'.&#xC2;&#xA0; If the land only tour is selected it may be a good idea to arrive a day or two before the actual tour date to get over the flight and get the batteries re-charged.   Is there anything else you would like to add?  Iwas very impressed with Exodus both at the office and also on the ground in Vietnam.&#xC2;&#xA0; I would highly recommend this tour and Exodus. This tour gives a very good overview of Vietnam - if you have the chance add on the trip to Cambodia."},{"rating":"4.0","review":"A good way to see the highlights of Vietnam.    What was the most inspirational moment of your trip?  There were a number of inspirational moments on this trip - I personally loved the boat trip on Halong Bay, the Historic town of Hoi An and waterside living in the Mekong Delta.   What did you think of your group leader?  Khiem, the group leader, looked after us all very well and took us to fantastic restaurants. Our group was diverse but he was very inclusive and patient.  I'm especially grateful to him for keeping me safe on the roads.   Do you have any advice for potential travellers?  This is not a physically demanding holiday in terms of hiking and climbing mountains but an awful lot is crammed into a short time and there is no time for relaxation.  There are 2 very early morning flights and I felt very tired a lot of the time.  Make sure you get a good nights sleep before the flight to Vietnam.   Is there anything else you would like to add?  Vietnam is changing very quickly!"},{"rating":"5.0","review":"An excellent trip - a very well thought out itinerary and run at a good pace.Exodus staff could not have been more helpful in the planning stage and our first class tour guide(Anh Nguyen) ensured it was a really memorable holiday.   What was the most inspirational moment of your trip?  There were severalHalong Bay - very dramaticHoi An - the markets, the river and those magical lanternsNha Trang - lovely beach, and great&#xC2;&#xA0;trip to the islands and swimming from the boatMeekong Delta - a fascinating experience   What did you think of your group leader?  Anh Nguyen was an excellent leader.He combined a very professional approach with the right degree of fun and&#xC2;&#xA0;good humour.Very knowledgeable too, nothing was&#xC2;&#xA0;too much trouble.He helped to make the holiday a fantastic experience.   Do you have any advice for potential travellers?  Pack as light as you can and remember that(on this particular trip) you are never very far from the products that you need.The traffic - if you have not been here before then you&#xC2;&#xA0;must keep an eagle eye on itUntil you are acclimatised,you need your wits about you&#xC2;&#xA0;24/7&#xC2;&#xA0;..!   Is there anything else you would like to add?  Fascinating country - must come back and see some more of it."},{"rating":"5.0","review":"Excellent holiday   What was the most inspirational moment of your trip?  Halon bay   What did you think of your group leader?  Excellent   Do you have any advice for potential travellers?  Do plenty of training"},{"rating":"5.0","review":"An amazing holiday from start to finish. The only negative is that we had to come home!   What was the most inspirational moment of your trip?  Meeting such lovely people in Vietnam, an amazing country. Staying in the home stay was a high light and the locals seem to want to share part of their lives with us.   What did you think of your group leader?  Tuyen-Vu was fantastic. Our group of 15 - aged between 30-75 all had different needs but he managed to look after us all and make sure we all had a great holiday. His knowledge was amazing and his social skills with organising taxi's, meals and&#xC2;&#xA0;cyclo tours&#xC2;&#xA0;second to none. Anyone who has Tuyen as their group leader are in for a great adventure.   Do you have any advice for potential travellers?  Book&#xC2;&#xA0;yourself on the next trip and discover what Vietnam has to offer! If you book flights via Exodus request seats together, while they can't guarantee you will sit together it did work on all our long haul flights.Go with the flow - while we did stick to the trip notes a majority of the time sometimes opportunities come up that you have to grab.Take both Vietnam Dong and US Dollars- While at bigger stores, restaurants&#xC2;&#xA0;and the tour guide accept dollars some smaller places only prefer to take local currency. Don't always assume restaurants take debit/credit cards, they don't.   Is there anything else you would like to add?  Starting in the north of Vietnam allows you to get use to the heat. This tour allows you to see many parts of an amazing country. Some days are long and exhausting but it is worth it. You get to meet wonderful, friendly people, eat lots of fresh and delicious food and on occasions can help make it too."},{"rating":"5.0","review":"An amazing trip, beautiful scenery, numerous highlights and a fabulous group of people!   What did you think of your group leader?  Mao was a great leader. Interesting, entertaining, friendly and very passionate about his job. He went out of his way to make sure everyone was happy and was very helpful if anyone had any problems during the trip.   Do you have any advice for potential travellers?  Pack light and for hot humid weather. Take good insect repellent for the south. You don't really need to take malaria preventatives.   Is there anything else you would like to add?  Go on the trip. Just do it!"},{"rating":"5.0","review":"Beautiful country, amazing food & great group of people!    What was the most inspirational moment of your trip?  Too many to name only one!&#xC2;&#xA0; Halong Bay was stunning &amp;amp; a wonderful way to start the trip.&#xC2;&#xA0; The boat was lovely &amp;amp; kayaking in the bay was great fun. Hoi An was fantastic, and it was good to have a few days there.&#xC2;&#xA0; The cycling trip in particular was a highlight, as was the Vietnamese cooking course. Mekong Delta was a great way to end the trip too, with the Homestay being much nicer than I expected, and the area itself was fascinating. To be honest, there were no days on the trip in which we didn't do or see something amazing!   What did you think of your group leader?  He was great - well organised, friendly and was very attentive to the group and made every effort to ensure we enjoyed ourselves and saw the best of the areas we went too.   Do you have any advice for potential travellers?  Take a small rucksack for the overnight stay on the boat in Halong Bay &amp;amp; the Homestay in the Mekong Delta.   Is there anything else you would like to add?  This was a brilliant trip &amp;amp; I'd recommend it to everyone!"},{"rating":"5.0","review":"A varied and great experience  Good group of people to be on holiday with   What was the most inspirational moment of your trip?  Halong BayWar Remnants MuseumMekong Delta   What did you think of your group leader?  Excellent, knowledgable, helpful and wanting to do his best   Do you have any advice for potential travellers?  Quickly get used to crossing the roadTravel light   Is there anything else you would like to add?  Awesome holiday"},{"rating":"5.0","review":"An excellent holiday with a great guide and and fantastic group of people. Vietnam is  a country to be experienced as  soon as possible.   What was the most inspirational moment of your trip?  So many great experiences but I would highlight Hoi An, which I was really looking forward to, and which didn't disappoint and the Mekong Delta &#xC2;&#xA0;experience. The stay at Hue had &#xC2;&#xA0;much more than I anticipated and Ho Chi Min City&#xC2;&#xA0;was &#xC2;&#xA0;significantly better than I thought it would be and the history gave an extra edge to this &#xC2;&#xA0;element of the trip. The Vietnames people were &#xC2;&#xA0;extremely welcoming.   What did you think of your group leader?  Thuy was fantastic and I would love to go on another trip with him. So well organised everything ran like clockwork and we always knew &#xC2;&#xA0;where we &#xC2;&#xA0;were up to. He shared so much information with us regarding Vietnamese culture and history as &#xC2;&#xA0;well as his own family's story which you just don't get from the guidebooks. He was good at spending time with individual group members and really interacting with them.   Do you have any advice for potential travellers?  As other reviewers have said pack light there is loads to buy very cheaply and it is easy to get washing done half way through the trip. I wasn't impressed with Nha Trang or with the swimming/snorkelling trip there but it was redeemed by the fact that a small group of us walked out to the Cham Towers which were extremely interesting and as I hadn't been to My Son gave &#xC2;&#xA0;a feel of this different culture.   Is there anything else you would like to add?  Go with the flow &#xC2;&#xA0;and enjoy the varied experiences on offer .The hotels &#xC2;&#xA0;were better than I anticipated given that they are 3* comfort hotels."},{"rating":"4.0","review":"This was my first exodus trip and gave me an excellent insight into this fascinating country. The trip included lots of variety, from snorkelling in the east china sea to visiting Hoi Ann and staying in a traditional home in the mekong delta. The food was delicious and the group leader and local people very friendly. For me as a single traveller, the most challenging aspect of the holiday was travelling in a group with people i didnt know but this added to the experience.     What was the most inspirational moment of your trip?  Visting the town of Hoi AnnSnorkelling in the East China seaOvernight boat trip to Halong Bay and KayakingRelaxing mud bath in Nay trangDelicious foodPassion of the group leader for his country   What did you think of your group leader?  His passion and&#xC2;&#xA0;knowledge about the country's history really inspired me and I enjoyed hearing his&#xC2;&#xA0;entertaining stories and jokes.&#xC2;&#xA0;He spoke good english and was very helpful when any problems arose. He tried hard to make sure everyone in the group was happy, which is not an easy job.   Do you have any advice for potential travellers?  Make sure you read about Vietnam so you know what to expect in terms of climate, food and acitvities. Some people&#xC2;&#xA0;on the trip go to Vietnam with&#xC2;&#xA0;different expectations and&#xC2;&#xA0;were not&#xC2;&#xA0;prepared and this is such a shame.&#xC2;&#xA0;   Is there anything else you would like to add?  This was my first exodus holiday and so i did not know what to expect, but was pleased that i did go. I think exodus holidays are a good way for single travellers,such as myself, to get away and i liked that my group was a mixture of single travellers as well as couples."},{"rating":"4.0","review":"The Vietnam Adventure certainly lived up to its name in every way! It was a mix of an adventure in every sense from the many different (and often novel!) modes of transport we took and encountered during the two weeks, a culinary adventure experiencing different regional specialities and a sightseeing adventure from centuries old pagodas to the Cu Chi Tunnels from the Vietnam War. If you want to sample what Vietnam is all about this is the trip for you!   What was the most inspirational moment of your trip?  Each place we visited had a highlight, from learning how to cook delicious Vietnamese food from an entertaining chef in Hoi An, kayaking around the many and mysterious islands in Halong Bay, visiting the My Son temple complex, exploring Tu Duc's mausoleum, the sights and smells of Hue market, crawling along the tunnels at Cu Chi to taking a cyclotaxi ride around Ho Chi Minh City, every day had numerous inspirational moments. The Vietnamese people are amongst the friendliest I've met which added to the experience. I would highly recommend visiting Vietnam for the sheer variety on offer.   What did you think of your group leader?  Zung made the history and culture of Vietnam come to life and helped us to understand their customs and way of life. This was an invaluable way of getting a better understanding of the country and the people around us, which I definitely won't have got the most out of if I had visited Vietnam on my own.   Do you have any advice for potential travellers?  Book this trip now before Vietnam changes!!! You won't regret it. Don't forget to bring tropical strength DEET for the Mekong Delta as the mosquitoes in that part of Vietnam were particularly vicious!   Is there anything else you would like to add?  I got so much out of this holiday both in terms of the sights I saw, the activities I did and the people I met. Having the opportunity to have dinner at a local family's house was a real highlight as not only was the cooking excellent but the company was warm and welcoming too. Since the iternary allowed for free time along the way you could make this either a relaxing holiday or a real jam packed sightseeing one which suited the group dynamics well."},{"rating":"2.0","review":"It was a great country but the demographic i.e. mainly older couples, lack of night time activities and more exciting daytime activities were lacking for me.   What was the most inspirational moment of your trip?  I really loved Halong Bay and the kayaking, but heard the music on the other boat and they were clearly having more fun, jealous.The Mekong Delta was also beautiful and the locals lovely and friendly, the homestay was a bit quiet for me though.   What did you think of your group leader?  Was initially dissapointed as took an early dive on the 2nd night and decided we didin't need a group meal, the first three days were tough as lack of information on what we were doing and not properly kitted out for the day trip. However; once he asked what was wrong and I explianed he bent over backwards to make the trip really enjoyable. Very knowledgeable guide who was proud of his country and clearly enjoyed his job.   Do you have any advice for potential travellers?  Shopping in Hoi Ann is amazing, bought several tailor made suits and wok shirts which were well made and dirt cheap, so leave space in your luggage and remember you can do laundry there so don't over pack."},{"rating":"5.0","review":"Any thoughts that we might have had against signing up for another Exodus Group trip,( Our first to India was a wonderful experience) were extinguished by the end of day one.   What was the most inspirational moment of your trip?  Experiencing the wonderful Vietnamese people and how they have come through such a war torn history.Halong Bay of course . The site of the Thet Offensive and clear evidence of the battle. The War Museum and the erie silence of the visitors.   What did you think of your group leader?  &#xC2;&#xA0;Thuay.Absolutely excellent. The standard against which all your guides could be judged   Do you have any advice for potential travellers?  Do not have any doubts about experiencing this visit and do it soon.   Is there anything else you would like to add?  We enjoyed our group experience so much we have suggested to all members that we get together again. Has that ever been done?"},{"rating":"4.0","review":"Have been on many Exodus holidays but this is the best. A memorable trip which exceeded my expectations   What was the most inspirational moment of your trip?  Mekong Delta was fascinating a community operating with resources immediately around them via little cottage industries.Visiting a nursery showing kids are the same no matter where you go- they just like to pose!Fresh food being produced out of nowhere on a small boat- fab   What did you think of your group leader?  Fantastic- receptive to the needs of every group memberSo organised and knowledgeable   Do you have any advice for potential travellers?  When crossing the road just go for it and the traffic avoids you!Enjoy!   Is there anything else you would like to add?  Have a ball!"},{"rating":"4.0","review":"A fabulous trip which lived up to all my expectations and more   What was the most inspirational moment of your trip?  For me the Mekong Delta was just fascinating. A complete community living and operating on the resources around them via little cottage industries.Fresh food supplied in abundance from little boats. Visiting a nursery which just shows how kids are the same no matter where you go-they just love to pose for a photo!   What did you think of your group leader?  Fantastic so knowledgeable and so aware of the needs of the group.Everything was so well organised.   Do you have any advice for potential travellers?  Just enjoy every minute and when crossing the road just go for it and the traffic will move around you!   Is there anything else you would like to add?  Have a ball!"},{"rating":"5.0","review":"A wonderfully varied trip with lots of fun activities and lovely scenery in a country with a complex and interesting history.   What was the most inspirational moment of your trip?  Impossible to decide on one moment as there were so many highlights.  I really enjoyed the various activities from the bike ride in Hoi An and the cyclo ride in Hue, to drinking coconut juice from a freshly cut coconut in the Mekong Delta.  There are plenty of boat trips and these were all superb.   What did you think of your group leader?  Giang was excellent, he was very passionate and knowledgeable about his lovely country.  He was always willing to provide ideas and help sort out arrangements, even in his free time.   Do you have any advice for potential travellers?  It was very easy to get laundry done in Hoi An.  The hotel service was relatively expensive so our tour leader arranged for us to drop our clothes off at the bike shop!  Everything arrived back clean, fresh and pressed, all at a reasonable price.Like all Exodus trips this is a busy and active holiday, however, I did not find it too tiring.  The bonus of this type of holiday is that you come home with so many wonderful memories and photos.   Is there anything else you would like to add?  The food was absolutely delicious.  I'm not a fan of spicy dishes so I was pleased to find out the food was not overly spicy.  Lots of fresh fruit and veg, endless seafood and of course plenty of rice and noodles.The group gelled very well and this just added to the enjoyment of the trip."},{"rating":"5.0","review":"A wonderfully varied trip with lots of fun activities and lovely scenery in a country with a complex and interesting history.   What was the most inspirational moment of your trip?  Impossible to decide on one moment as there were so many highlights.&#xC2;&#xA0; I really enjoyed the various activities from the bike ride in Hoi An and the cyclo ride in Hue, to drinking coconut juice from a freshly cut coconut in the Mekong Delta.&#xC2;&#xA0; There are plenty of boat trips and these were all superb.   What did you think of your group leader?  Giang was excellent, he was very passionate and knowledgeable about his lovely country.&#xC2;&#xA0; He was always willing to provide ideas and help sort out arrangements, even in his free time.   Do you have any advice for potential travellers?  It was very easy to get laundry done in Hoi An.&#xC2;&#xA0; The hotel service was relatively expensive so our tour leader arranged for us to drop our clothes off at the bike shop!&#xC2;&#xA0; Everything arrived back clean, fresh and pressed, all at a reasonable price.Like all Exodus trips this is a busy and active holiday, however, I did not find it too tiring.&#xC2;&#xA0; The bonus of this type of holiday is that you come home with so many wonderful memories and photos.   Is there anything else you would like to add?  The food was absolutely delicious.&#xC2;&#xA0; I'm not a fan of spicy dishes so I was pleased to find out the food was not overly spicy.&#xC2;&#xA0; Lots of fresh fruit and veg, endless seafood and of course plenty of rice and noodles.The group gelled very well and this just added to the enjoyment of the trip."},{"rating":"3.0","review":"An extremely comprehensive trip covering this inspiring country.  It was a real trip of contrasts, from the more conservative and overtly communist North to the more westernised South, so that you can get a real feel of what Vietnam is like today.     What was the most inspirational moment of your trip?  The Homestay in the Mekong Delta was wonderful, and gave the chance to meet some of the locals and experience life away from the hussle and bussle of the cities.  I loved the Imperial city of Hue, and also relaxed Hoi An - unfortunately we had fairly wet weather whilst we were in the middle of the country, so maybe didn't see them quite at their best - we were lucky to get out on bikes in Hoi An which allowed us to experience the motorbikes and scooters at a different pace than just trying to cross the road - which really is an experience (check out some videos on Youtube before you go).  We also got the chance to visit an orphanage in Hoi An which was quite moving, as was the War Remnants museum in Saigon. Halong Bay is stunning, and it was lovely to get out kayaking amongst the limestone karsts and the overnight boat trip was great.  The train journey from Danang to Nha Trang, whilst long and perhaps a little uncomfortable allowed you to see much more scenery than you ever do in a coach, so great for photo opportunities.    What did you think of your group leader?  Hai was extremely well organised, so all his arrangements went without a hitch and he was really keen to ensure that we all got to experience as much of Vietnam as we could in this busy trip.  He was really knowledgeable, and had some great anecdotes to tell about all the places we visited.   Do you have any advice for potential travellers?  Pack light, but be prepared that it might well rain a lot whilst you are there.  Leave plenty of space for shopping as there are loads of opportunities through the trip to buy some great things.  You can get washing done easily in Hoi An.  If you are looking for a relaxing holiday, this might not be the trip for you, be prepared for some long days.  As others have mentioned, be really careful of your possessions when you are out and about - it is very difficult for Vietnamese to leave the country, so our passports are very valuable to them as well as to us.  Keep your wits about you in the big cities, but do visit the markets and bargain, you can get some fantastic deals.  If you want to get clothes made in Hoi An, take some pictures with you to give ideas to the tailors, and be prepared to go for two or three fittings - persevere and as long as you have gone to a recommended tailor (ask your guide, they will know the good places) you will get a great result at the end.   Is there anything else you would like to add?  The Homestay in the Mekong was more comfortable than we had all expected - we were in rooms of max 4 people, and couples got their own rooms.  The food was delicious and the toilets/showers were clean and plentiful.  I would have preferred to spend less time in the cities and more time out in the more rural parts of Vietnam, but if you are a city lover, you will love this trip.  Remember, Vietnam is still very much a developing country, so standards might not be quite as good as you would get on a similar trip in say Thailand, but eating out and drinks are very good value, so you can get much more for your money whilst you are there.  The food is fantastic too!  If you want to visit Vietnam, I'd suggest you go soon, to experience it before it gets too developed and tourism spoils it!"}]},{"name":"Sapa Biking from Hanoi - 3 Days","reviews":[{"rating":"4.0","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"4.5","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"4.5","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Sapa Tour by train from Hanoi 2 days 3 nights - Overnight in homestay","reviews":[{"rating":"4.5","review":"Guides were very friendly and welcoming. Tour bus from Hanoi to port was relatively new, clean and comfortable. Boat like many others in the bay was fairly old and a bit run down. Had a great view from the top deck. The lock on our room broke and we needed to be moved to another room, the shower in the new room did not drain water so well. The tour packed in a lot of activities over the three days including a cave visit and hike up Ti Top island. Expect to pay for all drinks on the boat and corkage fee to bring your own drinks. Cat Ba island hotel was nice with a great view of the harbour and only a short walk to town. The hike included on Cat Ba was quite strenuous but the view from the top of the mountain fantastic. The trip to monkey island on a small boat off Cat Ba was cool - the monkeys can get a bit agitated, and are experts at raiding back packs, zippers pose no problem for them. Overall a lot of fun was had on the tour and it was well organised and the guides kept the group busy."},{"rating":"4.5","review":"The tour was a great overview of the life and industry on the Mekong Delta. The bus was comfortable and the tour guide very knowledgeable. It was a very on the go tour and long distances made the day tiring. We did not arrive at our homestay (we chose the homestay option - there was a hotel option) until quite late. But the homestay, while at first seeming quite isolated and off the beaten track, actually had about 25 other tourists also staying there. The highlight was the cooking lesson for dinner and then eating all we had cooked. All in all, a great overview, but long distances to travel."},{"rating":"4.5","review":"The tour guide and staff were excellent. The food was good. The rooms were great. Pick ups and drop offs smooth. I can say only good things about the staff. Their sense of humor and duty to their jobs was above board. The only problem I had was with how many other tours and tourists were doing the same thing at the exact same time."}]},{"name":"Top Gear Vietnam Motorbike Tour from Hanoi to Saigon on Chi Minh Trail","reviews":[{"rating":"5.0","review":"The tour and experience was excellent, a group of 4 on a dirt bike tour of Vietnam. This was our first time. and it couldnt have gone better. Mr Hoang Minh  and our Guide Vinh our guide were both professional and catered for all our requirements.\nThe bike ride was a little challenging in some places and Vinh knew many great tracks\nBikes were great, accommodation was great and our last night was amazing\nWe all had a blast and are looking forwards to planning another trip"},{"rating":"5.0","review":"Best way to see Vietnam\nI did a 12 day tour from Hanoi to Saigon with Cong as the tour guide. I would thoroughly recommend to anyone who is considering seeing Vietnam.\nCong was fantastic tour guide, and made sure the group was always looked after. We had a very authentic experience, and would often take the road less traveled to meet locals."},{"rating":"5.0","review":"This tour was an amazing way to see the country and covered so much from rural villages, scenic mountain passes, offroad paths and busy cities which really gave a great feel of the country and showed all aspects of Vietnamese life.\nOur guide, Mr Cong was very knowledgeable and easy to work and was committed to giving us the best experience. Thanks DNQ Travel"},{"rating":"5.0","review":"This is the most successful trip I have taken so far\nWe cannot fault any services as hotels, local guides, bikes, and programs are perfect\nWe will choose the company again for our next trip without hesitation"},{"rating":"5.0","review":"Great experience for 12 of us to explore 2600 km on motorbikes in Vietnam. \n\nMountain roads, trails, crossroads, culture, villages and cities, this tour has a number of things. The pilot and his crew are EXCELLENT!!! All we have to do is ride and have fun every day, they take care of the rest.\nHighly recommended DNQ Travel and look forward to a return trip!"},{"rating":"5.0","review":"For those who want to explore the best highlights of Vietnam from Hanoi to Saigon, please take this tour along the coast and Ho Chi Minh trail. It's just incredible"}]},{"name":"Vietnam Northwest Adventure Tour to Mai Chau, Sapa, Dien Bien Phu, Halong Bay","reviews":[{"rating":"5.0","review":"Done a trip in northwest Vietnam, was amazing and the views were unbelievable, definitely the best way to see Vietnam and its great culture , hotels and home stays were great and unique , highly recommend"},{"rating":"5.0","review":"exceptional vietnam cambodia tour for 14 days !!!\n\nWe've just returned from a 2-week family holiday in Cambodia & Vietnam which DNQ Travel provided. Truly i can not say \"thank you\" enough to what the team of DNQ & Mr. Dong handled our request from the beginning till the end of the trip. Everything was very responsive and on the right tracks, they advised us a very great tour program, in which we can combine so many different touring activities for both parents & kids together. We were not only engaging sightseeing trips at famous travel sites like Angkor, Killing Fields, Mekong, Hanoi, Halong bay but also handing on cooking classes, biking & joining charity programs at schools. All hotels chosen by DNQ are just centrally located, highly ranked on the tripadvisor and nearby restaurants, markets, shopping centers. Guides in regions were so friendly, well-educated, good at speaking English & professional. Cars are new & clean and turning on the air-conditions always to cool ourselves after every visits.\noverall we are so pleasant with all DNQ accommodated and surely will book them again as well as recommend them to our friends"}]},{"name":"3-Day Overnight Cruise in Ha Long Bay and Hotel in Cat Ba Island","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"5.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Excellent Hoa Lu - Tam Coc 1 Day plus Mai Chau Valley 1 Night","reviews":[{"rating":"4.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"5.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.5","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]}]