[{"name":"Vietnam Luxury Vacation plus Beach and Mountain Resorts - 17 Days","reviews":[{"rating":"4.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Explore Bai Dinh – Trang An Eco Complex 1 Day plus Mai Chau Valley","reviews":[{"rating":"4.5","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.5","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"4.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"Trekking Mai Chau And Pu Luong Hidden Trails","reviews":[{"rating":"5.0","review":"Our family of 5 enjoyed this 5-day bike trip in northern Vietnam. Our guide Trang (aka Peter) was excellent."},{"rating":"4.5","review":"This tour allowed us to get off the beaten track and see some parts of Vietnam that we haven't see before. This was fantastic. The long days and bad roads were definitely worth it. Our driver & guide were both fabulous. Visiting Sapa and walking around a local village was excellent but would have been better to stay in Sapa at a lodge or homestay rather than travel to Bac Ha and stay in a hotel. I would suggest that on the first day the tour should stay in Sapa - to have more free time to relax or enjoy a local restaurant and then travel to the Bac Ha markets the next day. I know it would be an early start but I think it would be worth it. The only thing we saw in Bac Ha was the markets. Pan Hou Lodge was fabulous as was the scenery along the way. Trekking on Day 4 was advertised as 4 hours but was actually all day - 8 hrs. Our family enjoyed this but it was misleading in the itinerary."},{"rating":"4.5","review":"Peter was a fantastic host throughout. He was knowledgable and made us feel welcome. He went out of his way to accommodate our needs. Food was exceptional. Hotels were beautiful. He did many little extras to make our trip that little bit more special"}]},{"name":"Hanoi at Glance for Full Day Trip plus Mai Chau Valley","reviews":[{"rating":"4.0","review":"Excellent -everything was really well organised from airport pickups, trips, hotels, food & guides."},{"rating":"4.0","review":"Full intinerary, opportunity to see so many things. Very little down time. Excellent organization of tours, pick ups, flights, etc. Very attentive to travellers needs. Would travel with legend tours again. Thank you for an excellent trip."},{"rating":"5.0","review":"A diverse & vibrant tour - fantastic food - knowledgable guides - a holiday to remember"}]},{"name":"3-day Sapa trekking and Bac Ha market on Sunday","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.5","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Vietnam the Long Way Up","reviews":[{"rating":"4.0","review":"I can represent the place as \"The Best of Vietnam\". The Golden bridge of Vietnam which is located at Ba Na Hills. The huge bridge placed in giant arms. Truly, the Best place to visit in Vietnam!"},{"rating":"4.0","review":"We had booked first time with Threeland Travel. They were very friendly and gave us all the facilities related to journey. We planned trip for Vietnam and Cambodia and it was awesome!"},{"rating":"5.0","review":"I had booked the tour with Threeland Travel in the back of May-2019. They gave me luxurious facilities with comfort. Thank you!"}]}]