[{"name":"3-day Mai Chau & Pu Luong Nature Reserve","reviews":[{"rating":"4.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"4.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.5","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Subduing Fansipan - 3 Days","reviews":[{"rating":"4.5","review":"We thoroughly enjoyed our trip lovely country and lovely people ,the tour covered a large part of the country and we learnt a lot .Apart from having our phone charger stolen from our room in Da nang, It was plugged into the wall and removed we did complain but ???? We did not let this spoil our holiday. Only one hotel was BAD and we complained as the area was a slum and we felt unsafe leaving the hotel, when we arrived back from the cruise we moved to another hotel and enjoyed the rest of our stay.THANKYOU VERY MUCH TO ALL CONCERNED June and John Riggall"},{"rating":"5.0","review":"We had an amazing time and really enjoyed our trip to Vietnam. Our guide “Eric” in Hoi An was particularly...\nShow more"},{"rating":"4.5","review":"I love the care and thoroughness that tour radar puts into my tour. The fact I am relieved of the stress of finding...\nShow more"}]},{"name":"Trans - Vietnam Train Journey - 18 days","reviews":[{"rating":"5.0","review":"Alice from Crossing Vietnam was polite and helpful with us from the very first day. She immediately understood what we needed and organized a great trekking trip for us at Sapa, a cruise to Lan Ha bay and a trekking to Phong Nha caves. All tours and activities perfectly designed, organized, with knowledgeable guides and accurate transfers. I absolutely recommend to book your tours with Crossing Vietnam!"},{"rating":"5.0","review":"Our guide Duc gave us a lot of useful tips about travelling in Vietname. We were very happy and would like to say thank you."},{"rating":"4.0","review":"Duc's offered places was very good. We spend very good and interesting time"}]},{"name":"Trekking in Mai Chau - Pu Luong 3 days 2 nights","reviews":[{"rating":"3.5","review":"We had two different tours which were totally different, and each excellent. The first was into the Northern Vietnam countryside to the Ban Gioc Waterfall and Ba Be Lake. What an amazing adventure and insight into the daily lives of the local people. The home stays were absolutely incredible and something we will never forget. Long was a fantastic tour guide. The second was a cruise to Halong Bay. This is a must see for anyone traveling in Northern Vietnam. Incredible scenery and a wonderful overnight cruise. Our tour guide Lang spoke excellent English, was so well organized, and made sure everyone’s needs were met. The common thread was the welcoming, friendly nature of the Vietnamese people. There is A LOT of driving, but that is required to get to remote places. It was an outstanding value and I would highly recommend both tours."},{"rating":"4.0","review":"Had a wonderful time visiting the remote Ban Gioc Waterfall and Ba Be National Park. The homestays were fun and we bonded well with the other tour group members. The only minor gripe was the long bus journeys in between which took up much of the tour."},{"rating":"4.5","review":"Do it! Great tour, very authentic."}]},{"name":"Sapa - Bac Ha Market ( Departure only on Friday )","reviews":[{"rating":"4.0","review":"From the moment I booked the tour I had a contact name and number via WhatsApp. The tour itself was very well organised, each day a local guide was waiting to take me on walks through the villages. The hotel was very comfortable and food was good. Would recommend this tour."},{"rating":"3.5","review":"The trip went very well. Everything was organised so well and we did not have any problems. It was so easy to book with Tour Radar. I was reluctant to book directly with a Vietnamese tour agents since communication might be delayed and also I might be cheated. Tour Radar had a 24 hours contact number which is based in Australia and that was so helpful. I also like how you can communicate with the Tour Radar's Vietnamese tour agent directly from Tour Radar's email. My overall rating is 5/5. Looking forward to booking my next trip with Tour Radar."}]},{"name":"Vietnam Discovery","reviews":[{"rating":"5.0","review":"The hotel was dated and dingy. Breakfast was pretty much the same every morning and the service was not good. My recommendation is to give recommendations and also nearer to restaurants and stores. Howard Johnson is on a quiet lonely street."},{"rating":"4.0","review":"I loved the trip and of course Bali, but Wingbuddy was not so hood to us. We had many things that were promised that were left unresolved, I got pushed off and even hung up on when trying to reach them to resolve. The hotel was excellent, the tours were great I'd give it a five but because of poor wing buddy service I have to go lower."},{"rating":"5.0","review":"Thoroughly enjoyed our Bali trip. Very happy with Patra Jasa Bali resort. Breakfast was great and the staff very helpful/courteous. Panorama did an excellent job in organizing the 5 included tours. It was a cultural immersion trip covering many aspects of Balinese religion, lifestyle, culture, arts and architecture."}]}]