[{"name":"Exploring Northern of Vietnam With 5 days 4 nights package","reviews":[{"rating":"5.0","review":"Our tour guide Rah made this a great experience."}]},{"name":"Authentic Vietnam tour 5D4N (Hanoi- Ninh Binh- Ha Long)","reviews":[{"rating":"3.5","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"3.5","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Hanoi 6 Days 5 Nights (Hanoi, Ha Long Bay)","reviews":[{"rating":"3.5","review":"A very well organized tour with a great and helpful team. Communication was impeccable all through the trip with notable flexibility from the organizers' side. The only down-side of this trip in specific is the daily commuting and transportation - we were almost on the move every single day. Other than that everything went smooth and up to our expectations - would totally deal with ATP again and highly recommend them."},{"rating":"3.5","review":"It was a good experience for my Vietnam trip. They followed everything from start to finish. It made my vacation worry free, thanks to Asia Pacific travel,(Mrs BAO)she what’s app me every night, make sure I don’t get lost. The local tour guide is good,knowledgeable. They are ten out of ten, I highly recommend APT,"},{"rating":"5.0","review":"The places I went during these 5 days were incredible. I felt the staff and management of the tour were exceptional. The hotel was good and clean, staff were friendly and the accommodation on the boat was amazing. I loved waking up in Halong bay to the sunrise as a start to my day. As a solo traveler with only a short time in Vietnam, I feel this was the best way for me to see these incredible parts of Vietnam. This made the long bus rides and average food worth it to me. At the end of my tour I was greeted by one of the supervisors and she checked in with me about my trip. She even gave me a little farewell token. I feel that the communication and people with this travel group were professional and really amazing. Overall, I do recommend this trip, just don't forget your neck pillow and extra waters for the bus rides ;)."}]},{"name":"Vietnam Adventure Tour 12 days","reviews":[{"rating":"5.0","review":"From first email Angie ensured our tour was what we wanted. We chose to do our own tour so we could see what we wanted and go at our pace. We were both able to enjoy the wondrous sites and we went everywhere easily with our guides with us. So much better than planning and do the tour on our own. Fantastic! Thank you, Esther and the team of Bravo IndochinaTours."},{"rating":"5.0","review":"Smooth and helpful from booking until the end of the tour. Fast repond to enquiries. Very approachable, friendly, enthusiastic and knowledgeable local tour guide.\nYou have no worries because they have planned everything. You just need to soaked in and enjoy your trip which I did immensely during my recent trip with Bravo Indochina Tours. I took the Indochina Tours and true to its name, I did witness the best of Angkor and had an amazing experience thanks to our experienced, multi tasking and wonderful local guide. Will surely be coming back for more Bravo Indochina Tours trip"},{"rating":"5.0","review":"I think the whole experience was first class and the mix of travelling and stops was great even though I would have liked longer stay. Also think I was very lucky travelling in a small group and having the leader we had. Tom was first class in all that he did for us that we could see and also in the things behind the scenes that went on because the whole thing seemed to me to flow without a hitch. We can't wait to return and would highly recommend Bravo Indochina Tours and will certainly travel with them again."},{"rating":"5.0","review":"I booked my  trip to Vietnam with Bravo Indochina Tours and our guide Henry, he has been great in arranging my travel. Everything that we asked for is in the trip. We are so excited to go. I know the trip will be seamless. He has been amazing and knowledge the entire process. We are so excited to go on our trip in Mar 2019. I plan to use him in the future for places they book for. Thank you Henry"},{"rating":"5.0","review":"Bravo Indochina Tours was an excellent surprise when we were starting to plan our trip to Vietnam! Our travel consultant Toni was ever so very responsive and full of good advice as to the details of our trip. Now we have to enjoy our trip and hopefully all the good advice and organization will pay off!"},{"rating":"5.0","review":"My daughter and I recently completed a 12  tour of Vietnam with Bravo indochina Tours. The tour was excellent and the planning was the same. Their team was so helpful with us with responding to our requests and providing advice. Every request via email was responded to so quickly, in many cases within 24 hours. This shows the professionalism and dedication of such staff and company. \nWe really enjoyed the flexibility of the tours on offer as we were able to make suggestions of places we wanted to visit and they had no problem in rearranging for us. The drivers at the airports and tour guides for the different excursions were always on time and the vehicles used were fairly new, always clean and well maintained. We were offered complimentary bottles of water regularly and there were plenty of opportunities to purchase more drinks when necessary. The tour group was normally 7-15 pax and each tour guide was enthusiastic, spoke very good English and engaged with us and our children making us feel looked after the whole time. I would definitely use Bravo Indochina again and would highly recommend them to others"}]},{"name":"Northern Vietnam Escape: Sapa And Surrounds","reviews":[{"rating":"4.0","review":"Rhi is a fun, caring, knowledgeable host. She is an excellent guide who is able to give advice, supper and recommendations according to each person on her tour. Rhi made my Contiki experience unforgettable. Thank you Rhi!"},{"rating":"4.5","review":"The main reason I booked a tour was because I had no time or desire to plan a full itinerary for the places I wanted to go. Moreover, while on the trip I wanted to do as little work as possible to see and do as many things as possible! I can say with absolute certainty that this tour, especially with Jules as the trip manager, far exceeded my expectations! There was not a day that I wasn’t seeing amazing new sights or going on some kind of adventure. Aside from the trip itself, I felt like myself and the rest of the group were in great hands with Jules leading us through Asia. She was very thorough with briefing us with what to expect for the days ahead that nothing ever caught me by surprise! Even when unexpected things did happen, I am very happy that Jules was there to resolve any issue that came our way. I would 100% recommend this tour with Jules as the trip manager!"},{"rating":"5.0","review":"Jules was incredible! So friendly from the start automatically making me feel settled in. Everything was so perfectly organised and she knew something about everything. She also ensured if we needed help with anything at all she was there for us."}]},{"name":"10 days 9 nights Ha Noi – SaPa – Ha Giang","reviews":[{"rating":"5.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.0","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"10 days Ha Noi – Hoi An – Ho Chi Minh","reviews":[{"rating":"4.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"5.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]},{"name":"6 days Mekong Delta And Con Dao Island","reviews":[{"rating":"5.0","review":"Heard a lot about Vietnam but this is the first time I’ve been here. Found Ideal Travel Asia on the internet and some itineraries of my interest. I did feel a bit nervous booking directly but to me, you are great tour operator. I was shown to the best place of Vietnam where I felt in love with the beauty and tranquility of the landscape. All the rising lands in the sea, the turquoise water (not really clean though ) , mouth watering culinary and friendly people make you wish for a longr trip. I think I would come back here one more time, with Ideal Travel Asia of course. Thank your for everything."},{"rating":"4.0","review":"Hi Mai. Thank you for all! That was amazing experience! Greetings from Poland :) After over one month since we've...\nShow more"},{"rating":"4.5","review":"Our group traveled to Vietnam and Cambodia. Our tour guide, Phong was very informative and saw to every detail of the...\nShow more"}]}]